{
  "lastUpdated": "2026-01-31T13:31:12.605515+00:00",
  "articles": [
    {
      "id": "fcef8290dba0",
      "title": "Bologna, training resumed today: Italiano recovers a player in the group",
      "url": "https://www.milannews.it/l-avversario/bologna-ripresi-oggi-gli-allenamenti-italiano-recupera-un-giocatore-in-gruppo-605889",
      "source": "milannews.it",
      "date": "2026-01-31T13:24:50+00:00",
      "summary": "After the European away match on the neutral pitch of Maccabi Tel Aviv, which resulted in a final tenth place in the Europa League League Phase standings, Bologna was able to enjoy a day of rest yesterday and ..."
    },
    {
      "id": "ec27fee6b6b2",
      "title": "Gordon Singer reflects on Elliott’s ownership of AC Milan: “We are proud”",
      "url": "https://sempremilan.com/singer-reflects-elliotts-ownership-milan-proud",
      "source": "sempremilan.com",
      "date": "2026-01-31T13:20:00+00:00",
      "summary": "Gordon Singer commented on Elliott Management’s official exit from AC Milan yesterday, stating that they are ‘proud’ of what they have achieved.  It was back in the summer of 2018 that Elliott took control of the club, as the Chinese owner Yongong Li defaulted on his loan. Immediately, the American "
    },
    {
      "id": "8be3baef08ac",
      "title": "Serie D, Scanzorosciate-Milan Futuro: the official lineups",
      "url": "https://www.milannews.it/milan-futuro/serie-d-scanzorosciate-milan-futuro-le-formazioni-ufficiali-605894",
      "source": "milannews.it",
      "date": "2026-01-31T13:12:02+00:00",
      "summary": "There is just over a quarter of an hour left until the start of the match between Scanzorosciate and Milan Futuro."
    },
    {
      "id": "ffbb8e709068",
      "title": "Last call for the defense: Allegri waits for the central defender",
      "url": "https://www.milannews.it/primo-piano/ultima-chiamata-per-la-difesa-allegri-aspetta-il-centrale-605698",
      "source": "milannews.it",
      "date": "2026-01-31T13:00:00+00:00",
      "summary": "The last few days of the transfer market for Milan revolve around a clear priority, almost no longer negotiable: a central defender."
    },
    {
      "id": "5477c3fb3f13",
      "title": "Galliani says Milan would have had ‘fewer’ points and ‘not more’ without Allegri",
      "url": "https://sempremilan.com/galliani-milan-fewer-points-without-allegri",
      "source": "sempremilan.com",
      "date": "2026-01-31T12:50:00+00:00",
      "summary": "AC Milan and Massimiliano Allegri have been praised for their results this season, and as argued by Adriano Galliani, the manager is a huge part of that.  There was some scepticism when Milan decided to replace Sergio Conceicao with Allegri in the summer. The Portuguese manager was always going to l"
    },
    {
      "id": "04198316a2bf",
      "title": "Rowe charges Bologna: \"EL's victory will give us enthusiasm in the championship too\"",
      "url": "https://www.milannews.it/l-avversario/rowe-carica-il-bologna-la-vittoria-di-el-ci-dara-entusiasmo-anche-in-campionato-605733",
      "source": "milannews.it",
      "date": "2026-01-31T12:48:00+00:00",
      "summary": "Jonathan Rowe, Bologna footballer, spoke to the club's official channels after EL's match against Maccabi Tel Aviv, also pointing to the next championship matches: \"This victory is important for us, I'm sure it will ..."
    },
    {
      "id": "5f28eb85690b",
      "title": "Bianchin hypothesizes the path for Alphadjo Cissè next year",
      "url": "https://www.milannews.it/news/bianchin-ipotizza-il-percorso-per-alphadjo-cisse-il-prossimo-anno-605879",
      "source": "milannews.it",
      "date": "2026-01-31T12:36:32+00:00",
      "summary": "It is now done for the purchase of Alphadjo Cissè by Milan: the footballer born in 2006, born in Treviso, owned by Hellas Verona and who this season plays on loan at Catanzaro in Ser ..."
    },
    {
      "id": "546955d493fb",
      "title": "De Zerbi doesn't back down: \"I'll stay in Marseille for another five or six years\"",
      "url": "https://www.milannews.it/dall-estero/de-zerbi-non-arretra-resto-a-marsiglia-altri-cinque-o-sei-anni-605833",
      "source": "milannews.it",
      "date": "2026-01-31T12:24:00+00:00",
      "summary": "(ANSA) - MARSEILLE, JAN 30 - Marseille coach Roberto De Zerbi, whose future at OM seemed uncertain after their elimination from the Champions League, confirmed that he will be on the bench on Saturday against Paris FC, where he intends ..."
    },
    {
      "id": "0b0671ae0cfb",
      "title": "Watch: Mateta to AC Milan? Lorenzo and Stefano react to the latest news",
      "url": "https://sempremilan.com/mateta-ac-milan-lorenzo-stefano-react",
      "source": "sempremilan.com",
      "date": "2026-01-31T12:20:00+00:00",
      "summary": "Jean-Philippe Mateta appears to be Milan’s priority on the transfer market at the moment, which is something that Lorenzo and Stefano have reacted to.  In the last few days, Milan have accelerated their pursuit of Crystal Palace’s Mateta, keen on beating the competition rather than waiting until the"
    },
    {
      "id": "15ef18572079",
      "title": "AC Milan-Mateta agreement: salary figures revealed",
      "url": "https://www.milannews.it/calciomercato-milan/accordo-milan-mateta-svelate-le-cifre-dell-ingaggio-605872",
      "source": "milannews.it",
      "date": "2026-01-31T12:12:00+00:00",
      "summary": "During the usual appointment with the video update on his YouTube channel, Fabrizio Romano took stock of Milan's incoming transfer market, talking about both the Mateta issue and the central defender."
    },
    {
      "id": "da381766a41f",
      "title": "Elliot bids farewell to Milan. The QS: \"RedBird completes refinancing. Comvest enters and Maignan signs\"",
      "url": "https://www.milannews.it/rassegna-stampa/elliot-saluta-il-milan-il-qs-redbird-completa-il-rifinanziamento-entra-comvest-e-maignan-firma-605857",
      "source": "milannews.it",
      "date": "2026-01-31T12:00:24+00:00",
      "summary": "Yesterday an important page in Milan's corporate history was written."
    },
    {
      "id": "6a35a435606c",
      "title": "LIVE MN - Milan transfer market: done for Cissè. Mike renews, decisive day for Mateta",
      "url": "https://www.milannews.it/primo-piano/live-mn-mercato-milan-fatta-per-cisse-mike-rinnova-giornata-decisiva-per-mateta-605873",
      "source": "milannews.it",
      "date": "2026-01-31T12:00:00+00:00",
      "summary": "1.00pm | MATHETA WAITING\n\nMatteo Moretto's comment on the current situation linked to Jean-Philippe Mateta: \"Milan will have new contacts today to define Mateta's arrival at the Rossoneri."
    },
    {
      "id": "560608b23b35",
      "title": "Official: Dates and times confirmed for Pisa, Parma and Como clashes for Milan",
      "url": "https://sempremilan.com/official-dates-times-pisa-parma-como",
      "source": "sempremilan.com",
      "date": "2026-01-31T11:55:00+00:00",
      "summary": "Lega Serie A have officially confirmed the dates and times for matchdays 25 and 26, as well as the rescheduled game between AC Milan and Como (matchday 24).  The scheduling of games has come under scrutiny in recent weeks, with Milan playing two games in just 66 hours. Furthermore, the Rossoneri’s h"
    },
    {
      "id": "a64dab4587e3",
      "title": "Moretto: \"Mateta is not in Milan but waiting to understand whether to fly or not\"",
      "url": "https://www.milannews.it/news/moretto-mateta-non-e-a-milano-ma-in-attesa-di-capire-se-volare-o-meno-605887",
      "source": "milannews.it",
      "date": "2026-01-31T11:48:59+00:00",
      "summary": "AC Milan is pushing, and pushing a lot, on Jean-Philippe Mateta: the Rossoneri club is working to bring the French striker to Max Allegri's court already in this winter transfer market session, anticipating the agreement that ..."
    },
    {
      "id": "d457b241add7",
      "title": "Movements at Milan. La Repubblica: \"Mateta taken. Maignan signs and goodbye Elliot\"",
      "url": "https://www.milannews.it/rassegna-stampa/movimenti-in-casa-milan-la-repubblica-preso-mateta-maignan-firma-e-addio-elliot-605858",
      "source": "milannews.it",
      "date": "2026-01-31T11:36:21+00:00",
      "summary": "Yesterday was the most important day of the last month for Milan."
    },
    {
      "id": "c3d5dbbd0987",
      "title": "Moretto: Price tag confirmed as Milan secure Verona youngster for the summer",
      "url": "https://sempremilan.com/moretto-price-tag-milan-verona-youngster",
      "source": "sempremilan.com",
      "date": "2026-01-31T11:30:00+00:00",
      "summary": "AC Milan have secured the services of Alphadjo Cissè, who will join the club in the summer, and the price tag of the operation has now been revealed. This morning, Gianluca Di Marzio stated that Milan had overtaken PSV Eindhoven in the race for the midfielder, reaching an agreement with Hellas Veron"
    },
    {
      "id": "9e2bca96f1ff",
      "title": "Serie A: dates, times and television assignments of the 25th and 26th matchdays",
      "url": "https://www.milannews.it/news/serie-a-date-orari-e-assegnazioni-televisive-di-25a-e-26a-giornata-605886",
      "source": "milannews.it",
      "date": "2026-01-31T11:24:13+00:00",
      "summary": "The Lega Serie A has announced the dates, times and television assignments of the championship matches on the 25th and 26th matchdays. Milan will be busy on Friday 13 February at 8pm."
    },
    {
      "id": "c8e6c13e0388",
      "title": "Milan-Como, the recovery date is official: here's when it will be played",
      "url": "https://www.milannews.it/news/milan-como-ufficiale-la-data-del-recupero-ecco-quando-si-giochera-605885",
      "source": "milannews.it",
      "date": "2026-01-31T11:16:25+00:00",
      "summary": "The recovery date of Milan-Como is official."
    },
    {
      "id": "7093c80cbe0c",
      "title": "Moretto: \"The name Tare is focusing on is that of Disasi\"",
      "url": "https://www.milannews.it/calciomercato-milan/moretto-il-nome-su-cui-si-sta-concentrando-tare-e-quello-di-disasi-605884",
      "source": "milannews.it",
      "date": "2026-01-31T11:15:35+00:00",
      "summary": "Constant updates on the central defender front regarding the last, very hot, hours of the Rossoneri transfer market."
    },
    {
      "id": "ddcd080bdb0f",
      "title": "Commissions, salary and formula, everything is ready for Mateta at Milan: the final approval from Palace is awaited",
      "url": "https://www.milannews.it/calciomercato-milan/commissioni-ingaggio-e-formula-tutto-pronto-per-mateta-al-milan-si-aspetta-l-ok-definitivo-del-palace-605870",
      "source": "milannews.it",
      "date": "2026-01-31T11:12:00+00:00",
      "summary": "During the usual appointment with the video update on his YouTube channel, Fabrizio Romano took stock of Milan's incoming transfer market, talking about both the Mateta issue and the central defender."
    },
    {
      "id": "a2efaa0729f1",
      "title": "Romano: Milan could sign centre-back as Allegri ‘made his voice heard’",
      "url": "https://sempremilan.com/romano-milan-centre-back-allegri-voice",
      "source": "sempremilan.com",
      "date": "2026-01-31T11:05:00+00:00",
      "summary": "Massimiliano Allegri has asked the AC Milan management to sign a centre-back and according to Fabrizio Romano, they could fulfil his wish.  It’s certainly heating up for Milan on the transfer market, in advanced negotiations with Crystal Palace over Jean-Philippe Mateta. However, the attack isn’t th"
    },
    {
      "id": "cdc11b8a138b",
      "title": "FOCUS MN - Power and sacrifice at the service of the game: Mateta is the prototype of an \"allegriano\" attacker",
      "url": "https://www.milannews.it/primo-piano/focus-mn-potenza-e-sacrificio-al-servizio-del-gioco-mateta-e-il-prototipo-di-attaccante-allegriano-605874",
      "source": "milannews.it",
      "date": "2026-01-31T11:00:40+00:00",
      "summary": "In an AC Milan looking for a \"real\" center forward, Jean-Philippe Mateta emerges as a congenial profile: the Crystal Palace born in 1997 combines physicality, sense of goal and tactical characteristics that fit perfectly with this..."
    },
    {
      "id": "efec904e8ea9",
      "title": "Done for Alphadjo Cissè: he will remain at Catanzaro until the end of the season",
      "url": "https://www.milannews.it/calciomercato-milan/fatta-per-alphadjo-cisse-restera-al-catanzaro-fino-a-fine-stagione-605878",
      "source": "milannews.it",
      "date": "2026-01-31T10:48:15+00:00",
      "summary": "AC Milan secures the 2006-born talent Alphadjo Cissè, one of the most interesting and promising players in the entire Italian scene: and done! The Rossoneri club accelerated yesterday, entering the ..."
    },
    {
      "id": "8c9bcfcbda69",
      "title": "Di Marzio: Furlani behind Milan’s accelerated pursuit of Mateta – the situation",
      "url": "https://sempremilan.com/di-marzio-furlani-milans-pursuit-mateta",
      "source": "sempremilan.com",
      "date": "2026-01-31T10:40:00+00:00",
      "summary": "Giorgio Furlani’s green light has been a key part of AC Milan’s accelerated pursuit of Jean-Philippe Mateta, who appears to be just one step away from leaving Crystal Palace.  Milan have been evaluating solutions for the No.9 role for quite some time now, above all as Santiago Gimenez and Christophe"
    },
    {
      "id": "3a004c1b9d42",
      "title": "Ceccarini on the Mateta deal: \"Milan hopes to bring forward the operation by raising the investment to 35 million\"",
      "url": "https://www.milannews.it/calciomercato-milan/ceccarini-sull-affare-mateta-il-milan-spera-di-anticipare-l-operazione-alzando-l-investimento-a-35-milioni-605865",
      "source": "milannews.it",
      "date": "2026-01-31T10:36:00+00:00",
      "summary": "During the usual appointment with his editorial for TMW, the transfer market expert Niccolò Ceccarini took stock of the various Italian teams, also focusing on Milan, ready to pull off that blow that doesn't seem to ..."
    },
    {
      "id": "3759f16cc45a",
      "title": "MN - Galliani specifies: \"Milan is ahead of 18 teams, not behind Inter. Let's not forget that last year they finished eighth\"",
      "url": "https://www.milannews.it/news/mn-galliani-precisa-il-milan-e-davanti-a-18-squadre-non-dietro-all-inter-non-dimentichiamo-che-l-anno-scorso-e-arrivato-ottavo-605862",
      "source": "milannews.it",
      "date": "2026-01-31T10:24:05+00:00",
      "summary": "Adriano Galliani, at the presentation of the book \"A corta muso\" by Giuseppe Alberto Falci, on Allegri and the current situation of Milan. These are the words of the former Rossoneri CEO taken up by the MilanNews correspondent."
    },
    {
      "id": "c7c41919f97b",
      "title": "Sky Germany: Milan ‘pushing’ to sign Bayern Munich right-back for the Futuro",
      "url": "https://sempremilan.com/sky-milan-pushing-bayern-munich-futuro",
      "source": "sempremilan.com",
      "date": "2026-01-31T10:15:00+00:00",
      "summary": "AC Milan are reportedly ‘pushing’ to sign the Bayern Munich right-back Magnus Dalpiaz, who would become a part of the Futuro team.  In the last year or so, we have seen quite a few reinforcements for the Futuro side, with the Rossoneri looking to make the team even more competitive. Cheveyo Balentie"
    },
    {
      "id": "269e5767485b",
      "title": "Milan, not just Disasi: Sergio Ramos is a suggestion for the defence",
      "url": "https://www.milannews.it/calciomercato-milan/milan-non-solo-disasi-per-la-difesa-spunta-la-suggestione-sergio-ramos-605868",
      "source": "milannews.it",
      "date": "2026-01-31T10:12:35+00:00",
      "summary": "In addition to the possible arrival of Jean-Philippe Mateta, in these last, excited 48 hours of the transfer market, Milan will also try to make a new central defender available to Massimiliano Allegri, so as to complete the ..."
    },
    {
      "id": "c9f49280eb8f",
      "title": "GdS: Maignan will sign Milan renewal this afternoon – final details sorted",
      "url": "https://sempremilan.com/gds-maignan-milan-renewal-this-afternoon",
      "source": "sempremilan.com",
      "date": "2026-01-31T09:50:00+00:00",
      "summary": "Mike Maignan will sign his new contract with AC Milan today, according to a report, and he will receive a significant pay rise for it.  After a long and tiring saga, with back and forths from both parties, Maignan is finally ready to put pen to paper. An agreement has been reached with Milan for […]"
    },
    {
      "id": "22f41b363db8",
      "title": "GdS: Two conditions must be met for Mateta to join Milan from Crystal Palace",
      "url": "https://sempremilan.com/gds-two-conditions-mateta-milan-crystal-palace",
      "source": "sempremilan.com",
      "date": "2026-01-31T09:25:00+00:00",
      "summary": "Jean-Philippe Mateta could be the big signing for AC Milan in this transfer window, but in order to secure him immediately, two conditions will have to be met.  Milan have been scratching their heads with regard to the No.9 position this season. As both Santiago Gimenez and Christopher Nkunku strugg"
    },
    {
      "id": "9346aac61f82",
      "title": "Two hurdles for Milan to overcome before landing Mateta deal with Crystal Palace",
      "url": "https://football-italia.net/two-hurdles-for-milan-to-overcome-for-mateta/",
      "source": "football-italia.net",
      "date": "2026-01-31T09:22:04+00:00",
      "summary": "Reports in Italy claim that Milan are closing in on a full agreement with Crystal..."
    },
    {
      "id": "01d50fe7a444",
      "title": "Di Marzio: Milan and Verona agree on summer move for youngster – full details",
      "url": "https://sempremilan.com/di-marzio-milan-verona-summer-move-youngster",
      "source": "sempremilan.com",
      "date": "2026-01-31T09:00:00+00:00",
      "summary": "AC Milan have ousted PSV Eindhoven in the race for Alphadjo Cissè, having reached a total agreement with Hellas Verona for a transfer.  Cissè is an attacking midfielder that Milan have been keeping tabs on for a very long time. In fact, the first rumours date back to February 2024, and the managemen"
    },
    {
      "id": "fa3dcf4ac29b",
      "title": "Today’s Papers: Milan all in for Mateta, Until the end for Juventus and Kolo Muani",
      "url": "https://football-italia.net/todays-papers-milan-all-in-for-mateta/",
      "source": "football-italia.net",
      "date": "2026-01-31T08:34:07+00:00",
      "summary": "La Gazzetta dello Sport Mateta: It’s a yes  The Frenchman wants Milan immediately Negotiations for..."
    },
    {
      "id": "5517bbe84b25",
      "title": "Gallery: ‘Milan all in for Mateta’, ‘Furlani attacks’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/gallery-milan-mateta-furlani-papers-italy",
      "source": "sempremilan.com",
      "date": "2026-01-31T08:30:00+00:00",
      "summary": "Jean-Philippe Mateta appears to be getting closer to AC Milan, with negotiations now at an advanced stage, and this was naturally the main focus of the newspapers this morning.  What initially seemed like a certain summer reinforcement has turned into a concrete January pursuit. Indeed, Milan are ho"
    },
    {
      "id": "1e928943ef43",
      "title": "“A long-term commitment to the Club” – Cardinale’s first comments after RedBird refinancing",
      "url": "https://sempremilan.com/cardinale-first-comments-redbird-refinancing",
      "source": "sempremilan.com",
      "date": "2026-01-30T20:30:00+00:00",
      "summary": "This afternoon, it was confirmed that RedBird had refinanced the vendor loan used to initially purchase AC Milan, thus seeing Elliott exit the club.  It has been an interesting few weeks where RedBird have been concerned. In December, it was reported that they would not be supporting any moves made "
    },
    {
      "id": "c54f160468a5",
      "title": "Romano: Mateta informs Crystal Palace of desire to join Milan regardless of timing",
      "url": "https://sempremilan.com/mateta-informs-palace-desire-join-milan",
      "source": "sempremilan.com",
      "date": "2026-01-30T19:45:04+00:00",
      "summary": "This evening, AC Milan have been given a huge boost in their chances of signing Jean-Philippe Mateta, with him requesting the move.  The Mateta saga has evolved quickly. As of this morning, Milan had a chance to sign the Frenchman, with Massimiliano Allegri pushing for the striker. In the hours that"
    },
    {
      "id": "7a0ae3ffde1c",
      "title": "Official: AC Milan announce signing of El Hadj Malick Cissè for Futuro squad – photo",
      "url": "https://sempremilan.com/ac-milan-announce-cisse-signing-futuro",
      "source": "sempremilan.com",
      "date": "2026-01-30T19:27:24+00:00",
      "summary": "This evening, AC Milan have confirmed the signing of El Hadj Malick Cissè, who will join Massimo Oddo’s Futuro side.  Things have moved quickly where Cissè has been involved, with the links first starting to appear at the start of the week. Appreciated by Barcelona and RB Leipzig, Milan may have pul"
    },
    {
      "id": "94d95ed43cb1",
      "title": "MN: Mateta may still arrive as Nkunku says no to exit – the situation",
      "url": "https://sempremilan.com/mateta-may-still-arrive-nkunku-says-no",
      "source": "sempremilan.com",
      "date": "2026-01-30T19:00:00+00:00",
      "summary": "It seemed AC Milan would need a striker to leave this month to allow someone new to arrive. However, this may not be the case.  Throughout the season so far, Milan have been tempted by the idea of signing a new striker. To do so, it seemed they would have had to part with one […]\nThe post MN: Mateta"
    },
    {
      "id": "97d305a1d7aa",
      "title": "Romano offers update on Cissè negotiations despite exit being ‘announced’",
      "url": "https://sempremilan.com/romano-update-cisse-negotiations",
      "source": "sempremilan.com",
      "date": "2026-01-30T18:30:00+00:00",
      "summary": "Despite his move to PSV seemingly being done, Fabrizio Romano has confirmed that AC Milan are in talks for Alphadjo Cissè. There has been a lot said about Cissè in the past few days, and a lot of it has not concerned Milan. Ultimately, it seemed that the youngster would return to Hellas Verona tempo"
    },
    {
      "id": "8919b69e59be",
      "title": "MN: Cissé at Casa Milan to complete signing for Oddo’s Futuro – the latest",
      "url": "https://sempremilan.com/cisse-at-casa-milan-complete-futuro-signing",
      "source": "sempremilan.com",
      "date": "2026-01-30T18:00:00+00:00",
      "summary": "It has been a hectic day for AC Milan, and it seems that another event has been taking place in the background of the headquarters, beyond what we already know.  Today has been a bit of a mental day for Milan. Not only have they progressed rapidly to complete a deal for Jean Philippe Mateta, […]\nThe"
    },
    {
      "id": "5338eabad5e6",
      "title": "Reports: Napoli say no as Atletico Madrid, Fenerbahce and Premier League clubs consider Nkunku",
      "url": "https://sempremilan.com/napoli-no-clubs-considering-nkunku",
      "source": "sempremilan.com",
      "date": "2026-01-30T17:30:00+00:00",
      "summary": "With Jean-Philippe Mateta looking like a potential late arrival, AC Milan are trying to part with Christopher Nkunku to free up space for another Frenchman.  When he first arrived, there were certainly a few questions about Nkunku’s signing. After all, he was the polar opposite of what Massimiliano "
    },
    {
      "id": "77d09fa2102e",
      "title": "Official: RedBird Capital confirms Elliott’s exit from AC Milan after securing Comvest financing",
      "url": "https://sempremilan.com/redbird-capital-confirm-elliott-exit-from-milan",
      "source": "sempremilan.com",
      "date": "2026-01-30T17:01:20+00:00",
      "summary": "In the last few moments, it has been announced that RedBird have paid back the vendor loan to Elliott Management, after securing financing from Comvest.  Over the course of the past few years, it has been no secret that Gerry Cardinale and RedBird have been searching for investors to help pay off th"
    },
    {
      "id": "0e648c8d7668",
      "title": "Glasner confirms Crystal Palace drop Mateta for Forest clash, fuelling Milan speculation",
      "url": "https://football-italia.net/mateta-dropped-not-forest-milan-speculation/",
      "source": "football-italia.net",
      "date": "2026-01-30T16:21:23+00:00",
      "summary": "Crystal Palace coach Oliver Glasner confirms Milan target Jean-Philippe Mateta won’t be part of the..."
    },
    {
      "id": "210e88203f90",
      "title": "Maignan set to sign new Milan contract, Roma ask for Nkunku",
      "url": "https://football-italia.net/maignan-signs-new-milan-contract-roma-nkunku/",
      "source": "football-italia.net",
      "date": "2026-01-30T14:03:32+00:00",
      "summary": "Sky Sport Italia reports that Mike Maignan will put pen to paper on a new..."
    },
    {
      "id": "3e92c9cf6b6c",
      "title": "January transfer liveblog: Milan close to Mateta, Lookman twist",
      "url": "https://football-italia.net/january-transfer-liveblog-rumours-done-deals-2/",
      "source": "football-italia.net",
      "date": "2026-01-30T10:40:41+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "5d048c937f37",
      "title": "Milan agreement for Mateta who prefers Rossoneri over Nottingham Forest – report",
      "url": "https://football-italia.net/milan-agreement-mateta-nottingham-forest/",
      "source": "football-italia.net",
      "date": "2026-01-30T09:47:40+00:00",
      "summary": "La Gazzetta dello Sport claims Milan have agreed a deal to bring in Jean-Philippe Mateta..."
    },
    {
      "id": "b9cb4f9e51f5",
      "title": "Report Milan fight for Mateta with Nottingham Forest and Juventus",
      "url": "https://football-italia.net/report-milan-mateta-nottingham-forest-juventus/",
      "source": "football-italia.net",
      "date": "2026-01-29T17:31:42+00:00",
      "summary": "Milan are reportedly trying to hijack Nottingham Forest’s bid for Crystal Palace striker Jean-Philippe Mateta,..."
    },
    {
      "id": "69318b559f5a",
      "title": "Milan look to Tottenham, Man City and Lazio for defensive reinforcement",
      "url": "https://football-italia.net/milan-tottenham-man-city-defence-reinforcement/",
      "source": "football-italia.net",
      "date": "2026-01-29T14:07:00+00:00",
      "summary": "According to reports in Italy, Milan are interested in Manchester City defender Nathan Aké, Tottenham’s..."
    },
    {
      "id": "059070d81ac0",
      "title": "Free agent Goretzka targeted with determination by Milan",
      "url": "https://football-italia.net/free-agent-goretzka-targeted-by-ac-milan/",
      "source": "football-italia.net",
      "date": "2026-01-27T20:11:15+00:00",
      "summary": "Milan are pushing hard to agree personal terms with Bayern Munich midfielder Leon Goretzka, who..."
    },
    {
      "id": "fa309b31e0a1",
      "title": "Capello identifies Milan’s biggest ‘flaw’ and explains Inter advantage in Serie A race",
      "url": "https://football-italia.net/capello-identifies-milans-biggest-flaw-and-explains-inter-advantage-in-serie-a-race/",
      "source": "football-italia.net",
      "date": "2026-01-27T17:47:32+00:00",
      "summary": "Fabio Capello has given an in-depth review of the two teams currently fighting for the..."
    },
    {
      "id": "325c906634a1",
      "title": "Milan expected to complete €20m deal for Lazio defender Gila in the summer",
      "url": "https://football-italia.net/milan-expected-20m-deal-for-lazio-gila/",
      "source": "football-italia.net",
      "date": "2026-01-27T13:23:36+00:00",
      "summary": "Milan are already laying the groundwork for their summer rebuild, and a new centre-back is..."
    },
    {
      "id": "5b2cb74dfdb9",
      "title": "Today’s papers – Inter push for Perisic; Napoli in crisis",
      "url": "https://football-italia.net/todays-papers-inter-push-for-perisic-napoli-in-crisis/",
      "source": "football-italia.net",
      "date": "2026-01-27T09:45:13+00:00",
      "summary": "La Gazzetta dello Sport “Inter don’t stop” Inter’s momentum continues both in Serie A and..."
    },
    {
      "id": "46dfb510bd30",
      "title": "Today’s Papers – Juve fly, Inter run away, Milan stopped",
      "url": "https://football-italia.net/todays-papers-juve-fly-milan-stop-inter-run/",
      "source": "football-italia.net",
      "date": "2026-01-26T08:51:22+00:00",
      "summary": "La Gazzetta dello Sport Juve fly and Inter run away The Old Lady dominates, Napoli..."
    },
    {
      "id": "da4eee084e3c",
      "title": "Allegri: ‘Positive Milan result, it was going so well against Roma’",
      "url": "https://football-italia.net/allegri-positive-milan-result-going-well-roma/",
      "source": "football-italia.net",
      "date": "2026-01-25T22:30:10+00:00",
      "summary": "Max Allegri insists Milan were on track for victory at the Stadio Olimpico until the..."
    },
    {
      "id": "91bacc5e5156",
      "title": "Gasperini proud of Roma draw: ‘Milan always dangerous, even when seemingly dominated’",
      "url": "https://football-italia.net/gasperini-proud-roma-milan-always-dangerous/",
      "source": "football-italia.net",
      "date": "2026-01-25T22:16:46+00:00",
      "summary": "Gian Piero Gasperini insists Roma ‘deserve credit’ for their 1-1 draw with second-placed Milan. ‘They..."
    },
    {
      "id": "8f2042147188",
      "title": "Milan stars Maignan and Modric frustrated at Roma penalty in 1-1 draw",
      "url": "https://football-italia.net/milan-maignan-modric-frustrated-roma-penalty/",
      "source": "football-italia.net",
      "date": "2026-01-25T22:02:38+00:00",
      "summary": "Milan stars Mike Maignan and Luka Modric were very critical of the Roma penalty in..."
    },
    {
      "id": "60c57a8359c6",
      "title": "Serie A | Roma 1-1 Milan – Player Ratings as Maignan digs deep to deny Giallorossi victory",
      "url": "https://football-italia.net/serie-a-roma-1-1-milan-maignan-draw/",
      "source": "football-italia.net",
      "date": "2026-01-25T21:41:41+00:00",
      "summary": "Milan battled hard against a strong Roma side to Serie A | Roma 1-1 Milan:..."
    },
    {
      "id": "0c7dae17b91b",
      "title": "Serie A | Roma 1-1 Milan: Stoic Pellegrini freezes De Winter celebration",
      "url": "https://football-italia.net/serie-a-roma-1-1-milan-pellegrini-de-winter/",
      "source": "football-italia.net",
      "date": "2026-01-25T21:40:13+00:00",
      "summary": "While Milan had taken the lead against the run of play with Koni De Winter,..."
    },
    {
      "id": "647772f783f3",
      "title": "Watch: De Winter heads Milan in front at Roma",
      "url": "https://football-italia.net/watch-de-winter-heads-milan-in-front-at-roma/",
      "source": "football-italia.net",
      "date": "2026-01-25T21:24:21+00:00",
      "summary": "Koni De Winter scored his first goal for Milan on Sunday evening, to give his..."
    },
    {
      "id": "eeb1b180ca82",
      "title": "Serie A Liveblog including Juventus vs. Napoli and Roma vs. Milan",
      "url": "https://football-italia.net/serie-a-liveblog-juventus-vs-napoli-roma-milan/",
      "source": "football-italia.net",
      "date": "2026-01-25T20:45:20+00:00",
      "summary": "{rsn-live-v2}"
    }
  ]
}