{
  "lastUpdated": "2026-02-15T09:30:24.555669+00:00",
  "articles": [
    {
      "id": "5ce2da3705c2",
      "title": "CM: Allegri considers three options after Rabiot’s red card – the solution vs. Como",
      "url": "https://sempremilan.com/allegri-considers-three-options-rabiot-red",
      "source": "sempremilan.com",
      "date": "2026-02-15T09:25:00+00:00",
      "summary": "AC Milan have to make do without their galloping midfielder, Adrien Rabiot, when they play Como next. However, replacing him is not so simple.  Since Rabiot’s arrival, Milan have been a much better team. Perhaps unfortunately, the stats also show this. Before he arrived and while he was injured, the"
    },
    {
      "id": "910169cb1a4a",
      "title": "Hernanes sensational: \"If Dazn calls me next year, I won't come anymore. The mentality of Bastoni and Vergara, who rejoice, must be fought\"",
      "url": "https://www.milannews.it/news/clamoroso-hernanes-se-dazn-mi-chiama-l-anno-prossimo-non-verro-piu-la-mentalita-di-bastoni-e-di-vergara-che-esultano-deve-essere-combattuta-607490",
      "source": "milannews.it",
      "date": "2026-02-15T09:24:30+00:00",
      "summary": "Hernanes, a commentator, expressed himself to Dazn as follows on the Kalulu-Bastoni affair: “I'm already thinking about next year. If DAZN calls me to come here to talk about football, I won't come anymore."
    },
    {
      "id": "e4adec56739f",
      "title": "Loftus-Cheek renewal: live dialogues. In January Milan and the Englishman also said no to a proposal from Saudi Arabia",
      "url": "https://www.milannews.it/calciomercato-milan/rinnovo-loftus-cheek-dialoghi-nel-vivo-a-gennaio-no-del-milan-e-dell-inglese-anche-ad-una-proposta-dall-arabia-saudita-607504",
      "source": "milannews.it",
      "date": "2026-02-15T09:10:56+00:00",
      "summary": "As today's edition of Tuttosport reports this morning, the discussions between Milan and Ruben Loftus-Cheek for the renewal of the English midfielder, whose current contract expires in 2027, have come to a head."
    },
    {
      "id": "553ba4336c3d",
      "title": "Satisfied with the victory, less so with the performance: Allegri's analysis with the group",
      "url": "https://www.milannews.it/primo-piano/soddisfatto-per-la-vittoria-meno-della-prestazione-l-analisi-di-allegri-con-il-gruppo-607512",
      "source": "milannews.it",
      "date": "2026-02-15T09:00:39+00:00",
      "summary": "Massimiliano Allegri's thoughts after the difficult 1-2 draw at Pisa can be summarized as follows: satisfied with the victory and the three points won, less so with the performance of his team, especially in the first half, closing ..."
    },
    {
      "id": "e06604689fe3",
      "title": "GdS: ‘Only Ancelotti is better’ – Allegri’s skill with numbers proven once again",
      "url": "https://sempremilan.com/allegri-skill-with-numbers-proven-again",
      "source": "sempremilan.com",
      "date": "2026-02-15T09:00:00+00:00",
      "summary": "Massimiliano Allegri is not an exciting coach. With him, you are not going to have moments of trickery often. Instead, AC Milan are expected to play a controlled game. It would be disrespectful to call Allegri’s football style boring, and whilst it may seem it, it largely isn’t. His football is effe"
    },
    {
      "id": "138c2de30950",
      "title": "CorSport headlines: \"Milan at Max. Great numbers in Europe\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-corsport-titola-milan-al-max-grandi-numeri-d-europa-607509",
      "source": "milannews.it",
      "date": "2026-02-15T08:47:21+00:00",
      "summary": "Regarding the Devil's performance in the league, today's edition of Corriere dello Sport headlines this morning: \"Milan at Max. Great numbers in Europe\"."
    },
    {
      "id": "4a366113252e",
      "title": "Towards Milan-Como: without Rabiot possible retreat of Loftus-Cheek in the middle of the field",
      "url": "https://www.milannews.it/rassegna-stampa/verso-milan-como-senza-rabiot-possibile-arretramento-di-loftus-cheek-in-mezzo-al-campo-607494",
      "source": "milannews.it",
      "date": "2026-02-15T08:35:24+00:00",
      "summary": "After two games in a row played in attack (and two goals scored), Ruben Loftus-Cheek should return to play in the middle of the field on Wednesday in injury time of the 24th matchday of Serie A against Como."
    },
    {
      "id": "8a37904f0539",
      "title": "Inter, Chivu: \"The Scudetto chance is 0% for us. 13 games left, the championship is still long\"",
      "url": "https://www.milannews.it/news/inter-chivu-possibilita-scudetto-per-noi-0-mancano-13-partite-il-campionato-e-ancora-lungo-607486",
      "source": "milannews.it",
      "date": "2026-02-15T08:24:16+00:00",
      "summary": "Cristian Chivu, Inter coach, expressed himself thus to DAZN after the 3-2 victory against Juventus: \"I think about what the mental and physical block was, perhaps the two years without winning direct matches..."
    },
    {
      "id": "228914ef7fc4",
      "title": "The QS on Milan: \"Master Modric, air of renewal. Rabiot, stop which now weighs\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-qs-sul-milan-maestro-modric-aria-di-rinnovo-rabiot-stop-che-ora-pesa-607500",
      "source": "milannews.it",
      "date": "2026-02-15T08:11:53+00:00",
      "summary": "The Quotidiano Sportivo headlined this morning: \"Master Modric, air of renewal. Rabiot, stop which now weighs\"."
    },
    {
      "id": "b9f25fadc0cd",
      "title": "Tuttosport: \"Loftus-Cheek, two consecutive goals for the renewal\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-loftus-cheek-due-gol-consecutivi-per-il-rinnovo-607496",
      "source": "milannews.it",
      "date": "2026-02-15T07:59:55+00:00",
      "summary": "\"Loftus-Cheek, two consecutive goals for renewal\": this is the headline from Tuttosport this morning explaining that, in the last two matches against Bologna and Pisa, the Englishman was deployed by Max Allegri in attack alongside C ..."
    },
    {
      "id": "fa62749e6fdb",
      "title": "Towards Como: the suspended Rabiot out, Ricci in",
      "url": "https://www.milannews.it/rassegna-stampa/verso-il-como-out-lo-squalificato-rabiot-dentro-ricci-607492",
      "source": "milannews.it",
      "date": "2026-02-15T07:48:43+00:00",
      "summary": "Adrien Rabiot was sent off on Friday evening at the end of the match against Pisa by referee Fabbri: double yellow (the first for a foul, the second for subsequent protests) for the Frenchman who will be stopped for a round of ..."
    },
    {
      "id": "703e9c7277f3",
      "title": "Tuttosport headline: \"More and more infinite. Modric joy at Milan\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-titola-sempre-piu-infinito-modric-gioia-milan-607487",
      "source": "milannews.it",
      "date": "2026-02-15T07:36:13+00:00",
      "summary": "Tuttosport on newsstands this morning with the headline: \"More and more infinite. Modric joy at Milan\"."
    },
    {
      "id": "b420805137b4",
      "title": "Chiellini very harsh: \"Rocchi goes around saying that he will leave at the end of the year. We can't continue like this\"",
      "url": "https://www.milannews.it/news/chiellini-durissimo-rocchi-va-in-giro-a-dire-che-a-fine-anno-andra-via-non-possiamo-continuare-cosi-607484",
      "source": "milannews.it",
      "date": "2026-02-15T07:24:00+00:00",
      "summary": "Giorgio Chiellini, director of football strategy of the Juventus club, thundered on Sky Sport after the incidents between Inter and Juventus: \"We can't talk about football, after what happened today it becomes difficult."
    },
    {
      "id": "64e07052a3da",
      "title": "Gazzetta: \"Milan, I'm going big. Allegri is as strong as Capello, with the Devil only Ancelotti is better\"",
      "url": "https://www.milannews.it/rassegna-stampa/gazzetta-milan-passo-da-big-allegri-va-forte-come-capello-col-diavolo-meglio-solo-ancelotti-607483",
      "source": "milannews.it",
      "date": "2026-02-15T07:12:57+00:00",
      "summary": "Today's edition of the Gazzetta dello Sport has the headline this morning: \"Milan, I'm a big player. Allegri is as strong as Capello, with the Devil only Ancelotti is better\"."
    },
    {
      "id": "6f9829f485f7",
      "title": "Modric and the applause from the locker room after Pisa. Waiting for the renewal: Luka's decision before the World Cup",
      "url": "https://www.milannews.it/primo-piano/modric-e-l-applauso-dello-spogliatoio-dopo-il-pisa-attesa-per-il-rinnovo-la-decisione-di-luka-prima-del-mondiale-607470",
      "source": "milannews.it",
      "date": "2026-02-15T07:00:20+00:00",
      "summary": "Zielinski's goal in injury time against Juventus, which allowed Inter to return to +8 on Milan (with one game more), certainly ruined the weekend for the Milan fans who, however, still have in their eyes what ..."
    },
    {
      "id": "373f00bda1ee",
      "title": "Rossoneri youth sector, today's matches: six matches on the Puma - House of Football pitches",
      "url": "https://www.milannews.it/settore-giovanile/settore-giovanile-rossonero-i-match-di-oggi-ben-sei-gare-sui-campi-del-puma-house-of-football-607444",
      "source": "milannews.it",
      "date": "2026-02-15T06:47:55+00:00",
      "summary": "Below is today's program for the Rossoneri youth sector:\n\nWOMEN'S UNDER 11: championship, Milan-Sesto 2012, 10.30 am - PUMA House of Football\n\nWOMEN'S UNDER 10: championship, Milan-Enotria, 10am."
    },
    {
      "id": "7f62da190595",
      "title": "Heavy defeat for Como before Milan. And he loses a man for the match at San Siro",
      "url": "https://www.milannews.it/news/sconfitta-pesante-per-il-como-prima-del-milan-e-perde-un-uomo-per-la-sfida-di-san-siro-607443",
      "source": "milannews.it",
      "date": "2026-02-15T06:35:46+00:00",
      "summary": "The Como falls four days before the match against Milan, the recovery of the twenty-fourth matchday of the Serie A Enilive championship which will be played on Wednesday at 8.45 pm at San Siro."
    },
    {
      "id": "774e07da4073",
      "title": "Sunday with training for Milan. Saelemaekers' condition needs to be assessed",
      "url": "https://www.milannews.it/news/domenica-con-allenamento-per-il-milan-da-valutare-le-condizioni-di-saelemaekers-607442",
      "source": "milannews.it",
      "date": "2026-02-15T06:23:24+00:00",
      "summary": "After yesterday's relaxing training session, today Milan will have a new session - the first with full ranks - in view of Wednesday's match against Como. Alexis Saelemaekers' condition needs to be assessed."
    },
    {
      "id": "f5217baedb83",
      "title": "Serie A matches today: there is another fundamental big match for Milan. The program",
      "url": "https://www.milannews.it/news/partite-serie-a-oggi-c-e-un-altro-big-match-fondamentale-per-il-milan-il-programma-607441",
      "source": "milannews.it",
      "date": "2026-02-15T06:11:25+00:00",
      "summary": "Below is the program for the 25th matchday of Serie A:\n\n13/02/2026 Friday 8.45pm Pisa 1-2 Milan DAZN\n02/14/2026 Saturday 15th."
    },
    {
      "id": "a4981ea8e642",
      "title": "The Serie A ranking after the previews: Milan leads Juventus",
      "url": "https://www.milannews.it/news/la-classifica-di-serie-a-dopo-gli-anticipi-il-milan-allunga-sulla-juve-607440",
      "source": "milannews.it",
      "date": "2026-02-15T06:00:45+00:00",
      "summary": "This is the updated ranking after Inter-Juventus 3-2, Como-Fiorentina 1-2 and Lazio-Atalanta 0-2:\n\nSERIES A, THE UPDATED RANKING\n\n1. Inter 61*\n2."
    },
    {
      "id": "2d445167c8b2",
      "title": "Bazzani: \"Last year Milan didn't have so many lives, they didn't have this mentality\"",
      "url": "https://www.milannews.it/news/bazzani-il-milan-l-anno-scorso-non-aveva-cosi-tante-vite-non-aveva-questa-mentalita-607338",
      "source": "milannews.it",
      "date": "2026-02-15T00:00:00+00:00",
      "summary": "Fabio Bazzani, in the post-match of Pisa-Milan 1-2, talks about the performance of the Rossoneri who achieved a good away victory this evening.\n\n“It's the confirmation of a team that doesn't give up in times of difficulty."
    },
    {
      "id": "097a9a8f9fae",
      "title": "Amelia believes it: \"This Milan can really aspire to the Scudetto\"",
      "url": "https://www.milannews.it/news/amelia-ci-crede-questo-milan-puo-ambire-realmente-allo-scudetto-607446",
      "source": "milannews.it",
      "date": "2026-02-14T23:48:38+00:00",
      "summary": "Marco Amelia, former AC Milan goalkeeper, spoke live on Sportitalia as a guest. His words on Milan: \"In my opinion this Milan can really aspire to the Scudetto."
    },
    {
      "id": "91ed3952841c",
      "title": "Pisa 1-2 AC Milan: Five things we learned – a true leader and smart choices",
      "url": "https://sempremilan.com/pisa-1-2-ac-milan-five-things-learned-2026",
      "source": "sempremilan.com",
      "date": "2026-02-14T19:13:06+00:00",
      "summary": "AC Milan travelled to Pisa for a long-awaited clash, after ten days of rest, and managed to extend their winning run with a 1-2 scoreline.  Due to the rescheduled Como game, which will be played on Wednesday instead, Milan had a lot of time to prepare for this one. Yet, it ended up being a […]\nThe p"
    },
    {
      "id": "716136d83f10",
      "title": "AC Milan Women 0-1 Fiorentina: Season target now difficult after muddy affair",
      "url": "https://sempremilan.com/ac-milan-women-0-1-fiorentina-muddy-affair",
      "source": "sempremilan.com",
      "date": "2026-02-14T18:37:24+00:00",
      "summary": "AC Milan Women lost for the second game in a row, as Fiorentina prevailed by the odd goal on a very muddy pitch. It has been a season filled with ups and downs for Milan Women so far. The fact that they have both six wins and six defeats perhaps says it all, and Champions […]\nThe post AC Milan Women"
    },
    {
      "id": "f6b0eac137c0",
      "title": "Morata sent off as Como dropped points again ahead of Milan encounter – video",
      "url": "https://sempremilan.com/morata-sent-off-cromo-dropped-points-milan",
      "source": "sempremilan.com",
      "date": "2026-02-14T18:00:00+00:00",
      "summary": "The former AC Milan player Alvaro Morata was sent off as Como dropped points again, losing 1-2 against Fiorentina, just days before the game against the Rossoneri.  Out of the next few games, including the one played yesterday, Como has always been described as the most difficult one for Milan. Righ"
    },
    {
      "id": "24279307e59b",
      "title": "Rabiot forced to tactical foul against Parma to avoid missing Milan-Inter",
      "url": "https://sempremilan.com/rabiot-forced-foul-parma-milan-inter",
      "source": "sempremilan.com",
      "date": "2026-02-14T17:30:00+00:00",
      "summary": "Adrien Rabiot might have some regrets about turning a yellow card into a red last night, as he now must make a tactical foul before the derby against Inter.  In the dying minutes of Pisa-Milan, which the Rossoneri won by two goals to one, Rabiot was shown a red card after two bookings. The first […]"
    },
    {
      "id": "965d7dec332d",
      "title": "Photos: Milan players react to Pisa win on social media – “Always a great feeling”",
      "url": "https://sempremilan.com/photos-milan-players-react-pisa-win-2026",
      "source": "sempremilan.com",
      "date": "2026-02-14T17:04:15+00:00",
      "summary": "After the crucial win against Pisa last night, some of the AC Milan players sent messages to the fans through their social media accounts.  Thanks to goals from Ruben Loftus-Cheek and Luka Modric, one in each half, Milan prevailed 2-1 against Pisa. It was a crucial win in the Scudetto race as the ga"
    },
    {
      "id": "c717eb7ad82a",
      "title": "GdS: Everton’s stadium one of many study visits as Milan proceed with San Siro plan",
      "url": "https://sempremilan.com/gds-everton-stadium-study-visits-milan",
      "source": "sempremilan.com",
      "date": "2026-02-14T16:30:00+00:00",
      "summary": "AC Milan recently sent a delegation to study Everton’s new home, the Hill Dickinson Stadium, as the San Siro plans are progressing according to plan.  After getting the green light from the city council for the sale of San Siro last year, Milan have since been working on the bureaucracy and paperwor"
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "3e6af2bedf24",
      "title": "Athekame’s crossing proving to be a weapon for Milan in season finale",
      "url": "https://sempremilan.com/athekame-crossing-weapon-milan-season-finale",
      "source": "sempremilan.com",
      "date": "2026-02-14T16:00:19+00:00",
      "summary": "Zachary Athekame has certainly responded to the initial criticism in recent weeks by showcasing his great crossing several times, including against Pisa last night.  Few knew who Athekame was when he arrived from Young Boys in the summer. He was just 20 at the time and didn’t exactly arrive from the"
    },
    {
      "id": "7cec168c88e0",
      "title": "Milan Futuro 1-0 Breno: Sardo and Traore lead the way for Oddo’s side",
      "url": "https://sempremilan.com/milan-futuro-1-0-breno-sardo-traore",
      "source": "sempremilan.com",
      "date": "2026-02-14T15:30:24+00:00",
      "summary": "Milan Futuro returned to winning ways against Breno this afternoon, largely thanks to the performances of Jacopo Sardo and Chaka Traore. After the defeat last time out, Massimo Oddo headed into today’s game under some pressure to turn things around, having fallen further away from the promotion play"
    },
    {
      "id": "e85da2c25057",
      "title": "Watch: Allegri lets his emotions out after Modric’s crucial winner against Pisa",
      "url": "https://sempremilan.com/watch-allegri-lets-emotions-out-modrics-winner",
      "source": "sempremilan.com",
      "date": "2026-02-14T15:00:00+00:00",
      "summary": "Massimiliano Allegri is known for showing his emotions in the dugout, especially at the end of games, and yesterday was no exception as Luka Modric scored the winner.  If there’s one thing that Milan fans have understood 24 games into the season, it’s that Allegri truly immerses himself in each game"
    },
    {
      "id": "cbc84cfc619d",
      "title": "Ricci and Jashari licking their lips amid Rabiot’s suspension for Milan-Como",
      "url": "https://sempremilan.com/ricci-jashari-licking-lips-rabiots-suspension",
      "source": "sempremilan.com",
      "date": "2026-02-14T14:30:00+00:00",
      "summary": "AC Milan will be without their star midfielder Adrien Rabiot for the game against Como on Wednesday, with Ardon Jashari and Samuele Ricci both eyeing a chance from start.  It was in the dying minute of yesterday’s 2-1 win against Pisa that Rabiot got sent off. He first received a yellow card for a f"
    },
    {
      "id": "5b1afed4e638",
      "title": "Genoa 1-2 Milan Primavera: Early red card paves the way for the Rossoneri",
      "url": "https://sempremilan.com/genoa-1-2-milan-primavera-early-red-card",
      "source": "sempremilan.com",
      "date": "2026-02-14T14:01:12+00:00",
      "summary": "A negative trend was thankfully reversed for Milan Primavera this afternoon, as they collected all points from their game against Genoa.  After three games without a win, including two defeats, Milan Primavera managed to get back to winning ways this afternoon. Despite the poor run of form lately, t"
    },
    {
      "id": "838d1f721b07",
      "title": "Watch: Relive Pisa-Milan as Modric scores the winner late on – the highlights",
      "url": "https://sempremilan.com/watch-relive-pisa-milan-modric-winner",
      "source": "sempremilan.com",
      "date": "2026-02-14T13:35:00+00:00",
      "summary": "It ended up being a complicated away trip to Pisa for Milan, who were rescued by their veteran Luka Modric in the dying minutes.  After taking the lead through Ruben Loftus-Cheek in the first half, it seemed like it would be a comfortable evening for Milan, especially since they dominated play befor"
    },
    {
      "id": "2984eb94f962",
      "title": "Man on a mission and runs equalled: All the key stats from Pisa vs. AC Milan",
      "url": "https://sempremilan.com/all-key-stats-pisa-1-2-milan-2026",
      "source": "sempremilan.com",
      "date": "2026-02-14T13:05:00+00:00",
      "summary": "AC Milan extended their unbeaten run to 23 games, and their winning run to to games, after scoring twice against Pisa last night.  Goals from Ruben Loftus-Cheek and Luka Modric were enough to secure all three points for the Rossoneri, but as we will get into, it wasn’t as easy as they perhaps would "
    },
    {
      "id": "289cf0a082e2",
      "title": "Füllkrug ‘relieved’ after missing penalty against Pisa: “Definitely had better days”",
      "url": "https://sempremilan.com/fullkrug-relieved-after-penalty-miss-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-14T12:45:00+00:00",
      "summary": "Niclas Füllkrug published a message for the AC Milan fans on Instagram this morning, after missing a penalty in the Rossoneri’s 2-1 win against Pisa. It was in the 56th minute that Füllkrug stepped up to take the penalty for Milan. The scoreline was 0-1 then, meaning a goal would have doubled the le"
    },
    {
      "id": "5a52ab37177a",
      "title": "Photo: Rabiot sends signal to Pisa-Milan referee with Instagram story",
      "url": "https://sempremilan.com/rabiot-signal-pisa-milan-referee-instagram",
      "source": "sempremilan.com",
      "date": "2026-02-14T12:20:00+00:00",
      "summary": "Adrien Rabiot has sent a message to the Pisa-Milan referee, and the officiating team in general, with a story on Instagram. Rabiot was sent off in the dying minutes of the Rossoneri’s 2-1 win, first receiving a yellow card for a light touch on a Pisa player. Evidently not happy with the call, he sai"
    },
    {
      "id": "a5f2b100ed40",
      "title": "Pisa manager believes they ‘played a perfect game’ against Milan despite defeat",
      "url": "https://sempremilan.com/pisa-manager-perfect-game-milan-defeat",
      "source": "sempremilan.com",
      "date": "2026-02-14T11:55:00+00:00",
      "summary": "Pisa manager Oscar Hljemark believes his side played a perfect game tactically against Milan, despite coming away with zero points in the end.  After the 2-2 draw in the reverse fixture, Milan headed into the game with a lust for revenge. While it was far from brilliant, they controlled the first ha"
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "4df7a9eb3d81",
      "title": "MN: Leao consoled Füllkrug after penalty miss and double substitution in Pisa-Milan",
      "url": "https://sempremilan.com/mn-leao-consoled-fullkrug-penalty-miss",
      "source": "sempremilan.com",
      "date": "2026-02-14T11:30:00+00:00",
      "summary": "Niclas Füllkrug was very disappointed after his penalty miss against Pisa and was consoled by Rafael Leao, as well as other teammates, after the final whistle.  At half-time, Massimiliano Allegri decided to replace Christopher Nkunku with Füllkrug. The German was immediately involved in a wonderful "
    },
    {
      "id": "394dddd46ab0",
      "title": "CorSera: ‘The dreamcatcher’ – Modric continues to keep Milan’s Scudetto dream alive",
      "url": "https://sempremilan.com/corsera-dreamcatcher-modric-milan-scudetto",
      "source": "sempremilan.com",
      "date": "2026-02-14T11:05:00+00:00",
      "summary": "Luka Modric scored the winner for AC Milan against Pisa, showing once again just how important he is, and there has been no shortage of praise for him this morning.  At the age of 40, it’s simply incredible what Modric has brought to the team this season. In addition to his passing, which everyone k"
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    },
    {
      "id": "9c729c8148a4",
      "title": "Pisa forced to field third-choice goalkeeper in Serie A match against Milan",
      "url": "https://football-italia.net/pisa-forced-3rd-choice-goalkeeper-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T13:04:11+00:00",
      "summary": "Second-choice Pisa goalkeeper Simone Scuffet has been ruled out of tonight’s Serie A match against..."
    },
    {
      "id": "e6e4778300f1",
      "title": "Report Milan call McKennie for possible USMNT reunion with Pulisic",
      "url": "https://football-italia.net/milan-call-mckennie-usmnt-reunion-pulisic/",
      "source": "football-italia.net",
      "date": "2026-02-13T12:43:07+00:00",
      "summary": "Milan have reportedly begun preliminary talks with Weston McKennie’s entourage as the Juventus midfielder is..."
    },
    {
      "id": "bb92885e8dfd",
      "title": "Milan make Modric decision, prepare for new contract extensions after Maignan",
      "url": "https://football-italia.net/milan-modric-decision-more-contracts-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-13T11:04:46+00:00",
      "summary": "According to La Gazzetta dello Sport, Fikayo Tomori is expected to be the next Milan..."
    },
    {
      "id": "c682014167e5",
      "title": "Serie A: Pisa vs. Milan – probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/pisa-vs-milan-probable-line-ups-watch-on-tv/",
      "source": "football-italia.net",
      "date": "2026-02-13T08:53:01+00:00",
      "summary": "Ruben Loftus-Cheek and Christopher Nknuku are expected to lead the Milan attack in an away..."
    },
    {
      "id": "d50cee56a1a2",
      "title": "Capello claims Serie A title race wide open: ‘Inter & Juventus, watch out for Milan & Roma’",
      "url": "https://football-italia.net/capello-claims-serie-a-title-race-wide-open/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:30:19+00:00",
      "summary": "Fabio Capello insists the Serie A title race is far from over, warning that Inter..."
    },
    {
      "id": "ef679b7e17ab",
      "title": "Only one Serie A player included in Europe’s best paid footballers in 2026",
      "url": "https://football-italia.net/one-juventus-player-europe-top-20-best-paid/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:01:54+00:00",
      "summary": "Juventus’s Dusan Vlahovic is currently the only Serie A player to feature in the list..."
    },
    {
      "id": "00edaaaae844",
      "title": "Juventus set price tag for Gatti as Milan, Napoli and Premier League clubs queue up",
      "url": "https://football-italia.net/juventus-set-price-tag-for-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-12T14:21:33+00:00",
      "summary": "Juventus reportedly have a price tag in mind when it comes to a potential sale..."
    },
    {
      "id": "8c7c1ace3789",
      "title": "Allegri previews Pisa vs. Milan and gives injury update: ‘Pulisic only has 15-20 minutes’",
      "url": "https://football-italia.net/allegri-previews-pisa-vs-milan-injury-update/",
      "source": "football-italia.net",
      "date": "2026-02-12T12:49:06+00:00",
      "summary": "Massimiliano Allegri has shared his thoughts ahead of Milan’s upcoming Serie A clash against Pisa..."
    }
  ]
}