{
  "lastUpdated": "2026-02-14T18:32:46.291525+00:00",
  "articles": [
    {
      "id": "0ccd3366f446",
      "title": "Montolivo on Milan after Pisa: \"These are three points that matter\"",
      "url": "https://www.milannews.it/news/montolivo-sul-milan-dopo-pisa-questi-sono-tre-punti-che-pesano-607347",
      "source": "milannews.it",
      "date": "2026-02-14T18:23:52+00:00",
      "summary": "The Milan won 1-2 in Pisa with a late goal from Luka Modric which puts the chestnuts out of the fire for the Rossoneri who thus find their first victory with a newly promoted team this season."
    },
    {
      "id": "947c2e7fe9c1",
      "title": "Amelia: \"Milan have the mentality to be able to win the Scudetto\"",
      "url": "https://www.milannews.it/news/amelia-il-milan-ha-la-mentalita-per-potercela-fare-per-lo-scudetto-607447",
      "source": "milannews.it",
      "date": "2026-02-14T18:12:00+00:00",
      "summary": "Marco Amelia, former AC Milan goalkeeper, spoke live on Sportitalia as a guest. His words on Milan: \"In my opinion this Milan can really aspire to the Scudetto."
    },
    {
      "id": "c4ea8b71ed23",
      "title": "Athekame sees Pisa and goes wild: goal in the first leg, assist in the return",
      "url": "https://www.milannews.it/news/athekame-vede-pisa-e-si-scatena-gol-all-andata-assist-al-ritorno-607357",
      "source": "milannews.it",
      "date": "2026-02-14T18:00:24+00:00",
      "summary": "In the hard and difficult victory at the home of Pisa by 1-2, which came thanks to a champion's play by Luka Modric in the final, we saw for the second time as a starter Zachary Athekame, a Swiss full-back who arrived from ..."
    },
    {
      "id": "f6b0eac137c0",
      "title": "Morata sent off as Como dropped points again ahead of Milan encounter – video",
      "url": "https://sempremilan.com/morata-sent-off-cromo-dropped-points-milan",
      "source": "sempremilan.com",
      "date": "2026-02-14T18:00:00+00:00",
      "summary": "The former AC Milan player Alvaro Morata was sent off as Como dropped points again, losing 1-2 against Fiorentina, just days before the game against the Rossoneri.  Out of the next few games, including the one played yesterday, Como has always been described as the most difficult one for Milan. Righ"
    },
    {
      "id": "5d590e4e67b8",
      "title": "Ceccarini: \"I dream of Lewandowski for Milan. Stay on the sidelines in case the Pole opens up\"",
      "url": "https://www.milannews.it/calciomercato-milan/ceccarini-sogno-lewandowski-per-il-milan-resta-alla-finestra-in-caso-di-apertura-del-polacco-607425",
      "source": "milannews.it",
      "date": "2026-02-14T17:48:07+00:00",
      "summary": "Niccolò Ceccarini, director of TMW, expressed himself thus in his editorial on the Milan transfer market: \"First the Champions League then a summer campaign with a very specific objective: a great striker."
    },
    {
      "id": "1f99814b755f",
      "title": "It hasn't happened since that super season with Pioli: Loftus-Cheek scored two games in a row",
      "url": "https://www.milannews.it/news/non-accadeva-da-quella-super-stagione-con-pioli-loftus-cheek-a-segno-per-due-gare-di-fila-607383",
      "source": "milannews.it",
      "date": "2026-02-14T17:36:52+00:00",
      "summary": "Ruben Loftus-Cheek scored 2 times in a row for the second time in Serie A, after the one in January 2024 (against Udinese and Bologna in that case). Opta reports it."
    },
    {
      "id": "24279307e59b",
      "title": "Rabiot forced to tactical foul against Parma to avoid missing Milan-Inter",
      "url": "https://sempremilan.com/rabiot-forced-foul-parma-milan-inter",
      "source": "sempremilan.com",
      "date": "2026-02-14T17:30:00+00:00",
      "summary": "Adrien Rabiot might have some regrets about turning a yellow card into a red last night, as he now must make a tactical foul before the derby against Inter.  In the dying minutes of Pisa-Milan, which the Rossoneri won by two goals to one, Rabiot was shown a red card after two bookings. The first […]"
    },
    {
      "id": "8a4e58ec9c60",
      "title": "Fabregas angry with Morata: \"Whoever doesn't live with provocation should do another sport\"",
      "url": "https://www.milannews.it/news/fabregas-arrabbiato-con-morata-chi-non-vive-con-la-provocazione-faccia-un-altro-sport-607448",
      "source": "milannews.it",
      "date": "2026-02-14T17:24:04+00:00",
      "summary": "Como lost 1-2 at home to Fiorentina in a very nervous match that ended with Alvaro Morata being sent off in added time."
    },
    {
      "id": "e7a7dd46dd90",
      "title": "New stadium, Milan was in Liverpool to view the Everton stadium",
      "url": "https://www.milannews.it/news/nuovo-stadio-il-milan-e-stato-a-liverpool-a-visionare-lo-stadio-dell-everton-607445",
      "source": "milannews.it",
      "date": "2026-02-14T17:12:58+00:00",
      "summary": "After in recent months Milan and Inter acquired the area of ​​the San Siro stadium in order to be able to start the works that will lead to the construction of the new Milanese facility in the coming months, in recent weeks the two clubs have ..."
    },
    {
      "id": "965d7dec332d",
      "title": "Photos: Milan players react to Pisa win on social media – “Always a great feeling”",
      "url": "https://sempremilan.com/photos-milan-players-react-pisa-win-2026",
      "source": "sempremilan.com",
      "date": "2026-02-14T17:04:15+00:00",
      "summary": "After the crucial win against Pisa last night, some of the AC Milan players sent messages to the fans through their social media accounts.  Thanks to goals from Ruben Loftus-Cheek and Luka Modric, one in each half, Milan prevailed 2-1 against Pisa. It was a crucial win in the Scudetto race as the ga"
    },
    {
      "id": "4657deb84a41",
      "title": "How things have changed in a year: the Allegriano Milan dreams",
      "url": "https://www.milannews.it/primo-piano/come-sono-cambiate-le-cose-in-un-anno-il-milan-allegriano-sogna-607439",
      "source": "milannews.it",
      "date": "2026-02-14T17:00:00+00:00",
      "summary": "About a year ago, Milan experienced one of the very rare peaks of enthusiasm of the last season: the January transfer window just ended with the arrival of moves announced as very important (Joao Felix, Gimenez, Walker) and victories in the championship..."
    },
    {
      "id": "52219d04eb9c",
      "title": "Agresti: \"Milan are not as strong as Inter: they have fewer quality alternatives, some ailments among the top players, they don't give a sense of superiority. Yet they are still close\"",
      "url": "https://www.milannews.it/news/agresti-il-milan-non-e-forte-come-l-inter-ha-meno-alternative-di-qualita-qualche-acciacco-dei-top-non-da-senso-di-superiorita-eppure-e-ancora-vicino-607418",
      "source": "milannews.it",
      "date": "2026-02-14T16:47:43+00:00",
      "summary": "Stefano Agresti, on the pages of the Gazzetta dello Sport on newsstands today, expressed himself as follows, commenting on the moment of Milan who beat Pisa 2-1 yesterday: \"Allegri's Milan is not as strong as Inter, nor is it ..."
    },
    {
      "id": "6aa354f185cf",
      "title": "Modric is the third oldest player to score in Serie A after Costacurta and Ibrahimovic",
      "url": "https://www.milannews.it/news/modric-e-il-terzo-giocatore-piu-anziano-a-segnare-in-serie-a-dopo-costacurta-e-ibrahimovic-607382",
      "source": "milannews.it",
      "date": "2026-02-14T16:35:52+00:00",
      "summary": "Luka Modrić (40 years and 157 days) is the third oldest player to score in Serie A after Alessandro Costacurta (41 years and 25 days) and Zlatan Ibrahimović (41 years and 166 days). Opta reports it."
    },
    {
      "id": "c717eb7ad82a",
      "title": "GdS: Everton’s stadium one of many study visits as Milan proceed with San Siro plan",
      "url": "https://sempremilan.com/gds-everton-stadium-study-visits-milan",
      "source": "sempremilan.com",
      "date": "2026-02-14T16:30:00+00:00",
      "summary": "AC Milan recently sent a delegation to study Everton’s new home, the Hill Dickinson Stadium, as the San Siro plans are progressing according to plan.  After getting the green light from the city council for the sale of San Siro last year, Milan have since been working on the bureaucracy and paperwor"
    },
    {
      "id": "383042bb764c",
      "title": "Sabatini critical: \"Milan extremely opaque, in the first half practically almost unwatchable. Three steps behind Bologna\"",
      "url": "https://www.milannews.it/news/sabatini-critico-milan-estremamente-opaco-nel-primo-tempo-praticamente-quasi-inguardabile-tre-passi-indietro-rispetto-a-bologna-607413",
      "source": "milannews.it",
      "date": "2026-02-14T16:23:59+00:00",
      "summary": "Sandro Sabatini, journalist, expressed himself as follows on the transfer market."
    },
    {
      "id": "a48607f2b545",
      "title": "Serie A, the updated ranking: Como slows down, Fiorentina breathes",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-il-como-rallenta-la-fiorentina-respira-607389",
      "source": "milannews.it",
      "date": "2026-02-14T16:12:56+00:00",
      "summary": "In the first match of a crackling Saturday, Como lost at home against Fiorentina by 1-2."
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "3c05ba9c04af",
      "title": "Como loses against Fiorentina: Morata, sent off, will miss Milan",
      "url": "https://www.milannews.it/news/il-como-perde-contro-la-fiorentina-morata-espulso-saltera-il-milan-607388",
      "source": "milannews.it",
      "date": "2026-02-14T16:00:41+00:00",
      "summary": "The Como falls four days before the match against Milan, the recovery of the twenty-fourth matchday of the Serie A Enilive championship which will be played on Wednesday at 8.45 pm at San Siro."
    },
    {
      "id": "3e6af2bedf24",
      "title": "Athekame’s crossing proving to be a weapon for Milan in season finale",
      "url": "https://sempremilan.com/athekame-crossing-weapon-milan-season-finale",
      "source": "sempremilan.com",
      "date": "2026-02-14T16:00:19+00:00",
      "summary": "Zachary Athekame has certainly responded to the initial criticism in recent weeks by showcasing his great crossing several times, including against Pisa last night.  Few knew who Athekame was when he arrived from Young Boys in the summer. He was just 20 at the time and didn’t exactly arrive from the"
    },
    {
      "id": "560d02fb5667",
      "title": "The end of the first half is always Milan-branded: 9 goals in the final 15 minutes. More than any other in Serie A",
      "url": "https://www.milannews.it/news/la-fine-del-primo-tempo-e-sempre-di-marca-milan-9-gol-nei-15-minuti-finali-piu-di-ogni-altro-in-serie-a-607381",
      "source": "milannews.it",
      "date": "2026-02-14T15:48:47+00:00",
      "summary": "Milan have scored 9 goals in the final 15 minutes of the first half this Serie A, more than any opponent in this Serie A. Opta reports."
    },
    {
      "id": "440963619ff7",
      "title": "The banner appears in Como: \"Better 1 day with Fabregas than 100 with Allegri\"",
      "url": "https://www.milannews.it/news/a-como-spunta-lo-striscione-meglio-1-giorno-da-fabregas-che-100-da-allegri-607438",
      "source": "milannews.it",
      "date": "2026-02-14T15:36:00+00:00",
      "summary": "About a month ago, Milan won in Como by 1-3 after a match that the Como team had played very well in the first half, but repeatedly crashed into a huge Mike Maignan, unbeatable between the posts."
    },
    {
      "id": "7cec168c88e0",
      "title": "Milan Futuro 1-0 Breno: Sardo and Traore lead the way for Oddo’s side",
      "url": "https://sempremilan.com/milan-futuro-1-0-breno-sardo-traore",
      "source": "sempremilan.com",
      "date": "2026-02-14T15:30:24+00:00",
      "summary": "Milan Futuro returned to winning ways against Breno this afternoon, largely thanks to the performances of Jacopo Sardo and Chaka Traore. After the defeat last time out, Massimo Oddo headed into today’s game under some pressure to turn things around, having fallen further away from the promotion play"
    },
    {
      "id": "410b3fe1101b",
      "title": "\"+3\": a cheerful Tomori on social media. Photos from Pisa and description with what matters most",
      "url": "https://www.milannews.it/news/3-un-tomori-allegriano-sui-social-foto-da-pisa-e-descrizione-con-cio-che-conta-di-piu-607410",
      "source": "milannews.it",
      "date": "2026-02-14T15:24:21+00:00",
      "summary": "Milan beat Pisa 1-2 thanks to Luka Modric's goal in the 85th minute, which was decisive in channeling the result after the momentary equalizer scored by Ruben Loftus-Cheek for the Rossoneri and by Loyola for the Tuscans."
    },
    {
      "id": "ffd9a3ad8631",
      "title": "LIVE MN - Serie D, Milan Futuro-Breno (1-0): the Rossoneri return to victory!",
      "url": "https://www.milannews.it/primo-piano/live-mn-serie-d-milan-futuro-breno-1-0-i-rossoneri-tornano-alla-vittoria-607435",
      "source": "milannews.it",
      "date": "2026-02-14T15:24:00+00:00",
      "summary": "MILAN FUTURO-BRENO 1-0, END OF THE MATCH. After one point in three games, Milan Futuro returns to victory and does so with full merit, or rather perhaps eliminating something."
    },
    {
      "id": "c38027fc10c6",
      "title": "Vernazza: \"If Allegri wanted it, he would win these matches without anxiety or worries, and the proof lies in the change of system that led to the 1-2 draw\"",
      "url": "https://www.milannews.it/news/vernazza-se-allegri-lo-volesse-queste-partite-le-vincerebbe-senza-ansie-ne-patemi-e-la-dimostrazione-sta-nel-cambio-di-sistema-che-ha-portato-all-1-2-607401",
      "source": "milannews.it",
      "date": "2026-02-14T15:12:09+00:00",
      "summary": "Sebastiano Vernazza, journalist, expressed himself in La Gazzetta dello Sport at the end of Pisa-Milan: \"A “triangle” opened and closed by Modric, with the collaboration of Ricci, saved Milan from yet another ..."
    },
    {
      "id": "a1f193c32280",
      "title": "Rome, Gasperini: \"After 24 days we are there, together with Juve and Napoli, with Milan still visible\"",
      "url": "https://www.milannews.it/news/roma-gasperini-dopo-24-giornate-siamo-li-insieme-a-juve-e-napoli-con-il-milan-ancora-visibile-607437",
      "source": "milannews.it",
      "date": "2026-02-14T15:00:22+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 14 - \"Undoubtedly against Napoli and Juve they will be two important matches, they have a higher value, but in the end they are always worth 3 points."
    },
    {
      "id": "e85da2c25057",
      "title": "Watch: Allegri lets his emotions out after Modric’s crucial winner against Pisa",
      "url": "https://sempremilan.com/watch-allegri-lets-emotions-out-modrics-winner",
      "source": "sempremilan.com",
      "date": "2026-02-14T15:00:00+00:00",
      "summary": "Massimiliano Allegri is known for showing his emotions in the dugout, especially at the end of games, and yesterday was no exception as Luka Modric scored the winner.  If there’s one thing that Milan fans have understood 24 games into the season, it’s that Allegri truly immerses himself in each game"
    },
    {
      "id": "c789d3c28bc0",
      "title": "Condò: \"For Inter and Juve, a lot of anxiety to manage after Modric's goal\"",
      "url": "https://www.milannews.it/news/condo-per-inter-e-juve-bel-carico-d-ansia-da-gestire-dopo-il-gol-di-modric-607431",
      "source": "milannews.it",
      "date": "2026-02-14T14:49:24+00:00",
      "summary": "In the columns of Corriere della Sera, Paolo Condò spoke like this about Inter-Juventus, which comes the day after Milan's victory on the pitch at Pisa thanks to a goal from Luka Modric: \"A very classy play from Luka Modr..."
    },
    {
      "id": "cbc84cfc619d",
      "title": "Ricci and Jashari licking their lips amid Rabiot’s suspension for Milan-Como",
      "url": "https://sempremilan.com/ricci-jashari-licking-lips-rabiots-suspension",
      "source": "sempremilan.com",
      "date": "2026-02-14T14:30:00+00:00",
      "summary": "AC Milan will be without their star midfielder Adrien Rabiot for the game against Como on Wednesday, with Ardon Jashari and Samuele Ricci both eyeing a chance from start.  It was in the dying minute of yesterday’s 2-1 win against Pisa that Rabiot got sent off. He first received a yellow card for a f"
    },
    {
      "id": "5b1afed4e638",
      "title": "Genoa 1-2 Milan Primavera: Early red card paves the way for the Rossoneri",
      "url": "https://sempremilan.com/genoa-1-2-milan-primavera-early-red-card",
      "source": "sempremilan.com",
      "date": "2026-02-14T14:01:12+00:00",
      "summary": "A negative trend was thankfully reversed for Milan Primavera this afternoon, as they collected all points from their game against Genoa.  After three games without a win, including two defeats, Milan Primavera managed to get back to winning ways this afternoon. Despite the poor run of form lately, t"
    },
    {
      "id": "838d1f721b07",
      "title": "Watch: Relive Pisa-Milan as Modric scores the winner late on – the highlights",
      "url": "https://sempremilan.com/watch-relive-pisa-milan-modric-winner",
      "source": "sempremilan.com",
      "date": "2026-02-14T13:35:00+00:00",
      "summary": "It ended up being a complicated away trip to Pisa for Milan, who were rescued by their veteran Luka Modric in the dying minutes.  After taking the lead through Ruben Loftus-Cheek in the first half, it seemed like it would be a comfortable evening for Milan, especially since they dominated play befor"
    },
    {
      "id": "2984eb94f962",
      "title": "Man on a mission and runs equalled: All the key stats from Pisa vs. AC Milan",
      "url": "https://sempremilan.com/all-key-stats-pisa-1-2-milan-2026",
      "source": "sempremilan.com",
      "date": "2026-02-14T13:05:00+00:00",
      "summary": "AC Milan extended their unbeaten run to 23 games, and their winning run to to games, after scoring twice against Pisa last night.  Goals from Ruben Loftus-Cheek and Luka Modric were enough to secure all three points for the Rossoneri, but as we will get into, it wasn’t as easy as they perhaps would "
    },
    {
      "id": "289cf0a082e2",
      "title": "Füllkrug ‘relieved’ after missing penalty against Pisa: “Definitely had better days”",
      "url": "https://sempremilan.com/fullkrug-relieved-after-penalty-miss-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-14T12:45:00+00:00",
      "summary": "Niclas Füllkrug published a message for the AC Milan fans on Instagram this morning, after missing a penalty in the Rossoneri’s 2-1 win against Pisa. It was in the 56th minute that Füllkrug stepped up to take the penalty for Milan. The scoreline was 0-1 then, meaning a goal would have doubled the le"
    },
    {
      "id": "5a52ab37177a",
      "title": "Photo: Rabiot sends signal to Pisa-Milan referee with Instagram story",
      "url": "https://sempremilan.com/rabiot-signal-pisa-milan-referee-instagram",
      "source": "sempremilan.com",
      "date": "2026-02-14T12:20:00+00:00",
      "summary": "Adrien Rabiot has sent a message to the Pisa-Milan referee, and the officiating team in general, with a story on Instagram. Rabiot was sent off in the dying minutes of the Rossoneri’s 2-1 win, first receiving a yellow card for a light touch on a Pisa player. Evidently not happy with the call, he sai"
    },
    {
      "id": "a5f2b100ed40",
      "title": "Pisa manager believes they ‘played a perfect game’ against Milan despite defeat",
      "url": "https://sempremilan.com/pisa-manager-perfect-game-milan-defeat",
      "source": "sempremilan.com",
      "date": "2026-02-14T11:55:00+00:00",
      "summary": "Pisa manager Oscar Hljemark believes his side played a perfect game tactically against Milan, despite coming away with zero points in the end.  After the 2-2 draw in the reverse fixture, Milan headed into the game with a lust for revenge. While it was far from brilliant, they controlled the first ha"
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "4df7a9eb3d81",
      "title": "MN: Leao consoled Füllkrug after penalty miss and double substitution in Pisa-Milan",
      "url": "https://sempremilan.com/mn-leao-consoled-fullkrug-penalty-miss",
      "source": "sempremilan.com",
      "date": "2026-02-14T11:30:00+00:00",
      "summary": "Niclas Füllkrug was very disappointed after his penalty miss against Pisa and was consoled by Rafael Leao, as well as other teammates, after the final whistle.  At half-time, Massimiliano Allegri decided to replace Christopher Nkunku with Füllkrug. The German was immediately involved in a wonderful "
    },
    {
      "id": "394dddd46ab0",
      "title": "CorSera: ‘The dreamcatcher’ – Modric continues to keep Milan’s Scudetto dream alive",
      "url": "https://sempremilan.com/corsera-dreamcatcher-modric-milan-scudetto",
      "source": "sempremilan.com",
      "date": "2026-02-14T11:05:00+00:00",
      "summary": "Luka Modric scored the winner for AC Milan against Pisa, showing once again just how important he is, and there has been no shortage of praise for him this morning.  At the age of 40, it’s simply incredible what Modric has brought to the team this season. In addition to his passing, which everyone k"
    },
    {
      "id": "48eeaf030fb2",
      "title": "Why Füllkrug’s penalty wasn’t retaken despite obvious encroachment",
      "url": "https://sempremilan.com/why-fullkrugs-penalty-wasnt-retaken-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-14T10:40:00+00:00",
      "summary": "Niclas Füllkrug missed a penalty for AC Milan in their 2-1 win against Pisa last night, but many have been asking why it wasn’t retaken due to obvious encroachment. It was in the 54th minute that the referee pointed to the spot, awarding a penalty to Milan. Strahinja Pabvlovic was brought down after"
    },
    {
      "id": "65cc76c7aa14",
      "title": "Obvious MOTM and flop: Player ratings for Pisa-Milan from Italian papers",
      "url": "https://sempremilan.com/ratings-italian-papers-pisa-1-2-milan",
      "source": "sempremilan.com",
      "date": "2026-02-14T10:15:00+00:00",
      "summary": "Luka Modric was named the MOTM in AC Milan’s 2-1 win against Pisa by every outlet, as you would expect, and there were no disagreements on the flop either.  Milan needed to clinch all three points to keep up with Inter in the Scudetto race, and that’s exactly what they did. However, it was far […]\nT"
    },
    {
      "id": "ac44c6d33098",
      "title": "Loftus-Cheek says ‘shouting’ from Allegri was important just before Pisa-Milan opener",
      "url": "https://sempremilan.com/loftus-cheek-shouting-allegri-pisa-milan",
      "source": "sempremilan.com",
      "date": "2026-02-14T09:50:00+00:00",
      "summary": "Ruben Loftus-Cheek was one of the goalscorers in AC Milan’s 2-1 win against Pisa, and afterwards, he spoke to the media about the important win.  The Englishman managed to build on his positive moment, scoring yet another goal after also getting on the scoresheet against Bologna. Considering that Ma"
    },
    {
      "id": "66bb22f5336e",
      "title": "GdS: Allegri’s crucial changes and Modric’s brilliance – Pisa succumb to Milan",
      "url": "https://sempremilan.com/gds-allegri-changes-modric-pisa-succumb-milan",
      "source": "sempremilan.com",
      "date": "2026-02-14T09:25:00+00:00",
      "summary": "AC Milan’s narrow win against Pisa didn’t just come about thanks to the brilliance of Luka Modric, but also some tactical changes from Allegri.  As highlighted in today’s edition of Gazzetta dello Sport (see featured image), a one-two started and finished by Modric, with the help of Samuele Ricci, s"
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    },
    {
      "id": "9c729c8148a4",
      "title": "Pisa forced to field third-choice goalkeeper in Serie A match against Milan",
      "url": "https://football-italia.net/pisa-forced-3rd-choice-goalkeeper-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T13:04:11+00:00",
      "summary": "Second-choice Pisa goalkeeper Simone Scuffet has been ruled out of tonight’s Serie A match against..."
    },
    {
      "id": "e6e4778300f1",
      "title": "Report Milan call McKennie for possible USMNT reunion with Pulisic",
      "url": "https://football-italia.net/milan-call-mckennie-usmnt-reunion-pulisic/",
      "source": "football-italia.net",
      "date": "2026-02-13T12:43:07+00:00",
      "summary": "Milan have reportedly begun preliminary talks with Weston McKennie’s entourage as the Juventus midfielder is..."
    },
    {
      "id": "bb92885e8dfd",
      "title": "Milan make Modric decision, prepare for new contract extensions after Maignan",
      "url": "https://football-italia.net/milan-modric-decision-more-contracts-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-13T11:04:46+00:00",
      "summary": "According to La Gazzetta dello Sport, Fikayo Tomori is expected to be the next Milan..."
    },
    {
      "id": "c682014167e5",
      "title": "Serie A: Pisa vs. Milan – probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/pisa-vs-milan-probable-line-ups-watch-on-tv/",
      "source": "football-italia.net",
      "date": "2026-02-13T08:53:01+00:00",
      "summary": "Ruben Loftus-Cheek and Christopher Nknuku are expected to lead the Milan attack in an away..."
    },
    {
      "id": "d50cee56a1a2",
      "title": "Capello claims Serie A title race wide open: ‘Inter & Juventus, watch out for Milan & Roma’",
      "url": "https://football-italia.net/capello-claims-serie-a-title-race-wide-open/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:30:19+00:00",
      "summary": "Fabio Capello insists the Serie A title race is far from over, warning that Inter..."
    },
    {
      "id": "ef679b7e17ab",
      "title": "Only one Serie A player included in Europe’s best paid footballers in 2026",
      "url": "https://football-italia.net/one-juventus-player-europe-top-20-best-paid/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:01:54+00:00",
      "summary": "Juventus’s Dusan Vlahovic is currently the only Serie A player to feature in the list..."
    },
    {
      "id": "00edaaaae844",
      "title": "Juventus set price tag for Gatti as Milan, Napoli and Premier League clubs queue up",
      "url": "https://football-italia.net/juventus-set-price-tag-for-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-12T14:21:33+00:00",
      "summary": "Juventus reportedly have a price tag in mind when it comes to a potential sale..."
    },
    {
      "id": "8c7c1ace3789",
      "title": "Allegri previews Pisa vs. Milan and gives injury update: ‘Pulisic only has 15-20 minutes’",
      "url": "https://football-italia.net/allegri-previews-pisa-vs-milan-injury-update/",
      "source": "football-italia.net",
      "date": "2026-02-12T12:49:06+00:00",
      "summary": "Massimiliano Allegri has shared his thoughts ahead of Milan’s upcoming Serie A clash against Pisa..."
    }
  ]
}