{
  "lastUpdated": "2026-02-11T21:32:42.974319+00:00",
  "articles": [
    {
      "id": "4897e8594c18",
      "title": "Camarda replies: “My Milanism cannot be questioned”",
      "url": "https://www.milannews.it/news/camarda-risponde-il-mio-milanismo-non-puo-essere-messo-in-discussione-607094",
      "source": "milannews.it",
      "date": "2026-02-11T21:26:13+00:00",
      "summary": "The answer that Francesco Camarda, an AC Milan striker on loan to Lecce, gave to the question about the possibility of going to Inter in the future created a bit of controversy."
    },
    {
      "id": "2344b5ccad57",
      "title": "Paganini: \"Milan have been interested in Vlahovic for a long time, he often spoke with Allegri and also with Tare\"",
      "url": "https://www.milannews.it/news/paganini-il-milan-e-da-tanto-che-c-e-su-vlahovic-ha-parlato-spesso-con-allegri-e-anche-con-tare-607083",
      "source": "milannews.it",
      "date": "2026-02-11T21:20:37+00:00",
      "summary": "Paolo Paganini was a guest of Maracanà, in the afternoon of TMW Radio. His words on Dusan Vlahovic:\n\nJuve remains the attacking node."
    },
    {
      "id": "fd0177eb7a7e",
      "title": "Moretto: \"Milan is in no hurry to renew Pulisic. There is one thing to highlight...\"",
      "url": "https://www.milannews.it/news/moretto-milan-non-ha-fretta-di-rinnovare-pulisic-c-e-una-cosa-da-evidenziare-607095",
      "source": "milannews.it",
      "date": "2026-02-11T21:14:03+00:00",
      "summary": "On Fabrizio Romano's YouTube channel, Matteo Moretto spoke about Pulisic's renewal. These are his words:\n\n\"There is a lot of talk about the possible renewal of Pulisic, in short the possibility that he might not renew."
    },
    {
      "id": "27e4989f0cc6",
      "title": "Sheva: \"Maldini made the absolute difference. At Kakà's first training session I told Ancelotti...\"",
      "url": "https://www.milannews.it/news/sheva-maldini-faceva-la-differenza-assoluta-al-primo-allenamento-di-kaka-dissi-ad-ancelotti-607019",
      "source": "milannews.it",
      "date": "2026-02-11T21:11:12+00:00",
      "summary": "Guest of the Amazon Prime Video format \"FENOMENI\" in the company of former footballer Luca Toni, Andriy Shevchenko, historic AC Milan striker who won everything with the Rossoneri between 1999 and 2006, including a Ballon d'Or."
    },
    {
      "id": "df0cc9dd1af8",
      "title": "Camarda: \"Best goal? In terms of importance I say the one with Lecce against Bologna\"",
      "url": "https://www.milannews.it/news/camarda-gol-piu-bello-per-importanza-dico-quello-con-il-lecce-contro-il-bologna-607077",
      "source": "milannews.it",
      "date": "2026-02-11T21:00:29+00:00",
      "summary": "Francesco Camarda, AC Milan striker born in 2008 on loan to Lecce, met the very young students of the Marcelline Institute as part of the \"Draw with footballers\" project organized by Panini."
    },
    {
      "id": "a88382179c0a",
      "title": "MN - Marcolin: \"There is an essential difference between Inter and Milan...\"",
      "url": "https://www.milannews.it/news/mn-marcolin-c-e-una-differenza-essenziale-tra-inter-e-milan-606994",
      "source": "milannews.it",
      "date": "2026-02-11T20:50:06+00:00",
      "summary": "The former Napoli, Lazio and Sampdoria player, among others, Dario Marcolin, spoke exclusively to MilanNews."
    },
    {
      "id": "337ca8fa0c0d",
      "title": "Atalanta, De Ketelaere tile: lesion of the posterior horn of the internal meniscus of the right knee",
      "url": "https://www.milannews.it/l-avversario/atalanta-tegola-de-ketelaere-lesione-del-corno-posteriore-del-menisco-interno-del-ginocchio-destro-607087",
      "source": "milannews.it",
      "date": "2026-02-11T20:40:00+00:00",
      "summary": "Tile at home Atalanta: Charles De Ketelaere, reports tuttomercatoweb.com, in the warm-up of the match against Cremonese last Monday suffered a lesion of the posterior horn of the internal meniscus of the right knee."
    },
    {
      "id": "b65cb7587b7b",
      "title": "Chukwueze can now consider himself a Fulham starter and Milan is confident that the club will pay the ransom",
      "url": "https://www.milannews.it/calciomercato-milan/chukwueze-puo-oggi-considerarsi-un-titolare-del-fulham-e-il-milan-confida-che-il-club-paghi-il-riscatto-606954",
      "source": "milannews.it",
      "date": "2026-02-11T20:30:26+00:00",
      "summary": "Alessandra Gozzini, journalist, expressed herself in La Gazzetta dello Sport on the future of Samuel Chukwueze: \"The rich Premier League will be able to fill the Rossoneri coffers with another 24 million if Samu ..."
    },
    {
      "id": "0b6e2b558d34",
      "title": "Stringara: \"I remember Vlahovic from Fiorentina, but at Juventus he was never considered immovable by Allegri and it's strange that he's looking for him now\"",
      "url": "https://www.milannews.it/news/stringara-ricordo-il-vlahovic-della-fiorentina-ma-alla-juve-non-e-mai-stato-considerato-inamovibile-da-allegri-ed-e-strano-che-ora-lo-cerchi-607082",
      "source": "milannews.it",
      "date": "2026-02-11T20:20:50+00:00",
      "summary": "Paolo Stringara, former footballer, spoke about Dusan Vlahovic in his speech at Maracanà on TWM Radio:\n\nJuve remains the attacking node."
    },
    {
      "id": "f2ab74313ece",
      "title": "Criscitiello: \"It's not a problem if the referees go in favor of Milan, Inter, Napoli, Juve, Lecce and Parma. The problem is general\"",
      "url": "https://www.milannews.it/news/criscitiello-non-e-un-problema-se-gli-arbitri-vanno-a-favore-del-milan-inter-napoli-juve-lecce-e-parma-il-problema-e-generale-607047",
      "source": "milannews.it",
      "date": "2026-02-11T20:12:42+00:00",
      "summary": "During his editorial for Sportitalia, Michele Criscitiello expressed himself as follows on refereeing: \"De Rossi is right when he says that it is no longer football."
    },
    {
      "id": "b6c36ecd9191",
      "title": "From SOS to potential logjam: How the future of Milan’s attack could be decided in 15 games",
      "url": "https://sempremilan.com/how-future-milan-attack-decided-15-games",
      "source": "sempremilan.com",
      "date": "2026-02-11T20:01:53+00:00",
      "summary": "The attacking department has not allowed Massimiliano Allegri to rest easy this season so far, for various different reasons. We start from a premise: going int the 2025-26 season, Allegri had earmarked Rafael Leao and Christian Pulisic as the duo that he wanted to spearhead his 3-5-2 system. There "
    },
    {
      "id": "9802f0f64f6d",
      "title": "Camarda remembers his debut in Serie A at 15: \"I was really small compared to the other players\"",
      "url": "https://www.milannews.it/news/camarda-ricorda-l-esordio-in-serie-a-a-15-anni-ero-proprio-piccolo-in-confronto-agli-altri-giocatori-607076",
      "source": "milannews.it",
      "date": "2026-02-11T20:00:00+00:00",
      "summary": "Francesco Camarda, AC Milan striker born in 2008 on loan to Lecce, met the very young students of the Marcelline Institute as part of the \"Draw with footballers\" project organized by Panini."
    },
    {
      "id": "84cdb2f21077",
      "title": "MN - Marcolin on the championship race: \"Everything is still open\"",
      "url": "https://www.milannews.it/news/mn-marcolin-sulla-corsa-scudetto-tutto-e-ancora-aperto-606993",
      "source": "milannews.it",
      "date": "2026-02-11T19:50:00+00:00",
      "summary": "The former Napoli, Lazio and Sampdoria player, among others, Dario Marcolin, spoke exclusively to MilanNews."
    },
    {
      "id": "7c60598e6979",
      "title": "Referees, Dossena: \"Let's try to train and train a class of former footballers who can undertake that career or who can become varsity players\"",
      "url": "https://www.milannews.it/news/arbitri-dossena-proviamo-ad-allenare-e-formare-una-classe-di-ex-calciatori-che-possano-intraprendere-quella-carriera-o-che-possano-diventare-dei-varis-607081",
      "source": "milannews.it",
      "date": "2026-02-11T19:40:40+00:00",
      "summary": "Former footballer and coach Beppe Dossena was a guest on TMW Radio, during Maracanà. These are his words on a possible reform in the refereeing class:\n\n“Napoli are affected by injuries."
    },
    {
      "id": "e7a191b2927d",
      "title": "Juventus, Thuram: \"Will Milan and Napoli support us on Saturday? It will be important above all for our ranking\"",
      "url": "https://www.milannews.it/news/juventus-thuram-milan-e-napoli-tiferanno-per-noi-sabato-sara-importante-soprattutto-per-la-nostra-classifica-607048",
      "source": "milannews.it",
      "date": "2026-02-11T19:30:27+00:00",
      "summary": "Khephren Thuram, Juventus midfielder, expressed himself thus to the microphones of Sky Sport a few days before Inter-Juve: \"It's obvious that we are very angry. Because we played a good match."
    },
    {
      "id": "963b856ad9ca",
      "title": "FIGC: 'One team, one neighbourhood', the new episode of \"Speak Out!\" is online.",
      "url": "https://www.milannews.it/news/figc-una-squadra-un-quartiere-on-line-la-nuova-puntata-di-speak-out-607075",
      "source": "milannews.it",
      "date": "2026-02-11T19:20:56+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 11 - The theme of legality is at the center of the fifth episode of 'Speak Out! Football tells', the FIGC web series on the social value of football."
    },
    {
      "id": "a8df5042b058",
      "title": "Guidi: \"Leao will be 27 next summer, it's difficult for super offers to arrive\"",
      "url": "https://www.milannews.it/calciomercato-milan/guidi-leao-la-prossima-estate-avra-27-anni-difficile-arrivino-super-offerte-607013",
      "source": "milannews.it",
      "date": "2026-02-11T19:10:55+00:00",
      "summary": "On his YouTube channel, Carlo Pellegatti hosted Marco Guidi, a writer for the Gazzetta dello Sport, who spoke about the Leao situation like this:\n\n\"I believe that Leao, a bit like every year, because a bit like every year..."
    },
    {
      "id": "5e341a3030d7",
      "title": "Camarda: \"Suarez, Ibra and Ronaldo are my idols. Would I ever go to Inter? Now I'm at Lecce, then what will happen...\"",
      "url": "https://www.milannews.it/primo-piano/camarda-suarez-ibra-e-ronaldo-i-miei-idoli-andrei-mai-all-inter-ora-sono-al-lecce-poi-quello-che-succedera-607071",
      "source": "milannews.it",
      "date": "2026-02-11T19:00:00+00:00",
      "summary": "Francesco Camarda, AC Milan striker born in 2008 on loan to Lecce, met the very young students of the Marcelline Institute as part of the \"Draw with footballers\" project organized by Panini."
    },
    {
      "id": "3f942ce678a8",
      "title": "De Winter talks favoured role, adaptation at Milan and first goal – video",
      "url": "https://sempremilan.com/de-winter-favoured-role-adaptation-milan-goal",
      "source": "sempremilan.com",
      "date": "2026-02-11T18:55:27+00:00",
      "summary": "Koni De Winter has given a third interview to the media in the past 24 hours, this time speaking to AC Milan’s official channels. It would be fair to say that De Winter is in demand, having already spoken to SportMediaset and Tuttosport over the past day. It is deserved time in the limelight for […]"
    },
    {
      "id": "3c0b8b6c4023",
      "title": "MN - Resultsism or shall we play? Marcolin: \"There is no truth, but it's the thought you propose to the team that makes the difference\"",
      "url": "https://www.milannews.it/news/mn-risultatismo-o-giochiamo-marcolin-non-esiste-una-verita-ma-e-il-pensiero-che-proponi-alla-squadra-che-fa-la-differenza-606992",
      "source": "milannews.it",
      "date": "2026-02-11T18:50:33+00:00",
      "summary": "The former Napoli, Lazio and Sampdoria player, among others, Dario Marcolin, spoke exclusively to MilanNews."
    },
    {
      "id": "a17422dbd8e7",
      "title": "Super League: UEFA-Real Madrid agreement to resolve legal disputes",
      "url": "https://www.milannews.it/news/superlega-accordo-uefa-real-madrid-per-risolvere-le-controversie-legali-607074",
      "source": "milannews.it",
      "date": "2026-02-11T18:40:31+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 11 - UEFA and Real Madrid have reached an agreement \"for the good of European football, a joint note states, which with its full implementation will also lead to resolving the legal disputes relating to ..."
    },
    {
      "id": "2ca90e6239ff",
      "title": "Como, Fabregas: \"Between San Siro and Turin we have 60 hours of rest... We are a young, small team\"",
      "url": "https://www.milannews.it/news/como-fabregas-tra-san-siro-e-torino-abbiamo-60-ore-di-riposo-siamo-una-squadra-giovane-ridotta-607045",
      "source": "milannews.it",
      "date": "2026-02-11T18:30:25+00:00",
      "summary": "Cesc Fabregas, Como coach, said this in a press conference after the victory over Napoli in the Italian Cup: \"We can't deny that it's a little piece of history for Como, I can't deny it."
    },
    {
      "id": "b8aff92d98d7",
      "title": "GdS: Barcelona ‘obstacle’, salary, Milan interest – why Vlahovic is taking time over his future",
      "url": "https://sempremilan.com/barcelona-salary-milan-interest-vlahovic-future",
      "source": "sempremilan.com",
      "date": "2026-02-11T18:14:22+00:00",
      "summary": "Dusan Vlahovic has not yet made a decision regarding his future beyond this season yet, but AC Milan are at the window. Vlahovic’s five years with Juventus have seen him rack up 162 appearances so far, with 64 goals and 16 assists. He has six goals this season – three each in Serie A and […]\nThe pos"
    },
    {
      "id": "f17bb4131b53",
      "title": "MN: Milan fans left angry again after ‘unorganised’ Pisa ticketing situation – the reasons",
      "url": "https://sempremilan.com/milan-fans-angry-pisa-the-reasons",
      "source": "sempremilan.com",
      "date": "2026-02-11T17:47:03+00:00",
      "summary": "There is once again drama concerning AC Milan’s away sector in the build-up to a game, this time Friday’s trip to Pisa. As MilanNews report, Milan fans ‘have suffered yet more deplorable organisational treatment’ regarding the sale of away tickets. For the game at the Arena Garibaldi, there was no p"
    },
    {
      "id": "ac9876ea2425",
      "title": "‘Needs to be addressed’ – Gazzetta journalist confirms Pulisic-Milan contract ‘stalemate’",
      "url": "https://sempremilan.com/gazzetta-pulisic-milan-contract-stalemate",
      "source": "sempremilan.com",
      "date": "2026-02-11T17:00:00+00:00",
      "summary": "Christian Pulisic’s contract with AC Milan officially expires at the end of next season, and the club must work on his renewal. There is no doubting that Pulisic has been probably Milan’s most consistent player since his arrival from Chelsea in 2023. In fact, he has recorded 42 goals and 25 assists "
    },
    {
      "id": "e758f584091a",
      "title": "Camarda answers questions from kids on Milan debut, opponents and possible future at Inter",
      "url": "https://sempremilan.com/camarda-milan-debut-opponents-inter",
      "source": "sempremilan.com",
      "date": "2026-02-11T16:30:00+00:00",
      "summary": "Francesco Camarda did not rule out the idea of joining Inter one day, while he recalled some of his favourite memories from his young career. Last season, Camarda earned the distinction of becoming the youngest debutant in Serie A history, making his first appearance for Milan on 25 November 2023. H"
    },
    {
      "id": "ba5343954769",
      "title": "MN: Fight for minutes and to stay at Milan – Gimenez to face immediate crossroads",
      "url": "https://sempremilan.com/fight-minutes-gimenez-immediate-crossroads-milan",
      "source": "sempremilan.com",
      "date": "2026-02-11T16:00:00+00:00",
      "summary": "AC Milan are waiting for Santiago Gimenez, hoping that he can provide a valuable production in the final part of the season. As MilanNews write, Milan have been waiting for practically a year now for Gimenez to show his worth, ever since his €32m arrival from Feyenoord. The recent period has been es"
    },
    {
      "id": "388489af4709",
      "title": "Romano reveals figures of Jimenez sale to Bournemouth: “Good news for AC Milan’s coffers”",
      "url": "https://sempremilan.com/romano-figures-jimenez-bournemouth-sale",
      "source": "sempremilan.com",
      "date": "2026-02-11T15:30:00+00:00",
      "summary": "Alex Jimenez’s move to AFC Bournemouth has now been made permanent after a series of targets were hit, it has been confirmed. The Spanish full-back left Milan in the summer window despite showing signs of his potential during his stint at the club. He joined Bournemouth on loan with an option to buy"
    },
    {
      "id": "6b7c62dbc4ab",
      "title": "How much Milan and Real Madrid earn from Jimenez’s Bournemouth move as documents signed",
      "url": "https://football-italia.net/milan-real-madrid-earn-jimenez-bournemouth/",
      "source": "football-italia.net",
      "date": "2026-02-11T15:20:29+00:00",
      "summary": "Fabrizio Romano confirms that Milan and Bournemouth have signed the documents for Alex Jimenez’s permanent..."
    },
    {
      "id": "59a750d454c0",
      "title": "‘Top-quality’ striker and Nkunku stay – Journalist reveals predictions for Milan’s attack",
      "url": "https://sempremilan.com/top-striker-nkunku-stay-predictions-attack",
      "source": "sempremilan.com",
      "date": "2026-02-11T15:00:00+00:00",
      "summary": "AC Milan will sign a top-level striker in the summer window, according to La Gazzetta dello Sport journalist Marco Guidi. The ongoing physical problems that Christian Pulisic and Rafael Leao were battling saw Milan agree a deal for Jean-Philippe Mateta with Crystal Palace worth €30-35m. It seemed th"
    },
    {
      "id": "413696c0d798",
      "title": "Sky: Milan’s atmosphere change evident – 70 players and staff enjoy fine-funded dinner",
      "url": "https://sempremilan.com/70-players-staff-milan-fine-funded-dinner",
      "source": "sempremilan.com",
      "date": "2026-02-11T14:30:00+00:00",
      "summary": "In the space of a year, the atmosphere at AC Milan has completely changed, and there are signs of this that continue to emerge. Last season, Milan were in the headlines constantly for the wrong reasons. There was the cooling break incident against Lazio, the penalty mutiny in the defeat to Fiorentin"
    },
    {
      "id": "12df281becc6",
      "title": "Milan handed Pulisic injury boost for Pisa clash",
      "url": "https://football-italia.net/milan-pulisic-injury-boost-for-pisa-clash/",
      "source": "football-italia.net",
      "date": "2026-02-11T14:19:12+00:00",
      "summary": "Milan star Christian Pulisic returned to group training on Wednesday, meaning he’ll probably be available..."
    },
    {
      "id": "3a766bc033ef",
      "title": "Conte mentions Milan in Scudetto assessment but loses cool after Como loss: “Serious problems”",
      "url": "https://sempremilan.com/conte-milan-loses-cool-scudetto-como",
      "source": "sempremilan.com",
      "date": "2026-02-11T14:00:00+00:00",
      "summary": "Antonio Conte was not happy about Napoli being eliminated from the Coppa Italia, and once again spoke about the Scudetto race. Conte’s side experienced another bad night on Tuesday as they were beaten on penalties by Como in the quarter-finals of the Coppa Italia. It means that the club from the lak"
    },
    {
      "id": "5c37982ca415",
      "title": "Tuttosport: Why Allegri is tempted to give Füllkrug a start against Pisa",
      "url": "https://sempremilan.com/why-allegri-tempted-fullkrug-start-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-11T13:35:00+00:00",
      "summary": "Massimiliano Allegri is studying the best attacking duo to field against Pisa, and one temptation in particular is growing. The build-up to Friday’s match in Tuscany against Pisa is in full swing, and Allegri has some tough decisions to make. With Rafael Leão’s recovery appears to be confirmed and C"
    },
    {
      "id": "014667952e7f",
      "title": "MN: Milan given big pre-Pisa boost as Pulisic returns to full training – the latest",
      "url": "https://sempremilan.com/pulisic-returns-to-full-training-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-11T13:10:00+00:00",
      "summary": "AC Milan were back in training again at Milanello two days before the trip to Pisa, and some good news came regarding Christian Pulisic. MilanNews are reporting that Christian Pulisic returned to training with the rest of the squad this morning. The American had been training separately in recent da"
    },
    {
      "id": "920f190ef582",
      "title": "De Winter reveals childhood bond with Milan including father’s plan to name him after Seedorf",
      "url": "https://sempremilan.com/de-winter-childhood-bond-milan-seedorf",
      "source": "sempremilan.com",
      "date": "2026-02-11T12:45:00+00:00",
      "summary": "AC Milan central defender Koni De Winter seems to be doing the media rounds at the moment, and has given another interview this morning. Having signed from Genoa in the summer mercato, De Winter initially had to make do with being the fourth choice centre-back, with Fikayo Tomori, Matteo Gabbia and "
    },
    {
      "id": "c75f61a00269",
      "title": "CorSport: ‘Seduced and abandoned’ – why Paratici could complicate Milan’s striker plan",
      "url": "https://sempremilan.com/why-paratici-complicate-milan-striker-furlani",
      "source": "sempremilan.com",
      "date": "2026-02-11T12:20:00+00:00",
      "summary": "AC Milan are evaluating making a move for Moise Kean in view of the summer, but Fabio Paritici could complicate matters. This morning’s Corriere dello Sport (via MN24) urges caution regarding the names Dusan Vlahovic and Moise Kean, suggesting that Giorgio Furlani and Zlatan Ibrahimovic ‘s strategy "
    },
    {
      "id": "62863c967793",
      "title": "Kaladze compares current Milan with Berlusconi era and praises Allegri’s impact",
      "url": "https://sempremilan.com/kaladze-compares-current-milan-berlusconi-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-11T11:55:00+00:00",
      "summary": "Kakhaber Kaladze has claimed that the current AC Milan cannot be compared to the one he played in, with Silvio Berlusconi at the helm. Kaladze had an illustrious playing career in which he became perhaps Georgia’s most famous export, and now he is serving a third term as the Mayor of Tbilisi. He joi"
    },
    {
      "id": "6cf456b44487",
      "title": "De Winter hopes Milan help him get Belgium 2026 World Cup spot",
      "url": "https://football-italia.net/de-winter-hope-milan-beligum-spot-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-11T11:44:07+00:00",
      "summary": "Milan defender Koni De Winter hopes that his performances with the Rossoneri this season will..."
    },
    {
      "id": "f75655907b10",
      "title": "Sky Germany: Mainz star ‘one to watch’ ahead of summer – Milan and Inter among admirers",
      "url": "https://sempremilan.com/mainz-potulski-milan-inter-como",
      "source": "sempremilan.com",
      "date": "2026-02-11T11:30:00+00:00",
      "summary": "There is a Polish talent playing in the Bundesliga that is catching the eye of some top teams in Italy: Kacper Potulski of Mainz. Milan have always shown a willingness to invest in young talent under the ownership of RedBird Capital and Elliott Management prior. Even in the most recent summer window"
    },
    {
      "id": "94911fedaf36",
      "title": "Malpensa24: Work to be completed on Milan Futuro’s home this year after €2.5m investment",
      "url": "https://sempremilan.com/work-completed-milan-futuro-2-5m-investment",
      "source": "sempremilan.com",
      "date": "2026-02-11T11:05:00+00:00",
      "summary": "As part of the agreement to share the Stadio Felice Chinetti, AC Milan are carrying out some work on the ground which should soon be done. When Milan launched their ‘Milan Futuro’ project ahead of the 2024-25 season, one which began badly with relegation to Serie D, they struck a deal to use the sta"
    },
    {
      "id": "4513c075f64b",
      "title": "Ordine: Tare’s tip-off results in bullet dodged – why Milan pulled the plug on Mateta deal",
      "url": "https://sempremilan.com/tare-tip-off-milan-mateta-pull-plug",
      "source": "sempremilan.com",
      "date": "2026-02-11T10:40:00+00:00",
      "summary": "AC Milan put the brakes on a potential move for Jean-Philippe Mateta thanks in part to the intervention of Igli Tare, it is claimed. Milan’s winter transfer window ended with a dramatic turn of events that saved them from a risky investment worth over €35m. The deal for Mateta – which seemed to be c"
    },
    {
      "id": "8484bf50a4c8",
      "title": "CorSport: A potential €108m ‘treasure’ – Milan plan to reinvest proceeds from buy-outs",
      "url": "https://sempremilan.com/milan-108m-treasure-reinvest-proceeds-buyouts",
      "source": "sempremilan.com",
      "date": "2026-02-11T10:15:00+00:00",
      "summary": "With the winter transfer window now behind us, calculators are already in hand at AC Milan as they plan for the summer. As Corriere dello Sport (via MN24) report this morning, Milan are ‘sitting on a potential goldmine’ generated by the numerous players currently on loan with options or obligations "
    },
    {
      "id": "394a459f8eaf",
      "title": "Mateta mystery deepens, Crystal Palace insist failed Milan transfer ‘does not need surgery’",
      "url": "https://football-italia.net/mateta-mystery-crystal-palacefailed-milan-move/",
      "source": "football-italia.net",
      "date": "2026-02-10T17:19:18+00:00",
      "summary": "Jean-Philippe Mateta failed a medical test with Milan to scupper his €30m transfer from Crystal..."
    },
    {
      "id": "44962c2fbe63",
      "title": "Jimenez feared limited Milan playing time, Nico Paz ‘ready’ for Real Madrid return",
      "url": "https://football-italia.net/jimenez-fear-limited-milan-time-paz-madrid/",
      "source": "football-italia.net",
      "date": "2026-02-10T14:42:00+00:00",
      "summary": "Alex Jimenez feared he’d get limited playing time at Milan, so he joined Bournemouth last..."
    },
    {
      "id": "303da62cf040",
      "title": "Report Pulisic waits for Milan contract offer as Liverpool and Arsenal loom",
      "url": "https://football-italia.net/pulisic-waits-milan-contract-liverpool-arsenal/",
      "source": "football-italia.net",
      "date": "2026-02-10T12:04:47+00:00",
      "summary": "Liverpool and Arsenal are reportedly interested in Milan star Christian Pulisic, who hasn’t yet received..."
    },
    {
      "id": "f688f227c904",
      "title": "Gattuso meets Italy players across the globe ahead of World Cup play-off",
      "url": "https://football-italia.net/gattuso-meets-italy-players-globe-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:54:51+00:00",
      "summary": "Denied a training retreat this month, Italy coach Gennaro Gattuso has taken his World Cup..."
    },
    {
      "id": "e43af22dbbb7",
      "title": "Nkunku: France have three teams to win World Cup, Rabiot ‘a beast’",
      "url": "https://football-italia.net/france-3-teams-win-world-cup-rabiot-beast/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:23:18+00:00",
      "summary": "During his interview with Gazzetta dello Sport, Milan striker Christopher Nkunku praised many of his Rossoneri..."
    },
    {
      "id": "b12a747674d2",
      "title": "Nkunku: ‘Never’ wanted to leave Milan, Ibrahimovic hasn’t changed",
      "url": "https://football-italia.net/nkunku-never-wanted-leave-milan-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:00:31+00:00",
      "summary": "Milan striker Christopher Nkunku insists he didn’t consider leaving the Rossoneri in the January transfer..."
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    }
  ]
}