{
  "lastUpdated": "2026-02-09T22:34:36.864606+00:00",
  "articles": [
    {
      "id": "eeb4cfef9f12",
      "title": "PHOTO - Training at Milanello in view of Pisa-Milan",
      "url": "https://www.milannews.it/news/foto-allenamento-a-milanello-in-vista-di-pisa-milan-606887",
      "source": "milannews.it",
      "date": "2026-02-09T22:24:44+00:00",
      "summary": "There are still a few days left before Milan's match at Pisa on Friday, but as of today the feeling is that Christian Pulisic should be called up by Massimiliano Allegri, while Alexis Saelemaekers should not be fired ..."
    },
    {
      "id": "d965d0cd15e1",
      "title": "Serie A, the updated standings. Roma catches Juventus",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-la-roma-aggancia-la-juventus-606893",
      "source": "milannews.it",
      "date": "2026-02-09T22:11:13+00:00",
      "summary": "This is the updated ranking after Roma-Cagliari 2-0:\n\nSERIES A, THE UPDATED RANKING\n\n1. Inter 58\n2."
    },
    {
      "id": "6f9f676efd00",
      "title": "Serie A, Roma-Cagliari 2-0: Giallorossi victorious thanks to Malen",
      "url": "https://www.milannews.it/l-avversario/serie-a-roma-cagliari-2-0-giallorossi-vittoriosi-nel-segno-di-malen-606892",
      "source": "milannews.it",
      "date": "2026-02-09T22:00:00+00:00",
      "summary": "Roma didn't stumble in the Monday evening positives and won 2-0 against a slightly dull Cagliari. The Giallorossi recovered immediately after the bad defeat in Udine and dominated without problems against the Sardinians coached by Pisacane."
    },
    {
      "id": "71ada13df7ec",
      "title": "MN - Zille: \"What an impact Rabiot has. He's a driving force\"",
      "url": "https://www.milannews.it/news/mn-zille-che-impatto-rabiot-e-un-trascinatore-606861",
      "source": "milannews.it",
      "date": "2026-02-09T21:48:26+00:00",
      "summary": "Federica Zille, DAZN journalist, was interviewed exclusively for MilanNews.it and spoke thus about Adrien Rabiot and Luka Modric: \n\nDid you expect a Rabiot like this?\n\n\"Yes, it's really impactful."
    },
    {
      "id": "bf07e8ed9c8b",
      "title": "Italy, \"National\" dinner in Milan with CT Gattuso. Bartesaghi is also among the Rossoneri",
      "url": "https://www.milannews.it/news/italia-cena-nazionale-a-milano-con-ct-gattuso-tra-i-rossoneri-anche-bartesaghi-606891",
      "source": "milannews.it",
      "date": "2026-02-09T21:35:18+00:00",
      "summary": "In view of the play-offs at the end of March, a crucial point for possible qualification for the World Cup, Rino Gattuso is going through various \"stages\" to form a group and stay close to his players."
    },
    {
      "id": "494aab8e8ae1",
      "title": "Fullkrug: \"Have a good week of training. Thanks for the good wishes\"",
      "url": "https://www.milannews.it/news/fullkrug-buona-settimana-di-allenamenti-grazie-per-gli-auguri-606885",
      "source": "milannews.it",
      "date": "2026-02-09T21:24:13+00:00",
      "summary": "Today Fullkrug turns 33 and the entire Rossoneri world celebrated him: the German arrived just over a month ago but has already conquered everyone with his work ethic, his determination and also the unique characteristics that ..."
    },
    {
      "id": "53bd23ef7fbf",
      "title": "Serie A, the program of the 14th round: Milan hosts Fiorentina",
      "url": "https://www.milannews.it/milan-femminile/serie-a-il-programma-del-14-turno-il-milan-ospita-la-fiorentina-606844",
      "source": "milannews.it",
      "date": "2026-02-09T21:11:20+00:00",
      "summary": "The FIGC website reports the results of the 13th matchday of the Women's Serie A, the standings and the program of the next round: \"Roma narrowly wins the big match against Milan, 3-0 for Inter over Fiorentina and 3-1 against Napo..."
    },
    {
      "id": "2495c6c5f85c",
      "title": "Rampulla on the Scudetto race: \"I believe that Inter and Milan will share the first two places, but Napoli are not out of the fight yet\"",
      "url": "https://www.milannews.it/news/rampulla-sulla-corsa-scudetto-credo-che-inter-e-milan-si-divideranno-i-primi-due-posti-ma-il-napoli-non-e-ancora-fuori-dalla-lotta-606874",
      "source": "milannews.it",
      "date": "2026-02-09T21:00:37+00:00",
      "summary": "Former goalkeeper Michelangelo Rampulla spoke on TMW Radio during the Maracanà and also had his say on the championship race: \n\nNapoli, heartfelt victory against Genoa:\n\"Sure, he can make a streak of results..."
    },
    {
      "id": "9ff1bb48c0d1",
      "title": "Fenucci: \"Bologna will not ask to build a new stadium\"",
      "url": "https://www.milannews.it/news/fenucci-il-bologna-non-chiedera-di-fare-un-nuovo-stadio-606880",
      "source": "milannews.it",
      "date": "2026-02-09T20:48:16+00:00",
      "summary": "(ANSA) - BOLOGNA, 09 FEB - \"Bologna will not ask to build a new stadium or a restyling."
    },
    {
      "id": "afad7d518f30",
      "title": "MN - Zille promotes De Winter: \"He has improved a lot, perhaps he had paid the price of settling into a team like Milan\"",
      "url": "https://www.milannews.it/news/mn-zille-promuove-de-winter-e-migliorato-molto-forse-aveva-pagato-un-po-lo-scotto-dell-ambientamento-in-una-squadra-come-il-milan-606860",
      "source": "milannews.it",
      "date": "2026-02-09T20:37:36+00:00",
      "summary": "Federica Zille, DAZN journalist, was interviewed exclusively for MilanNews."
    },
    {
      "id": "2a79858a6999",
      "title": "Towards Pisa-Milan: ticket sales have also started for the guest sector",
      "url": "https://www.milannews.it/news/verso-pisa-milan-iniziata-la-vendita-dei-biglietti-anche-per-il-settore-ospiti-606878",
      "source": "milannews.it",
      "date": "2026-02-09T20:25:26+00:00",
      "summary": "This is all the information on the sale of tickets for Pisa-Milan on Friday, published by the official website of the Tuscan club:\n\n\"The Pisa Sporting Club communicates the methods of purchasing tickets for the ..."
    },
    {
      "id": "27704564a4ac",
      "title": "The different media treatment reserved for Inter and Milan caused Juventus to cancel a goal",
      "url": "https://www.milannews.it/news/il-diverso-trattamento-mediatico-riservato-ad-inter-e-milan-ha-fatto-annullare-un-gol-alla-juventus-606879",
      "source": "milannews.it",
      "date": "2026-02-09T20:12:08+00:00",
      "summary": "Dimarco's goal in Inter-Cremonese, Leao's goal in Milan-Pisa and Koopmeiners' goal in Juventus-Lazio are very similar to each other: a shot from outside which has in its path a player in a geographical offside position."
    },
    {
      "id": "0ff556a1c91d",
      "title": "Pisa, the Nerazzurri's training program ahead of Milan",
      "url": "https://www.milannews.it/l-avversario/pisa-il-programma-degli-allenamenti-dei-nerazzurri-in-vista-del-milan-606877",
      "source": "milannews.it",
      "date": "2026-02-09T20:02:01+00:00",
      "summary": "The official website of Pisa, Milan's next opponent in the championship (Friday at 8pm."
    },
    {
      "id": "b6f8fecb873b",
      "title": "Alphadjo Cissè insight: Background, strengths, weaknesses and tactical fit",
      "url": "https://sempremilan.com/alphadjo-cisse-insight-scouting-report-milan",
      "source": "sempremilan.com",
      "date": "2026-02-09T19:48:37+00:00",
      "summary": "The winter transfer window ended up being a quiet one for AC Milan after an initial flurry, but one signing might go under the radar: Alphadjo Cissè. The big news concerning the first team in the mid-season mercato was the signing of Niclas Füllkrug from West Ham United on loan with option to buy, o"
    },
    {
      "id": "97d26f33bf5f",
      "title": "Chinetti Stadium, the mayor of Solbiate Arno: \"Milan intervened for around one million euros for a series of adjustments\"",
      "url": "https://www.milannews.it/news/stadio-chinetti-il-sindaco-di-solbiate-arno-il-milan-e-intervenuto-per-circa-un-milione-di-euro-per-una-serie-di-adeguamenti-606868",
      "source": "milannews.it",
      "date": "2026-02-09T19:48:17+00:00",
      "summary": "Oreste Battiston, mayor of Solbiate Arno, announced that the works on the Felice Chinetti Stadium, the facility that hosts AC Milan Futuro's home matches, should be completed by 2026: \"This is the goal we have had ..."
    },
    {
      "id": "45ed31b1399a",
      "title": "Serie A, the updated standings after Atalanta-Cremonese 2-1",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-dopo-atalanta-cremonese-2-1-606884",
      "source": "milannews.it",
      "date": "2026-02-09T19:36:20+00:00",
      "summary": "This is the updated Serie A standings after Atalanta-Cremonese 2-1.\n\nSERIES A, THE UPDATED RANKING\n\n1."
    },
    {
      "id": "296d47c72ed7",
      "title": "Serie A, Atalanta-Cremonese 2-1: the Bergamo team win with a thrill",
      "url": "https://www.milannews.it/news/serie-a-atalanta-cremonese-2-1-i-bergamaschi-vincono-col-brivido-606883",
      "source": "milannews.it",
      "date": "2026-02-09T19:25:40+00:00",
      "summary": "The match between Atalanta and Cremonese ends 2-1. The Dea broke the deadlock immediately at the start of the first half with a great goal from Krstovic, followed by Zappacosta's second in the 25th minute, who scored after an excellent personal move."
    },
    {
      "id": "aa0784a0ca1c",
      "title": "Leao updates on his condition: \"He's doing much better\"",
      "url": "https://www.milannews.it/news/leao-aggiorna-sulle-sue-condizioni-va-molto-meglio-606882",
      "source": "milannews.it",
      "date": "2026-02-09T19:11:36+00:00",
      "summary": "It is no mystery that the last few months have been very difficult from a physical point of view for Rafa Leao: first the delicate calf injury that kept him out for a long time at the beginning of the season, then these continuous problems in the add area ..."
    },
    {
      "id": "3f40e5659650",
      "title": "Ardon Jashari's apprenticeship: a year at Luka Modric's school",
      "url": "https://www.milannews.it/primo-piano/l-apprendistato-di-ardon-jashari-un-anno-a-scuola-di-luka-modric-606852",
      "source": "milannews.it",
      "date": "2026-02-09T19:00:13+00:00",
      "summary": "Given how long the negotiation with Club Brugge lasted and, above all, how much Milan invested to buy him outright (almost 40 million euros with bonuses), expectations on Ardon Jashari were very high."
    },
    {
      "id": "fcecbbed5454",
      "title": "Abodi: \"The Stadium Commissioner does not mean a 'free for all', there are rules that must be respected\"",
      "url": "https://www.milannews.it/news/abodi-il-commissario-stadi-non-significa-un-libera-tutti-ci-sono-delle-norme-che-dovranno-essere-rispettate-606873",
      "source": "milannews.it",
      "date": "2026-02-09T18:47:52+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 09 - \"We are applying a state rule, what we want is for Italian stadiums to be at least in line with European ones but there is little time available."
    },
    {
      "id": "01583805a730",
      "title": "MN - Zille (DAZN) on the Milan market: \"A defender would have been needed, but even just Füllkrug is fine...\"",
      "url": "https://www.milannews.it/news/mn-zille-dazn-sul-mercato-del-milan-sarebbe-servito-un-difensore-ma-anche-solo-fullkrug-va-bene-606798",
      "source": "milannews.it",
      "date": "2026-02-09T18:36:00+00:00",
      "summary": "Federica Zille, a well-known DAZN journalist, spoke exclusively for MilanNews.it."
    },
    {
      "id": "f91d10c378fd",
      "title": "‘A bit grotesque’ – Journalist breaks down timeline of Mateta to Milan saga",
      "url": "https://sempremilan.com/schira-breaks-down-timeline-mateta-milan-saga",
      "source": "sempremilan.com",
      "date": "2026-02-09T18:30:00+00:00",
      "summary": "Journalist Nicolo Schira has provided a detailed breakdown of exactly what happened in the Jean-Philippe Mateta saga. On the penultimate day of the winter window on February 1, multiple reliable sources stated that Milan and Crystal Palace had agreed a deal worth €30-35m for Mateta, the striker that"
    },
    {
      "id": "1d5d3d04dd95",
      "title": "Reports: Saelemaekers set to miss Pisa game after further MRI scan – the situation",
      "url": "https://sempremilan.com/saelemaekers-miss-pisa-mri-scan-situation",
      "source": "sempremilan.com",
      "date": "2026-02-09T18:02:10+00:00",
      "summary": "There were hopes that Alexis Saelemaekers could recover in time to face Pisa on Friday night, but the chances seem to have faded. According to MilanNews, the signs from training at Milanello today are that Christian Pulisic should be called up by Massimiliano Allegri in Pisa. Rafael Leao will be the"
    },
    {
      "id": "be67e20f950c",
      "title": "The odd one out: Estupinan immune to Allegri’s cure as question marks grow",
      "url": "https://sempremilan.com/estupinan-immune-to-allegri-cure-questions",
      "source": "sempremilan.com",
      "date": "2026-02-09T17:38:22+00:00",
      "summary": "Massimiliano Allegri is gradually getting more and more contributions from the summer signings, but there is one outlier. Milan’s squad is not a deep one after the cull that took place ahead of the season, and while some of the new additions – Luka Modric and Adrien Rabiot, above all – hit the groun"
    },
    {
      "id": "4c29e890bc21",
      "title": "TMW: Following Comotto’s path – enquiries arrive with Milan talent ready for next step",
      "url": "https://sempremilan.com/sala-comotto-path-enquiries-serie-b",
      "source": "sempremilan.com",
      "date": "2026-02-09T17:00:00+00:00",
      "summary": "Emanuele Sala is continuing his development with Milan Futuro, and his performances this season have attracted some interest. As TMW report, the 18-year-old – who signed a renewal on his birthday – is making a name for himself with Milan Futuro in Serie D under Massimo Oddo. His excellent performanc"
    },
    {
      "id": "bab1c884a3e7",
      "title": "CM: First-team plans to consecutive exclusions – Milan watching Max Ibrahimovic closely at Ajax",
      "url": "https://sempremilan.com/milan-watching-max-ibrahimovic-closely-ajax",
      "source": "sempremilan.com",
      "date": "2026-02-09T16:30:00+00:00",
      "summary": "AC Milan are keeping an eye on Maximilian Ibrahimovic’s time at Ajax, given that some money rests on the option to buy. As Calciomercato.com recall, Ibrahimovic introduced himself as a new Ajax player on January 14, stating: “I’m an independent player, and I want to write my own story. I feel good. "
    },
    {
      "id": "5451e22bee5a",
      "title": "CM: A familiar feeling – Bennacer sidelined again with €10m move in doubt",
      "url": "https://sempremilan.com/bennacer-sidelined-again-10m-dinamo-doubt",
      "source": "sempremilan.com",
      "date": "2026-02-09T16:00:00+00:00",
      "summary": "Ismael Bennacer has suffered a setback which puts his potential permanent move to Dinamo Zagreb in even more dought. In the summer window, Bennacer returned from Marseille who chose not to use their option to buy, but he didn’t remain for long. He again left Milan to move on loan to Dinamo Zagreb, w"
    },
    {
      "id": "01ca9ebf4d55",
      "title": "Report: Milan’s January signing Cissè suffers untimely blow – prolonged absence expected",
      "url": "https://sempremilan.com/alphadjo-cisse-untimely-blow-prolonged-absence",
      "source": "sempremilan.com",
      "date": "2026-02-09T15:30:00+00:00",
      "summary": "Some bad news has arrived for AC Milan’s January signing Alphadjo Cisse, who could be forced to sit out most of the rest of the season. Milan officially confirmed the signing of Cissè on a permanent deal from Hellas Verona on deadline day for the winter window. As part of the deal, it was also annou"
    },
    {
      "id": "955d1212b6f4",
      "title": "Sky: Leao back, Pulisic better, more tests for Saelemaekers – the latest from Milanello",
      "url": "https://sempremilan.com/leao-pulisic-saelemaekers-tests-latest-milanello",
      "source": "sempremilan.com",
      "date": "2026-02-09T15:00:00+00:00",
      "summary": "The AC Milan squad were once again at Milanello on Monday, as preparations continue for Friday night’s game in Pisa. According to what is being reported by Sky (via MilanNews), Milan had a double session today at Milanello. The team did some work in the gym this morning and training on one of the pi"
    },
    {
      "id": "44a1e116e494",
      "title": "‘A fantastic transfer window’ – Di Marzio explains why Milan’s management deserve praise",
      "url": "https://sempremilan.com/di-marzio-milan-fantastic-window-praise",
      "source": "sempremilan.com",
      "date": "2026-02-09T14:34:09+00:00",
      "summary": "Gianluca Di Marzio believes that AC Milan did fantastic business in the window, largely because they were able to complete Mike Maignan’s renewal. A week has already passed since the winter transfer window closed, and it’s time to take stock of things. Milan acquired a striker for the present in Nic"
    },
    {
      "id": "73c50e6dc84b",
      "title": "MN: Operation 12 from 12 – Milan enter crucial quartet of games with plenty to prove",
      "url": "https://sempremilan.com/milan-crucial-quartet-games-plenty-prove",
      "source": "sempremilan.com",
      "date": "2026-02-09T14:05:49+00:00",
      "summary": "AC Milan play four games between now and the derby against Inter on March 8, and the objective is simple: win them all. As MilanNews writes, Inter have moved eight points clear at the top again after hammering Sassuolo 5-0 on Sunday. Milan have a game in hand, but they cannot concern themselves with"
    },
    {
      "id": "dcf008d9eccd",
      "title": "CorSport: The three factors that will determine if Modric has a ‘final showcase’ with Milan",
      "url": "https://sempremilan.com/three-factors-modric-final-showcase-milan",
      "source": "sempremilan.com",
      "date": "2026-02-09T13:41:54+00:00",
      "summary": "Luka Modric is a pillar of the current AC Milan side, but at present there is uncertainty regarding whether he will remain beyond June. Corriere dello Sport (via MN24) wites this morning that the future of Milan’s midfield passes through what Modric chooses to do. More specifically, Igli Tare’s summ"
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "e2939d39a994",
      "title": "Tuttosport: Milan table €24m net contract to Vlahovic – agent wants double digits",
      "url": "https://sempremilan.com/milan-contract-vlahovic-agent-double-digits",
      "source": "sempremilan.com",
      "date": "2026-02-09T13:10:00+00:00",
      "summary": "AC Milan risk being priced out of the Dusan Vlahovic sweepstakes because of the striker’s salary remands, a report claims. According to the latest from Tuttosport, sporting director Igli Tare has re-established contact with Vlahovic’s agent, Darko Ristic, in order to try and make progress. Although "
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "6ce0d878c795",
      "title": "CorSport: Nkunku plus one – Leao and Füllkrug to fight for spot in Pisa",
      "url": "https://sempremilan.com/nkunku-plus-one-leao-fullkrug-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-09T12:45:00+00:00",
      "summary": "Due to a rather strange scheduling quirk, AC Milan had the weekend off while all of their top four rivals played. On Friday, though, they return to action in Pisa. As Corriere dello Sport (via MilanPress) write this morning, Milan were not in action due to the postponement of the match against Como "
    },
    {
      "id": "2dd78534f8a6",
      "title": "Schira: Milan send scout to watch Fiorentina star ahead of potential swoop – the details",
      "url": "https://sempremilan.com/milan-scout-fiorentina-kean-swoop-details",
      "source": "sempremilan.com",
      "date": "2026-02-09T12:20:00+00:00",
      "summary": "AC Milan had a scout present to watch Moise Kean in action ahead of a potential move in the summer window, it is claimed. With Jean-Philippe Mateta now crossed off the list following the knee issues that his medical revealed on deadline day, Milan are looking ahead to 2026-27 with the intention of s"
    },
    {
      "id": "94af64931b73",
      "title": "Oddo states ‘good football’ matters for Milan Futuro over results: “Not here to win the league”",
      "url": "https://sempremilan.com/oddo-milan-future-not-here-win-league",
      "source": "sempremilan.com",
      "date": "2026-02-09T11:55:00+00:00",
      "summary": "Massimo Oddo has once again stressed that Milan Futuro do not see winning Serie D as their aim, after another tough defeat. There have been times this season when the Futuro have flirted with a push for top spot, though they have almost always been in a play-off position. Early in 2026 though their "
    },
    {
      "id": "791ad6ad5341",
      "title": "Albertini reflects on dazzling Milan career including debut, coaches and best moments",
      "url": "https://sempremilan.com/albertini-milan-debut-coaches-best-moments",
      "source": "sempremilan.com",
      "date": "2026-02-09T11:30:00+00:00",
      "summary": "Demetrio Albertini has opened up about his time with AC Milan, including the prevailing memories and some of the coaches he worked with. Albertini was a hugely influential figure in Milan’s golden era back in the 1990s, when red and black ruled the world. The midfielder was even nicknamed ‘The Metro"
    },
    {
      "id": "ea7be9cb09e2",
      "title": "CorSport: Milan still pursuing Partizan star on Savicevic’s recommendation – the situation",
      "url": "https://sempremilan.com/milan-partizan-kostic-savicevic-recommendation",
      "source": "sempremilan.com",
      "date": "2026-02-09T11:05:00+00:00",
      "summary": "Despite failing to get the deal done in the winter transfer window, AC Milan have no intention of giving up on Andrej Kostic. According to Corriere dello Sport (via MN24) this morning, Milan have continued work to try and get Kostic ahead of the summer. Discussions with Partizan Belgrade have contin"
    },
    {
      "id": "579e2ead7437",
      "title": "Schira: Lazio star gives priority to Milan for summer move – talks continue over €20m deal",
      "url": "https://sempremilan.com/lazio-gila-priority-milan-20m-deal",
      "source": "sempremilan.com",
      "date": "2026-02-09T10:40:00+00:00",
      "summary": "AC Milan are thinking ahead to the summer window, and they have identified their main target for the centre-back department. Milan were linked with various defensive options during the winter mercato that has just closed, from Axel Disasi to Radu Dragusin. In the end, the management decided to keep "
    },
    {
      "id": "28d1d1cab55d",
      "title": "QS: Schedule, Allegri and returns – three reasons Milan should believe in a Scudetto surge",
      "url": "https://sempremilan.com/three-reasons-milan-believe-scudetto-surge",
      "source": "sempremilan.com",
      "date": "2026-02-09T10:15:00+00:00",
      "summary": "First place is now eight points away, but AC Milan still have reasons to believe that they can challenge Inter all the way in the title race. As Quotidiano Sportivo write this morning, the mountain to climb is steep, and the declared primary objective remains a Champions League spot. The temptation "
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    },
    {
      "id": "0bbe5dfeba4c",
      "title": "Milan vs. Como postponed for 2026 Winter Olympics opening ceremony: when will it be played?",
      "url": "https://football-italia.net/milan-vs-como-postponed-2026-olympics-when/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:59:54+00:00",
      "summary": "With the Stadio Meazza in San Siro unavailable for the 2026 Winter Olympics opening ceremony,..."
    },
    {
      "id": "7c148df4d4cd",
      "title": "Glasner opens up on Mateta’s failed Milan medical: ‘It wasn’t a big surprise’",
      "url": "https://football-italia.net/glasner-on-matetas-failed-milan-medical/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:55:13+00:00",
      "summary": "Crystal Palace head coach Oliver Glasner has admitted that ‘it wasn’t a big big surprise’..."
    },
    {
      "id": "c10c6a922ef6",
      "title": "San Siro’s last dance at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/san-siro-last-dance-winter-olympics-ceremony/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:23:58+00:00",
      "summary": "The opening ceremony of the 2026 Milan Cortina Winter Olympics will take place today at..."
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    },
    {
      "id": "b17892f94874",
      "title": "Hazard: ‘I was a Milan fan’, ‘special’ relationship with Sarri, but Mourinho the best",
      "url": "https://football-italia.net/hazard-milan-fan-sarri-special-mourinho-best/",
      "source": "football-italia.net",
      "date": "2026-02-05T10:54:34+00:00",
      "summary": "Former Belgian star Eden Hazard reveals he was a Milan fan as a kid and..."
    },
    {
      "id": "f86a3c2aa1e5",
      "title": "Del Piero: Juventus ‘must’ have title belief, but avoids Yildiz comparison",
      "url": "https://football-italia.net/del-piero-juventus-title-no-yildiz-comparison/",
      "source": "football-italia.net",
      "date": "2026-02-05T09:35:42+00:00",
      "summary": "Juventus legend Alessandro Del Piero feels the Bianconeri can still aim for the Serie A..."
    },
    {
      "id": "a5543b121859",
      "title": "Marotta: ‘Inter approve of rotation, Milan have an advantage for Scudetto’",
      "url": "https://football-italia.net/marotta-inter-approve-rotation-milan-advantage/",
      "source": "football-italia.net",
      "date": "2026-02-04T19:52:47+00:00",
      "summary": "Inter President Beppe Marotta backs the squad rotation for the Coppa Italia quarter-final with Torino..."
    },
    {
      "id": "9de86510452c",
      "title": "Why Inter vs. Torino Coppa Italia clash moved for 2026 Winter Olympics",
      "url": "https://football-italia.net/why-inter-vs-torino-coppa-italia-clash-moved/",
      "source": "football-italia.net",
      "date": "2026-02-04T17:23:22+00:00",
      "summary": "Tonight’s Coppa Italia quarter-final is technically Inter hosting Torino, but the 2026 Winter Olympics mean..."
    }
  ]
}