{
  "lastUpdated": "2026-02-17T07:55:58.304944+00:00",
  "articles": [
    {
      "id": "18cee25c4863",
      "title": "Milan, Leao is better and hopes for a starting shirt against Como",
      "url": "https://www.milannews.it/rassegna-stampa/milan-leao-sta-meglio-e-spera-in-una-maglia-titolare-contro-il-como-607702",
      "source": "milannews.it",
      "date": "2026-02-17T07:50:18+00:00",
      "summary": "Rafael Leao is better and continues to train with the group at Milanello, but he is not yet in top shape due to the pubic discomfort that has been tormenting him for some time now and which certainly affects his performance on the pitch."
    },
    {
      "id": "c19cb8f15881",
      "title": "Scaroni returns to talk about the new Milan and Inter stadium: \"It will be as iconic as the old San Siro\"",
      "url": "https://www.milannews.it/rassegna-stampa/scaroni-torna-a-parlare-del-nuovo-stadio-di-milan-e-inter-sara-iconico-come-il-vecchio-san-siro-607701",
      "source": "milannews.it",
      "date": "2026-02-17T07:40:30+00:00",
      "summary": "Yesterday, Paolo Scaroni, AC Milan president, returned to talk about the new stadium project with Inter, speaking at the presentation of the \"Your Next Milano 2026\" report, edited by Assolombarda and Milano& ..."
    },
    {
      "id": "fd139f734b4d",
      "title": "Gazzetta: \"First the debut in the League, then the return to San Siro: Cardinale aims for the derby\"",
      "url": "https://www.milannews.it/rassegna-stampa/gazzetta-prima-il-debutto-in-lega-poi-il-ritorno-a-san-siro-cardinale-punta-il-derby-607700",
      "source": "milannews.it",
      "date": "2026-02-17T07:30:45+00:00",
      "summary": "\"First the debut in the League, then the return to San Siro: Cardinale aims for the derby\": this is the headline in La Gazzetta dello Sport this morning, which explains that, after having been at Milanello on Sunday to see Allegri and the Rossoneri team, Ger ..."
    },
    {
      "id": "011a15ef8e38",
      "title": "Towards Milan-Como, Tuttosport: \"Max, Cesc again to dream\"",
      "url": "https://www.milannews.it/rassegna-stampa/verso-milan-como-tuttosport-max-di-nuovo-cesc-per-sognare-607699",
      "source": "milannews.it",
      "date": "2026-02-17T07:20:18+00:00",
      "summary": "Tuttosport on newsstands this morning has the following headline in view of Milan-Como tomorrow evening at San Siro: \"Max, Cesc again to dream\"."
    },
    {
      "id": "5620192da6db",
      "title": "Como is tomorrow. Gazzetta: \"Milan won't give up. Fewer games and the derby card: Allegri believes in it\"",
      "url": "https://www.milannews.it/rassegna-stampa/domani-c-e-il-como-gazzetta-il-milan-non-molla-meno-partite-e-la-carta-derby-allegri-ci-crede-607698",
      "source": "milannews.it",
      "date": "2026-02-17T07:10:13+00:00",
      "summary": "Today's edition of the Gazzetta dello Sport on newsstands this morning has the front page headline: \"Milan aren't giving up. Fewer games and the derby card: Allegri believes in it\"."
    },
    {
      "id": "e59c69688421",
      "title": "Milan, Allegri finds Saelemaekers again. Doubts about how to replace Rabiot",
      "url": "https://www.milannews.it/primo-piano/milan-allegri-ritrova-saelemaekers-dubbi-su-come-sostituire-rabiot-607696",
      "source": "milannews.it",
      "date": "2026-02-17T07:00:13+00:00",
      "summary": "If Milan wants to remain in the running for the Scudetto, tomorrow evening they will have to beat Como at all costs in the second half of the 24th matchday of Serie A."
    },
    {
      "id": "53ad7ca88a77",
      "title": "Kirovski explains the reason for the departures of Ibra Jr, Dutu and Sia",
      "url": "https://www.milannews.it/news/kirovski-spiega-il-motivo-delle-partenze-di-ibra-jr-dutu-e-sia-607658",
      "source": "milannews.it",
      "date": "2026-02-17T06:50:28+00:00",
      "summary": "During the Monday episode of Inferno, a program on the schedule of Milan TV, the exclusive interview with Jovan Kirovski, technical director of the Milan Futuro project, his second to ..."
    },
    {
      "id": "d8298868b8d7",
      "title": "Saele recovered, Leao towards ownership, vice-Rabiot duel: the probable Rossoneri",
      "url": "https://www.milannews.it/news/recuperato-saele-leao-verso-la-titolarita-duello-vice-rabiot-la-probabile-rossonera-607663",
      "source": "milannews.it",
      "date": "2026-02-17T06:40:00+00:00",
      "summary": "Yesterday's good news is the recovery of Alexis Saelemaekers for tomorrow night's match against Como: Zachary Athekame has given good guarantees in the last two outings, so the Belgian should still start from the bench for ..."
    },
    {
      "id": "fe23f1459307",
      "title": "New stadium, reread the statements of Paolo Scaroni and Giuseppe Marotta",
      "url": "https://www.milannews.it/news/nuovo-stadio-rileggi-le-dichiarazioni-di-paolo-scaroni-e-giuseppe-marotta-607664",
      "source": "milannews.it",
      "date": "2026-02-17T06:30:00+00:00",
      "summary": "Yesterday afternoon, Paolo Scaroni, president of Milan, and Beppe Marotta, president of Inter, were guests at the Your Next Milano 2026 event at the Triennale di Milano, in recent days Casa Italia on the occasion ..."
    },
    {
      "id": "007f4aa88166",
      "title": "Serie A, the updated rankings: Milan will eliminate the asterisk tomorrow",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-il-milan-domani-elimina-l-asterisco-607661",
      "source": "milannews.it",
      "date": "2026-02-17T06:20:00+00:00",
      "summary": "In the last match of the 25th round of the Enilive Serie A championship, Lecce won and moved back up to +3 over third-last Fiorentina, reaching both Cremonese and Genoa in the standings and putting them back on their feet..."
    },
    {
      "id": "662a28f5f4bb",
      "title": "The 25th round ended with the victory of Lecce: all the results",
      "url": "https://www.milannews.it/news/il-25-turno-e-finito-con-la-vittoria-del-lecce-tutti-i-risultati-607662",
      "source": "milannews.it",
      "date": "2026-02-17T06:10:00+00:00",
      "summary": "The twenty-fifth day of the Enilive Serie A championship has ended. The round came to an end with a 0-2 victory for Lecce on the Cagliari pitch: three golden points in the crowded race for salvation."
    },
    {
      "id": "0608e7e64750",
      "title": "Milan-Como, Max Allegri's press conference today",
      "url": "https://www.milannews.it/news/milan-como-oggi-la-conferenza-stampa-di-max-allegri-607637",
      "source": "milannews.it",
      "date": "2026-02-17T06:00:00+00:00",
      "summary": "Today is the day before Milan-Como, the second half of the 24th matchday of Serie A which will be played on Wednesday at 8.45pm at the San Siro stadium."
    },
    {
      "id": "627fbfbeb7ea",
      "title": "Matri believes in Allegri: \"It's a Milan that is attached to the championship and always keeps an eye on it\"",
      "url": "https://www.milannews.it/news/matri-crede-in-allegri-e-un-milan-attaccato-al-campionato-e-uno-sguardo-su-lo-da-sempre-607668",
      "source": "milannews.it",
      "date": "2026-02-17T00:00:00+00:00",
      "summary": "AC Milan, after returning to the field and winning at Pisa last Friday thanks to a super goal from Luka Modric, returns to the field on Wednesday evening to recover the twenty-fourth matchday of the Serie A Eniliv championship ..."
    },
    {
      "id": "f2b3db2dea8b",
      "title": "Kirovski: \"It's important that our young people play in C or D, with adults: it's real football\"",
      "url": "https://www.milannews.it/news/kirovski-importante-che-i-nostri-giovani-giochino-in-c-o-in-d-con-gli-adulti-e-il-vero-calcio-607655",
      "source": "milannews.it",
      "date": "2026-02-16T23:50:14+00:00",
      "summary": "During the Monday episode of Inferno, a program on the schedule of Milan TV, the exclusive interview with Jovan Kirovski, technical director of the Milan Futuro project, his second to ..."
    },
    {
      "id": "97fead8137c8",
      "title": "Cassano: \"Juve's morality is disgusting. Let's not make Bastoni look like a monster\"",
      "url": "https://www.milannews.it/news/cassano-e-uno-schifo-la-juve-che-fa-la-morale-non-facciamo-passare-bastoni-come-un-mostro-607667",
      "source": "milannews.it",
      "date": "2026-02-16T23:30:12+00:00",
      "summary": "Antonio Cassano, speaking on Viva El Futbol, ​​commented on the case of the weekend, the simulation with exultation by Alessandro Bastoni: \"Even Pavel Nedved who was an icon, threw himself at you against me in a Juventus-Roma match..."
    },
    {
      "id": "6cf2891b7009",
      "title": "Ag. Klopp: \"Requests continue to arrive: at the moment very happy with his role\"",
      "url": "https://www.milannews.it/news/ag-klopp-continuano-ad-arrivare-richieste-al-momento-molto-felice-del-suo-ruolo-607665",
      "source": "milannews.it",
      "date": "2026-02-16T23:20:00+00:00",
      "summary": "Marc Kosice, agent of the German coach Jurgen Klopp, who joined the management of the Red Bull sports branch after his experience in Liverpool, spoke about the coach's future on Transfermarkt."
    },
    {
      "id": "e5009392dd5b",
      "title": "Bastoni case, Giletti: \"The Inter fan should also apologize to Kalulu\"",
      "url": "https://www.milannews.it/news/caso-bastoni-giletti-l-interista-dovrebbe-chiedere-scusa-anche-a-kalulu-607622",
      "source": "milannews.it",
      "date": "2026-02-16T23:10:00+00:00",
      "summary": "Thus spoke the well-known journalist Massimo Giletti, exclusively to the microphones of TMW Radio on the now discussed and serious Bastoni-Kalulu case."
    },
    {
      "id": "f8654e33d5a1",
      "title": "What filters out about Modric's future at Milan. The VAR is useless like this! Give credibility back to Italian football",
      "url": "https://www.milannews.it/editoriale/cosa-filtra-sul-futuro-di-modric-al-milan-il-var-cosi-non-serve-ridate-credibilita-al-calcio-italiano-607641",
      "source": "milannews.it",
      "date": "2026-02-16T23:00:38+00:00",
      "summary": "Watch out Milan, because rumors are coming from Como about how Fabregas is preparing for the match against Milan. It is said that Como intends to \"take revenge\" after the heavy internal defeat a month ago."
    },
    {
      "id": "7f445e2e93ab",
      "title": "Kirovski: \"Our young players must have pressure because at San Siro they will play with pressure\"",
      "url": "https://www.milannews.it/news/kirovski-i-nostri-giovani-devono-avere-pressione-perche-a-san-siro-giocheranno-con-pressione-607656",
      "source": "milannews.it",
      "date": "2026-02-16T22:50:00+00:00",
      "summary": "During the Monday episode of Inferno, a program on the schedule of Milan TV, the exclusive interview with Jovan Kirovski, technical director of the Milan Futuro project, his second to ..."
    },
    {
      "id": "16f3c5ffd5d6",
      "title": "Milan, all the results of the Youth Sector: successes for the men's and women's Primavera",
      "url": "https://www.milannews.it/news/milan-tutti-i-risultati-del-settore-giovanile-successi-per-primavera-maschile-e-femminile-607618",
      "source": "milannews.it",
      "date": "2026-02-16T22:40:00+00:00",
      "summary": "Lots of smiles during the weekend for the Rossoneri Youth Sector, starting with the away victories of the two Primavera teams: the men's team found a precious away success in Genoa against Genoa while the women's team tamed at home..."
    },
    {
      "id": "5c5918868a9e",
      "title": "Replacing Rabiot, defensive doubts and the front two: How Milan should line up vs. Como",
      "url": "https://sempremilan.com/rabiot-saelemaekers-front-two-how-milan-should-line-up-como",
      "source": "sempremilan.com",
      "date": "2026-02-16T19:01:31+00:00",
      "summary": "When AC Milan face Como on Wednesday night, there will be a few questions that need answering, and Massimiliano Allegri is currently left making decisions. Considering the number of issues that Allegri has had to contend with this season, and the season that came before this, Milan sitting in second"
    },
    {
      "id": "16c78b64cb51",
      "title": "Scaroni reveals he is happy with Cardinale’s reception at Serie A meeting: “Well received”",
      "url": "https://sempremilan.com/scaroni-reveals-happy-cardinale-reception-serie-a",
      "source": "sempremilan.com",
      "date": "2026-02-16T18:30:00+00:00",
      "summary": "This afternoon, AC Milan Gerry Cardinale stopped for a visit to join the ongoing Serie A meeting, and Paolo Scaroni discussed his appearance and more.  Despite his role as the owner of Milan, it is rare that the American is seen in Italy. However, given that he is based in America, this is not too ["
    },
    {
      "id": "372cdf331629",
      "title": "Report: London calling – Chukwueze has Premier League suitors as Milan await €30m decision",
      "url": "https://sempremilan.com/chukwueze-multiple-premier-league-suitors",
      "source": "sempremilan.com",
      "date": "2026-02-16T18:00:00+00:00",
      "summary": "AC Milan could guarantee a sale in the summer with Samuel Chukwueze impressing during his current loan spell with Fulham. It never really clicked for Chukwueze in Milan. He arrived with the world seemingly ahead of him, an exciting dynamic winger who was coming off a fantastic season in Spain, ready"
    },
    {
      "id": "825fd52f3ca1",
      "title": "GdS: Cardinale a surprise presence at Lega Serie A meeting – the reasons",
      "url": "https://sempremilan.com/cardinale-surprise-presence-serie-a-meeting",
      "source": "sempremilan.com",
      "date": "2026-02-16T17:30:00+00:00",
      "summary": "Today, a meeting was held involving the Serie A leaders, which is a regularity. Nevertheless, there was a surprise visit from AC Milan’s owner, Gerry Cardinale.  His last visit to Milano only lasted a day, due to his involvement in meetings for the European NBA league. However, after yesterday’s vis"
    },
    {
      "id": "db00bbe4318b",
      "title": "GdS: Why the Maignan handshake was ‘particularly significant’ during Cardinale’s visit",
      "url": "https://sempremilan.com/why-maignan-handshake-significant-cardinale",
      "source": "sempremilan.com",
      "date": "2026-02-16T17:00:00+00:00",
      "summary": "During Gerry Cardinale’s visit, he took the time to specifically greet Mike Maignan, who has recently renewed his deal with AC Milan, but why was this significant? It is big enough in itself that Cardinale was at Milanello twice in the space of under a month. However, his visits have held different "
    },
    {
      "id": "afa5c0223baa",
      "title": "Costacurta mentions Maldini in criticism of Bastoni’s actions during Inter-Juventus",
      "url": "https://sempremilan.com/costacurta-mentions-maldini-criticism-bastoni",
      "source": "sempremilan.com",
      "date": "2026-02-16T16:30:00+00:00",
      "summary": "Billy Costacurta had held Alessandro Bastoni in a high regard before this weekend, but it seems the Inter defender has let the AC Milan legend down… This weekend’s game between Inter and Juventus has certainly brought up a bit of controversy with many seeing former Milan defender Pierre Kalulu’s red"
    },
    {
      "id": "a230b14f0582",
      "title": "Caught Offside: Milan hold talks with Stones but face European heavyweight competition",
      "url": "https://sempremilan.com/milan-hold-talks-stones-face-european-competition",
      "source": "sempremilan.com",
      "date": "2026-02-16T16:00:15+00:00",
      "summary": "This summer, John Stones will be available on a free transfer, and this is piquing the interest of several top European clubs, including AC Milan.  There are a number of opportunities that Milan may look to capitalise on this summer, with a number of ageing elites at the end of their contracts. Of c"
    },
    {
      "id": "1e03e0988363",
      "title": "GdS: Milan fans flock to San Siro a month after Lecce win – Como sell-out expected",
      "url": "https://sempremilan.com/milan-fans-flock-san-siro",
      "source": "sempremilan.com",
      "date": "2026-02-16T15:33:08+00:00",
      "summary": "AC Milan are no strangers to a fantastic home support, but after a month away, they can know that they will be well backed at San Siro once again. The recent calendar has been pretty tough for Milan, and it will not get much easier. Indeed, they have faced three games away from home, with […]\nThe po"
    },
    {
      "id": "e86bd0995318",
      "title": "Longo: Comotto showcasing development at Spezia – Milan’s two options for 2026-27",
      "url": "https://sempremilan.com/comotto-showcasing-development-spezia-milan-options",
      "source": "sempremilan.com",
      "date": "2026-02-16T15:00:00+00:00",
      "summary": "AC Milan are pleased with how Christian Comotto’s loan spell at Spezia is going, but they face a decision to make during the summer. Comotto was part of the senior side during the preseason camp, and he had a couple of impressive outings. He did not stay around under Massimiliano Allegri though, ins"
    },
    {
      "id": "825c7f4cae9c",
      "title": "Inter vs. Juventus refereeing upset Milan too – report",
      "url": "https://football-italia.net/inter-vs-juventus-refereeing-upset-milan-too/",
      "source": "football-italia.net",
      "date": "2026-02-16T14:46:52+00:00",
      "summary": "Corriere dello Sport reports that the officiating in Inter-Juventus did not infuriate the Bianconeri only,..."
    },
    {
      "id": "2199667f778a",
      "title": "Watch: How good Luka Modric has been for AC Milan so far in 2025-26",
      "url": "https://sempremilan.com/how-good-luka-modric-milan-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-16T14:30:00+00:00",
      "summary": "Luka Modric is the man of the moment for AC Milan again after his winner in Pisa, and he continues to play at an elite level even at 40. Modric netted late on in Friday night’s game at the Arena Garibaldi to just about keep Milan’s Scudetto hopes alive. It is his second game-winning goal […]\nThe pos"
    },
    {
      "id": "b1e9821c9c56",
      "title": "Milan failure to Lyon favourite: Emotional Fonseca celebrates 13 straight wins",
      "url": "https://sempremilan.com/milan-failure-lyon-favourite-fonseca-13-wins",
      "source": "sempremilan.com",
      "date": "2026-02-16T14:00:00+00:00",
      "summary": "Things may not have gone well for Paulo Fonseca at AC Milan, but now he is very much a fan favourite at his current club Lyon. Fonseca was hired by Milan to replace Stefano Pioli before the start of the 2024-25 season, but he didn’t even make it into 2025. The Portuguese was sacked after […]\nThe pos"
    },
    {
      "id": "19f4d6b324cb",
      "title": "MN: Key Saelemaekers update arrives ahead of Milan’s home game vs. Como",
      "url": "https://sempremilan.com/key-saelemaekers-update-arrives-milan-como",
      "source": "sempremilan.com",
      "date": "2026-02-16T13:35:00+00:00",
      "summary": "Some good news has come from Milanello a couple of days before AC Milan welcome Como to San Siro. The Milan squad were in training today continuing to prepare for the rescheduled game against Cesc Fabregas’ side, which will take place on Wednesday night. There are some doubts about the team Massimil"
    },
    {
      "id": "4ad81ad1d371",
      "title": "GdS: Division ‘not important’ – why the Milan Futuro project has barely changed since relegation",
      "url": "https://sempremilan.com/why-milan-futuro-project-barely-changed",
      "source": "sempremilan.com",
      "date": "2026-02-16T13:10:00+00:00",
      "summary": "Davide Bartesaghi is a shining example of a Milan Futuro graduate, but now the club want to see more players make the jump. La Gazzetta dello Sport recall how ‘strange’ the two games against Chievo Verona were. On one side were the Futuro, who dropped into Serie D after a failure on the field in […]"
    },
    {
      "id": "4112f5bad99c",
      "title": "Mazzara claims 4-3-3 is ‘the key’ to Milan ‘making the most of their technical potential’",
      "url": "https://sempremilan.com/mazzara-4-3-3-key-milan-most-potential",
      "source": "sempremilan.com",
      "date": "2026-02-16T12:45:00+00:00",
      "summary": "Pietro Mazzara has suggested that Massimiliano Allegri could and should turn to the 4-3-3 more in order to unlock difficult games. Milan made things more difficult than they perhaps should have been on Friday night in Pisa, especially after taking a first-half lead through Ruben Loftus-Cheek. Niclas"
    },
    {
      "id": "959905e70d11",
      "title": "QS: A ‘strong message’ to Milan – stability and centrality behind Cardinale’s visit",
      "url": "https://sempremilan.com/strong-message-cardinale-visit-stability-centrality",
      "source": "sempremilan.com",
      "date": "2026-02-16T12:20:00+00:00",
      "summary": "Gerry Cardinale was once again present at AC Milan’s training ground on Sunday, his second visit in less than one month. As Quotidiano Sportivo recall, Cardinale’s past agenda includes a visit to Milanello in the summer of 2024, an appearance at San Siro in September of that year (his most recent fo"
    },
    {
      "id": "47a89354b790",
      "title": "CaughtOffside: Milan star ‘open’ to Premier League return – Arsenal, Spurs and Man Utd keen",
      "url": "https://sempremilan.com/pulisic-open-manchester-united-arsenal-spurs",
      "source": "sempremilan.com",
      "date": "2026-02-16T11:55:00+00:00",
      "summary": "Speculation about Christian Pulisic’s future at AC Milan continues, with some Premier League clubs keen on landing him. Pulisic is currently under contract until June 2027 at present, but Milan have a one-year option that they can trigger, and they are expected to. However, to resolve his long-term "
    },
    {
      "id": "92ab2443e132",
      "title": "GdS: Leao, Saelemaekers, De Winter and more – Allegri’s doubts ahead of Como game",
      "url": "https://sempremilan.com/leao-saelemaekers-allegri-doubts-como",
      "source": "sempremilan.com",
      "date": "2026-02-16T11:30:00+00:00",
      "summary": "AC Milan are back in action on Wednesday night against Como, and Massimiliano Allegri has some decisions to make. As La Gazzetta dello Sport report, Alexis Saelemaekers also trained separately on Sunday, but will most likely return to full training today. If his left adductor doesn’t cause discomfor"
    },
    {
      "id": "f8fac00794ad",
      "title": "CorSport: Milan aiming to tie English duo down to new deals – the strategy",
      "url": "https://sempremilan.com/milan-tomori-loftus-cheek-new-deals",
      "source": "sempremilan.com",
      "date": "2026-02-16T11:05:00+00:00",
      "summary": "Even though the winter transfer window is now behind us, the AC Milan management are still in negotiations over some deals. It was a rather quiet January for Milan in the end as they signed Niclas Füllkrug from West Ham on loan with option to buy and that was it, with a late deal for […]\nThe post Co"
    },
    {
      "id": "8bf3833fe4c7",
      "title": "Reports: Season over for new Milan signing Alphadjo Cissè with surgery chosen",
      "url": "https://sempremilan.com/season-over-alphadjo-cisse-surgery-chosen",
      "source": "sempremilan.com",
      "date": "2026-02-16T10:40:00+00:00",
      "summary": "There was a lot of excitement about the signing of Alphadjo Cissè, but he is now expected to spend the rest of the season out of action. While the Jean-Philippe Mateta saga dominated the headlines on deadline day a couple of weeks ago, Milan completed the signing of Cissè, the young talent who was d"
    },
    {
      "id": "6d3b9f6092c0",
      "title": "GdS: Ricci the ‘extra man’ for Milan – how he earned Allegri’s full trust",
      "url": "https://sempremilan.com/ricci-extra-man-milan-allegri-trust",
      "source": "sempremilan.com",
      "date": "2026-02-16T10:15:00+00:00",
      "summary": "Samuele Ricci had a big hand in AC Milan’s winning goal against Pisa on Friday, and he has become the ‘extra man’ for Massimiliano Allegri. As La Gazzetta dello Sport write, it was Luka Modric who stole the show after the victory over Pisa. The 40-year-old popped up in the right place at the right ["
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    },
    {
      "id": "9c729c8148a4",
      "title": "Pisa forced to field third-choice goalkeeper in Serie A match against Milan",
      "url": "https://football-italia.net/pisa-forced-3rd-choice-goalkeeper-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T13:04:11+00:00",
      "summary": "Second-choice Pisa goalkeeper Simone Scuffet has been ruled out of tonight’s Serie A match against..."
    },
    {
      "id": "e6e4778300f1",
      "title": "Report Milan call McKennie for possible USMNT reunion with Pulisic",
      "url": "https://football-italia.net/milan-call-mckennie-usmnt-reunion-pulisic/",
      "source": "football-italia.net",
      "date": "2026-02-13T12:43:07+00:00",
      "summary": "Milan have reportedly begun preliminary talks with Weston McKennie’s entourage as the Juventus midfielder is..."
    },
    {
      "id": "bb92885e8dfd",
      "title": "Milan make Modric decision, prepare for new contract extensions after Maignan",
      "url": "https://football-italia.net/milan-modric-decision-more-contracts-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-13T11:04:46+00:00",
      "summary": "According to La Gazzetta dello Sport, Fikayo Tomori is expected to be the next Milan..."
    },
    {
      "id": "c682014167e5",
      "title": "Serie A: Pisa vs. Milan – probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/pisa-vs-milan-probable-line-ups-watch-on-tv/",
      "source": "football-italia.net",
      "date": "2026-02-13T08:53:01+00:00",
      "summary": "Ruben Loftus-Cheek and Christopher Nknuku are expected to lead the Milan attack in an away..."
    },
    {
      "id": "d50cee56a1a2",
      "title": "Capello claims Serie A title race wide open: ‘Inter & Juventus, watch out for Milan & Roma’",
      "url": "https://football-italia.net/capello-claims-serie-a-title-race-wide-open/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:30:19+00:00",
      "summary": "Fabio Capello insists the Serie A title race is far from over, warning that Inter..."
    },
    {
      "id": "ef679b7e17ab",
      "title": "Only one Serie A player included in Europe’s best paid footballers in 2026",
      "url": "https://football-italia.net/one-juventus-player-europe-top-20-best-paid/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:01:54+00:00",
      "summary": "Juventus’s Dusan Vlahovic is currently the only Serie A player to feature in the list..."
    },
    {
      "id": "00edaaaae844",
      "title": "Juventus set price tag for Gatti as Milan, Napoli and Premier League clubs queue up",
      "url": "https://football-italia.net/juventus-set-price-tag-for-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-12T14:21:33+00:00",
      "summary": "Juventus reportedly have a price tag in mind when it comes to a potential sale..."
    }
  ]
}