{
  "lastUpdated": "2026-02-25T16:01:50.733495+00:00",
  "articles": [
    {
      "id": "3f5e6ed3499e",
      "title": "CM: ‘At the centre’ – Jesus hoping for Serie A move after agency change",
      "url": "https://sempremilan.com/jesus-hoping-serie-a-move-agency-change",
      "source": "sempremilan.com",
      "date": "2026-02-25T16:00:00+00:00",
      "summary": "AC Milan will probably sign a striker in the next six months, and Gabriel Jesus’ name continues to appear on the list of options.  Throughout the past few months, it has seemed increasingly likely that Milan would make a move for Jesus. Indeed, the Brazilian striker has lost his position in the Arse"
    },
    {
      "id": "ed53dda0c895",
      "title": "MN - Bazzani: \"Allegri and Tare were important steps to change that mentality which last year was often very superficial\"",
      "url": "https://www.milannews.it/news/mn-bazzani-allegri-e-tare-sono-stati-passi-importanti-per-cambiare-quella-mentalita-che-l-anno-scorso-spesso-era-molto-superficiale-608668",
      "source": "milannews.it",
      "date": "2026-02-25T15:50:07+00:00",
      "summary": "Fabio Bazzani, former striker in Serie A with Sampdoria and Lazio, today a commentator for DAZN, spoke exclusively for the editorial staff of MilanNews.it."
    },
    {
      "id": "95ee432c93c6",
      "title": "Juventus, Kalulu still amazed by the red card with Bastoni. And from what happened next",
      "url": "https://www.milannews.it/news/juventus-kalulu-ancora-stupito-per-il-rosso-con-bastoni-e-da-cio-che-e-successo-dopo-608639",
      "source": "milannews.it",
      "date": "2026-02-25T15:40:29+00:00",
      "summary": "(ANSA) - TURIN, FEBRUARY 25 - \"After the expulsion with Inter I turned off the phone so as not to fuel the controversy: many people spoke but in the end the disqualification remained, better to leave everything behind me\": so the ..."
    },
    {
      "id": "8e280352a8ea",
      "title": "Ramazzotti announces: \"Here's when the derby between Milan and Inter will be played\"",
      "url": "https://www.milannews.it/news/ramazzotti-annuncia-ecco-quando-si-giochera-il-derby-tra-milan-e-inter-608655",
      "source": "milannews.it",
      "date": "2026-02-25T15:30:58+00:00",
      "summary": "Andrea Ramazzotti, journalist, expressed himself as follows in La Gazzetta dello Sport on the next Milan derby, scheduled for the 28th matchday of Serie A between Saturday 7 and Sunday 8 March: \"The Milan derby will be played dome ..."
    },
    {
      "id": "86bb8d9f7eb3",
      "title": "‘He wants to build’ – Pellegatti offers opposing view on Allegri’s Milan future",
      "url": "https://sempremilan.com/pellegatti-opposing-view-allegri-milan-future",
      "source": "sempremilan.com",
      "date": "2026-02-25T15:30:00+00:00",
      "summary": "There has been a suggestion that Massimiliano Allegri could leave AC Milan in the summer, but it seems that it may not be the case. In a world where it can be questioned if Milan have always acted on Allegri’s best interests, it is not a surprise to see suggestions about his future. Ultimately, with"
    },
    {
      "id": "ac9c27301a6b",
      "title": "Atletico Madrid beats Tresoldi's Bruges: 4-1 and access to the Champions League round of 16",
      "url": "https://www.milannews.it/news/l-atletico-madrid-impallina-il-bruges-di-tresoldi-4-1-secco-e-accesso-agli-ottavi-di-champions-608650",
      "source": "milannews.it",
      "date": "2026-02-25T15:20:09+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 24 - Atletico Madrid beat Bruges 4-1 (1-1) in the second leg of the Champions League playoffs, gaining access to the round of 16."
    },
    {
      "id": "8100b1c9e72f",
      "title": "F. Galli: \"I always say that in order to see a certain type of football, someone needs to try to play the match\"",
      "url": "https://www.milannews.it/news/f-galli-io-dico-sempre-che-per-poter-vedere-un-calcio-di-un-certo-tipo-c-e-bisogno-che-qualcuno-provi-a-far-la-partita-608658",
      "source": "milannews.it",
      "date": "2026-02-25T15:10:03+00:00",
      "summary": "Filippo Galli, a former footballer, expressed himself as follows on Radio Rossonera about Milan's championship: “Those behind are running. We have a good margin of advantage over Juventus."
    },
    {
      "id": "42439d733e13",
      "title": "MN EXCLUSIVE - Bazzani: \"Milan, the scudetto is gone, now qualification for the Champions League. Goals from Pulisic and Leao are missing, but Rafa is not to be rejected\"",
      "url": "https://www.milannews.it/esclusive-mn/esclusiva-mn-bazzani-milan-lo-scudetto-e-andato-ora-la-qualificazione-in-champions-stanno-mancando-i-gol-di-pulisic-e-leao-ma-rafa-non-e-da-bocciare-608571",
      "source": "milannews.it",
      "date": "2026-02-25T15:00:00+00:00",
      "summary": "Fabio Bazzani, former striker in Serie A with Sampdoria and Lazio, today a commentator for DAZN, spoke exclusively for the editorial staff of MilanNews.it."
    },
    {
      "id": "874311d4fdee",
      "title": "QS: Milan clinging to their ‘senators’ – Pulisic and others required to step up",
      "url": "https://sempremilan.com/milan-clinging-to-senators-pulisic-step-up",
      "source": "sempremilan.com",
      "date": "2026-02-25T15:00:00+00:00",
      "summary": "If AC Milan are not careful, they could quickly lose sight of the Scudetto and maybe even the Champions League safety.  Throughout this season, Milan have always remained true to the fact that they want to finish in the Champions League places. Whilst the Scudetto has been within reach, the hope has"
    },
    {
      "id": "dbb977430178",
      "title": "Pasotto: \"The use of Füllkrug's arrival on loan is clear proof of how the striker's role is lacking\"",
      "url": "https://www.milannews.it/news/pasotto-il-ricorso-all-arrivo-in-prestito-di-fullkrug-e-una-prova-evidente-di-quanto-il-ruolo-della-punta-sia-lacunoso-608656",
      "source": "milannews.it",
      "date": "2026-02-25T14:50:29+00:00",
      "summary": "Marco Pasotto, journalist, expressed himself as follows in La Gazzetta dello Sport on Milan in the near future: \"Next season, net of the mathematics that has yet to certify it, the Devil will play in Europe and therefore either..."
    },
    {
      "id": "0b961786e190",
      "title": "Lazio, Sarri hopes for Gila's recovery. In twenty days there is the match against Milan",
      "url": "https://www.milannews.it/news/lazio-sarri-spera-nel-recupero-di-gila-tra-venti-giorni-c-e-la-sfida-al-milan-608651",
      "source": "milannews.it",
      "date": "2026-02-25T14:40:44+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 24 - Lazio, fresh from the draw in Cagliari, resumes preparations for Turin."
    },
    {
      "id": "e6488519f84b",
      "title": "Inter, Barella: \"This can happen when they give you a penalty in the 90th minute in the group stage, you lose a point and end up in the playoffs\"",
      "url": "https://www.milannews.it/news/inter-barella-questo-puo-capitare-quando-ti-danno-contro-un-rigore-al-90-nella-fase-a-gironi-perdi-un-punto-e-finisci-ai-playoff-608648",
      "source": "milannews.it",
      "date": "2026-02-25T14:30:28+00:00",
      "summary": "(ANSA) - MILAN, FEBRUARY 24 - \"They didn't put us in difficulty and we conceded a goal following an individual error. These things are part of football, today Akanji made a mistake but other times it happened to me."
    },
    {
      "id": "f81cb3ce15a8",
      "title": "MN: Furlani returns to Milanello with message for the Milan squad after Parma defeat",
      "url": "https://sempremilan.com/furlani-milanello-message-milan-squad",
      "source": "sempremilan.com",
      "date": "2026-02-25T14:30:00+00:00",
      "summary": "Ahead of Sunday’s game against Cremonese, AC Milan have returned to training today, and one visitor in particular has been noticed. After the disappointment at the weekend, Milan have had a few days off to recuperate, and they will now begin to prepare for the next game on the fixture list, which se"
    },
    {
      "id": "8ef3142b8104",
      "title": "Referee revolution: FIGC president Gravina's plan is underway",
      "url": "https://www.milannews.it/news/rivoluzione-arbitrale-al-via-il-piano-del-presidente-della-figc-gravina-608682",
      "source": "milannews.it",
      "date": "2026-02-25T14:20:26+00:00",
      "summary": "As reported in today's edition of La Gazzetta dello Sport, work begins today to create a class of real professionals, as studied by the president of the FIGC Gabriele Gravina."
    },
    {
      "id": "6f319df54a7a",
      "title": "Pietrella: \"That goal in the preliminary round convinced Maldini to harpoon his talent with a blitz. “Hi, I'm Paolo, are you coming to us?” And Hauge signed\"",
      "url": "https://www.milannews.it/calciomercato-milan/pietrella-quel-gol-nel-preliminare-convinse-maldini-ad-arpionarne-il-talento-con-un-blitz-ciao-sono-paolo-vieni-da-noi-e-hauge-firmo-608653",
      "source": "milannews.it",
      "date": "2026-02-25T14:11:42+00:00",
      "summary": "Francesco Pietrella, journalist, expressed himself in La Gazzetta dello Sport about Jens Pettere Hauge: \"San Siro turned his life upside down and directed his path."
    },
    {
      "id": "5866e06b44aa",
      "title": "The coach for the post-Baroni period was presented by Torino: it is Roberto D'Aversa",
      "url": "https://www.milannews.it/news/presentato-dal-torino-l-allenatore-per-il-dopo-baroni-e-roberto-d-aversa-608646",
      "source": "milannews.it",
      "date": "2026-02-25T14:00:19+00:00",
      "summary": "(ANSA) - TURIN, FEBRUARY 25 - \"The Grande Torino, Superga, the Mole, the Alps, the Po, the Granata. The history of football and of Italy."
    },
    {
      "id": "733de664b516",
      "title": "Capello identifies Milan’s ‘obvious flaws’ with Leao judgement: “Simply not a centre-forward”",
      "url": "https://sempremilan.com/capello-milan-two-obvious-flaws-leao",
      "source": "sempremilan.com",
      "date": "2026-02-25T14:00:00+00:00",
      "summary": "Fabio Capello has revealed his belief that Rafael Leao cannot operate as a striker for AC Milan, who need a reinforcement in that area. Leao is not having a bad season by any means, given that he is the joint-top scorer in the league for Milan with eight goals, matching the tally that he racked […]\n"
    },
    {
      "id": "190effacf716",
      "title": "Gozzini: \"Jashari is the new player ready to take the stage: to facilitate his entry onto the pitch, a Golden Ball was even inconvenienced\"",
      "url": "https://www.milannews.it/news/gozzini-jashari-e-la-novita-pronta-a-prendersi-la-scena-per-agevolarne-l-ingresso-in-campo-si-e-scomodato-addirittura-un-pallone-d-oro-608652",
      "source": "milannews.it",
      "date": "2026-02-25T13:51:02+00:00",
      "summary": "Alessandra Gozzini, journalist, expressed herself as follows in La Gazzetta dello Sport on Ardon Jashari, Milan midfielder: \"In the last two Rossoneri matches Ardon Jashari has played almost as much as in the rest of the team ..."
    },
    {
      "id": "ead944222c54",
      "title": "The graduation prize named after the journalist Mario Sconcerti was awarded",
      "url": "https://www.milannews.it/news/assegnato-il-premio-di-laurea-intitolato-al-giornalista-mario-sconcerti-608645",
      "source": "milannews.it",
      "date": "2026-02-25T13:41:35+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 25 - The graduation prize named after Mario Sconcerti has been awarded, strongly desired by the Football Museum Foundation \"to honor one of the greatest sports journalists of the post-war period\", as underlined ..."
    },
    {
      "id": "bee33393f11d",
      "title": "‘Lowest point in the relationship’ – Criscitiello voices concerns regarding Allegri’s Milan future",
      "url": "https://sempremilan.com/criscitiello-concerns-allegri-milan-future",
      "source": "sempremilan.com",
      "date": "2026-02-25T13:35:00+00:00",
      "summary": "Sportitalia director Michele Criscitiello has criticised AC Milan’s management for the squad they built, and revealed Massimiliano Allegri isn’t happy either. From the outside looking in, it would appear that Milan are having a much better season given that they finished eighth in 2024-25 in what wa"
    },
    {
      "id": "2dbdd3736744",
      "title": "Pastor in disbelief: \"Piccinini says 'For me it's a foul', why does VAR intervene?\"",
      "url": "https://www.milannews.it/news/pastore-incredulo-piccinini-dice-per-me-e-fallo-perche-interviene-il-var-608601",
      "source": "milannews.it",
      "date": "2026-02-25T13:30:23+00:00",
      "summary": "During the last episode of Fontana di Trevi, Cronache di Spogliatoio format, Giuseppe Pastore spoke thus about the episode of the Parma goal and the on-field review:\n\n\"In the ideal football that I like, which involves a year ..."
    },
    {
      "id": "167545c0919c",
      "title": "The Prestianni-Vinicius controversy makes tonight's match between Real and Benfica even more tense",
      "url": "https://www.milannews.it/news/la-polemica-prestianni-vinicius-rende-ancor-piu-teso-l-appuntamento-di-stasera-tra-real-e-benfica-608644",
      "source": "milannews.it",
      "date": "2026-02-25T13:20:43+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 25 - Real Madrid will not be able to field Kylian Mbappé tonight in the return match of the Champions League playoffs against Benfica, defeated 1-0 in the first leg in Lisbon."
    },
    {
      "id": "4c863d72a46b",
      "title": "Capello: \"Milan needs a top-level defender and a starting centre-forward\"",
      "url": "https://www.milannews.it/news/capello-al-milan-serve-un-difensore-di-grande-livello-e-un-centravanti-titolare-608633",
      "source": "milannews.it",
      "date": "2026-02-25T13:10:41+00:00",
      "summary": "Fabio Capello, former Rossoneri coach, gave a long interview to the Gazzetta dello Sport in which he also spoke about Max Allegri's Milan: \"Milan favorites for the Champions League race? True, but they often get distracted against the small teams ..."
    },
    {
      "id": "321f2e250317",
      "title": "Tuttosport: Gimenez’s injury ordeal almost over – why specialist check-up will be key",
      "url": "https://sempremilan.com/gimenez-ordeal-almost-over-specialist-check",
      "source": "sempremilan.com",
      "date": "2026-02-25T13:10:00+00:00",
      "summary": "Santiago Gimenez has had a difficult 2025-26 season for various reasons, but he will almost certainly get the chance to end it in a positive way. As Tuttosport (via MN24) recall this morning, Gimenez has been sidelined for several months due to a serious ankle injury that required surgery in mid-Dec"
    },
    {
      "id": "8e60aa6d66e1",
      "title": "Jens Petter Hauge: from arriving at Milan as an unknown to the double against Inter in the Champions League",
      "url": "https://www.milannews.it/primo-piano/jens-petter-hauge-dall-arrivo-al-milan-da-sconosciuto-alla-doppietta-contro-l-inter-in-champions-league-608667",
      "source": "milannews.it",
      "date": "2026-02-25T13:00:00+00:00",
      "summary": "On 1 October 2020, Milan made official the purchase of a young Norwegian striker from Bodo/Glimt for 4 million euros: Jeans Petter Hauge."
    },
    {
      "id": "03887330fc05",
      "title": "Order: \"In the last 5 years I see Lazio and Milan having over 20 expulsions, while Inter have had 5\"",
      "url": "https://www.milannews.it/news/ordine-negli-ultimi-5-anni-vedo-lazio-e-milan-che-hanno-oltre-20-espulsioni-mentre-c-e-l-inter-che-ne-ha-avute-5-608662",
      "source": "milannews.it",
      "date": "2026-02-25T12:50:17+00:00",
      "summary": "Franco Ordine, journalist, expressed himself to TeleVomero on the refereeing errors in Serie A: \"I don't agree with just one thing about the scorecard, in this championship there have been many errors, repeated and which have had the..."
    },
    {
      "id": "d9f9e59b192f",
      "title": "GdS: Another dream night six years on – Hauge bewitches San Siro again in ‘derby’",
      "url": "https://sempremilan.com/hauge-bewitches-san-siro-dream-derby",
      "source": "sempremilan.com",
      "date": "2026-02-25T12:45:00+00:00",
      "summary": "San Siro is a stadium that Jens Petter Hauge will always remember fondly, for what it has brought him in his career so far. As La Gazzetta dello Sport write, it is the stadium that turned his life upside down and shaped his path. Last night, just like six years ago when the blond Bodo/Glimt […]\nThe "
    },
    {
      "id": "c5516d81f068",
      "title": "Adidas and Kings League extend their partnership until June 2028",
      "url": "https://www.milannews.it/news/adidas-e-kings-league-estendono-la-loro-partnership-fino-a-giugno-2028-608637",
      "source": "milannews.it",
      "date": "2026-02-25T12:40:59+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 24 - Adidas and Kings League extend their global commercial partnership, confirming the sports brand as Official Technical Partner of the league until June 2028."
    },
    {
      "id": "4028bd0bc135",
      "title": "CM: Searching for the right duo – what the numbers show about Milan’s attacking pairs",
      "url": "https://sempremilan.com/what-numbers-show-milan-attacking-pairs",
      "source": "sempremilan.com",
      "date": "2026-02-25T12:20:00+00:00",
      "summary": "AC Milan once again have a problem getting regular goals from their attacking department, with Massimiliano Allegri searching for the right duo. As Calciomercato.com write, Milan’s attack is one worth of a top four spot but not the league title. In 26 games, they have scored 41 goals, the same as Co"
    },
    {
      "id": "c59ff645f864",
      "title": "CorSport: Lazio resigned to losing star defender – Milan and Inter at the window",
      "url": "https://sempremilan.com/lazio-resigned-gila-milan-inter-window",
      "source": "sempremilan.com",
      "date": "2026-02-25T11:55:00+00:00",
      "summary": "Lazio are braced for the exit of central defender Mario Gila as early as the summer window, with both Milan clubs keen. It is well known that Milan are in the market for another options for the centre-back department, especially with the presumed return to playing in European competitions from next "
    },
    {
      "id": "9976a496ef8e",
      "title": "GdS: 30 months, many issue – Loftus-Cheek’s constant battle with injuries at Milan",
      "url": "https://sempremilan.com/loftus-cheek-constant-battle-injuries-milan",
      "source": "sempremilan.com",
      "date": "2026-02-25T11:30:00+00:00",
      "summary": "Ruben Loftus-Cheek has suffered yet another injury setback, which has been the running theme of his troubled time at AC Milan. La Gazzetta dello Sport confirm that Milan will be without Loftus-Cheek for approximately two months. On Monday morning, the Englishman underwent surgery at Milan’s San Paol"
    },
    {
      "id": "e4f860ec8001",
      "title": "Tuttosport: Milan hunting for the right No.9 – the names in the mix from Kean to Nunez",
      "url": "https://sempremilan.com/milan-right-no9-names-kean-nunez",
      "source": "sempremilan.com",
      "date": "2026-02-25T11:05:00+00:00",
      "summary": "AC Milan will have to fix some gaps in the squad during the summer window, and the biggest is the centre-forward role. As Tuttosport (via MilanNews) report this morning, Milan need a true No.9 for next season and this will be the management’s main mission in the summer. It’s no secret that in Januar"
    },
    {
      "id": "4607c4ec9334",
      "title": "Report Allegri considering his future at Milan",
      "url": "https://football-italia.net/allegri-consider-future-milan-report/",
      "source": "football-italia.net",
      "date": "2026-02-25T10:56:20+00:00",
      "summary": "According to Sportitalia, Milan coach Massimiliano Allegri is considering his future at the club beyond..."
    },
    {
      "id": "79b51922cfe1",
      "title": "‘Watch out Max’ – Capello explains why Milan must be ‘wary of those behind them’",
      "url": "https://sempremilan.com/capello-max-milan-wary-those-behind",
      "source": "sempremilan.com",
      "date": "2026-02-25T10:40:00+00:00",
      "summary": "Fabio Capello believes a top four spot is not locked up for AC Milan, who could pay for the energy they spent chasing Inter. Milan’s unbeaten run came to an end at San Siro on Sunday night as they were beaten 1-0 by Parma, which likely ends any faint title hopes too. It means that […]\nThe post ‘Watc"
    },
    {
      "id": "d4a31e229684",
      "title": "Hauge reveals added ‘pressure’ after knocking out Inter: “The Milan fans are really passionate”",
      "url": "https://sempremilan.com/hauge-added-pressure-milan-inter-passionate",
      "source": "sempremilan.com",
      "date": "2026-02-25T10:15:00+00:00",
      "summary": "Jens Petter Hauge has admitted he felt the pressure from AC Milan fans to do the business for Bodo/Glimt against Inter last night. Bodo/Glimt stunned San Siro on Tuesday night as they build on a 3-1 lead against Inter from the first leg to win 2-1 on the night and 5-2 on aggregate, knocking last […]"
    },
    {
      "id": "b4c6444f7abc",
      "title": "CorSport: Füllkrug has ‘impressed’ Allegri but Milan future unclear – the factors at play",
      "url": "https://sempremilan.com/fullkrug-impressed-allegri-milan-future-unclear",
      "source": "sempremilan.com",
      "date": "2026-02-25T09:50:00+00:00",
      "summary": "Niclas Füllkrug was AC Milan’s only signing of the winter transfer window, and so far he has not really had the desired impact. As Corriere dello Sport (via MilanNews) write this morning, Milan are going through difficult times. The last week has seen the Rossoneri fall 10 points behind Inter, and n"
    },
    {
      "id": "970315eee723",
      "title": "GdS: The ‘double playmaker’ idea is born – how Allegri will build around Jashari and Modric",
      "url": "https://sempremilan.com/how-allegri-build-around-jashari-modic",
      "source": "sempremilan.com",
      "date": "2026-02-25T09:25:00+00:00",
      "summary": "Massimiliano Allegri wants to change the way that his AC Milan side play, and his latest idea concerns the midfield configuration. As La Gazzetta dello Sport (seen below) write this morning, Ardon Jashari has played almost as much as he has in the rest of the season during the last two games. He pla"
    },
    {
      "id": "7e9e7a58aa62",
      "title": "Official: AC Milan unveil new PUMA x Slam Jam fourth kits – ‘Benvenuti all’Inferno’",
      "url": "https://sempremilan.com/official-ac-milan-slam-jam-puma-fourth-kits",
      "source": "sempremilan.com",
      "date": "2026-02-25T09:00:00+00:00",
      "summary": "AC Milan have officially unveiled their 2025-26 fourth kits, which are in collaboration with PUMA and fashion brand Slam Jam. The shirts were actually worn for the first time on Sunday during Milan’s 1-0 defeat at home to Parma at San Siro. The design had been teased for many weeks, but when the tea"
    },
    {
      "id": "c09bbcf4c99d",
      "title": "GdS: Why there are still doubts about Milan-Inter derby will be played",
      "url": "https://sempremilan.com/why-doubts-milan-inter-derby-played",
      "source": "sempremilan.com",
      "date": "2026-02-24T20:11:45+00:00",
      "summary": "The Milan derby is one of those occasions that almost every Italian football fan stops to watch, but there are doubts about when it will be played. According to La Gazzetta dello Sport, the Derby della Madonnina is scheduled to be played on Sunday, March 8th at 20:45 CEST. The match is one of the […"
    },
    {
      "id": "ba735388b4ef",
      "title": "Video exposes the 10 refereeing errors that have gone against AC Milan this season",
      "url": "https://sempremilan.com/10-refereeing-errors-against-milan-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-24T19:00:00+00:00",
      "summary": "A video that has gone viral on social media has explained the 10 major errors that AC Milan have been on the wrong end of this season. After the Como draw, Milan left San Siro bitter about Van der Brempt’s nasty foul on Pavlovic and the failure to send off Cesc Fabregas for holding Alexis […]\nThe po"
    },
    {
      "id": "37828f3229f1",
      "title": "Sky: Nkunku in line to return vs. Cremonese as Leao battles inflammation again",
      "url": "https://sempremilan.com/nkunku-return-cremonese-leao-inflammation",
      "source": "sempremilan.com",
      "date": "2026-02-24T18:36:36+00:00",
      "summary": "AC Milan resumed training at Milanello on Tuesday, beginning preparations for Sunday’s match against Cremonese. The defeat against Parma on Sunday has pretty much put an end to the Scudetto pursuit, barring a miraculous run of form that would also have to coincide with Inter having a drop-off that t"
    },
    {
      "id": "7367715a2cf2",
      "title": "Former Serie A referee plays down controversial decisions in Milan defeat to Parma",
      "url": "https://football-italia.net/tommasi-milan-parma-open-var/",
      "source": "football-italia.net",
      "date": "2026-02-24T16:51:37+00:00",
      "summary": "Parma’s late 1-0 victory against Milan at San Siro has continued to generate significant debate..."
    },
    {
      "id": "af0191216a1b",
      "title": "Today’s Papers: Champions League, Inter-Bodo/Glimt, McKennie renewal",
      "url": "https://football-italia.net/todays-papers-champions-league-inter-bodo/",
      "source": "football-italia.net",
      "date": "2026-02-24T08:41:35+00:00",
      "summary": "La Gazzetta dello Sport  In with the goals  Champions League: Inter looking for the comeback..."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "7d1eaf8982a2",
      "title": "Serie A | Milan 0-1 Parma – Player Ratings as Troilo and Corvi batten down the hatches",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-player-ratings/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:09:16+00:00",
      "summary": "Milan fell to a late 1-0 defeat to Parma this evening, after they were unable..."
    },
    {
      "id": "0338d8d0b0d7",
      "title": "Serie A | Milan 0-1 Parma: Rossoneri suffer shocking first defeat in 24 rounds",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-shocking-defeat-24/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:05:53+00:00",
      "summary": "Milan paid the price for insipid finishing and sluggish defending, as Parma inflicted their first..."
    },
    {
      "id": "ad92e7503a8c",
      "title": "Ex-West Ham & Villa man Reo-Coker: ‘Fabregas pull on Saelemaekers inexcusable’",
      "url": "https://football-italia.net/ex-west-ham-villa-man-reo-coker-fabregas/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:50:32+00:00",
      "summary": "Former West Ham and Aston Villa midfielder turned CBS Sports Golazo pundit Nigel Reo-Coker has..."
    }
  ]
}