{
  "lastUpdated": "2026-02-10T16:09:10.602404+00:00",
  "articles": [
    {
      "id": "5bb6bdad20e0",
      "title": "Bartesaghi at dinner with Gattuso. And Gym? For Pisacane the evaluation is only by the coach",
      "url": "https://www.milannews.it/news/bartesaghi-a-cena-con-gattuso-e-palestra-per-pisacane-la-valutazione-e-solo-del-ct-606901",
      "source": "milannews.it",
      "date": "2026-02-10T16:00:20+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 09 - \"When you lose it is clear that there is always something you can do better."
    },
    {
      "id": "1c054929d8e3",
      "title": "Photo: Club Brugge star fuels Milan links with Leao celebration – the situation",
      "url": "https://sempremilan.com/club-brugge-star-fuels-milan-links-leao-celebration",
      "source": "sempremilan.com",
      "date": "2026-02-10T16:00:00+00:00",
      "summary": "Nicolo Tresoldi has made it clear that AC Milan is his dream destination in his career, and with it being likely that a striker will be signed in the summer, he is putting himself in the window. The links between Milan and Tresoldi are not new, and there have been a few reports in the […]\nThe post P"
    },
    {
      "id": "8d004058faf6",
      "title": "Parolo's Milan U16 continues to fly: 0-2 in Monza and first place ahead of Inter confirmed",
      "url": "https://www.milannews.it/settore-giovanile/continua-a-volare-il-milan-u16-di-parolo-0-2-a-monza-e-primo-posto-davanti-all-inter-confermato-606908",
      "source": "milannews.it",
      "date": "2026-02-10T15:48:48+00:00",
      "summary": "On the 16th day of the championship, Milan's U16s beat their cousins ​​Monza 0-2 thanks to goals in the 13th minute by Marasco and in the 41st minute by Esposti."
    },
    {
      "id": "3f30458d3753",
      "title": "Trevisani: \"'He won' is a judgment that doesn't mean a thing: Allegri coached Juve who were 20 points stronger than second place. I see the matches\"",
      "url": "https://www.milannews.it/news/trevisani-ha-vinto-e-un-giudizio-che-non-conta-una-mazza-allegri-ha-allenato-la-juve-che-era-20-punti-piu-forte-della-seconda-io-vedo-le-partite-606926",
      "source": "milannews.it",
      "date": "2026-02-10T15:36:06+00:00",
      "summary": "Riccardo Trevisani, journalist, expressed himself as follows to Centrocampo Podcast on Massimiliano Allegri: “If Allegri wins the scudetto this year, we bow and shake his hand."
    },
    {
      "id": "8f3c25c14672",
      "title": "TMW: Arsenal and Liverpool circle as Pulisic waits for Milan’s move – the situation",
      "url": "https://sempremilan.com/arsenal-liverpool-circle-pulisic-wait-milan-move",
      "source": "sempremilan.com",
      "date": "2026-02-10T15:30:00+00:00",
      "summary": "Christian Pulisic’s situation with AC Milan should be pretty safe, but it appears that there is a chance that things could go south. In the past few months, it has seemed increasingly likely that Pulisic will renew with Milan. He is happy at the club, and more than anything, an agreement has been fo"
    },
    {
      "id": "41d9f1a96df1",
      "title": "Casa Milan hosts the match between the Olympic champions and the young Rossoneri",
      "url": "https://www.milannews.it/casa-milan/casa-milan-ospita-l-incontro-tra-i-campioni-olimpici-e-i-giovani-rossoneri-606979",
      "source": "milannews.it",
      "date": "2026-02-10T15:24:53+00:00",
      "summary": "Evan Lysacek, Olympic gold medalist and Ezra Frech, Paralympic gold medalist talk about themselves in the context of the Milan-Cortina 2026 Winter Olympics\n \nAC Milan, on the occasion of the Milan-Cortina 2026 Winter Olympic Games currently underway, hosted the ..."
    },
    {
      "id": "24179837254c",
      "title": "MN - Ibrahimovic and Tare were also present at Milanello today",
      "url": "https://www.milannews.it/da-milanello/mn-presenti-oggi-a-milanello-anche-ibrahimovic-e-tare-606978",
      "source": "milannews.it",
      "date": "2026-02-10T15:12:00+00:00",
      "summary": "Work continued today at Milanello in view of the match scheduled for Friday evening at the Cetilar Arena against Oscar Hiljemark's Pisa."
    },
    {
      "id": "e4510a77c57a",
      "title": "MN EXCLUSIVE - Russo (DAZN): \"Milan against all odds. Rabiot is the essential thing for this team\"",
      "url": "https://www.milannews.it/primo-piano/esclusiva-mn-russo-dazn-milan-contro-ogni-pronostico-rabiot-e-l-imprescindibile-di-questa-squadra-606890",
      "source": "milannews.it",
      "date": "2026-02-10T15:00:00+00:00",
      "summary": "DAZN colleague Marco Russo spoke exclusively to MilanNews.it to talk about Milan, between playfulness and results, luck and skill and much more."
    },
    {
      "id": "b7ff6d803946",
      "title": "SempreMilan Podcast: Episode 400 – A Trip To The Tower",
      "url": "https://sempremilan.com/sempremilan-podcast-episode-400-a-trip-to-the-tower",
      "source": "sempremilan.com",
      "date": "2026-02-10T15:00:00+00:00",
      "summary": "Join Oli, Anthony and BdairBall for a landmark episode as they preview the trip to Pisa, look at the Serie A landscape and answer some questions. This week’s topics include… ↳ Pisa (A) preview ↳ Inter-Juve + Napoli-Roma = big opportunity ↳ Which striker do Milan need? ↳ Kiss, marry, avoid and other "
    },
    {
      "id": "3d32cf844ddf",
      "title": "Nkunku: \"If I try Modric's outside throws, my hip will move. He can play until he's 46\"",
      "url": "https://www.milannews.it/news/nkunku-se-provo-io-i-lanci-di-esterno-di-modric-mi-si-sposta-l-anca-puo-giocare-fino-a-46-anni-606960",
      "source": "milannews.it",
      "date": "2026-02-10T14:48:00+00:00",
      "summary": "The month of January was the turning point for Christopher Nkunku who saw several sliding doors close and others open suddenly."
    },
    {
      "id": "44962c2fbe63",
      "title": "Jimenez feared limited Milan playing time, Nico Paz ‘ready’ for Real Madrid return",
      "url": "https://football-italia.net/jimenez-fear-limited-milan-time-paz-madrid/",
      "source": "football-italia.net",
      "date": "2026-02-10T14:42:00+00:00",
      "summary": "Alex Jimenez feared he’d get limited playing time at Milan, so he joined Bournemouth last..."
    },
    {
      "id": "4ea555ba719e",
      "title": "Great performance from the AC Milan women's youth team: tennis result in Cesena",
      "url": "https://www.milannews.it/milan-femminile/gran-prova-della-primavera-femminile-del-milan-risultato-tennistico-a-cesena-606907",
      "source": "milannews.it",
      "date": "2026-02-10T14:37:10+00:00",
      "summary": "On the 14th day of the Women's Serie A Primavera Championship, the young Rossoneri beat Cesena 1-6 away."
    },
    {
      "id": "d61aa9593659",
      "title": "‘The biggest club in Italy’ – Nkunku discusses January rumours and Milan arrival",
      "url": "https://sempremilan.com/nkunku-discusses-january-milan-arrival",
      "source": "sempremilan.com",
      "date": "2026-02-10T14:30:44+00:00",
      "summary": "AC Milan signed Christopher Nkunku in the summer, but the Frenchman could have left the club only six months after signing, thanks to a January push. In the past few years, Milan have had some pretty rotten luck with strikers, and it seemed that Nkunku was going to be added to the list. With only […"
    },
    {
      "id": "ede3aa34cf23",
      "title": "After consulting 4 specialists, Mateta cannot be operated on. Glasner's confirmation",
      "url": "https://www.milannews.it/news/consultati-4-specialisti-mateta-non-si-opera-la-conferma-di-glasner-606977",
      "source": "milannews.it",
      "date": "2026-02-10T14:24:11+00:00",
      "summary": "Jean-Philippe Mateta was truly one step away from wearing the AC Milan shirt: in fact, more than a step away were two medical visits which did not convince the Rossoneri staff about the condition of the Frenchman's knee who, since ..."
    },
    {
      "id": "7a5c98c5b03a",
      "title": "Pastore: \"I didn't understand the point of taking a 28-year-old player permanently in a department that seems quite complete to me\"",
      "url": "https://www.milannews.it/news/pastore-non-capivo-il-senso-di-prendere-un-giocatore-di-28-anni-a-titolo-definitivo-in-un-reparto-che-mi-sembra-abbastanza-completo-606922",
      "source": "milannews.it",
      "date": "2026-02-10T14:13:25+00:00",
      "summary": "Giuseppe Pastore, journalist, expressed himself thus on Radio Rossonera on the Mateta deal at Milan, which was canceled due to the negative outcome of the medical examinations: “I didn't understand it from the beginning."
    },
    {
      "id": "37058afb53c4",
      "title": "Jimenez explains why he opted to leave AC Milan for Bournemouth",
      "url": "https://sempremilan.com/jimenez-explains-why-milan-bournemouth",
      "source": "sempremilan.com",
      "date": "2026-02-10T14:02:52+00:00",
      "summary": "Alex Jimenez’s move to AFC Bournemouth has become a permanent one, and he has spoken about his exit from AC Milan. Milan made the decision in the summer window to let Jimenez leave to try a new experience in the Premier League. He headed to the south coast on a loan with option to buy […]\nThe post J"
    },
    {
      "id": "935753f4833c",
      "title": "Totti at the Olimpico for Roma-Cagliari. And Massara confirms the excellent relationship with the Friedkins",
      "url": "https://www.milannews.it/news/totti-all-olimpico-per-roma-cagliari-e-massara-conferma-l-ottimo-rapporto-con-i-friedkin-606904",
      "source": "milannews.it",
      "date": "2026-02-10T14:00:01+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 9 - Francesco Totti still at the Olympic stadium. The former Giallorossi captain, after almost three years of absence, had already returned for the Roma-Stuttgart match and this evening he is once again present in the stands."
    },
    {
      "id": "b418c6dd7026",
      "title": "Nkunku: \"When Maignan speaks, everyone listens. Good thing for the club to remain\"",
      "url": "https://www.milannews.it/news/nkunku-quando-maignan-parla-tutti-ascoltano-cosa-buona-per-il-club-che-rimanga-606959",
      "source": "milannews.it",
      "date": "2026-02-10T13:48:52+00:00",
      "summary": "The month of January was the turning point for Christopher Nkunku who saw several sliding doors close and others open suddenly."
    },
    {
      "id": "e5eac93b9b97",
      "title": "The Premier League is not over: Manchester City conquers Anfield with super Donnarumma",
      "url": "https://www.milannews.it/news/la-premier-league-non-e-finita-il-manchester-city-espugna-anfield-con-super-donnarumma-606905",
      "source": "milannews.it",
      "date": "2026-02-10T13:36:43+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 08 - Manchester City beat Liverpool 2-1 and rekindled their Premier League title hopes. The penalty converted by Erling Haaland in injury time was decisive."
    },
    {
      "id": "43e7ef1c3849",
      "title": "GdS: Milan Futuro hoping for play-offs or repechage as slide continues – the regulations",
      "url": "https://sempremilan.com/milan-futuro-hoping-play-offs-or-repechage",
      "source": "sempremilan.com",
      "date": "2026-02-10T13:35:00+00:00",
      "summary": "It would be fair to say the Milan Futuro project has not gone entirely to plan for AC Milan so far, at least on the field. As La Gazzetta dello Sport write, the Futuro are hoping to avenge their relegation to Serie D via the play-offs in their debut season by getting instant promotion. Yet, […]\nThe "
    },
    {
      "id": "5befa7687ac9",
      "title": "Cremonese, Nicola: \"Terracciano had problems with his ankle and in any case he entered making his contribution\"",
      "url": "https://www.milannews.it/news/cremonese-nicola-terracciano-aveva-fastidi-alla-caviglia-e-comunque-e-entrato-dando-il-suo-contributo-606903",
      "source": "milannews.it",
      "date": "2026-02-10T13:24:41+00:00",
      "summary": "(ANSA) - BERGAMO, 09 FEB - \"Maybe we should be less worried: we conceded two avoidable goals, we need more arrogance.\""
    },
    {
      "id": "97f7a58feaea",
      "title": "MN - Leao continues in the group, Pulisic still apart. Saelemaekers custom work",
      "url": "https://www.milannews.it/da-milanello/mn-leao-continua-in-gruppo-pulisic-ancora-a-parte-saelemaekers-lavoro-personalizzato-606973",
      "source": "milannews.it",
      "date": "2026-02-10T13:12:20+00:00",
      "summary": "There is no big news from today's training at Milanello, with the injury situation remaining almost the same compared to that reported yesterday."
    },
    {
      "id": "d0591e31dc2c",
      "title": "Serbia coach expects Juventus star Vlahovic to snub Milan: “He’ll go to Barcelona”",
      "url": "https://sempremilan.com/serbia-coach-juventus-vlahovic-milan-barcelona",
      "source": "sempremilan.com",
      "date": "2026-02-10T13:10:00+00:00",
      "summary": "Serbian national team fitness coach Dusan Ilic has named the club that he thinks Dusan Vlahovic will join next, and it is not AC Milan. Vlahovic has been linked with Milan for years, stretching back to his days with Fiorentina. Multiple sources have confirmed in recent weeks that the Rossoneri see t"
    },
    {
      "id": "d60f060339d2",
      "title": "A fairy tale tinged with blue: Davide Bartesaghi from Milan Futuro to the national team",
      "url": "https://www.milannews.it/primo-piano/una-favola-che-si-tinge-di-azzurro-davide-bartesaghi-dal-milan-futuro-alla-nazionale-606967",
      "source": "milannews.it",
      "date": "2026-02-10T13:00:00+00:00",
      "summary": "It seems like the beginning of a fairy tale, of a dreamed but almost impossible adventure, but it's all true."
    },
    {
      "id": "e5500dae9af8",
      "title": "Gozzini: \"Too undisciplined for Allegri, Jimenez was valuable from afar: he will bring a dozen million\"",
      "url": "https://www.milannews.it/calciomercato-milan/gozzini-troppo-indisciplinato-per-allegri-jimenez-e-stato-prezioso-da-lontano-portera-una-dozzina-di-milioni-606911",
      "source": "milannews.it",
      "date": "2026-02-10T12:48:32+00:00",
      "summary": "Alessandra Gozzini, journalist, expressed herself as follows in La Gazzetta dello Sport on the future of Alex Jimenez: \"Even in the weekend without the championship, Milan was able to celebrate: the news from the Premier League, with the eighteenth presence of ..."
    },
    {
      "id": "ac06883cb989",
      "title": "Sergio Ramos given Milan shirt by Luka Modric: “Always a great joy to see you, brother”",
      "url": "https://sempremilan.com/sergio-ramos-milan-shirt-luka-modric",
      "source": "sempremilan.com",
      "date": "2026-02-10T12:45:00+00:00",
      "summary": "Sergio Ramos reunited with his ex-Real Madrid team-mate Luka Modric recently in his home in Seville, a post on social media has shown. As Tribuna report, the two decided to catch up for a barbecue on the same day their former side defeated Valencia by a 2-0 margin in LaLiga. Ramos posted a picture o"
    },
    {
      "id": "b091a467b6b2",
      "title": "A very important comparison for Malen: according to Gasperini, he resembles Vialli",
      "url": "https://www.milannews.it/news/paragone-importantissimo-per-malen-secondo-gasperini-assomiglia-a-vialli-606902",
      "source": "milannews.it",
      "date": "2026-02-10T12:36:55+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 09 - \"We always try to live up to our rivals. We have the hope and desire to grow in the offensive department and Malen's arrival certainly gives us much more."
    },
    {
      "id": "4162b030544c",
      "title": "Nkunku clarifies: \"I never asked my agent to look for something else: I want to return here to Milan\"",
      "url": "https://www.milannews.it/calciomercato-milan/nkunku-chiarisce-mai-chiesto-al-mio-agente-di-cercare-altro-voglio-rendere-qui-al-milan-606958",
      "source": "milannews.it",
      "date": "2026-02-10T12:24:30+00:00",
      "summary": "The month of January was the turning point for Christopher Nkunku who saw several sliding doors close and others open suddenly."
    },
    {
      "id": "7c4765ea6010",
      "title": "Vitiello explains what Füllkrug must do to earn Milan stay: “It all depends on him”",
      "url": "https://sempremilan.com/what-fullkrug-do-earn-milan-stay",
      "source": "sempremilan.com",
      "date": "2026-02-10T12:20:00+00:00",
      "summary": "Niclas Füllkrug celebrated his first birthday with AC Milan on Monday, but whether it is his last at the club is yet to be decided. As a reminder, Füllkrug was a signing that Milan lined up in advance of the winter window opening, as they wanted a target man. They agreed a deal with West […]\nThe pos"
    },
    {
      "id": "a73fca8971bb",
      "title": "Cuomo: \"Bartesaghi's discovery would have been talked about much longer if it had been the work of some other coach\"",
      "url": "https://www.milannews.it/news/cuomo-della-scoperta-di-bartesaghi-se-ne-sarebbe-parlato-molto-piu-a-lungo-se-fosse-stata-opera-di-qualche-altro-allenatore-606971",
      "source": "milannews.it",
      "date": "2026-02-10T12:12:20+00:00",
      "summary": "Michael Cuomo, journalist, expressed himself to MilanNews as follows about the Rossoneri in the national team: \"When I heard about Bartesaghi at the table, in Milan, with Gattuso and the other Azzurri, I thought that if his discovery had been the work of some ..."
    },
    {
      "id": "303da62cf040",
      "title": "Report Pulisic waits for Milan contract offer as Liverpool and Arsenal loom",
      "url": "https://football-italia.net/pulisic-waits-milan-contract-liverpool-arsenal/",
      "source": "football-italia.net",
      "date": "2026-02-10T12:04:47+00:00",
      "summary": "Liverpool and Arsenal are reportedly interested in Milan star Christian Pulisic, who hasn’t yet received..."
    },
    {
      "id": "d8c373b3a071",
      "title": "GdS: Milan to face Pisa with a depleted attack again – the bulletin from Milanello",
      "url": "https://sempremilan.com/milan-pisa-depleted-attack-bulletin-milanello",
      "source": "sempremilan.com",
      "date": "2026-02-10T11:55:00+00:00",
      "summary": "The AC Milan squad have been back in training since Sunday, preparing for the trip to Pisa, but there are doubts about who will travel. As La Gazzetta dello Sport report, Christopher Nkunku will be the only forward certain of getting a call-up from Massimiliano Allegri for Friday’s game. The coach i"
    },
    {
      "id": "bb6e76953af3",
      "title": "‘Milan have recently been linked’ – Moretto provides update on Juventus midfielder",
      "url": "https://sempremilan.com/milan-mckennie-moretto-update-juventus",
      "source": "sempremilan.com",
      "date": "2026-02-10T11:30:00+00:00",
      "summary": "Weston McKennie’s future beyond the end of this season remains an unknown, but AC Milan are unlikely to be his destination. McKennie is proving to be one of the key men under Luciano Spalletti, and on Sunday he sparked the comeback in Juventus’ 2-2 draw with Lazio by scoring the goal that halved the"
    },
    {
      "id": "8d77212baba6",
      "title": "CM: Allegri at work to convince Modric amid unanimous agreement at Milan",
      "url": "https://sempremilan.com/allegri-work-modric-unanimous-agreement-milan",
      "source": "sempremilan.com",
      "date": "2026-02-10T11:05:00+00:00",
      "summary": "Luka Modric will ultimately decide his own future, but Massimiliano Allegri has moved ahead of time to try and convince him. When talking about Modric it is hard not to use superlatives. His impact on Milan since arriving is there for all to see: he is the technical leader of the team, at the very ["
    },
    {
      "id": "f688f227c904",
      "title": "Gattuso meets Italy players across the globe ahead of World Cup play-off",
      "url": "https://football-italia.net/gattuso-meets-italy-players-globe-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:54:51+00:00",
      "summary": "Denied a training retreat this month, Italy coach Gennaro Gattuso has taken his World Cup..."
    },
    {
      "id": "15bb8a276f31",
      "title": "Reports: Gattuso holds dinner with Italy squad ahead of play-offs – the Milan trio involved",
      "url": "https://sempremilan.com/gattuso-dinner-italy-milan-trio-involved",
      "source": "sempremilan.com",
      "date": "2026-02-10T10:40:00+00:00",
      "summary": "Italy are preparing for a crucial World Cup play-off against Northern Ireland, and Gennaro Gattuso has brought the players together. As Calciomercato.com report, Gattuso has been unable to organise a training camp in February to prepare for the play-off semi-final on March 26 against Northern Irelan"
    },
    {
      "id": "e43af22dbbb7",
      "title": "Nkunku: France have three teams to win World Cup, Rabiot ‘a beast’",
      "url": "https://football-italia.net/france-3-teams-win-world-cup-rabiot-beast/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:23:18+00:00",
      "summary": "During his interview with Gazzetta dello Sport, Milan striker Christopher Nkunku praised many of his Rossoneri..."
    },
    {
      "id": "d68dbca86044",
      "title": "CorSport: Milan reach verbal agreement over terms with Gila – €15-18m deal pursued",
      "url": "https://sempremilan.com/milan-verbal-agreement-gila-15-18m-deal",
      "source": "sempremilan.com",
      "date": "2026-02-10T10:15:00+00:00",
      "summary": "The rumours about AC Milan signing Mario Gila will not go away, and the management even know how much they would like to spend. According to Corriere dello Sport (via MilanNews), Gila is certainly high on Igli Tare and Milan’s list for the summer, when they will look to sign another central defender"
    },
    {
      "id": "b12a747674d2",
      "title": "Nkunku: ‘Never’ wanted to leave Milan, Ibrahimovic hasn’t changed",
      "url": "https://football-italia.net/nkunku-never-wanted-leave-milan-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:00:31+00:00",
      "summary": "Milan striker Christopher Nkunku insists he didn’t consider leaving the Rossoneri in the January transfer..."
    },
    {
      "id": "ea0eff65557b",
      "title": "MN: A year one apprenticeship – Jashari growing under Modric as crucial role beckons",
      "url": "https://sempremilan.com/apprenticeship-jashari-modric-crucial-role-beckons",
      "source": "sempremilan.com",
      "date": "2026-02-10T09:50:00+00:00",
      "summary": "Ardon Jashari was one of the most eagerly anticipated signings for AC Milan in recent times, but he is yet to carve out a starting role. Given the length of negotiations with Club Brugge and the amount that Milan agreed to invest to land him (almost €40m, including bonuses), expectations for Jashari"
    },
    {
      "id": "174e651f3e15",
      "title": "Tuttosport: ‘Operation Kean’ – Milan outline strategy to land striker Allegri sees as perfect",
      "url": "https://sempremilan.com/operation-kean-milan-strategy-allegri-perfect",
      "source": "sempremilan.com",
      "date": "2026-02-10T09:25:00+00:00",
      "summary": "We may be a few months away from the transfer window reopening, but AC Milan are already plotting their attempt for Moise Kean. Milan came very close to signing the striker for the future towards the end of the winter mercato. Jean-Philippe Mateta looked all set to be joining, but the move collapsed"
    },
    {
      "id": "79fcc69dccd2",
      "title": "Nkunku lifts lid on initial difficulties at Milan, exit rumours, team-mates and desire to win",
      "url": "https://sempremilan.com/nkunku-difficulties-milan-exit-rumours-win",
      "source": "sempremilan.com",
      "date": "2026-02-10T09:00:00+00:00",
      "summary": "Christopher Nkunku has revealed his love for AC Milan, and also shed some light on why he encountered difficulties at first. Nkunku was the last signing that Milan made in the summer transfer window and the management chose to invest heavily in him, agreeing a deal with Chelsea widely reported to be"
    },
    {
      "id": "b6f8fecb873b",
      "title": "Alphadjo Cissè insight: Background, strengths, weaknesses and tactical fit",
      "url": "https://sempremilan.com/alphadjo-cisse-insight-scouting-report-milan",
      "source": "sempremilan.com",
      "date": "2026-02-09T19:48:37+00:00",
      "summary": "The winter transfer window ended up being a quiet one for AC Milan after an initial flurry, but one signing might go under the radar: Alphadjo Cissè. The big news concerning the first team in the mid-season mercato was the signing of Niclas Füllkrug from West Ham United on loan with option to buy, o"
    },
    {
      "id": "f91d10c378fd",
      "title": "‘A bit grotesque’ – Journalist breaks down timeline of Mateta to Milan saga",
      "url": "https://sempremilan.com/schira-breaks-down-timeline-mateta-milan-saga",
      "source": "sempremilan.com",
      "date": "2026-02-09T18:30:00+00:00",
      "summary": "Journalist Nicolo Schira has provided a detailed breakdown of exactly what happened in the Jean-Philippe Mateta saga. On the penultimate day of the winter window on February 1, multiple reliable sources stated that Milan and Crystal Palace had agreed a deal worth €30-35m for Mateta, the striker that"
    },
    {
      "id": "1d5d3d04dd95",
      "title": "Reports: Saelemaekers set to miss Pisa game after further MRI scan – the situation",
      "url": "https://sempremilan.com/saelemaekers-miss-pisa-mri-scan-situation",
      "source": "sempremilan.com",
      "date": "2026-02-09T18:02:10+00:00",
      "summary": "There were hopes that Alexis Saelemaekers could recover in time to face Pisa on Friday night, but the chances seem to have faded. According to MilanNews, the signs from training at Milanello today are that Christian Pulisic should be called up by Massimiliano Allegri in Pisa. Rafael Leao will be the"
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    },
    {
      "id": "0bbe5dfeba4c",
      "title": "Milan vs. Como postponed for 2026 Winter Olympics opening ceremony: when will it be played?",
      "url": "https://football-italia.net/milan-vs-como-postponed-2026-olympics-when/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:59:54+00:00",
      "summary": "With the Stadio Meazza in San Siro unavailable for the 2026 Winter Olympics opening ceremony,..."
    },
    {
      "id": "7c148df4d4cd",
      "title": "Glasner opens up on Mateta’s failed Milan medical: ‘It wasn’t a big surprise’",
      "url": "https://football-italia.net/glasner-on-matetas-failed-milan-medical/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:55:13+00:00",
      "summary": "Crystal Palace head coach Oliver Glasner has admitted that ‘it wasn’t a big big surprise’..."
    },
    {
      "id": "c10c6a922ef6",
      "title": "San Siro’s last dance at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/san-siro-last-dance-winter-olympics-ceremony/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:23:58+00:00",
      "summary": "The opening ceremony of the 2026 Milan Cortina Winter Olympics will take place today at..."
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    }
  ]
}