{
  "lastUpdated": "2026-02-26T04:18:35.580156+00:00",
  "articles": [
    {
      "id": "f5a0804381b3",
      "title": "Costacurta: \"Pasalic should be underlined, since Baresi in '94 I haven't seen a player take a team by the hand like he did\"",
      "url": "https://www.milannews.it/news/costacurta-pasalic-da-sottolineare-era-dai-tempi-di-baresi-nel-94-che-non-vedevo-un-giocatore-prendere-una-squadra-per-mano-come-ha-fatto-lui-608707",
      "source": "milannews.it",
      "date": "2026-02-25T23:59:01+00:00",
      "summary": "Atalanta's feat, a formidable 4-1 against Dortmund which overturned the 2-0 lead from the first leg, delighted Billy Costacurta."
    },
    {
      "id": "48a944363a69",
      "title": "MN - Bazzani: \"Leao is playing the striker role well, then due to his quality and way of being on the pitch he struggles to play with his back to goal\"",
      "url": "https://www.milannews.it/news/mn-bazzani-leao-sta-interpretando-bene-il-ruolo-di-punta-poi-per-qualita-e-modi-di-stare-in-campo-fa-fatica-a-giocare-spalle-alla-porta-608673",
      "source": "milannews.it",
      "date": "2026-02-25T23:50:20+00:00",
      "summary": "Fabio Bazzani, former striker in Serie A with Sampdoria and Lazio, today a commentator for DAZN, spoke exclusively for the editorial staff of MilanNews.it."
    },
    {
      "id": "dd5d1b70b941",
      "title": "Women's Football, Soncin ahead of the World Cup: \"We have a clear objective\"",
      "url": "https://www.milannews.it/news/calcio-femminile-soncin-in-vista-dei-mondiali-abbiamo-chiaro-l-obiettivo-608712",
      "source": "milannews.it",
      "date": "2026-02-25T23:40:11+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 25 - \"Going to the World Cup is our dream: we respect the qualities of our opponents, but we know where we want to arrive."
    },
    {
      "id": "83ece1ef4bee",
      "title": "Moretto's background on Luka Modric's possible contract renewal",
      "url": "https://www.milannews.it/calciomercato-milan/il-retroscena-di-moretto-sul-possibile-rinnovo-di-contratto-di-luka-modric-608719",
      "source": "milannews.it",
      "date": "2026-02-25T23:30:10+00:00",
      "summary": "Matteo Moretto, in a live broadcast on Fabrizio Romano's YouTube channel, talks about Luka Modric's future. The Croatian champion has a contract with Milan until 30 June 2026."
    },
    {
      "id": "cc3f233857b1",
      "title": "Viviano: “Leao aims for one of the biggest follies of the last 10 years”",
      "url": "https://www.milannews.it/news/viviano-leao-punta-una-delle-piu-grandi-follie-degli-ultimi-10-anni-608592",
      "source": "milannews.it",
      "date": "2026-02-25T23:20:07+00:00",
      "summary": "During the last episode of the Aura Sport podcast, Viviano expressed himself like this about Milan after the match against Parma:\n\n“For me it is one of the greatest craziness I have seen in the last 10 years to see Leao punt ..."
    },
    {
      "id": "2041f911e194",
      "title": "Champions League, Atalanta is the only Italian in the round of 16. Inter disaster, Juve mockery",
      "url": "https://www.milannews.it/news/champions-league-atalanta-unica-italiana-agli-ottavi-disastro-inter-beffa-juve-608717",
      "source": "milannews.it",
      "date": "2026-02-25T23:10:09+00:00",
      "summary": "THE RESULTS OF THE CHAMPIONS LEAGUE EVENING\n\nAtalanta-Borussia Dortmund 4-1\nPSG-Monaco 2-2\nReal Madrid-Benfica 2-1\nJuventus-Galatasaray 3-2\n\nAtalanta, PSG, Real Madrid and Galatasaray advance to the round of 16, joining Atletico M..."
    },
    {
      "id": "e8f7ab9f0069",
      "title": "Allegri stays but trust him. Referees: ask to send Rocchi away to understand who isn't there",
      "url": "https://www.milannews.it/editoriale/allegri-resta-ma-fidatevi-di-lui-arbitri-chiedere-di-mandare-via-rocchi-per-capire-chi-non-ci-sta-608698",
      "source": "milannews.it",
      "date": "2026-02-25T23:00:01+00:00",
      "summary": "Fabio Capello is right, someone who knows these dynamics very well."
    },
    {
      "id": "4c1fa37f0aae",
      "title": "MN - Bazzani: \"Pulisic has never managed to be continuous due to the many physical problems\"",
      "url": "https://www.milannews.it/news/mn-bazzani-pulisic-non-e-mai-riuscito-ad-essere-continuo-per-i-tanti-problemi-fisici-608674",
      "source": "milannews.it",
      "date": "2026-02-25T22:50:25+00:00",
      "summary": "Fabio Bazzani, former striker in Serie A with Sampdoria and Lazio, today a commentator for DAZN, spoke exclusively for the editorial staff of MilanNews.it."
    },
    {
      "id": "be36ca51cf5e",
      "title": "Juve, that's how it burns. Super comeback, then the Gala strikes: 3-2 in Turin, the Bianconeri out of the Champions League",
      "url": "https://www.milannews.it/news/juve-cosi-brucia-super-rimonta-poi-il-gala-colpisce-3-2-a-torino-bianconeri-out-dalla-champions-608716",
      "source": "milannews.it",
      "date": "2026-02-25T22:39:16+00:00",
      "summary": "Juventus came this close to their feat in the Champions League, with regulation time ending at 3-0 (Locatelli, Gatti and McKennie) despite having one man less."
    },
    {
      "id": "bd0e21817a13",
      "title": "Champions League, Percassi: \"A feat that comes only after Dublin\"",
      "url": "https://www.milannews.it/news/champions-league-percassi-un-impresa-che-viene-solo-dopo-dublino-608711",
      "source": "milannews.it",
      "date": "2026-02-25T22:30:10+00:00",
      "summary": "(ANSA) - BERGAMO, FEBRUARY 25 - \"This feat is slightly behind that of Dublin, but only because we won a trophy in Dublin. This evening the perfect match was played."
    },
    {
      "id": "c02c59ddc090",
      "title": "Paquetá defends Vini Jr: \"It's really sad to continue to see and experience these situations. He is the victim\"",
      "url": "https://www.milannews.it/news/paqueta-difende-vini-jr-e-davvero-triste-continuare-a-vedere-e-vivere-queste-situazioni-lui-e-la-vittima-608709",
      "source": "milannews.it",
      "date": "2026-02-25T22:20:15+00:00",
      "summary": "The former AC Milan player Lucas Paquetá, now at Flamengo, interviewed by ESPN, commented on the alleged racist insults that Gianluca Prestianni directed towards Vini Jr in the first leg match of the Champions League playoffs between Benfica ..."
    },
    {
      "id": "ad35da96a1f1",
      "title": "TMW - More guarantees on the involvement of the AIA: how the Gravina-Rocchi meeting on the PGMOL went",
      "url": "https://www.milannews.it/news/tmw-piu-garanzie-sul-coinvolgimento-dell-aia-com-e-andato-l-incontro-gravina-rocchi-sul-pgmol-608708",
      "source": "milannews.it",
      "date": "2026-02-25T22:10:05+00:00",
      "summary": "A calm and constructive discussion, aimed at discussing a proposal designed to improve the quality of the referee class, not to downsize the Italian Referees Association."
    },
    {
      "id": "74699b32da5a",
      "title": "Champions League, Real Madrid and PSG advance. Juve in extra time",
      "url": "https://www.milannews.it/news/champions-league-passano-real-madrid-e-psg-juve-ai-supplementari-608710",
      "source": "milannews.it",
      "date": "2026-02-25T22:00:00+00:00",
      "summary": "Two out of three matches of the Champions League playoffs have ended: PSG-Monaco 2-2 and Real Madrid-Benfica 2-1, while Juventus, sensationally down by one man but up by three goals at home, are playing extra time."
    },
    {
      "id": "95a713faadea",
      "title": "MN - Bazzani: \"Scudetto? In my opinion the margin with Inter is too wide to think of a comeback\"",
      "url": "https://www.milannews.it/news/mn-bazzani-scudetto-secondo-me-il-margine-con-l-inter-e-troppo-ampio-per-pensare-a-una-rimonta-608676",
      "source": "milannews.it",
      "date": "2026-02-25T21:50:34+00:00",
      "summary": "Fabio Bazzani, former striker in Serie A with Sampdoria and Lazio, today a commentator for DAZN, spoke exclusively for the editorial staff of MilanNews.it."
    },
    {
      "id": "db1dd4a08aae",
      "title": "Serie A: Sozza referees Roma-Juventus, Fabbri for Inter-Genoa",
      "url": "https://www.milannews.it/news/serie-a-sozza-arbitra-roma-juventus-fabbri-per-inter-genoa-608706",
      "source": "milannews.it",
      "date": "2026-02-25T21:40:11+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 25 - Simone Sozza will be the designated referee for Roma-Juventus, scheduled at the Olimpico on Sunday at 8.45pm."
    },
    {
      "id": "8e026956639a",
      "title": "Rummenigge: \"It makes no sense to say that we must abolish agents. But commissions today have become immoral\"",
      "url": "https://www.milannews.it/news/rummenigge-non-ha-senso-dire-che-dobbiamo-abolire-gli-agenti-ma-le-commissioni-oggi-sono-diventate-immorali-608705",
      "source": "milannews.it",
      "date": "2026-02-25T21:30:30+00:00",
      "summary": "Karl-Heinz Rummenigge, star of Bayern Munich, interviewed by FIFA did not mince words on the situation at a global level in football, regarding agents and agents: \"It makes no sense to say that we must abolish agents."
    },
    {
      "id": "c427ee3ccd22",
      "title": "Despite the heavy climate, the conclusion of the Verona sporting director's conference is one of resilience",
      "url": "https://www.milannews.it/news/nonostante-il-clima-pesante-la-conclusione-della-conferenza-del-ds-del-verona-e-di-resilienza-608664",
      "source": "milannews.it",
      "date": "2026-02-25T21:20:28+00:00",
      "summary": "(ANSA) - VERONA, FEBRUARY 24 - \"I put my face to it, as always, but I don't accept the lack of respect\"."
    },
    {
      "id": "0fc01698c7ab",
      "title": "Inter, Chivu: \"It's not easy against a team that has played four games in three months\"",
      "url": "https://www.milannews.it/news/inter-chivu-non-e-semplice-contro-una-squadra-che-ha-giocato-quattro-partite-in-tre-mesi-608647",
      "source": "milannews.it",
      "date": "2026-02-25T21:10:55+00:00",
      "summary": "(ANSA) - MILAN, FEBRUARY 24 - \"We tried in every way from the beginning. We weren't able to break the deadlock, then in the second half they had much more energy than us."
    },
    {
      "id": "327aaad552db",
      "title": "Sabatini is sure: “Criticism of instrumental Allegris, but he too sometimes makes mistakes”",
      "url": "https://www.milannews.it/news/sabatini-e-sicuro-critiche-ad-allegri-strumentali-ma-anche-lui-a-volte-sbaglia-608683",
      "source": "milannews.it",
      "date": "2026-02-25T21:00:00+00:00",
      "summary": "During one of his videos on YouTube with Carlo Pellegatti, Sandro Sabatini spoke about the criticisms made of Allegri due to the distance he has from the first in the rankings already at the end of February."
    },
    {
      "id": "b4badeb917f9",
      "title": "MN - Bazzani: \"I faced defenders like Maldini, Costacurta, Nesta or Stam. When you played against that Milan you always had the feeling of going against giants\"",
      "url": "https://www.milannews.it/news/mn-bazzani-affrontavo-difensori-come-maldini-costacurta-nesta-o-stam-quando-giocavi-contro-quel-milan-li-avevi-sempre-la-sensazione-di-andare-contro-d-608675",
      "source": "milannews.it",
      "date": "2026-02-25T20:50:30+00:00",
      "summary": "Fabio Bazzani, former striker in Serie A with Sampdoria and Lazio, today a commentator for DAZN, spoke exclusively for the editorial staff of MilanNews.it."
    },
    {
      "id": "ea3b8cf767e4",
      "title": "MN: ‘Moment of truth’ – Gimenez hoping for March return with Milan goal in mind",
      "url": "https://sempremilan.com/gimenez-hoping-march-return-milan-goal",
      "source": "sempremilan.com",
      "date": "2026-02-25T19:00:00+00:00",
      "summary": "It seems next month will be the one for Santiago Gimenez, and the Mexican certainly has high hopes for what could be at AC Milan. This season, Gimenez has struggled, and that was immediately clear. However, it took until the Atalanta game for it to be addressed. A scan turned into a set-back and tha"
    },
    {
      "id": "0e84a1982af8",
      "title": "‘5 in 5 years’ – Ordine highlights difference between Inter and Milan’s card numbers",
      "url": "https://sempremilan.com/ordine-highlights-differences-inter-milan-red-cards",
      "source": "sempremilan.com",
      "date": "2026-02-25T18:30:00+00:00",
      "summary": "Today, the FIGC have held a ‘referee revolution’ meeting, and Franco Ordine has brought up a rather interesting stat.  The fallout from Inter’s win against Juventus is still going on, especially with Milan pretty much out of the title race now. Perhaps it is keeping an old wound open and vulnerable "
    },
    {
      "id": "339a1d078013",
      "title": "Home advantage… or not – San Siro proving to be Milan’s biggest downfall this season",
      "url": "https://sempremilan.com/home-advantage-not-milan-downfall-this-season",
      "source": "sempremilan.com",
      "date": "2026-02-25T18:00:00+00:00",
      "summary": "San Siro is probably imagined as a bit of a fortress for some, and it may have been correct in recent years. However, AC Milan have struggled this season. As the year has gone on, it has become growingly noticeable that Milan have a problem at San Siro. Considering the record for the season, it […]\n"
    },
    {
      "id": "08ffebe89485",
      "title": "Gazzetta journalist states that Derby della Madonna ‘will be played’ on March 8",
      "url": "https://sempremilan.com/gds-journalist-states-milan-derby-played-march-8",
      "source": "sempremilan.com",
      "date": "2026-02-25T17:30:00+00:00",
      "summary": "AC Milan and Inter are still waiting for the Derby della Madonnina to be written into the calendar officially. However, it may be possible to work out when the game will take place.  Unlike many European calendars, the Italian fixture list is confirmed, at least date-wise, in a periodic basis. Whils"
    },
    {
      "id": "28cdba3bdee0",
      "title": "Falk: Inter join Milan and Arsenal in the race for out of contract Bayern star",
      "url": "https://sempremilan.com/inter-join-milan-arsenal-bayern-star",
      "source": "sempremilan.com",
      "date": "2026-02-25T17:00:00+00:00",
      "summary": "AC Milan will face further competition to sign Leon Goretzka in the summer, with a new suitor coming to light today.  It has been suggested that signing Goretzka would be a difficult feat for Milan already. In fact, they almost lost the chance to sign him in January, with Atletico Madrid seemingly o"
    },
    {
      "id": "3c55d0b0d876",
      "title": "GdS: FIGC hosting ‘referee revolution’ after recent incidents – the situation",
      "url": "https://sempremilan.com/figc-host-referee-revolution-after-incidents",
      "source": "sempremilan.com",
      "date": "2026-02-25T16:30:00+00:00",
      "summary": "AC Milan are no strangers to strange decisions, and this season has seen several questionable calls go against them, the latest of which occurred this weekend. It has been a difficult year for the officials. Indeed, throughout this season, the scrutiny on them has been higher than ever. Unfortunatel"
    },
    {
      "id": "3f5e6ed3499e",
      "title": "CM: ‘At the centre’ – Jesus hoping for Serie A move after agency change",
      "url": "https://sempremilan.com/jesus-hoping-serie-a-move-agency-change",
      "source": "sempremilan.com",
      "date": "2026-02-25T16:00:00+00:00",
      "summary": "AC Milan will probably sign a striker in the next six months, and Gabriel Jesus’ name continues to appear on the list of options.  Throughout the past few months, it has seemed increasingly likely that Milan would make a move for Jesus. Indeed, the Brazilian striker has lost his position in the Arse"
    },
    {
      "id": "86bb8d9f7eb3",
      "title": "‘He wants to build’ – Pellegatti offers opposing view on Allegri’s Milan future",
      "url": "https://sempremilan.com/pellegatti-opposing-view-allegri-milan-future",
      "source": "sempremilan.com",
      "date": "2026-02-25T15:30:00+00:00",
      "summary": "There has been a suggestion that Massimiliano Allegri could leave AC Milan in the summer, but it seems that it may not be the case. In a world where it can be questioned if Milan have always acted on Allegri’s best interests, it is not a surprise to see suggestions about his future. Ultimately, with"
    },
    {
      "id": "874311d4fdee",
      "title": "QS: Milan clinging to their ‘senators’ – Pulisic and others required to step up",
      "url": "https://sempremilan.com/milan-clinging-to-senators-pulisic-step-up",
      "source": "sempremilan.com",
      "date": "2026-02-25T15:00:00+00:00",
      "summary": "If AC Milan are not careful, they could quickly lose sight of the Scudetto and maybe even the Champions League safety.  Throughout this season, Milan have always remained true to the fact that they want to finish in the Champions League places. Whilst the Scudetto has been within reach, the hope has"
    },
    {
      "id": "f81cb3ce15a8",
      "title": "MN: Furlani returns to Milanello with message for the Milan squad after Parma defeat",
      "url": "https://sempremilan.com/furlani-milanello-message-milan-squad",
      "source": "sempremilan.com",
      "date": "2026-02-25T14:30:00+00:00",
      "summary": "Ahead of Sunday’s game against Cremonese, AC Milan have returned to training today, and one visitor in particular has been noticed. After the disappointment at the weekend, Milan have had a few days off to recuperate, and they will now begin to prepare for the next game on the fixture list, which se"
    },
    {
      "id": "733de664b516",
      "title": "Capello identifies Milan’s ‘obvious flaws’ with Leao judgement: “Simply not a centre-forward”",
      "url": "https://sempremilan.com/capello-milan-two-obvious-flaws-leao",
      "source": "sempremilan.com",
      "date": "2026-02-25T14:00:00+00:00",
      "summary": "Fabio Capello has revealed his belief that Rafael Leao cannot operate as a striker for AC Milan, who need a reinforcement in that area. Leao is not having a bad season by any means, given that he is the joint-top scorer in the league for Milan with eight goals, matching the tally that he racked […]\n"
    },
    {
      "id": "bee33393f11d",
      "title": "‘Lowest point in the relationship’ – Criscitiello voices concerns regarding Allegri’s Milan future",
      "url": "https://sempremilan.com/criscitiello-concerns-allegri-milan-future",
      "source": "sempremilan.com",
      "date": "2026-02-25T13:35:00+00:00",
      "summary": "Sportitalia director Michele Criscitiello has criticised AC Milan’s management for the squad they built, and revealed Massimiliano Allegri isn’t happy either. From the outside looking in, it would appear that Milan are having a much better season given that they finished eighth in 2024-25 in what wa"
    },
    {
      "id": "321f2e250317",
      "title": "Tuttosport: Gimenez’s injury ordeal almost over – why specialist check-up will be key",
      "url": "https://sempremilan.com/gimenez-ordeal-almost-over-specialist-check",
      "source": "sempremilan.com",
      "date": "2026-02-25T13:10:00+00:00",
      "summary": "Santiago Gimenez has had a difficult 2025-26 season for various reasons, but he will almost certainly get the chance to end it in a positive way. As Tuttosport (via MN24) recall this morning, Gimenez has been sidelined for several months due to a serious ankle injury that required surgery in mid-Dec"
    },
    {
      "id": "d9f9e59b192f",
      "title": "GdS: Another dream night six years on – Hauge bewitches San Siro again in ‘derby’",
      "url": "https://sempremilan.com/hauge-bewitches-san-siro-dream-derby",
      "source": "sempremilan.com",
      "date": "2026-02-25T12:45:00+00:00",
      "summary": "San Siro is a stadium that Jens Petter Hauge will always remember fondly, for what it has brought him in his career so far. As La Gazzetta dello Sport write, it is the stadium that turned his life upside down and shaped his path. Last night, just like six years ago when the blond Bodo/Glimt […]\nThe "
    },
    {
      "id": "4028bd0bc135",
      "title": "CM: Searching for the right duo – what the numbers show about Milan’s attacking pairs",
      "url": "https://sempremilan.com/what-numbers-show-milan-attacking-pairs",
      "source": "sempremilan.com",
      "date": "2026-02-25T12:20:00+00:00",
      "summary": "AC Milan once again have a problem getting regular goals from their attacking department, with Massimiliano Allegri searching for the right duo. As Calciomercato.com write, Milan’s attack is one worth of a top four spot but not the league title. In 26 games, they have scored 41 goals, the same as Co"
    },
    {
      "id": "c59ff645f864",
      "title": "CorSport: Lazio resigned to losing star defender – Milan and Inter at the window",
      "url": "https://sempremilan.com/lazio-resigned-gila-milan-inter-window",
      "source": "sempremilan.com",
      "date": "2026-02-25T11:55:00+00:00",
      "summary": "Lazio are braced for the exit of central defender Mario Gila as early as the summer window, with both Milan clubs keen. It is well known that Milan are in the market for another options for the centre-back department, especially with the presumed return to playing in European competitions from next "
    },
    {
      "id": "9976a496ef8e",
      "title": "GdS: 30 months, many issue – Loftus-Cheek’s constant battle with injuries at Milan",
      "url": "https://sempremilan.com/loftus-cheek-constant-battle-injuries-milan",
      "source": "sempremilan.com",
      "date": "2026-02-25T11:30:00+00:00",
      "summary": "Ruben Loftus-Cheek has suffered yet another injury setback, which has been the running theme of his troubled time at AC Milan. La Gazzetta dello Sport confirm that Milan will be without Loftus-Cheek for approximately two months. On Monday morning, the Englishman underwent surgery at Milan’s San Paol"
    },
    {
      "id": "e4f860ec8001",
      "title": "Tuttosport: Milan hunting for the right No.9 – the names in the mix from Kean to Nunez",
      "url": "https://sempremilan.com/milan-right-no9-names-kean-nunez",
      "source": "sempremilan.com",
      "date": "2026-02-25T11:05:00+00:00",
      "summary": "AC Milan will have to fix some gaps in the squad during the summer window, and the biggest is the centre-forward role. As Tuttosport (via MilanNews) report this morning, Milan need a true No.9 for next season and this will be the management’s main mission in the summer. It’s no secret that in Januar"
    },
    {
      "id": "4607c4ec9334",
      "title": "Report Allegri considering his future at Milan",
      "url": "https://football-italia.net/allegri-consider-future-milan-report/",
      "source": "football-italia.net",
      "date": "2026-02-25T10:56:20+00:00",
      "summary": "According to Sportitalia, Milan coach Massimiliano Allegri is considering his future at the club beyond..."
    },
    {
      "id": "79b51922cfe1",
      "title": "‘Watch out Max’ – Capello explains why Milan must be ‘wary of those behind them’",
      "url": "https://sempremilan.com/capello-max-milan-wary-those-behind",
      "source": "sempremilan.com",
      "date": "2026-02-25T10:40:00+00:00",
      "summary": "Fabio Capello believes a top four spot is not locked up for AC Milan, who could pay for the energy they spent chasing Inter. Milan’s unbeaten run came to an end at San Siro on Sunday night as they were beaten 1-0 by Parma, which likely ends any faint title hopes too. It means that […]\nThe post ‘Watc"
    },
    {
      "id": "d4a31e229684",
      "title": "Hauge reveals added ‘pressure’ after knocking out Inter: “The Milan fans are really passionate”",
      "url": "https://sempremilan.com/hauge-added-pressure-milan-inter-passionate",
      "source": "sempremilan.com",
      "date": "2026-02-25T10:15:00+00:00",
      "summary": "Jens Petter Hauge has admitted he felt the pressure from AC Milan fans to do the business for Bodo/Glimt against Inter last night. Bodo/Glimt stunned San Siro on Tuesday night as they build on a 3-1 lead against Inter from the first leg to win 2-1 on the night and 5-2 on aggregate, knocking last […]"
    },
    {
      "id": "7367715a2cf2",
      "title": "Former Serie A referee plays down controversial decisions in Milan defeat to Parma",
      "url": "https://football-italia.net/tommasi-milan-parma-open-var/",
      "source": "football-italia.net",
      "date": "2026-02-24T16:51:37+00:00",
      "summary": "Parma’s late 1-0 victory against Milan at San Siro has continued to generate significant debate..."
    },
    {
      "id": "af0191216a1b",
      "title": "Today’s Papers: Champions League, Inter-Bodo/Glimt, McKennie renewal",
      "url": "https://football-italia.net/todays-papers-champions-league-inter-bodo/",
      "source": "football-italia.net",
      "date": "2026-02-24T08:41:35+00:00",
      "summary": "La Gazzetta dello Sport  In with the goals  Champions League: Inter looking for the comeback..."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "7d1eaf8982a2",
      "title": "Serie A | Milan 0-1 Parma – Player Ratings as Troilo and Corvi batten down the hatches",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-player-ratings/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:09:16+00:00",
      "summary": "Milan fell to a late 1-0 defeat to Parma this evening, after they were unable..."
    },
    {
      "id": "0338d8d0b0d7",
      "title": "Serie A | Milan 0-1 Parma: Rossoneri suffer shocking first defeat in 24 rounds",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-shocking-defeat-24/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:05:53+00:00",
      "summary": "Milan paid the price for insipid finishing and sluggish defending, as Parma inflicted their first..."
    },
    {
      "id": "ad92e7503a8c",
      "title": "Ex-West Ham & Villa man Reo-Coker: ‘Fabregas pull on Saelemaekers inexcusable’",
      "url": "https://football-italia.net/ex-west-ham-villa-man-reo-coker-fabregas/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:50:32+00:00",
      "summary": "Former West Ham and Aston Villa midfielder turned CBS Sports Golazo pundit Nigel Reo-Coker has..."
    }
  ]
}