{
  "lastUpdated": "2026-02-10T13:10:06.777134+00:00",
  "articles": [
    {
      "id": "d60f060339d2",
      "title": "A fairy tale tinged with blue: Davide Bartesaghi from Milan Futuro to the national team",
      "url": "https://www.milannews.it/primo-piano/una-favola-che-si-tinge-di-azzurro-davide-bartesaghi-dal-milan-futuro-alla-nazionale-606967",
      "source": "milannews.it",
      "date": "2026-02-10T13:00:00+00:00",
      "summary": "It seems like the beginning of a fairy tale, of a dreamed but almost impossible adventure, but it's all true."
    },
    {
      "id": "e5500dae9af8",
      "title": "Gozzini: \"Too undisciplined for Allegri, Jimenez was valuable from afar: he will bring a dozen million\"",
      "url": "https://www.milannews.it/calciomercato-milan/gozzini-troppo-indisciplinato-per-allegri-jimenez-e-stato-prezioso-da-lontano-portera-una-dozzina-di-milioni-606911",
      "source": "milannews.it",
      "date": "2026-02-10T12:48:32+00:00",
      "summary": "Alessandra Gozzini, journalist, expressed herself as follows in La Gazzetta dello Sport on the future of Alex Jimenez: \"Even in the weekend without the championship, Milan was able to celebrate: the news from the Premier League, with the eighteenth presence of ..."
    },
    {
      "id": "ac06883cb989",
      "title": "Sergio Ramos given Milan shirt by Luka Modric: “Always a great joy to see you, brother”",
      "url": "https://sempremilan.com/sergio-ramos-milan-shirt-luka-modric",
      "source": "sempremilan.com",
      "date": "2026-02-10T12:45:00+00:00",
      "summary": "Sergio Ramos reunited with his ex-Real Madrid team-mate Luka Modric recently in his home in Seville, a post on social media has shown. As Tribuna report, the two decided to catch up for a barbecue on the same day their former side defeated Valencia by a 2-0 margin in LaLiga. Ramos posted a picture o"
    },
    {
      "id": "b091a467b6b2",
      "title": "A very important comparison for Malen: according to Gasperini, he resembles Vialli",
      "url": "https://www.milannews.it/news/paragone-importantissimo-per-malen-secondo-gasperini-assomiglia-a-vialli-606902",
      "source": "milannews.it",
      "date": "2026-02-10T12:36:55+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 09 - \"We always try to live up to our rivals. We have the hope and desire to grow in the offensive department and Malen's arrival certainly gives us much more."
    },
    {
      "id": "4162b030544c",
      "title": "Nkunku clarifies: \"I never asked my agent to look for something else: I want to return here to Milan\"",
      "url": "https://www.milannews.it/calciomercato-milan/nkunku-chiarisce-mai-chiesto-al-mio-agente-di-cercare-altro-voglio-rendere-qui-al-milan-606958",
      "source": "milannews.it",
      "date": "2026-02-10T12:24:30+00:00",
      "summary": "The month of January was the turning point for Christopher Nkunku who saw several sliding doors close and others open suddenly."
    },
    {
      "id": "7c4765ea6010",
      "title": "Vitiello explains what Füllkrug must do to earn Milan stay: “It all depends on him”",
      "url": "https://sempremilan.com/what-fullkrug-do-earn-milan-stay",
      "source": "sempremilan.com",
      "date": "2026-02-10T12:20:00+00:00",
      "summary": "Niclas Füllkrug celebrated his first birthday with AC Milan on Monday, but whether it is his last at the club is yet to be decided. As a reminder, Füllkrug was a signing that Milan lined up in advance of the winter window opening, as they wanted a target man. They agreed a deal with West […]\nThe pos"
    },
    {
      "id": "a73fca8971bb",
      "title": "Cuomo: \"Bartesaghi's discovery would have been talked about much longer if it had been the work of some other coach\"",
      "url": "https://www.milannews.it/news/cuomo-della-scoperta-di-bartesaghi-se-ne-sarebbe-parlato-molto-piu-a-lungo-se-fosse-stata-opera-di-qualche-altro-allenatore-606971",
      "source": "milannews.it",
      "date": "2026-02-10T12:12:20+00:00",
      "summary": "Michael Cuomo, journalist, expressed himself to MilanNews as follows about the Rossoneri in the national team: \"When I heard about Bartesaghi at the table, in Milan, with Gattuso and the other Azzurri, I thought that if his discovery had been the work of some ..."
    },
    {
      "id": "303da62cf040",
      "title": "Report Pulisic waits for Milan contract offer as Liverpool and Arsenal loom",
      "url": "https://football-italia.net/pulisic-waits-milan-contract-liverpool-arsenal/",
      "source": "football-italia.net",
      "date": "2026-02-10T12:04:47+00:00",
      "summary": "Liverpool and Arsenal are reportedly interested in Milan star Christian Pulisic, who hasn’t yet received..."
    },
    {
      "id": "fb6ae1256bd3",
      "title": "New training sessions for Milan? Since this afternoon, Pisa has been seriously preparing for Friday's match",
      "url": "https://www.milannews.it/news/nuovi-allenamenti-per-il-milan-da-oggi-pomeriggio-il-pisa-prepara-sul-serio-la-sfida-di-venerdi-606910",
      "source": "milannews.it",
      "date": "2026-02-10T12:00:22+00:00",
      "summary": "After resuming training yesterday, today Pisa will have an afternoon session towards the match against Milan on Friday."
    },
    {
      "id": "d8c373b3a071",
      "title": "GdS: Milan to face Pisa with a depleted attack again – the bulletin from Milanello",
      "url": "https://sempremilan.com/milan-pisa-depleted-attack-bulletin-milanello",
      "source": "sempremilan.com",
      "date": "2026-02-10T11:55:00+00:00",
      "summary": "The AC Milan squad have been back in training since Sunday, preparing for the trip to Pisa, but there are doubts about who will travel. As La Gazzetta dello Sport report, Christopher Nkunku will be the only forward certain of getting a call-up from Massimiliano Allegri for Friday’s game. The coach i"
    },
    {
      "id": "276e3d0eeb66",
      "title": "Nkunku cheers: \"First four objective: we think match after match. The Derby is special\"",
      "url": "https://www.milannews.it/news/nkunku-allegriano-obiettivo-prime-quattro-pensiamo-partita-dopo-partita-il-derby-e-speciale-606920",
      "source": "milannews.it",
      "date": "2026-02-10T11:48:01+00:00",
      "summary": "The month of January was the turning point for Christopher Nkunku who saw several sliding doors close and others open suddenly."
    },
    {
      "id": "3d0b6e5f8bf9",
      "title": "Guidi: \"There is no flattery in Allegri's words, but only a massive dose of realism for Rabiot\"",
      "url": "https://www.milannews.it/news/guidi-nelle-parole-di-allegri-non-c-e-piaggeria-ma-solo-una-massiccia-dose-di-realismo-per-rabiot-606915",
      "source": "milannews.it",
      "date": "2026-02-10T11:36:54+00:00",
      "summary": "Marco Guidi, journalist, reported an article praising Adrien Rabiot in La Gazzetta dello Sport: \"The confirmation came on Tuesday evening, in the heart of Dall'Ara, from the man who knows him more than ..."
    },
    {
      "id": "bb6e76953af3",
      "title": "‘Milan have recently been linked’ – Moretto provides update on Juventus midfielder",
      "url": "https://sempremilan.com/milan-mckennie-moretto-update-juventus",
      "source": "sempremilan.com",
      "date": "2026-02-10T11:30:00+00:00",
      "summary": "Weston McKennie’s future beyond the end of this season remains an unknown, but AC Milan are unlikely to be his destination. McKennie is proving to be one of the key men under Luciano Spalletti, and on Sunday he sparked the comeback in Juventus’ 2-2 draw with Lazio by scoring the goal that halved the"
    },
    {
      "id": "e75e1bfd08f6",
      "title": "Ambrosini explains how Tomba and Compagnoni can be an example for young people",
      "url": "https://www.milannews.it/news/ambrosini-racconta-come-tomba-e-la-compagnoni-possono-essere-d-esempio-per-i-giovani-606966",
      "source": "milannews.it",
      "date": "2026-02-10T11:24:58+00:00",
      "summary": "During the broadcast Stadi 5."
    },
    {
      "id": "57d3e9aa30b2",
      "title": "Ottolini (Juve sporting director): \"Vlahovic? It's not a totally closed discussion\"",
      "url": "https://www.milannews.it/news/ottolini-ds-juve-vlahovic-non-e-un-discorso-totalmente-chiuso-606969",
      "source": "milannews.it",
      "date": "2026-02-10T11:12:37+00:00",
      "summary": "The future of Dusan Vlahovic is yet to be written, both in the long and short term: on the one hand, the Serbian footballer's contract with Juventus is expiring and does not seem willing to renew with the Juventus club; from ..."
    },
    {
      "id": "8d77212baba6",
      "title": "CM: Allegri at work to convince Modric amid unanimous agreement at Milan",
      "url": "https://sempremilan.com/allegri-work-modric-unanimous-agreement-milan",
      "source": "sempremilan.com",
      "date": "2026-02-10T11:05:00+00:00",
      "summary": "Luka Modric will ultimately decide his own future, but Massimiliano Allegri has moved ahead of time to try and convince him. When talking about Modric it is hard not to use superlatives. His impact on Milan since arriving is there for all to see: he is the technical leader of the team, at the very ["
    },
    {
      "id": "708c068fe307",
      "title": "Milan, a defender will have to arrive in the summer: Gila remains the favourite",
      "url": "https://www.milannews.it/primo-piano/milan-in-estate-un-difensore-dovra-arrivare-gila-rimane-il-favorito-606968",
      "source": "milannews.it",
      "date": "2026-02-10T11:00:00+00:00",
      "summary": "AC Milan, for various reasons, decided not to go for a defender in the winter transfer window which ended a week ago: the Rossoneri thought that, with only one competition and with the performance in ..."
    },
    {
      "id": "463c56a2088f",
      "title": "Serie A Milan Scudetto odds, bets on the Rossoneri",
      "url": "https://www.milannews.it/scommesse/quote-antepost/quote-scudetto-serie-a-milan-le-scommesse-sui-rossoneri-579454",
      "source": "milannews.it",
      "date": "2026-02-10T11:00:00+00:00",
      "summary": "Milan approaches the 25th matchday second in the standings with 50 points and one game less than their direct competitors."
    },
    {
      "id": "f688f227c904",
      "title": "Gattuso meets Italy players across the globe ahead of World Cup play-off",
      "url": "https://football-italia.net/gattuso-meets-italy-players-globe-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:54:51+00:00",
      "summary": "Denied a training retreat this month, Italy coach Gennaro Gattuso has taken his World Cup..."
    },
    {
      "id": "f397fc9c3caf",
      "title": "The operation starts for the summer. The redemption is being played out. Milan, don't fall for it again",
      "url": "https://www.milannews.it/editoriale/parte-l-operazione-per-l-estate-si-sta-giocando-il-riscatto-milan-non-ricascarci-606881",
      "source": "milannews.it",
      "date": "2026-02-10T10:53:01+00:00",
      "summary": "Milan will have to try, and not fall into the trap of the first round again. There are four matches on the calendar before the Derby against Inter, and they are Pisa, Como, Parma and Cremonese."
    },
    {
      "id": "d33bb1049ba2",
      "title": "Nkunku: \"If Milan calls you... The club wants to win and that's also my goal\"",
      "url": "https://www.milannews.it/news/nkunku-se-ti-chiama-il-milan-la-societa-vuole-vincere-ed-e-anche-il-mio-obiettivo-606921",
      "source": "milannews.it",
      "date": "2026-02-10T10:48:19+00:00",
      "summary": "The month of January was the turning point for Christopher Nkunku who saw several sliding doors close and others open suddenly."
    },
    {
      "id": "15bb8a276f31",
      "title": "Reports: Gattuso holds dinner with Italy squad ahead of play-offs – the Milan trio involved",
      "url": "https://sempremilan.com/gattuso-dinner-italy-milan-trio-involved",
      "source": "sempremilan.com",
      "date": "2026-02-10T10:40:00+00:00",
      "summary": "Italy are preparing for a crucial World Cup play-off against Northern Ireland, and Gennaro Gattuso has brought the players together. As Calciomercato.com report, Gattuso has been unable to organise a training camp in February to prepare for the play-off semi-final on March 26 against Northern Irelan"
    },
    {
      "id": "251c8f6d8cf2",
      "title": "Canovi: \"Milan doesn't have the quality to compete with Inter\"",
      "url": "https://www.milannews.it/news/canovi-il-milan-non-ha-la-qualita-per-competere-con-l-inter-606964",
      "source": "milannews.it",
      "date": "2026-02-10T10:36:25+00:00",
      "summary": "Dario Canovi, market operator, spoke to the microphones of Tuttomercatoweb.com to talk about the hot topics relating to the Serie A championship, especially regarding the Scudetto fight and that for the Champions League."
    },
    {
      "id": "f68197997708",
      "title": "Kean target, Milan would like to avoid the clause",
      "url": "https://www.milannews.it/calciomercato-milan/obiettivo-kean-il-milan-vorrebbe-evitare-la-clausola-606965",
      "source": "milannews.it",
      "date": "2026-02-10T10:24:14+00:00",
      "summary": "Moise Kean is the name that Tuttosport is talking about today with a view to the Rossoneri summer: it is very likely that Milan will decide to go for a new striker in the next summer transfer window, the ..."
    },
    {
      "id": "e43af22dbbb7",
      "title": "Nkunku: France have three teams to win World Cup, Rabiot ‘a beast’",
      "url": "https://football-italia.net/france-3-teams-win-world-cup-rabiot-beast/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:23:18+00:00",
      "summary": "During his interview with Gazzetta dello Sport, Milan striker Christopher Nkunku praised many of his Rossoneri..."
    },
    {
      "id": "d68dbca86044",
      "title": "CorSport: Milan reach verbal agreement over terms with Gila – €15-18m deal pursued",
      "url": "https://sempremilan.com/milan-verbal-agreement-gila-15-18m-deal",
      "source": "sempremilan.com",
      "date": "2026-02-10T10:15:00+00:00",
      "summary": "The rumours about AC Milan signing Mario Gila will not go away, and the management even know how much they would like to spend. According to Corriere dello Sport (via MilanNews), Gila is certainly high on Igli Tare and Milan’s list for the summer, when they will look to sign another central defender"
    },
    {
      "id": "decb1bab5b74",
      "title": "The Serbia coach: \"I believe we will see Vlahovic on the pitch again in March\"",
      "url": "https://www.milannews.it/news/il-preparatore-della-serbia-credo-che-vlahovic-lo-rivedremo-in-campo-a-marzo-606946",
      "source": "milannews.it",
      "date": "2026-02-10T10:12:49+00:00",
      "summary": "One of the hottest names in the next summer transfer market will certainly be Dusan Vlahovic, the Serbian striker from Juventus who has been out of action for a few months today and is expected to be out of action for a further ..."
    },
    {
      "id": "b12a747674d2",
      "title": "Nkunku: ‘Never’ wanted to leave Milan, Ibrahimovic hasn’t changed",
      "url": "https://football-italia.net/nkunku-never-wanted-leave-milan-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:00:31+00:00",
      "summary": "Milan striker Christopher Nkunku insists he didn’t consider leaving the Rossoneri in the January transfer..."
    },
    {
      "id": "b67683d256b9",
      "title": "Saelemaekers' return will not be forced: Como objective",
      "url": "https://www.milannews.it/news/il-rientro-di-saelemaekers-non-verra-forzato-obiettivo-como-606963",
      "source": "milannews.it",
      "date": "2026-02-10T10:00:00+00:00",
      "summary": "In Milan's last championship match, the clear and beautiful victory in Bologna by 0-3 exactly one week ago, Alexis Saelemaekers was not on the pitch, forced into the pits after a relapse of the muscle problem suffered in the minutes ..."
    },
    {
      "id": "ea0eff65557b",
      "title": "MN: A year one apprenticeship – Jashari growing under Modric as crucial role beckons",
      "url": "https://sempremilan.com/apprenticeship-jashari-modric-crucial-role-beckons",
      "source": "sempremilan.com",
      "date": "2026-02-10T09:50:00+00:00",
      "summary": "Ardon Jashari was one of the most eagerly anticipated signings for AC Milan in recent times, but he is yet to carve out a starting role. Given the length of negotiations with Club Brugge and the amount that Milan agreed to invest to land him (almost €40m, including bonuses), expectations for Jashari"
    },
    {
      "id": "a9d60f9278d9",
      "title": "Nkunku explains: \"Condition matters a lot: as if a journalist did an interview without preparing the questions\"",
      "url": "https://www.milannews.it/news/nkunku-spiega-condizione-conta-tantissimo-come-se-un-giornalista-facesse-un-intervista-senza-preparare-le-domande-606917",
      "source": "milannews.it",
      "date": "2026-02-10T09:48:26+00:00",
      "summary": "The month of January was the turning point for Christopher Nkunku who saw several sliding doors close and others open suddenly."
    },
    {
      "id": "38233f6b5e55",
      "title": "Milan-Inter in a month: the words of Nerazzurri Dumfries on his return",
      "url": "https://www.milannews.it/l-avversario/tra-un-mese-milan-inter-le-parole-del-nerazzurro-dumfries-sul-suo-rientro-606953",
      "source": "milannews.it",
      "date": "2026-02-10T09:36:02+00:00",
      "summary": "In exactly one month, on the weekend of March 8, Milan will face Inter in a derby that already promises to be very heated and which could say a lot about the season of both teams, especially s ..."
    },
    {
      "id": "174e651f3e15",
      "title": "Tuttosport: ‘Operation Kean’ – Milan outline strategy to land striker Allegri sees as perfect",
      "url": "https://sempremilan.com/operation-kean-milan-strategy-allegri-perfect",
      "source": "sempremilan.com",
      "date": "2026-02-10T09:25:00+00:00",
      "summary": "We may be a few months away from the transfer window reopening, but AC Milan are already plotting their attempt for Moise Kean. Milan came very close to signing the striker for the future towards the end of the winter mercato. Jean-Philippe Mateta looked all set to be joining, but the move collapsed"
    },
    {
      "id": "79fcc69dccd2",
      "title": "Nkunku lifts lid on initial difficulties at Milan, exit rumours, team-mates and desire to win",
      "url": "https://sempremilan.com/nkunku-difficulties-milan-exit-rumours-win",
      "source": "sempremilan.com",
      "date": "2026-02-10T09:00:00+00:00",
      "summary": "Christopher Nkunku has revealed his love for AC Milan, and also shed some light on why he encountered difficulties at first. Nkunku was the last signing that Milan made in the summer transfer window and the management chose to invest heavily in him, agreeing a deal with Chelsea widely reported to be"
    },
    {
      "id": "b6f8fecb873b",
      "title": "Alphadjo Cissè insight: Background, strengths, weaknesses and tactical fit",
      "url": "https://sempremilan.com/alphadjo-cisse-insight-scouting-report-milan",
      "source": "sempremilan.com",
      "date": "2026-02-09T19:48:37+00:00",
      "summary": "The winter transfer window ended up being a quiet one for AC Milan after an initial flurry, but one signing might go under the radar: Alphadjo Cissè. The big news concerning the first team in the mid-season mercato was the signing of Niclas Füllkrug from West Ham United on loan with option to buy, o"
    },
    {
      "id": "f91d10c378fd",
      "title": "‘A bit grotesque’ – Journalist breaks down timeline of Mateta to Milan saga",
      "url": "https://sempremilan.com/schira-breaks-down-timeline-mateta-milan-saga",
      "source": "sempremilan.com",
      "date": "2026-02-09T18:30:00+00:00",
      "summary": "Journalist Nicolo Schira has provided a detailed breakdown of exactly what happened in the Jean-Philippe Mateta saga. On the penultimate day of the winter window on February 1, multiple reliable sources stated that Milan and Crystal Palace had agreed a deal worth €30-35m for Mateta, the striker that"
    },
    {
      "id": "1d5d3d04dd95",
      "title": "Reports: Saelemaekers set to miss Pisa game after further MRI scan – the situation",
      "url": "https://sempremilan.com/saelemaekers-miss-pisa-mri-scan-situation",
      "source": "sempremilan.com",
      "date": "2026-02-09T18:02:10+00:00",
      "summary": "There were hopes that Alexis Saelemaekers could recover in time to face Pisa on Friday night, but the chances seem to have faded. According to MilanNews, the signs from training at Milanello today are that Christian Pulisic should be called up by Massimiliano Allegri in Pisa. Rafael Leao will be the"
    },
    {
      "id": "be67e20f950c",
      "title": "The odd one out: Estupinan immune to Allegri’s cure as question marks grow",
      "url": "https://sempremilan.com/estupinan-immune-to-allegri-cure-questions",
      "source": "sempremilan.com",
      "date": "2026-02-09T17:38:22+00:00",
      "summary": "Massimiliano Allegri is gradually getting more and more contributions from the summer signings, but there is one outlier. Milan’s squad is not a deep one after the cull that took place ahead of the season, and while some of the new additions – Luka Modric and Adrien Rabiot, above all – hit the groun"
    },
    {
      "id": "4c29e890bc21",
      "title": "TMW: Following Comotto’s path – enquiries arrive with Milan talent ready for next step",
      "url": "https://sempremilan.com/sala-comotto-path-enquiries-serie-b",
      "source": "sempremilan.com",
      "date": "2026-02-09T17:00:00+00:00",
      "summary": "Emanuele Sala is continuing his development with Milan Futuro, and his performances this season have attracted some interest. As TMW report, the 18-year-old – who signed a renewal on his birthday – is making a name for himself with Milan Futuro in Serie D under Massimo Oddo. His excellent performanc"
    },
    {
      "id": "bab1c884a3e7",
      "title": "CM: First-team plans to consecutive exclusions – Milan watching Max Ibrahimovic closely at Ajax",
      "url": "https://sempremilan.com/milan-watching-max-ibrahimovic-closely-ajax",
      "source": "sempremilan.com",
      "date": "2026-02-09T16:30:00+00:00",
      "summary": "AC Milan are keeping an eye on Maximilian Ibrahimovic’s time at Ajax, given that some money rests on the option to buy. As Calciomercato.com recall, Ibrahimovic introduced himself as a new Ajax player on January 14, stating: “I’m an independent player, and I want to write my own story. I feel good. "
    },
    {
      "id": "5451e22bee5a",
      "title": "CM: A familiar feeling – Bennacer sidelined again with €10m move in doubt",
      "url": "https://sempremilan.com/bennacer-sidelined-again-10m-dinamo-doubt",
      "source": "sempremilan.com",
      "date": "2026-02-09T16:00:00+00:00",
      "summary": "Ismael Bennacer has suffered a setback which puts his potential permanent move to Dinamo Zagreb in even more dought. In the summer window, Bennacer returned from Marseille who chose not to use their option to buy, but he didn’t remain for long. He again left Milan to move on loan to Dinamo Zagreb, w"
    },
    {
      "id": "01ca9ebf4d55",
      "title": "Report: Milan’s January signing Cissè suffers untimely blow – prolonged absence expected",
      "url": "https://sempremilan.com/alphadjo-cisse-untimely-blow-prolonged-absence",
      "source": "sempremilan.com",
      "date": "2026-02-09T15:30:00+00:00",
      "summary": "Some bad news has arrived for AC Milan’s January signing Alphadjo Cisse, who could be forced to sit out most of the rest of the season. Milan officially confirmed the signing of Cissè on a permanent deal from Hellas Verona on deadline day for the winter window. As part of the deal, it was also annou"
    },
    {
      "id": "955d1212b6f4",
      "title": "Sky: Leao back, Pulisic better, more tests for Saelemaekers – the latest from Milanello",
      "url": "https://sempremilan.com/leao-pulisic-saelemaekers-tests-latest-milanello",
      "source": "sempremilan.com",
      "date": "2026-02-09T15:00:00+00:00",
      "summary": "The AC Milan squad were once again at Milanello on Monday, as preparations continue for Friday night’s game in Pisa. According to what is being reported by Sky (via MilanNews), Milan had a double session today at Milanello. The team did some work in the gym this morning and training on one of the pi"
    },
    {
      "id": "44a1e116e494",
      "title": "‘A fantastic transfer window’ – Di Marzio explains why Milan’s management deserve praise",
      "url": "https://sempremilan.com/di-marzio-milan-fantastic-window-praise",
      "source": "sempremilan.com",
      "date": "2026-02-09T14:34:09+00:00",
      "summary": "Gianluca Di Marzio believes that AC Milan did fantastic business in the window, largely because they were able to complete Mike Maignan’s renewal. A week has already passed since the winter transfer window closed, and it’s time to take stock of things. Milan acquired a striker for the present in Nic"
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    },
    {
      "id": "0bbe5dfeba4c",
      "title": "Milan vs. Como postponed for 2026 Winter Olympics opening ceremony: when will it be played?",
      "url": "https://football-italia.net/milan-vs-como-postponed-2026-olympics-when/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:59:54+00:00",
      "summary": "With the Stadio Meazza in San Siro unavailable for the 2026 Winter Olympics opening ceremony,..."
    },
    {
      "id": "7c148df4d4cd",
      "title": "Glasner opens up on Mateta’s failed Milan medical: ‘It wasn’t a big surprise’",
      "url": "https://football-italia.net/glasner-on-matetas-failed-milan-medical/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:55:13+00:00",
      "summary": "Crystal Palace head coach Oliver Glasner has admitted that ‘it wasn’t a big big surprise’..."
    },
    {
      "id": "c10c6a922ef6",
      "title": "San Siro’s last dance at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/san-siro-last-dance-winter-olympics-ceremony/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:23:58+00:00",
      "summary": "The opening ceremony of the 2026 Milan Cortina Winter Olympics will take place today at..."
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    }
  ]
}