{
  "lastUpdated": "2026-02-20T11:31:02.183784+00:00",
  "articles": [
    {
      "id": "63a3114676fb",
      "title": "Reports: Derby in doubt for Inter captain Lautaro due to calf strain – the latest",
      "url": "https://sempremilan.com/derby-doubt-inter-lautaro-calf-strain",
      "source": "sempremilan.com",
      "date": "2026-02-20T11:30:00+00:00",
      "summary": "Inter could be without their captain and talisman Lautaro Martinez for the derby next month, according to reports. Inter’s Champions League trip to Norway on Wednesday wasn’t just a disaster because of the result (the Nerazzurri lost 3-1 to Bodo/Glimt) but also because Lautaro Martinez was injured, "
    },
    {
      "id": "2429feaca628",
      "title": "From Allegri's expulsion to Van der Brempt's missed red card: a certain irritation filters through Casa Milan over the refereeing in the match against Como",
      "url": "https://www.milannews.it/news/dall-espulsione-di-allegri-al-mancato-rosso-a-van-der-brempt-da-casa-milan-filtra-una-certa-irritazione-per-l-arbitraggio-nel-match-contro-il-como-608097",
      "source": "milannews.it",
      "date": "2026-02-20T11:21:19+00:00",
      "summary": "Mariani's referee in the match against Como felt some irritation at Casa Milan."
    },
    {
      "id": "13a650435479",
      "title": "Impallomeni rejects Milan: \"He doesn't have continuity to bother Inter\"",
      "url": "https://www.milannews.it/news/impallomeni-boccia-il-milan-non-ha-continuita-per-dar-fastidio-all-inter-608045",
      "source": "milannews.it",
      "date": "2026-02-20T11:11:00+00:00",
      "summary": "Stefano Impallomeni, on TMW Radio, spoke about Milan and responded to the question as to whether the Rossoneri could still bother Inter for the Scudetto: \"No, because they don't have the continuity to bother In..."
    },
    {
      "id": "d3663991af98",
      "title": "GdS: Milan feared season-ending injury for Pavlovic which sparked fury",
      "url": "https://sempremilan.com/milan-feared-season-ending-injury-pavlovic",
      "source": "sempremilan.com",
      "date": "2026-02-20T11:05:00+00:00",
      "summary": "AC Milan had strong fears that they would lose Strahinja Pavlovic for the rest of the season after what happened against Como. There has been a lot of attention drawn towards the challenge made by Van der Brempt in the first half of Milan’s draw against Como on Wednesday night. Not even a card was ["
    },
    {
      "id": "eb2263538c0c",
      "title": "Gabbia's energy after Milan-Como: \"Now more than ever, all together\"",
      "url": "https://www.milannews.it/news/la-carica-di-gabbia-dopo-milan-como-ora-piu-che-mai-tutti-insieme-607954",
      "source": "milannews.it",
      "date": "2026-02-20T11:01:00+00:00",
      "summary": "Only 1-1 for Milan against Como. With this bittersweet draw, the Rossoneri see Inter extend their lead at the top of the table, the Nerazzurri are now at +7."
    },
    {
      "id": "3c425ca297d9",
      "title": "29 trophies in 31 years, but which victory was Berlusconi most attached to? Galliani: \"The night of the Champions Cup final with Steaua, I've never seen him so happy again\"",
      "url": "https://www.milannews.it/gli-ex/29-trofei-in-31-anni-ma-qual-e-la-vittoria-a-cui-era-piu-legato-berlusconi-galliani-la-notte-della-finale-di-coppa-dei-campioni-con-la-steaua-mai-piu-608071",
      "source": "milannews.it",
      "date": "2026-02-20T10:50:33+00:00",
      "summary": "In the long interview given to Corriere della Sera, Adriano Galliani, former Rossoneri CEO, said: \"When was Silvio Berlusconi's Milan born? On 1 July 1987 because in the previous season there was a coach, Li ..."
    },
    {
      "id": "6a05de106b1c",
      "title": "Leao says: \"Inter wanted me, but I wasn't convinced. The following year Milan called me and...\"",
      "url": "https://www.milannews.it/news/leao-racconta-mi-voleva-l-inter-ma-non-ero-convinto-l-anno-dopo-mi-chiamo-il-milan-e-608084",
      "source": "milannews.it",
      "date": "2026-02-20T10:40:58+00:00",
      "summary": "Rafael Leao made these statements to CBS Sports in the new episode of \"Kickin' It\": \n\nOn the call from Milan: \"Inter telephoned the sporting director of Lille, saying they were interested in m ..."
    },
    {
      "id": "1b18114ff460",
      "title": "Galliani reveals how Berlusconi bought Milan, his proudest moments and why he feels ‘lucky’",
      "url": "https://sempremilan.com/galliani-berlusconi-proudest-moments-lucky",
      "source": "sempremilan.com",
      "date": "2026-02-20T10:40:00+00:00",
      "summary": "February 20th is a day for celebrating Silvio Berlusconi’s time as AC Milan owner, and Adriano Galliani has revealed som brilliant anecdotes. On this day in 1986, the Berlusconi era at Milan began. He took over a club on the brink of bankruptcy that had spent time in Serie B into the best team in […"
    },
    {
      "id": "6462d01ead3b",
      "title": "Inter, soleus muscle strain for Lautaro Martinez",
      "url": "https://www.milannews.it/news/inter-risentimento-muscolare-al-soleo-per-lautaro-martinez-608093",
      "source": "milannews.it",
      "date": "2026-02-20T10:37:37+00:00",
      "summary": "Lautaro Martinez, the Inter striker who will face Milan in the derby on 7 or 8 February, was injured during the last Champions League match which the Nerazzurri lost 3-1 against Bodo/Glimt."
    },
    {
      "id": "3ff86825b172",
      "title": "Paolo Berlusconi remembers Silvio: \"The purchase of Milan was an affair of the heart\"",
      "url": "https://www.milannews.it/gli-ex/paolo-berlusconi-ricorda-silvio-l-acquisto-del-milan-fu-un-affare-di-cuore-608078",
      "source": "milannews.it",
      "date": "2026-02-20T10:30:00+00:00",
      "summary": "To commemorate Silvio Berlusconi's acquisition of Milan, 40 years ago, today's edition of Corriere dello Sport interviewed his brother, Paolo, who recalled the first days: \"It was an affair of the heart."
    },
    {
      "id": "5c4da726a547",
      "title": "Baresi on his health conditions: \"I'm fine. I've started attending the San Siro again and it's already a good step forward\"",
      "url": "https://www.milannews.it/news/baresi-sulle-sue-condizioni-di-salute-sto-benino-ho-ripreso-a-frequentare-san-siro-ed-e-gia-un-bel-passo-avanti-608080",
      "source": "milannews.it",
      "date": "2026-02-20T10:20:42+00:00",
      "summary": "Franco Baresi, the great former Rossoneri captain and current honorary vice-president of Milan, gave a long interview to Il Giornale in which he also spoke about his health conditions: \"How am I? Good, come on."
    },
    {
      "id": "525d10716578",
      "title": "Moretto: ‘Significant developments’ expected – Milan hold discussions over key renewal",
      "url": "https://sempremilan.com/moretto-milan-discussions-key-renewal",
      "source": "sempremilan.com",
      "date": "2026-02-20T10:15:00+00:00",
      "summary": "It seems to be renewal season at AC Milan currently, and Fikayo Tomori could well be the next to put pen to paper on a new deal. Tomori had been inconsistent since the 2021-22 Scudetto-winning campaign, but under Massimiliano Allegri he has found himself a key pillar of the three-man defence, and hi"
    },
    {
      "id": "eb3874c5f374",
      "title": "Leao: \"As a center forward I can score more goals. The derby is life or death and I want to live\"",
      "url": "https://www.milannews.it/primo-piano/leao-da-centravanti-posso-fare-piu-gol-il-derby-e-vita-o-morte-e-io-voglio-vivere-608083",
      "source": "milannews.it",
      "date": "2026-02-20T10:10:50+00:00",
      "summary": "Rafael Leao spoke thus to CBS Sports in the new episode of \"Kickin' It\": \n\nOn the call from Milan: \"Inter phoned the sporting director of Lille, saying they were interested in me."
    },
    {
      "id": "1d105e09ce4c",
      "title": "Tuttosport on Milan: \"Pavlovic knocked out, Rossoneri annoyed\"",
      "url": "https://www.milannews.it/news/tuttosport-sul-milan-pavlovic-ko-rossoneri-infastiditi-608077",
      "source": "milannews.it",
      "date": "2026-02-20T10:00:10+00:00",
      "summary": "Today's edition of Tuttosport headlines this morning on Milan: \"Pavlovic knocked out, Rossoneri annoyed\"."
    },
    {
      "id": "49116ff9531a",
      "title": "Confalonieri remembers Berlusconi: \"No one expected the triumphal ride that lasted 30 years\"",
      "url": "https://www.milannews.it/gli-ex/confalonieri-ricorda-berlusconi-nessuno-si-aspettava-la-cavalcata-trionfale-durata-30-anni-608073",
      "source": "milannews.it",
      "date": "2026-02-20T09:50:00+00:00",
      "summary": "Fedele Confalonieri, Silvio Berlusconi's trusted man, interviewed in today's edition of Corriere dello Sport, recalled the great journey of the Rossoneri club: \"At the beginning we began to dream of achieving great ..."
    },
    {
      "id": "7402c00dd9aa",
      "title": "‘Turn all my dreams into reality’ – Baresi explains how Berlusconi transformed AC Milan",
      "url": "https://sempremilan.com/baresi-how-berlusconi-transformed-ac-milan",
      "source": "sempremilan.com",
      "date": "2026-02-20T09:50:00+00:00",
      "summary": "The 20th of February is a special date in AC Milan history, and Franco Baresi has explained exactly why. Indeed, it is on this very date 40 years ago that Silvio Berlusconi completed the purchase of Milan. It was the beginning of a tenure that spanned until April 2017, during which he transformed th"
    },
    {
      "id": "af6a9b4377e0",
      "title": "How did Silvio Berlusconi end up buying Milan? The story of Adriano Galliani",
      "url": "https://www.milannews.it/gli-ex/come-e-arrivato-silvio-berlusconi-ad-acquistare-il-milan-il-racconto-di-adriano-galliani-608068",
      "source": "milannews.it",
      "date": "2026-02-20T09:38:08+00:00",
      "summary": "In the long interview given to Corriere della Sera, Adriano Galliani, former Rossoneri CEO, recalled 20 February 1986, the day in which Silvio Berlusconi officially became the new owner of Milan: \"How did he ..."
    },
    {
      "id": "66f413039db2",
      "title": "Gazzetta: \"Leao doesn't give up on his championship dream: 'The championship is a marathon'\"",
      "url": "https://www.milannews.it/news/gazzetta-leao-non-rinuncia-al-sogno-scudetto-il-campionato-e-una-maratona-608075",
      "source": "milannews.it",
      "date": "2026-02-20T09:28:03+00:00",
      "summary": "\"Leao does not give up on the championship dream: 'The championship is a marathon'\": this is the headline from La Gazzetta dello Sport this morning regarding the message published in recent hours on social media by Rafael Leao who clarified that he ..."
    },
    {
      "id": "60a4e5005cb3",
      "title": "Leao lifts lid on call with Maldini, time at Milan, new role, body language and derby vs. Inter",
      "url": "https://sempremilan.com/leao-maldini-milan-body-language-inter",
      "source": "sempremilan.com",
      "date": "2026-02-20T09:25:00+00:00",
      "summary": "Rafael Leao has revealed details about how his move to AC Milan came about, what Zlatan Ibrahimovic is really like and how he feels in his new role. Leao is having somewhat of a strange season so far it would be fair to say. He was held back by a calf injury that he sustained […]\nThe post Leao lifts"
    },
    {
      "id": "23d1789a58d3",
      "title": "February 20, 1986, 40 years of King Silvio: how many stars and trophies",
      "url": "https://www.milannews.it/news/20-febbraio-1986-40-anni-da-re-silvio-quante-stelle-e-trofei-608069",
      "source": "milannews.it",
      "date": "2026-02-20T09:20:00+00:00",
      "summary": "A memorable date for the Milan world: on 20 February 1986, in fact, the Silvio Berlusconi era began."
    },
    {
      "id": "dd5c7ce4637e",
      "title": "Galliani and his relationship with Allegri: \"What if I support Max? What's more, we spent Valentine's evening together...\"",
      "url": "https://www.milannews.it/gli-ex/galliani-e-il-rapporto-con-allegri-se-io-tifo-per-max-di-piu-abbiamo-passato-insieme-la-sera-di-san-valentino-608063",
      "source": "milannews.it",
      "date": "2026-02-20T09:08:34+00:00",
      "summary": "On the day that marks the 40th anniversary of Silvio Berlusconi purchasing Milan (20 February 1986), Adriano Galliani gave a long interview to Corriere della Sera in which he said that the former Rossoneri president ..."
    },
    {
      "id": "34204e1d257f",
      "title": "Milan calls the AIA: \"No more mistakes\". Here are the disputed refereeing episodes",
      "url": "https://www.milannews.it/primo-piano/il-milan-telefona-all-aia-basta-errori-ecco-gli-episodi-arbitrali-contestati-608079",
      "source": "milannews.it",
      "date": "2026-02-20T09:00:06+00:00",
      "summary": "Wednesday's recovery against Como caused a lot of irritation at Casa Milan."
    },
    {
      "id": "a71ffd8cb05b",
      "title": "GdS: Pavlovic, Fabregas and many other errors – Milan ‘make themselves heard’ with AIA call",
      "url": "https://sempremilan.com/milan-make-themselves-heard-with-aia-call",
      "source": "sempremilan.com",
      "date": "2026-02-20T09:00:00+00:00",
      "summary": "AC Milan have made a call to the Italian Refereeing Association to let them know that they are furious with the amount of errors against them. La Gazzetta dello Sport report that the call was made one day after Milan-Como, amid anger over Strahinja Pavlovic’s injury. The defender received studs on h"
    },
    {
      "id": "89ed2c349111",
      "title": "Milan, Pavlovic out against Parma: the hope is to have him back on March 1st in Cremona",
      "url": "https://www.milannews.it/rassegna-stampa/milan-pavlovic-out-contro-il-parma-la-speranza-e-di-riaverlo-il-1-marzo-a-cremona-608062",
      "source": "milannews.it",
      "date": "2026-02-20T08:49:24+00:00",
      "summary": "The injury suffered by Strahinja Pavlovic against Como after a terrible foul by Van der Brempt is fortunately less serious than expected: the tests he underwent yesterday in fact ruled out injuries, but it is still ..."
    },
    {
      "id": "f20c90552d59",
      "title": "Milan, sigh of relief for Pavlovic. CorSport: \"Just a strong bruise\"",
      "url": "https://www.milannews.it/news/milan-sospiro-di-sollievo-per-pavlovic-il-corsport-solo-una-forte-contusione-608066",
      "source": "milannews.it",
      "date": "2026-02-20T08:40:00+00:00",
      "summary": "Sigh of relief for Milan and for Pavlovic, after the injury during the match against Como: \"Only a strong bruise\", headlines today's edition of Corriere dello Sport."
    },
    {
      "id": "46350e123f0a",
      "title": "Today’s Papers – Furious Milan, McTominay’s ‘soft football’",
      "url": "https://football-italia.net/todays-papers-furious-milan-mctominay-soft/",
      "source": "football-italia.net",
      "date": "2026-02-20T08:34:08+00:00",
      "summary": "La Gazzetta dello Sport Furious Milan The club is irritated with the referees, call to..."
    },
    {
      "id": "e9bdf8ce4b09",
      "title": "CorSera headline: \"Poco Allegri if Fabregas is there\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-corsera-titola-poco-allegri-se-c-e-fabregas-608074",
      "source": "milannews.it",
      "date": "2026-02-20T08:29:12+00:00",
      "summary": "The Corriere della Sera on newsstands today has the headline: \"Little Allegri if Fabregas is there\"."
    },
    {
      "id": "386b1b9a00f1",
      "title": "Galliani remembers Berlusconi: \"He was an extraordinary motivator. If I had to compare him to a footballer it would be Pelè\"",
      "url": "https://www.milannews.it/rassegna-stampa/galliani-ricorda-berlusconi-era-uno-straordinario-motivatore-se-lo-dovessi-paragonare-a-un-calciatore-sarebbe-pele-608067",
      "source": "milannews.it",
      "date": "2026-02-20T08:19:39+00:00",
      "summary": "In the long interview given to Corriere della Sera, Adriano Galliani, former Rossoneri CEO, recalled 20 February 1986, the day in which Silvio Berlusconi officially became the new owner of Milan: \"How did he ..."
    },
    {
      "id": "69ca8cc56c24",
      "title": "GdS: ‘Jashari like Modric’ – €34m man showing signs of massive potential",
      "url": "https://sempremilan.com/jashari-like-modric-signs-of-potential",
      "source": "sempremilan.com",
      "date": "2026-02-19T19:30:00+00:00",
      "summary": "Since joining AC Milan, Ardon Jashari has not had it easy. An injury stopped his season, and then he has been limited for minutes. However, he has not given up.  Many would have struggled if they were given the cards that Jashari was dealt. Ultimately, the youngster has had it tough for a player who"
    },
    {
      "id": "5c375aee8cdc",
      "title": "AC Milan 1-1 Como: Five things we learned – dreams fade, a star shines and a rivalry is born",
      "url": "https://sempremilan.com/ac-milan-1-1-como-five-things-we-learned",
      "source": "sempremilan.com",
      "date": "2026-02-19T19:00:00+00:00",
      "summary": "AC Milan’s faint title hopes are hanging by a thread after they were forced to come from behind to earn a 1-1 draw against Como. Milan’s game at San Siro on Wednesday night was their first at home in exactly one month, and it was a hotly anticipated rematch after the 3-1 victory in Como […]\nThe post"
    },
    {
      "id": "a2c302f03c7b",
      "title": "TMW: Milan beaten by Dortmund to Brazilian starlet – the latest",
      "url": "https://sempremilan.com/milan-beaten-by-dortmund-brazilian-starlet",
      "source": "sempremilan.com",
      "date": "2026-02-19T18:30:00+00:00",
      "summary": "AC Milan made an approach for young full-back Kaua Prates in the winter mercato, but they have been beaten to his signing by Borussia Dortmund.  In the past month, Milan took a look at a number of impressive young talents, with the intention of strengthening the Futuro set-up. Indeed, it has since b"
    },
    {
      "id": "2e2b8b55e6a6",
      "title": "Why Fabregas cannot be punished with video evidence after Milan 1-1 Como",
      "url": "https://football-italia.net/why-fabregas-cannot-be-punished-video-evidence/",
      "source": "football-italia.net",
      "date": "2026-02-19T18:02:36+00:00",
      "summary": "Many were calling for video evidence to be used in punishing Como coach Cesc Fabregas..."
    },
    {
      "id": "67ea6b5c6432",
      "title": "TMW: Tom Brady, Olympic stars and Gattuso – San Siro hosts several famous faces",
      "url": "https://sempremilan.com/tom-brady-olympic-stars-gattuso-san-siro",
      "source": "sempremilan.com",
      "date": "2026-02-19T18:00:00+00:00",
      "summary": "It is nothing new for San Siro to host celebrities, and for the game between AC Milan and Como, there were several notable faces in attendance.  For many, San Siro is a box office stadium to attend once in their life, and with the recent news about its closure, a new stadium is to be […]\nThe post TM"
    },
    {
      "id": "3589546d74c3",
      "title": "CorSport: Milan in the hands of the best – Allegri’s experience crucial to this moment",
      "url": "https://sempremilan.com/milan-in-hands-of-the-best-allegri-experience",
      "source": "sempremilan.com",
      "date": "2026-02-19T17:30:00+00:00",
      "summary": "Whilst it may not feel positive for AC Milan currently, they can have faith that Massimiliano Allegri will guide them through this moment successfully. At this moment, it is difficult to see Milan having an exciting end to the season. They are seven points clear in the Champions League places, but t"
    },
    {
      "id": "d4a68d83fb78",
      "title": "First meeting to press room row: How Allegri-Fabregas tension arose",
      "url": "https://sempremilan.com/how-allegri-fabregas-tension-arose",
      "source": "sempremilan.com",
      "date": "2026-02-19T17:00:00+00:00",
      "summary": "Seeing a rivalry develop in real time is something strange, and with AC Milan manager Massimiliano Allegri and Como’s coach Cesc Fabregas, it is happening.  After the latest game, it cannot be denied that Fabregas and Allegri are rivals. The dislike is clear, and it has largely been one-sided, if no"
    },
    {
      "id": "d552387df9a2",
      "title": "GdS: ‘A sigh of relief’ – Pavlovic will not face long absence after avoiding fracture",
      "url": "https://sempremilan.com/pavlovic-not-face-long-absence-avoid-fracture",
      "source": "sempremilan.com",
      "date": "2026-02-19T16:30:00+00:00",
      "summary": "AC Milan sighed last night when Strahinja Pavlovic was forced to be subbed off at half-time, and it seemed serious. However, tests, thankfully, show otherwise.  In recent years, Milan have been seriously unlucky with injuries, and this season has been no different. Perhaps it can be argued that they"
    },
    {
      "id": "aa3ccea1bb99",
      "title": "Watch: Leao’s lob sees Milan extend unbeaten run with draw vs. Como – the highlights",
      "url": "https://sempremilan.com/highlights-from-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T16:00:00+00:00",
      "summary": "AC Milan managed to salvage a draw yesterday against Como, after the visitors took the lead in the first half. Offensively speaking, it was one of the worst Milan performances of the season at San Siro, as they managed less than 1 xG. Nevertheless, they still got a result, being effective, even if t"
    },
    {
      "id": "88f321aefd9b",
      "title": "Milan team news: Boost as Pavlovic tests reveal no fracture",
      "url": "https://football-italia.net/milan-team-news-boost-as-pavlovic-tests/",
      "source": "football-italia.net",
      "date": "2026-02-19T15:39:58+00:00",
      "summary": "Milan will breathe a sigh of relief this morning, after medical examinations revealed that Strahinja..."
    },
    {
      "id": "27873a4bfc49",
      "title": "‘Its not about sprints, it’s a marathon’ – Milan players react after disappointing Como draw",
      "url": "https://sempremilan.com/players-react-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T15:30:00+00:00",
      "summary": "AC Milan were forced to settle for a draw against Como on Wednesday night, and some of the team have posted messages about the result.  It is a game where Milan can look back with some allowance. After all, they keep their unbeaten run whilst being far from their best, while their Head-To-Head recor"
    },
    {
      "id": "7cb100489dc6",
      "title": "When coaches get involved: Milan rightly furious after Chivu and Fabregas incidents",
      "url": "https://sempremilan.com/milan-rightly-furious-chivu-fabregas",
      "source": "sempremilan.com",
      "date": "2026-02-19T15:00:00+00:00",
      "summary": "This season, AC Milan have been subjected to a few occasions where managers have been wrongly involved in games, yet nothing has ever been done with it.  Last night’s involvement from Cesc Fabregas brings up an uneasy question again, why are Milan the victims of coaches getting involved in games. If"
    },
    {
      "id": "61851f5fc6dd",
      "title": "Hauge refers to Inter clash as ‘the derby’ and admits ‘special meaning’: “Always nice”",
      "url": "https://sempremilan.com/hauge-refers-to-inter-clash-as-the-derby-special-meaning",
      "source": "sempremilan.com",
      "date": "2026-02-19T14:30:00+00:00",
      "summary": "Jens Petter Hauge never really hit the levels that AC Milan hoped for, but the Norwegian winger still keeps the club close to his heart. After leaving Milan, the young winger has gone on to have a pretty decent interesting career. Of course, the initial hopes were that he would be a key figure for ["
    },
    {
      "id": "acb2506abbea",
      "title": "Jashari’s arrival and xG lows: All the key stats from Milan 1-1 Como",
      "url": "https://sempremilan.com/all-the-key-stats-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T14:00:00+00:00",
      "summary": "AC Milan were held to a 1-1 draw by Como at San Siro on Wednesday night, here are some of the key stats from the game.  It was certainly not a game to shout about from a Milan perspective. In fact, it was a game to forget. From poor officiating to the goal conceded, the […]\nThe post Jashari’s arriva"
    },
    {
      "id": "99590206d996",
      "title": "Longoni: ‘Milan barely manage to win’ – Scudetto dream is over for the Rossoneri this season",
      "url": "https://sempremilan.com/barely-manage-win-scudetto-dream-over-for-milan",
      "source": "sempremilan.com",
      "date": "2026-02-19T13:35:00+00:00",
      "summary": "This season, AC Milan have been in the Scudetto fight, but they have often been their own downfall, rather than anyone else damaging them.  It has been a while since Milan last lost, yet, despite that feeling, they are not sitting at the top of the table, as many would expect. Indeed, despite losing"
    },
    {
      "id": "d1035a3b77cf",
      "title": "Video: Fabregas’ shirt tug and touchline confrontation with Allegri",
      "url": "https://football-italia.net/fabregas-shirt-tug-touchline-clash-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-19T12:02:33+00:00",
      "summary": "Watch how Cesc Fabregas pulled the shirt of Alexis Saelemaekers and how Milan coach Massimiliano..."
    },
    {
      "id": "8e22ac8839a0",
      "title": "What Allegri told Fabregas in heated post-match clash: ‘You are a kid’",
      "url": "https://football-italia.net/what-allegri-told-fabregas-kid-milan-como/",
      "source": "football-italia.net",
      "date": "2026-02-19T09:09:48+00:00",
      "summary": "More details emerge about the confrontation between Milan coach Massimiliano Allegri and Como’s Cesc Fabregas..."
    },
    {
      "id": "d3f0ece0dd15",
      "title": "Today’s Papers – Bodo shaming, Italy cry, Leao saves Milan",
      "url": "https://football-italia.net/today-papers-bodo-shaming-italy-cry-leao-milan/",
      "source": "football-italia.net",
      "date": "2026-02-19T08:42:54+00:00",
      "summary": "La Gazzetta dello Sport Inter, three slaps But they are still +7 in Serie A...."
    },
    {
      "id": "f24c9ac03bd7",
      "title": "Allegri and Fabregas bad blood after Como coach ‘unsporting behaviour’",
      "url": "https://football-italia.net/allegri-fabregas-bad-blood-como-unsporting/",
      "source": "football-italia.net",
      "date": "2026-02-18T23:07:22+00:00",
      "summary": "There is bad blood between Max Allegri and Cesc Fabregas, as they had another row..."
    },
    {
      "id": "60f4f709567f",
      "title": "Leao and Jashari believe Milan ‘played better’ than in victory over Como",
      "url": "https://football-italia.net/leao-jashari-believe-milan-played-better-como/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:53:55+00:00",
      "summary": "Rafael Leao and Ardon Jashari argue Milan ‘played better’ in their 1-1 draw than they..."
    },
    {
      "id": "0886a97f78fb",
      "title": "Allegri: ‘A valuable Milan point, Fabregas fouled Saelemaekers’",
      "url": "https://football-italia.net/allegri-valuable-milan-point-fabregas-fouled/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:34:39+00:00",
      "summary": "Max Allegri insists Milan must see the 1-1 draw with Como as ‘a valuable point’..."
    },
    {
      "id": "72872cf860f0",
      "title": "Fabregas: ‘Como proud of 1-1 Milan draw, apology for Allegri’ row",
      "url": "https://football-italia.net/fabregas-como-proud-of-1-1-milan-draw-apology/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:19:36+00:00",
      "summary": "Cesc Fabregas apologised for his touchline row with Max Allegri, but was ‘very proud’ of..."
    },
    {
      "id": "d7ed67655616",
      "title": "Serie A | Milan 1-1 Como: Leao magic rescues Maignan howler",
      "url": "https://football-italia.net/serie-a-milan-1-1-como-leao-magic-save-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-18T21:46:39+00:00",
      "summary": "Rafael Leao’s remarkable lob cancelled out a Mike Maignan howler on Nico Paz, as Milan..."
    },
    {
      "id": "f3ddcbad229c",
      "title": "Serie A and UCL Liveblog: Milan vs. Como and Bodo/Glimt vs. Inter",
      "url": "https://football-italia.net/serie-a-ucl-liveblog-milan-como-bodo-inter/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:45:19+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "1c9558aed7a3",
      "title": "Tare shrugs off Milan Scudetto talk, reassuring news on Leao",
      "url": "https://football-italia.net/tare-shrugs-off-milan-scudetto-reassuring-leao/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:33:33+00:00",
      "summary": "Milan director Igli Tare shrugs off Scudetto talk ahead of tonight’s rescheduled clash with Como..."
    },
    {
      "id": "383f8ba5a703",
      "title": "Fabregas hint at Como False 9 experiment ‘to hurt Milan’",
      "url": "https://football-italia.net/fabregas-hint-at-como-false-9-experiment-milan/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:25:43+00:00",
      "summary": "Cesc Fabregas gives hints who is playing False 9 for Como this evening against Milan,..."
    },
    {
      "id": "740924179509",
      "title": "Serie A official Week 24 line-ups: Milan vs. Como",
      "url": "https://football-italia.net/serie-a-official-wk-24-line-ups-milan-vs-como/",
      "source": "football-italia.net",
      "date": "2026-02-18T18:39:09+00:00",
      "summary": "Milan have Rafael Leao and Christopher Nkunku upfront for the rescheduled Serie A clash with..."
    },
    {
      "id": "480f0a07090d",
      "title": "Milan optimistic over one-year Modric extension",
      "url": "https://football-italia.net/milan-optimistic-over-modric-extension/",
      "source": "football-italia.net",
      "date": "2026-02-18T17:17:48+00:00",
      "summary": "Milan are working hard to sign Luka Modric to a new one-year contract extension, after..."
    },
    {
      "id": "6dc5a25930b4",
      "title": "Milan team news: Loftus-Cheek set to miss Como clash; Nkunku to start instead",
      "url": "https://football-italia.net/milan-team-news-loftus-cheek-como-nkunku/",
      "source": "football-italia.net",
      "date": "2026-02-18T15:19:36+00:00",
      "summary": "Milan are preparing to host Como at San Siro this evening, as the Rossoneri look..."
    },
    {
      "id": "3ecccc1bff44",
      "title": "Why is Milan vs. Como the only Serie A match being played on Wednesday?",
      "url": "https://football-italia.net/why-is-milan-como-being-played-on-wednesday/",
      "source": "football-italia.net",
      "date": "2026-02-18T14:08:50+00:00",
      "summary": "Milan are due to take on Como in Serie A on Sunday evening, the only..."
    },
    {
      "id": "eb060911f496",
      "title": "Italy’s extra Champions League spot fades away after Juventus and Atalanta losses",
      "url": "https://football-italia.net/italys-extra-champions-league-spot-fades-away/",
      "source": "football-italia.net",
      "date": "2026-02-18T13:33:42+00:00",
      "summary": "Italy’s chances of receiving an extra spot in next season’s Champions League were dealt another..."
    },
    {
      "id": "6e8ccb197068",
      "title": "Official: Bologna sign Milan midfielder on permanent basis",
      "url": "https://football-italia.net/bologna-sign-milan-midfielder-on-permanent/",
      "source": "football-italia.net",
      "date": "2026-02-18T12:41:09+00:00",
      "summary": "Bologna have officially announced their signing of Tommaso Pobega on a definitive, permanent transfer from..."
    }
  ]
}