{
  "lastUpdated": "2026-02-13T09:42:20.873189+00:00",
  "articles": [
    {
      "id": "106a16d17d1e",
      "title": "Towards Pisa-Milan: the starting trio from the beginning of the season returns to the defense, De Winter on the bench",
      "url": "https://www.milannews.it/news/verso-pisa-milan-in-difesa-torna-il-trio-titolare-di-inizio-stagione-de-winter-in-panchina-607246",
      "source": "milannews.it",
      "date": "2026-02-13T09:28:38+00:00",
      "summary": "As reported this morning in today's edition of Tuttosport, tonight against Pisa the starting trio from the beginning of the season will be back in Milan's defense from the first minute, namely the one made up of Fikayo Tomori, Matteo Gabbia and Stra ..."
    },
    {
      "id": "77a9d49b7434",
      "title": "GdS: ‘Allegri votes Nkunku’ – Frenchman to lead line in Pisa with aim to put pressure on Inter",
      "url": "https://sempremilan.com/allegri-votes-nkunku-pisa-pressure-inter",
      "source": "sempremilan.com",
      "date": "2026-02-13T09:25:00+00:00",
      "summary": "AC Milan are back in action 10 days since they last played and won in Serie A, hoping for a good Friday night by the leaning tower. In their sixth and final away game of the last 42 days, La Gazzetta dello Sport (seen below) report this morning that Massimiliano Allegri will choose to make […]\nThe p"
    },
    {
      "id": "5ff6d1344683",
      "title": "The chase for Inter starts from Pisa: Milan needs a quick run before the derby",
      "url": "https://www.milannews.it/news/parte-da-pisa-la-rincorsa-all-inter-al-milan-serve-un-filotto-prima-del-derby-607243",
      "source": "milannews.it",
      "date": "2026-02-13T09:18:20+00:00",
      "summary": "Milan is currently second in the standings, -8 behind Inter, but the Rossoneri have one game less which they will make up for on Wednesday at San Siro against Como."
    },
    {
      "id": "d05adf469445",
      "title": "AC Milan player Brignone, Olympic champion: Milan has already taken steps to host her at San Siro or Milanello",
      "url": "https://www.milannews.it/news/la-milanista-brignone-campionessa-olimpica-il-milan-si-e-gia-attivato-per-ospitarla-a-san-siro-o-a-milanello-607250",
      "source": "milannews.it",
      "date": "2026-02-13T09:08:55+00:00",
      "summary": "Federica Brignone, who yesterday won the gold medal in the Olympic Super G, is a great Rossoneri fan and for this reason Milan has already taken steps to host the ski champion at San Siro or Milanello."
    },
    {
      "id": "5a80a6780e1f",
      "title": "MN EXCLUSIVE - Passerini (CorSera): \"Scudetto? Milan must do everything to fight for it until the end\"",
      "url": "https://www.milannews.it/primo-piano/esclusiva-mn-passerini-corsera-scudetto-il-milan-deve-fare-di-tutto-per-giocarsela-fino-alla-fine-607214",
      "source": "milannews.it",
      "date": "2026-02-13T09:00:00+00:00",
      "summary": "On the eve of Pisa-Milan, Il Corriere della Sera colleague Carlos Passerini spoke exclusively to the microphones of the MilanNews YouTube channel."
    },
    {
      "id": "e2a5da0799e7",
      "title": "Milanista gold medal, ‘Mission -5’ in Pisa – Today’s front pages in Italy",
      "url": "https://sempremilan.com/front-pages-italy-pisa-milan-brignone",
      "source": "sempremilan.com",
      "date": "2026-02-13T09:00:00+00:00",
      "summary": "The Winter Olympics is dominating the Italian media at the moment, but AC Milan are hoping to keep pace in a race of their own tonight. There are a couple of oddities about how Milan enter the game against Pisa. Firstly, it will be their sixth away game in the last nine in Serie A, […]\nThe post Mila"
    },
    {
      "id": "c682014167e5",
      "title": "Serie A: Pisa vs. Milan – probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/pisa-vs-milan-probable-line-ups-watch-on-tv/",
      "source": "football-italia.net",
      "date": "2026-02-13T08:53:01+00:00",
      "summary": "Ruben Loftus-Cheek and Christopher Nknuku are expected to lead the Milan attack in an away..."
    },
    {
      "id": "6c30018add0b",
      "title": "Milan renewals, Gazzetta: \"Tomori first signing, the club calls Modric. Leao, Rossoneri future\"",
      "url": "https://www.milannews.it/rassegna-stampa/rinnovi-milan-gazzetta-tomori-prima-firma-il-club-chiama-modric-leao-futuro-rossonero-607248",
      "source": "milannews.it",
      "date": "2026-02-13T08:49:59+00:00",
      "summary": "Regarding the question of renewals at the Rossoneri, today's edition of the Gazzetta dello Sport headlines as follows: \"Tomori first signing, the club calls Modric. Leao, future Rossoneri\"."
    },
    {
      "id": "594a7cadfce5",
      "title": "Milan, Allegri still relies on Nkunku. Leao and Pulisic must be managed",
      "url": "https://www.milannews.it/rassegna-stampa/milan-allegri-si-affida-ancora-a-nkunku-leao-e-pulisic-vanno-gestiti-607242",
      "source": "milannews.it",
      "date": "2026-02-13T08:39:21+00:00",
      "summary": "Tonight against Pisa, in the first matchday 25 of Serie A, it will once again be Christopher Nkunku's turn to lead Milan's attack."
    },
    {
      "id": "ff3a0da9fe1c",
      "title": "Towards Pisa-Milan: the probable lineups of the two teams",
      "url": "https://www.milannews.it/rassegna-stampa/verso-pisa-milan-le-probabili-formazioni-delle-due-squadre-607245",
      "source": "milannews.it",
      "date": "2026-02-13T08:29:01+00:00",
      "summary": "These, according to La Gazzetta dello Sport, are the probable lineups of Pisa and Milan for the match valid for the 25th matchday of Serie A scheduled for tonight at 8pm."
    },
    {
      "id": "7067bd7919d5",
      "title": "Milan, another bench for Fullkrug: at this moment it represents an important change for Allegri with the match underway",
      "url": "https://www.milannews.it/rassegna-stampa/milan-altra-panchina-per-fullkrug-in-questo-momento-rappresenta-un-cambio-importante-per-allegri-a-partita-in-corso-607244",
      "source": "milannews.it",
      "date": "2026-02-13T08:19:33+00:00",
      "summary": "Tonight against Pisa, Max Allegri will initially rely on the attacking duo of Ruben Loftus-Cheek and Christopher Nkunku, who also played from the first minute ten days ago in Bologna."
    },
    {
      "id": "1e6a6c1eedb7",
      "title": "Milan, Saelemaekers also misses Pisa but will return against Como",
      "url": "https://www.milannews.it/rassegna-stampa/milan-saelemaekers-salta-anche-il-pisa-ma-tornera-contro-il-como-607241",
      "source": "milannews.it",
      "date": "2026-02-13T08:09:19+00:00",
      "summary": "After missing the trip to Bologna ten days ago, Alexis Saelemaekers will not be available to Max Allegri even for this evening's match on the Pisa pitch."
    },
    {
      "id": "946c159cafc2",
      "title": "Pisa Milan goalscorer odds",
      "url": "https://www.milannews.it/scommesse/pronostici/pisa-milan-quote-marcatore-606981",
      "source": "milannews.it",
      "date": "2026-02-13T08:00:00+00:00",
      "summary": "Milan will play against Pisa in a match valid for the 25th matchday of Serie A."
    },
    {
      "id": "b826095a6248",
      "title": "QS: \"Milan finds Pulisic again in Pisa. Allegri keeps Leao on the bench\"",
      "url": "https://www.milannews.it/rassegna-stampa/qs-il-milan-a-pisa-ritrova-pulisic-allegri-tiene-leao-in-panchina-607240",
      "source": "milannews.it",
      "date": "2026-02-13T07:50:12+00:00",
      "summary": "The Quotidiano Sportivo on newsstands today has the headline: \"Milan reunites Pulisic in Pisa. Allegri keeps Leao on the bench\"."
    },
    {
      "id": "cda649ea5b7f",
      "title": "Towards Pisa-Milan: in attack Allegri chooses Nkunku again with Loftus-Cheek",
      "url": "https://www.milannews.it/rassegna-stampa/verso-pisa-milan-in-attacco-allegri-sceglie-ancora-nkunku-con-loftus-cheek-607239",
      "source": "milannews.it",
      "date": "2026-02-13T07:40:51+00:00",
      "summary": "With the recovery of Christian Pulisic, back available after missing the last match against Bologna, Max Allegri will have four attackers at his disposal tonight in Pisa, but from the start he will only be one of ..."
    },
    {
      "id": "d960b0882bdb",
      "title": "Tuttosport headlines: \"Pulisic is available. And the renewal is upon us\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-titola-pulisic-e-a-disposizione-e-il-rinnovo-e-alle-porte-607238",
      "source": "milannews.it",
      "date": "2026-02-13T07:30:44+00:00",
      "summary": "\"Pulisic is available."
    },
    {
      "id": "d309b197066d",
      "title": "Tonight there is Pisa. CorSera: \"Crocevia Milan, Allegri's plan\"",
      "url": "https://www.milannews.it/rassegna-stampa/stasera-c-e-il-pisa-corsera-crocevia-milan-il-piano-di-allegri-607235",
      "source": "milannews.it",
      "date": "2026-02-13T07:20:17+00:00",
      "summary": "The Corriere della Sera headline this morning in view of this evening's Rossoneri away match at Pisa: \"Crocevia Milan, Allegri's plan\"."
    },
    {
      "id": "94440efb8139",
      "title": "La Gazzetta opening: \"Milan attack with Nkunku and try to scare Chivu\"",
      "url": "https://www.milannews.it/rassegna-stampa/la-gazzetta-in-apertura-il-milan-all-assalto-con-nkunku-prova-a-spaventare-chivu-607227",
      "source": "milannews.it",
      "date": "2026-02-13T07:10:58+00:00",
      "summary": "Today's edition of the Gazzetta dello Sport headlines this morning on the front page: \"Milan attack with Nkunku and try to scare Chivu\"."
    },
    {
      "id": "7462728c4192",
      "title": "Milan, Pulisic available again. And the renewal dialogues are open",
      "url": "https://www.milannews.it/primo-piano/milan-pulisic-di-nuovo-a-disposizione-e-sono-aperti-i-dialoghi-per-il-rinnovo-607222",
      "source": "milannews.it",
      "date": "2026-02-13T07:00:52+00:00",
      "summary": "After the match won against Bologna, Milan did not play last weekend against Como due to the unavailability of San Siro and will return to the field this evening at Pisa."
    },
    {
      "id": "9e5a995a4b01",
      "title": "Milan Futuro on the pitch tomorrow: the Serie D group B standings",
      "url": "https://www.milannews.it/milan-futuro/milan-futuro-domani-in-campo-la-classifica-del-girone-b-di-serie-d-607221",
      "source": "milannews.it",
      "date": "2026-02-13T06:50:12+00:00",
      "summary": "Below is the ranking of Group B of Serie D. Tomorrow, Saturday 14 February, at 2.30 pm Milan Futuro will host Breno."
    },
    {
      "id": "df903d1afe04",
      "title": "All the appointments of the day in Serie A: Fabbri for Pisa-Milan",
      "url": "https://www.milannews.it/news/tutte-le-designazioni-della-giornata-di-serie-a-fabbri-per-pisa-milan-607219",
      "source": "milannews.it",
      "date": "2026-02-13T06:40:54+00:00",
      "summary": "All referee appointments for the 25th day of the Serie A Enilive championship. This evening's match between Pisa and Milan was entrusted to Ravenna whistler Michael Fabbri."
    },
    {
      "id": "b3b5544891a3",
      "title": "Pisa on the road to Milan: the possible choices of coach Hiljemark",
      "url": "https://www.milannews.it/l-avversario/il-pisa-sulla-strada-del-milan-le-possibili-scelte-del-tecnico-hiljemark-607220",
      "source": "milannews.it",
      "date": "2026-02-13T06:30:00+00:00",
      "summary": "For Oscar HIljemark, a very young coach who took over from the sacked Gilardino at Pisa and who has a decent past as a footballer in Serie A, this evening's match against Milan at 8pm."
    },
    {
      "id": "5141adab076f",
      "title": "Serie A, the updated ranking after 24 days: Milan with the asterisk",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-dopo-24-giornate-il-milan-con-l-asterisco-607218",
      "source": "milannews.it",
      "date": "2026-02-13T06:20:00+00:00",
      "summary": "The 25th round of the Enilive Serie A championship begins today. It will be Milan that will open the ball, after a 10-day break, at the home of Pisa, second to last in the table."
    },
    {
      "id": "038ed51733c2",
      "title": "MN: Predicted Milan XI vs Pisa – Tomori the only returnee for Allegri",
      "url": "https://sempremilan.com/predicted-milan-xi-pisa-tomori-only-returnee",
      "source": "sempremilan.com",
      "date": "2026-02-12T20:00:00+00:00",
      "summary": "Fikayo Tomori is predicted to return to the starting lineup for AC Milan tomorrow night when they face Pisa at the Arena Garibaldi.  Massimiliano Allegri has had to deal with a pretty slim squad all season, partially due to his own squad choices. However, with the recent injuries, he has had most of"
    },
    {
      "id": "8cd6d62942a1",
      "title": "Footy Headlines: First look at new Milan x PUMA x Slam Jam jacket – photos",
      "url": "https://sempremilan.com/first-look-milan-puma-slam-jam-jacket",
      "source": "sempremilan.com",
      "date": "2026-02-12T19:30:00+00:00",
      "summary": "AC Milan are expected to announce a new collaboration with PUMA and Slam Jam shortly, and a new piece from the collection has been shown. It is nothing new for Milan to have mid-season collabs with fashion brands. Over the past years, there have been several, with the partnership with Off-White bein"
    },
    {
      "id": "3ac8c79d3e7c",
      "title": "Opposition insight for Pisa-Milan: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-pisa-milan-form-injuries-xi-more",
      "source": "sempremilan.com",
      "date": "2026-02-12T19:00:00+00:00",
      "summary": "On Friday night, after a decent break from Serie A action, AC Milan will travel to the Arena Garibaldi to face a struggling Pisa side. It has been a long 10 days with no Milan action to fill the gap. However, the Rossoneri will return to Serie A action tomorrow night to face Pisa, who […]\nThe post O"
    },
    {
      "id": "165ff3a71450",
      "title": "Hiljemark discusses Milan’s quality, facing Allegri and match prep: “A lot to learn”",
      "url": "https://sempremilan.com/hiljemark-discusses-milan-quality-match-prep",
      "source": "sempremilan.com",
      "date": "2026-02-12T18:30:00+00:00",
      "summary": "Oscar Hiljemark has been full of praise for AC Milan ahead of their clash on Friday night. However, he is aware of his team’s situation. For Milan, once again, they will prepare for this game against Pisa with the confidence that they can win the game. However, they must be wary of their last result"
    },
    {
      "id": "6bb38ed87942",
      "title": "Moretto: Gatti available in the summer – Allegri’s position after January persistence",
      "url": "https://sempremilan.com/gatti-available-summer-allegri-position",
      "source": "sempremilan.com",
      "date": "2026-02-12T18:00:00+00:00",
      "summary": "With AC Milan interested in signing a senior defender in January, Massimiliano Allegri repeatedly asked for Federico Gatti. However, it was not possible, at least then. Throughout last month, Gatti’s name was heavily repeated, and it makes sense why. The Italian worked heavily with Allegri, and he w"
    },
    {
      "id": "3d8464ef80c8",
      "title": "Serie A preview: Pisa vs. AC Milan – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-pisa-milan-team-news-stats",
      "source": "sempremilan.com",
      "date": "2026-02-12T17:30:00+00:00",
      "summary": "AC Milan are back in action after an extended break as they take on Pisa at the Arena Garibaldi on Friday night. By the time Milan take to the field in Tuscany, it will have been 10 days since they last played, in the 3-0 win away against Bologna. That is because the Milan-Como fixture […]\nThe post "
    },
    {
      "id": "55188169c61f",
      "title": "Report: Milan among 22 clubs to be offered Duran with Russia move imminent",
      "url": "https://sempremilan.com/milan-among-22-clubs-offered-duran-january",
      "source": "sempremilan.com",
      "date": "2026-02-12T17:00:00+00:00",
      "summary": "It is no secret that AC Milan need a striker, but they rejected the chance to sign one on favourable terms in January.  There were several names linked to Milan, and in the next few months, more will be attached to the Rossoneri. However, things could’ve been placed on hold, had an offered player mo"
    },
    {
      "id": "d50cee56a1a2",
      "title": "Capello claims Serie A title race wide open: ‘Inter & Juventus, watch out for Milan & Roma’",
      "url": "https://football-italia.net/capello-claims-serie-a-title-race-wide-open/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:30:19+00:00",
      "summary": "Fabio Capello insists the Serie A title race is far from over, warning that Inter..."
    },
    {
      "id": "c77e2e55d1f1",
      "title": "‘For a long time’ – Juventus journalist confirms Vlahovic has spoken with Allegri and Tare",
      "url": "https://sempremilan.com/juventus-journalist-confirms-vlahovic-spoke-allegri-tare",
      "source": "sempremilan.com",
      "date": "2026-02-12T16:30:00+00:00",
      "summary": "It is no secret that Massimiliano Allegri has been trying to get Dusan Vlahovic to arrive at AC Milan since last summer, and a journalist has looked at the situation.  Nearly a year on from Allegri’s arrival at Milan, the same issues exist. Whilst he has transformed Rafael Leao and Christian Pulisic"
    },
    {
      "id": "ef679b7e17ab",
      "title": "Only one Serie A player included in Europe’s best paid footballers in 2026",
      "url": "https://football-italia.net/one-juventus-player-europe-top-20-best-paid/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:01:54+00:00",
      "summary": "Juventus’s Dusan Vlahovic is currently the only Serie A player to feature in the list..."
    },
    {
      "id": "74b80fd4472a",
      "title": "Allegri sheds light on Nkunku’s adaptation and Gimenez’s accelerated recovery",
      "url": "https://sempremilan.com/allegri-sheds-light-nkunku-gimenez-recovery",
      "source": "sempremilan.com",
      "date": "2026-02-12T16:00:00+00:00",
      "summary": "In today’s press conference, AC Milan manager Massimiliano Allegri spoke about the situation of his strikers, and there were certainly positives! This has been a torrid season for Milan, at least where the attack has been concerned. With out of form players and injuries, Allegri has rarely had a cho"
    },
    {
      "id": "2feb9b020dff",
      "title": "‘Don’t ask me why’ – Journalist reveals Milan made a January move for Brighton attacker",
      "url": "https://sempremilan.com/journalist-reveals-milan-january-move",
      "source": "sempremilan.com",
      "date": "2026-02-12T15:30:00+00:00",
      "summary": "There have been questions about AC Milan’s mercato antics for a while now, and this week, another has arisen regarding the choice to pursue one player. In January, Milan were rather quiet. It was not a shock; the budget was not there for excessive spending, and there was no point adding names for th"
    },
    {
      "id": "5f051e035dab",
      "title": "Official: Date and time confirmed for Cremonese-Milan in Serie A round 27",
      "url": "https://sempremilan.com/date-time-confirmed-cremonese-milan-serie-a-round-27",
      "source": "sempremilan.com",
      "date": "2026-02-12T15:00:00+00:00",
      "summary": "This afternoon, the latest set of Serie A fixtures has been released. As a result, AC Milan now know the official date and time for their game against Cremonese at the start of March. Some big fixtures are coming up for Milan, and many will already be looking ahead to the game against Inter at […]\nT"
    },
    {
      "id": "225af3bab4d4",
      "title": "GdS: Serie A debut in 1989 to return as coach – Allegri gets ready for ‘special’ Pisa rematch",
      "url": "https://sempremilan.com/serie-a-debut-pisa-allegri-special-rematch",
      "source": "sempremilan.com",
      "date": "2026-02-12T14:30:00+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri will return to his old stomping ground on Friday night, facing his former club Pisa. As La Gazzetta dello Sport recall, it all started at the Arena Garibaldi, which has now changed its name due to a sponsorship agreement. For Allegri, it will always be the st"
    },
    {
      "id": "00edaaaae844",
      "title": "Juventus set price tag for Gatti as Milan, Napoli and Premier League clubs queue up",
      "url": "https://football-italia.net/juventus-set-price-tag-for-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-12T14:21:33+00:00",
      "summary": "Juventus reportedly have a price tag in mind when it comes to a potential sale..."
    },
    {
      "id": "196a83cddc90",
      "title": "Ordine outlines the message Allegri wanted to send with dinner: “The real climb begins”",
      "url": "https://sempremilan.com/ordine-message-allegri-send-team-dinner",
      "source": "sempremilan.com",
      "date": "2026-02-12T14:00:00+00:00",
      "summary": "Franco Ordine believes the decisive part of the season is about to start for AC Milan, hence the big team dinner organised. In case you missed the news from Sky’s Peppe Di Stefano on Wednesday, Milan held a dinner at a hotel in the city which featured not only the first team squad but many […]\nThe p"
    },
    {
      "id": "a3da33e6eddc",
      "title": "Pulisic sheds light on what he loves about AC Milan, upcoming World Cup and life in Italy",
      "url": "https://sempremilan.com/pulisic-love-milan-world-cup-life-italy",
      "source": "sempremilan.com",
      "date": "2026-02-12T13:35:00+00:00",
      "summary": "Christian Pulisic has provided an update on his injury, as well as lifting the lid on various aspects of his time at AC Milan so far. There are always a lot of eyes on Pulisic, given that he is the most recognisable football player from the USA, and given that they are about to go […]\nThe post Pulis"
    },
    {
      "id": "514bf5b0f365",
      "title": "Schira: Pulisic ‘happy’ at Milan but expected contract as Liverpool circle – the situation",
      "url": "https://sempremilan.com/pulisic-happy-milan-liverpool-circle-situation",
      "source": "sempremilan.com",
      "date": "2026-02-12T13:10:00+00:00",
      "summary": "Liverpool are weighing up a move to bring Christian Pulisic back to the Premier League, according to a report from one journalist. As a reminder, Pulisic is no stranger to the Premier League, having joined Chelsea from Borussia Dortmund in 2019 for a fee widely reported to be €64m. He made 145 appea"
    },
    {
      "id": "8c7c1ace3789",
      "title": "Allegri previews Pisa vs. Milan and gives injury update: ‘Pulisic only has 15-20 minutes’",
      "url": "https://football-italia.net/allegri-previews-pisa-vs-milan-injury-update/",
      "source": "football-italia.net",
      "date": "2026-02-12T12:49:06+00:00",
      "summary": "Massimiliano Allegri has shared his thoughts ahead of Milan’s upcoming Serie A clash against Pisa..."
    },
    {
      "id": "c58463a64570",
      "title": "Moretto reveals Allegri called Juventus defender: “No unanimity within the Milan world”",
      "url": "https://sempremilan.com/moretto-allegri-juventus-gatti-no-unanimity",
      "source": "sempremilan.com",
      "date": "2026-02-12T12:45:00+00:00",
      "summary": "AC Milan tried to see if there was an opening to sign Federico Gatti in the winter window, but were unable to pursue a deal. Milan were linked with a number of different central defenders during the January mercato, but in the end they decided to stay as they are. One of the most frequently […]\nThe "
    },
    {
      "id": "71c32d5efbab",
      "title": "Capello explains why Allegri and Milan should try chase Inter down: “They’re the closest”",
      "url": "https://sempremilan.com/capello-why-milan-chase-inter-closest",
      "source": "sempremilan.com",
      "date": "2026-02-12T12:20:00+00:00",
      "summary": "Fabio Capello has given an updated view on how he sees the Scudetto race at present, confirming his belief that AC Milan are Inter’s main rivals. A glance at the Serie A table seems to show Inter running away with it given that they are eight points clear. However, there are four games for Milan […]"
    },
    {
      "id": "f21e40e4567e",
      "title": "CorSport: Milan continue talks with Bayern Munich midfielder in bid to beat competition",
      "url": "https://sempremilan.com/milan-continues-talks-goretzka-bayern-atletico",
      "source": "sempremilan.com",
      "date": "2026-02-12T11:55:00+00:00",
      "summary": "AC Milan have not given up on the idea of signing Leon Goretzka, and are keeping contacts alive to see if they can pull off the coup. Goretzka’s fate was sealed last month when Christoph Freund – a director at Bayern Munich – did a press conference held together with coach Vincent Kompany, in which "
    },
    {
      "id": "3e2b69a629df",
      "title": "Official: AFC Bournemouth sign Alex Jimenez on permanent transfer from Milan",
      "url": "https://football-italia.net/official-milan-sell-jimenez-to-bournemouth/",
      "source": "football-italia.net",
      "date": "2026-02-12T11:19:57+00:00",
      "summary": "Premier League side AFC Bournemouth have officially announced the signing of Alex Jimenez on a..."
    },
    {
      "id": "6b7c62dbc4ab",
      "title": "How much Milan and Real Madrid earn from Jimenez’s Bournemouth move as documents signed",
      "url": "https://football-italia.net/milan-real-madrid-earn-jimenez-bournemouth/",
      "source": "football-italia.net",
      "date": "2026-02-11T15:20:29+00:00",
      "summary": "Fabrizio Romano confirms that Milan and Bournemouth have signed the documents for Alex Jimenez’s permanent..."
    },
    {
      "id": "12df281becc6",
      "title": "Milan handed Pulisic injury boost for Pisa clash",
      "url": "https://football-italia.net/milan-pulisic-injury-boost-for-pisa-clash/",
      "source": "football-italia.net",
      "date": "2026-02-11T14:19:12+00:00",
      "summary": "Milan star Christian Pulisic returned to group training on Wednesday, meaning he’ll probably be available..."
    },
    {
      "id": "6cf456b44487",
      "title": "De Winter hopes Milan help him get Belgium 2026 World Cup spot",
      "url": "https://football-italia.net/de-winter-hope-milan-beligum-spot-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-11T11:44:07+00:00",
      "summary": "Milan defender Koni De Winter hopes that his performances with the Rossoneri this season will..."
    },
    {
      "id": "394a459f8eaf",
      "title": "Mateta mystery deepens, Crystal Palace insist failed Milan transfer ‘does not need surgery’",
      "url": "https://football-italia.net/mateta-mystery-crystal-palacefailed-milan-move/",
      "source": "football-italia.net",
      "date": "2026-02-10T17:19:18+00:00",
      "summary": "Jean-Philippe Mateta failed a medical test with Milan to scupper his €30m transfer from Crystal..."
    },
    {
      "id": "44962c2fbe63",
      "title": "Jimenez feared limited Milan playing time, Nico Paz ‘ready’ for Real Madrid return",
      "url": "https://football-italia.net/jimenez-fear-limited-milan-time-paz-madrid/",
      "source": "football-italia.net",
      "date": "2026-02-10T14:42:00+00:00",
      "summary": "Alex Jimenez feared he’d get limited playing time at Milan, so he joined Bournemouth last..."
    },
    {
      "id": "303da62cf040",
      "title": "Report Pulisic waits for Milan contract offer as Liverpool and Arsenal loom",
      "url": "https://football-italia.net/pulisic-waits-milan-contract-liverpool-arsenal/",
      "source": "football-italia.net",
      "date": "2026-02-10T12:04:47+00:00",
      "summary": "Liverpool and Arsenal are reportedly interested in Milan star Christian Pulisic, who hasn’t yet received..."
    },
    {
      "id": "f688f227c904",
      "title": "Gattuso meets Italy players across the globe ahead of World Cup play-off",
      "url": "https://football-italia.net/gattuso-meets-italy-players-globe-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:54:51+00:00",
      "summary": "Denied a training retreat this month, Italy coach Gennaro Gattuso has taken his World Cup..."
    },
    {
      "id": "e43af22dbbb7",
      "title": "Nkunku: France have three teams to win World Cup, Rabiot ‘a beast’",
      "url": "https://football-italia.net/france-3-teams-win-world-cup-rabiot-beast/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:23:18+00:00",
      "summary": "During his interview with Gazzetta dello Sport, Milan striker Christopher Nkunku praised many of his Rossoneri..."
    },
    {
      "id": "b12a747674d2",
      "title": "Nkunku: ‘Never’ wanted to leave Milan, Ibrahimovic hasn’t changed",
      "url": "https://football-italia.net/nkunku-never-wanted-leave-milan-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:00:31+00:00",
      "summary": "Milan striker Christopher Nkunku insists he didn’t consider leaving the Rossoneri in the January transfer..."
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    }
  ]
}