{
  "lastUpdated": "2026-02-22T14:25:17.913115+00:00",
  "articles": [
    {
      "id": "fd282d5f0de4",
      "title": "LIVE MN - Towards Milan-Parma: several changes for Allegri! Here is the starting attack again, new defense",
      "url": "https://www.milannews.it/primo-piano/live-mn-verso-milan-parma-diversi-cambi-per-allegri-riecco-l-attacco-titolare-difesa-inedita-608282",
      "source": "milannews.it",
      "date": "2026-02-22T14:17:16+00:00",
      "summary": "PROBABLE MILAN LINE-UP (3-5-2): Maignan; Tomori, Gabbia, Bartesaghi; Saelemaekers, Loftus-Cheek, Modric, Rabiot, Estupinan; Pulisic, Leao. Coach: Massimiliano Allegri."
    },
    {
      "id": "a14961509327",
      "title": "Inter, Bastoni gets a yellow card and gets a yellow card: Genoa misses and the derby is saved",
      "url": "https://www.milannews.it/l-avversario/inter-bastoni-diffidato-si-fa-ammonire-salta-il-genoa-e-salva-il-derby-608286",
      "source": "milannews.it",
      "date": "2026-02-22T14:12:02+00:00",
      "summary": "Yesterday, in the late afternoon, Inter flew to Lecce at the Via del Mare where after 75 minutes at 0-0, Chivu's men managed to break the deadlock and take home the 3 points with the final 0-2."
    },
    {
      "id": "c19fb7f0f808",
      "title": "The clinical meet the wasteful: All the key stats ahead of Milan vs. Parma",
      "url": "https://sempremilan.com/all-key-stats-milan-parma-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-22T14:11:48+00:00",
      "summary": "AC Milan take on Parma at San Siro this evening, hoping to rack up another three points in their quest for a Champions League return. It will be the 74th between the two teams, with Milan currently on 38 wins and Parma on 17, while 18 were draws. One of them came earlier this season […]\nThe post The"
    },
    {
      "id": "dfe325e86d6f",
      "title": "Serie A, the updated ranking: salvation step for De Rossi",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-passo-salvezza-per-de-rossi-608280",
      "source": "milannews.it",
      "date": "2026-02-22T14:00:23+00:00",
      "summary": "Below is the updated ranking after Genoa-Turin 3-0\n\nSERIES A, THE UPDATED RANKING\n\nInter 64 (26 games played)\nMilan 54 (25)\nNaples 50 (25)\nRome 47 (25)\nJuventus 46 (26)\nComo 45 (26)\nAtalanta 42 (25)\nSassuolo 35 (26)\nLazio 34 ..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T13:56:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "51c35b129135",
      "title": "Serie A, Genoa-Turin 3-0: rossoblu show at the Marassi",
      "url": "https://www.milannews.it/news/serie-a-genoa-torino-3-0-show-rossoblu-al-marassi-608279",
      "source": "milannews.it",
      "date": "2026-02-22T13:48:11+00:00",
      "summary": "It ends with a 3-0 no contest for Daniele De Rossi's men who defeat a defenseless Torino, increasingly in crisis, who remain in 15th place with 27 points."
    },
    {
      "id": "802e4ab02cf9",
      "title": "Leao-Pulisic in tandem, from certainty to rarity: how much the two played together",
      "url": "https://www.milannews.it/news/leao-pulisic-in-tandem-da-certezza-a-rarita-quanto-hanno-giocato-i-due-insieme-608285",
      "source": "milannews.it",
      "date": "2026-02-22T13:36:20+00:00",
      "summary": "This evening at 18:00 the Rossoneri will host Parma at San Siro for the match valid for the 26th matchday of Serie A."
    },
    {
      "id": "e9d015475d57",
      "title": "CorSport: Five-man block and two up front – Cuesta’s plan to frustrate Milan again",
      "url": "https://sempremilan.com/cuesta-plan-parma-frustrate-milan-again",
      "source": "sempremilan.com",
      "date": "2026-02-22T13:35:48+00:00",
      "summary": "Carlos Cuesta is still early in his journey as a head coach, but he is dreaming of a big scalp at San Siro against AC Milan this evening. Cuesta’s side caused problems for Milan earlier in the season as they came from 2-0 down to earn a draw in Parma. Massimiliano Allegri’s men are out […]\nThe post "
    },
    {
      "id": "cf88c63e1b29",
      "title": "Particular challenge between Rabiot and Bernabé: in Serie A, they are the midfielders who suffer the most fouls in the final third of the pitch",
      "url": "https://www.milannews.it/news/sfida-particolare-tra-rabiot-e-bernabe-in-serie-a-sono-i-centrocampisti-che-subiscono-piu-falli-nell-ultimo-terzo-di-campo-608187",
      "source": "milannews.it",
      "date": "2026-02-22T13:24:37+00:00",
      "summary": "One of Adrián Bernabé's four goals - all scored at home, including the one against Hellas Verona in the last round - in Serie A came against Milan, in a 2-2 draw in the first leg; the midfield..."
    },
    {
      "id": "89e7d2b4a09f",
      "title": "Serie D, Caldiero Terme-Milan Futuro: the official lineups",
      "url": "https://www.milannews.it/milan-futuro/serie-d-caldiero-terme-milan-futuro-le-formazioni-ufficiali-608295",
      "source": "milannews.it",
      "date": "2026-02-22T13:10:16+00:00",
      "summary": "These are the official lineups for Caldiero Terme-Milan Futuro, a match valid for the 25th matchday of Serie D:\n\nCALDIERO TERME: Zouaghi, Rugger, Retdji, Goglino, Liberati, Orfeini, Zanetti, Zazzi, Gentile, Zappa. Available"
    },
    {
      "id": "8f835974fc97",
      "title": "TMW: Milan to scout Parma star up close at San Siro – what his renewal means",
      "url": "https://sempremilan.com/milan-scout-parma-pellegrino-renewal",
      "source": "sempremilan.com",
      "date": "2026-02-22T13:10:00+00:00",
      "summary": "AC Milan will once again use their meeting with Parma as an opportunity to watch Mateo Pellegrino up close, a potential summer target. Parma extended the contract of Pellegrino three weeks ago, but this hasn’t stopped the speculation above his future. Sometimes clubs agree renewals to increase lever"
    },
    {
      "id": "d65448955331",
      "title": "Juventus fans' banner for little Domenico, who passed away yesterday",
      "url": "https://www.milannews.it/news/striscione-dei-tifosi-della-juventus-per-il-piccolo-domenico-scomparso-ieri-608245",
      "source": "milannews.it",
      "date": "2026-02-22T13:00:41+00:00",
      "summary": "During Juventus-Como, a match that saw the Lariani prevail 2-0 thanks to goals from Vojvoda and Caqueret, the Juventus fans became protagonists of a gesture that was particularly appreciated in the Naples area (and beyond)."
    },
    {
      "id": "c3b2cffd73ee",
      "title": "Cremonese, Luperto: \"Challenges against Milan and Roma? We know that in this sport there can be surprises\"",
      "url": "https://www.milannews.it/l-avversario/cremonese-luperto-sfide-contro-milan-e-roma-sappiamo-che-in-questo-sport-possono-esserci-delle-sorprese-608141",
      "source": "milannews.it",
      "date": "2026-02-22T12:48:00+00:00",
      "summary": "This Sunday Cremonese will face Roma, the following Sunday against Milan: two decidedly complicated matches on paper which defender Sebastiano Luperto, speaking at the press conference, presents as follows:\n\n\"We will face ..."
    },
    {
      "id": "3d46ea6ba0ab",
      "title": "GdS: The first past 2,000 – Modric remains central to Milan as options for future emerge",
      "url": "https://sempremilan.com/modric-central-milan-options-future",
      "source": "sempremilan.com",
      "date": "2026-02-22T12:45:00+00:00",
      "summary": "Against Como, Luka Modric passed the 2,000-minute mark for AC Milan, and he is currently the only outfield player in the squad to do so. La Gazzetta dello Sport report that the final three months of the season will not only see Modric focus on getting Milan back into the Champions League but also re"
    },
    {
      "id": "66f73921ffc8",
      "title": "Milan, few goals? It's not true: the Rossoneri are second in scoring percentage in Serie A",
      "url": "https://www.milannews.it/news/milan-pochi-gol-non-e-vero-rossoneri-secondi-per-percentuale-realizzativa-in-serie-a-608149",
      "source": "milannews.it",
      "date": "2026-02-22T12:36:00+00:00",
      "summary": "Regret and disappointment remain for the Rossoneri after the home draw against Como, Massimiliano Allegri's Milan are approaching their next league match on Sunday at 6pm against Parma."
    },
    {
      "id": "6545c5188146",
      "title": "Valentini sentences on Milan: \"Inter are now unattainable for the Scudetto\"",
      "url": "https://www.milannews.it/news/valentini-sentenzia-sul-milan-l-inter-ormai-e-irraggiungibile-per-lo-scudetto-608055",
      "source": "milannews.it",
      "date": "2026-02-22T12:24:00+00:00",
      "summary": "Antonello Valentini, connected on TMW Radio, analyzed the championship fight in this way, admitting that in his opinion Inter are now too far ahead: \"I believe that Inter are now unattainable."
    },
    {
      "id": "3d587d3d1f23",
      "title": "The five key battles that could win or lose the game for Milan against Parma",
      "url": "https://sempremilan.com/five-key-battles-ac-milan-parma-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-22T12:20:00+00:00",
      "summary": "AC Milan welcome Parma to San Siro on Sunday evening, hoping to continue their winning ways and pad the gap to fifth place. Inter are almost running their own race at the moment as they moved 10 points clear, and while Milan can make it a seven-point gap again by beating Parma, Massimiliano Allegri "
    },
    {
      "id": "33425b1b758b",
      "title": "Order: \"It is Leao and Pulisic who must improve their condition so that a double step forward can be made between Parma and Cremona\"",
      "url": "https://www.milannews.it/news/ordine-sono-leao-e-pulisic-che-devono-salire-di-condizione-perche-si-possa-fare-un-doppio-passo-avanti-tra-parma-e-cremona-608265",
      "source": "milannews.it",
      "date": "2026-02-22T12:12:47+00:00",
      "summary": "During his editorial for MilanNews.it, the journalist Franco Ordine expressed himself as follows on Leao and Pulisic: \"They are the two who shift the balance of this Milan in attack."
    },
    {
      "id": "448765972a59",
      "title": "Argentine Football Federation shock: warning for president Tapia",
      "url": "https://www.milannews.it/dall-estero/federcalcio-argentina-shock-avviso-di-garanzia-per-il-presidente-tapia-608115",
      "source": "milannews.it",
      "date": "2026-02-22T12:00:00+00:00",
      "summary": "As reported by Sportmediaset, the Argentine justice system has issued a warrant against the president of the Football Federation (Asociación Fútbol Argentino - Afa), Claudio 'Chiqui' Tapia, as part of an investigation into a ..."
    },
    {
      "id": "d77cc3e02752",
      "title": "‘Signing of the year’ – Sky journalist reveals exactly how Milan secured Maignan’s reanewal",
      "url": "https://sempremilan.com/maignan-signing-year-renewal-milan-how",
      "source": "sempremilan.com",
      "date": "2026-02-22T11:55:00+00:00",
      "summary": "Obtaining the renewal of Mike Maignan was the ‘signing of the year’ for AC Milan, Sky’s Peppe Di Stefano has told us. Heading into the summer window, it seemed obvious that Maignan’s days at Milan were numbered, given the interest from Chelsea and the fact his deal was expiring in 2026. Then, the ar"
    },
    {
      "id": "6b2bae0bb84c",
      "title": "Gozzini: \"You can tell by seeing Leao play that his form isn't the best\"",
      "url": "https://www.milannews.it/news/gozzini-si-intuisce-vedendo-giocare-leao-che-la-forma-non-e-delle-migliori-608210",
      "source": "milannews.it",
      "date": "2026-02-22T11:48:00+00:00",
      "summary": "Alessandra Gozzini, journalist, expressed herself as follows in La Gazzetta dello Sport on Rafael Leao and Christian Pulisic: \"Speaking of Rafa, goals aside, however decisive and aesthetically appreciable it is, you can tell by seeing him play..."
    },
    {
      "id": "404f3b3a924c",
      "title": "Parma not only on the pitch. Milan are also thinking about the ducals on the 9th of the future: they like Pellegrino",
      "url": "https://www.milannews.it/calciomercato-milan/parma-non-solo-sul-campo-il-milan-pensa-ai-ducali-anche-il-9-del-futuro-piace-pellegrino-608278",
      "source": "milannews.it",
      "date": "2026-02-22T11:36:50+00:00",
      "summary": "Parma extended the contract of center forward Mateo Pellegrino for three weeks, as announced with a video on social channels in which the news was given by the Argentine player himself: \"Dear fans, I am very happy to announce ..."
    },
    {
      "id": "51cc36eb6dec",
      "title": "Tuttosport: Allegri chooses striker he wants at Milan – Camarda could be included in offer",
      "url": "https://sempremilan.com/allegri-chooses-kean-camarda-fiorentina",
      "source": "sempremilan.com",
      "date": "2026-02-22T11:30:00+00:00",
      "summary": "AC Milan are interested in signing Moise Kean this summer, and a report has claimed that Francesco Camarda could be part of the negotiations. In January, AC Milan signed German striker Niclas Fullkrug on loan with an option to buy from West Ham, but are targeting a new centre-forward in the upcoming"
    },
    {
      "id": "391a4d8a4838",
      "title": "Pellegatti and the Allegri choice: \"Well done Tare and congratulations to Cardinale who understood the importance of restoration, after the failed attempt to revolutionize football\"",
      "url": "https://www.milannews.it/news/pellegatti-e-la-scelta-allegri-bravo-tare-e-complimenti-a-cardinale-che-ha-capito-l-importanza-della-restaurazione-dopo-il-tentativo-fallito-di-rivolu-608205",
      "source": "milannews.it",
      "date": "2026-02-22T11:24:25+00:00",
      "summary": "During his editorial for MIlanNews.it, the journalist Carlo Pellegatti expressed himself as follows on the choices for the Milan bench: \"A thousand times thanks to Massimiliano Allegri."
    },
    {
      "id": "670aea5ac647",
      "title": "Mancini: \"Fabregas' gesture with Saelemaekers is incomprehensible and immature\"",
      "url": "https://www.milannews.it/news/mancini-il-gesto-di-fabregas-con-saelemaekers-e-incomprensibile-ed-immaturo-608223",
      "source": "milannews.it",
      "date": "2026-02-22T11:12:26+00:00",
      "summary": "Decisive weeks for Milan. After the draw against Como, today the Rossoneri will challenge Parma to remain in first place in the standings, occupied by Inter."
    },
    {
      "id": "653c8998d35e",
      "title": "GdS: Predicted XIs for AC Milan vs. Parma – Estupinan in as Bartesaghi moves back",
      "url": "https://sempremilan.com/gds-predicted-xis-milan-como-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-22T11:05:00+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri has made his choices regarding the team that will start against Parma this evening. Milan are once again in desperate need of three points or they risk letting Inter run away with the title, while Juventus’ loss at home to Como means that they can open up an "
    },
    {
      "id": "93a8b702f408",
      "title": "Rossoneri offensive: Allegri launches Milan to attack Parma",
      "url": "https://www.milannews.it/primo-piano/offensiva-rossonera-allegri-lancia-il-milan-all-assalto-del-parma-608260",
      "source": "milannews.it",
      "date": "2026-02-22T11:00:00+00:00",
      "summary": "Milan is preparing for this afternoon's match against Parma with a clear and decisive signal: attack, from the first minute."
    },
    {
      "id": "350a172703af",
      "title": "Ramazzotti: \"Allegri used an intelligent way to ensure that his team's performances are not influenced by the results of their rivals\"",
      "url": "https://www.milannews.it/news/ramazzotti-allegri-ha-usato-un-modo-intelligente-affinche-le-prestazioni-dei-suoi-non-vengano-condizionate-dai-risultati-delle-rivali-608275",
      "source": "milannews.it",
      "date": "2026-02-22T10:48:53+00:00",
      "summary": "Andrea Ramazzotti, journalist, expressed himself in La Gazzetta dello Sport regarding Milan-Parma: \"Inter doesn't miss a beat and, in the event of a victory against Parma, Milan will remain seven points behind the league leaders, their opponent..."
    },
    {
      "id": "194c09086aba",
      "title": "CorSport: Allegri banking on Leao and Pulisic to raise bar for Milan – first test vs. Parma",
      "url": "https://sempremilan.com/allegri-leao-pulisic-raise-bar-milan",
      "source": "sempremilan.com",
      "date": "2026-02-22T10:40:00+00:00",
      "summary": "AC Milan will host Parma this evening at San Siro, and Massimiliano Allegri will finally be able to call upon his first choice front two again. As reported by Corriere dello Sport (via MilanNews), Allegri has selected Rafael Leao and Christian Pulisic as the attacking duo to face Parma. It means tha"
    },
    {
      "id": "27243fc4142c",
      "title": "The draw against Como perhaps definitively shattered the Scudetto dreams. Milan now wants to lock down the Champions League",
      "url": "https://www.milannews.it/rassegna-stampa/il-pari-col-como-ha-mandato-in-frantumi-forse-definitivamente-i-sogni-scudetto-il-milan-ora-vuole-blindare-la-champions-608276",
      "source": "milannews.it",
      "date": "2026-02-22T10:36:49+00:00",
      "summary": "Carlos Passerini, journalist, expressed himself in the Corriere della Sera on Milan versus Parma: \"Turn the page and start again."
    },
    {
      "id": "e440872925de",
      "title": "CM: Milan in renewal talks with Leao amid Allegri’s praise – why he is not unsellable",
      "url": "https://sempremilan.com/milan-renewal-talks-leao-not-unsellable",
      "source": "sempremilan.com",
      "date": "2026-02-22T10:15:00+00:00",
      "summary": "Massimiliano Allegri had words of praise for Rafael Leao in his pre-Parma press conference, and AC Milan are plotting contract talks. Calciomercato.com begin by recalling Allegri’s words: “Leao, in my opinion, is doing well as a centre-forward. The data shows that he makes fewer plays, but he is mor"
    },
    {
      "id": "eac4675a84f3",
      "title": "GdS: ‘Champions League immediately’ – why Parma game represents big opportunity for Milan",
      "url": "https://sempremilan.com/why-parma-big-opportunity-for-milan",
      "source": "sempremilan.com",
      "date": "2026-02-22T09:50:00+00:00",
      "summary": "The story is a familiar one for AC Milan on the day of their game against Parma: Inter won, so they are duty bound to respond with a win of their own. As La Gazzetta dello Sport (seen below) write this morning, Inter are not letting up, and it means that if Milan win against […]\nThe post GdS: ‘Champ"
    },
    {
      "id": "d4594d905943",
      "title": "Watch: AC Milan tease ‘bold, modern’ PUMA and Slam Jam fourth kit",
      "url": "https://sempremilan.com/milan-puma-slam-jam-fourth-kit-tease",
      "source": "sempremilan.com",
      "date": "2026-02-22T09:25:00+00:00",
      "summary": "AC Milan have published a video which teases the upcoming launch of the fourth shirt in collaboration with PUMA and Slam Jam. It was reported last month that Milan would be releasing yet another fourth kit, and continuing their trend of teaming up with fashion brands for it. Some more details emerge"
    },
    {
      "id": "cdb760fc8c2d",
      "title": "Serie A: Milan vs. Parma: Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-milan-vs-parma-probable-line-ups-2/",
      "source": "football-italia.net",
      "date": "2026-02-22T09:17:18+00:00",
      "summary": "Christian Pulisic and Rafael Leao look set to partner each other in attack for just..."
    },
    {
      "id": "22c60c05d54d",
      "title": "Gallery: ‘Keep the title race alive’, ‘Milan in the slipstream’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/front-pages-italy-22-february-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-22T09:00:00+00:00",
      "summary": "AC Milan are back in action at San Siro this evening as they host Parma, and the pressure is once again on to win. After the somewhat frustrating draw against Como in midweek which saw Inter consolidate their advantage at the top, the Nerazzurri’s victory over Lecce on Saturday evening means that th"
    },
    {
      "id": "1ebade3a7510",
      "title": "Today’s Papers: Juventus unrecognisable, Inter flying, Italy golden land",
      "url": "https://football-italia.net/todays-papers-juventus-unrecognisable-inter/",
      "source": "football-italia.net",
      "date": "2026-02-22T08:41:37+00:00",
      "summary": "La Gazzetta dello Sport  The golden land  The bluest Olympics ever come to an end ..."
    },
    {
      "id": "86ecaff0db99",
      "title": "Sky: Milan’s predicted XI to face Parma – Estupinan, Loftus-Cheek and Pulisic named",
      "url": "https://sempremilan.com/sky-milans-xi-parma-estupinan-rlc-pulisic",
      "source": "sempremilan.com",
      "date": "2026-02-21T19:31:42+00:00",
      "summary": "Massimiliano Allegri has decided to make some big changes to the starting eleven for Milan-Parma tomorrow, according to a report.  The mid-week game against Como didn’t go quite to plan for  Milan as a Mike Maignan howler had them trailing. They did enough to salvage a point but at the end of the da"
    },
    {
      "id": "253991d31736",
      "title": "Serie A preview: AC Milan vs. Parma – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-ac-milan-vs-parma-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-21T19:00:00+00:00",
      "summary": "After the mid-week draw, AC Milan will be looking to get back to winning ways against Parma, a team they also need to get revenge against.  Milan are entering a crucial part of the season, with just 13 games left and Inter pushing on at the top. In short, they need as many points as […]\nThe post Ser"
    },
    {
      "id": "e3fa1fdfa286",
      "title": "Di Stefano explains why Cissè signing is reminiscent of ‘the old Milan’",
      "url": "https://sempremilan.com/di-stefano-cisse-signing-reminiscent-milan",
      "source": "sempremilan.com",
      "date": "2026-02-21T18:30:00+00:00",
      "summary": "In the final days of the January window, AC Milan secured the promising Serie B talent Alphadjo Cissè, a signing that Peppe Di Stefano believes is reminiscent of the old Milan.  The transfer was announced on the final day of the window and in the statement, it was confirmed that the attacking midfie"
    },
    {
      "id": "9c459d1b6691",
      "title": "Mr 100% returns: Landucci ready to take Allegri’s duties for Milan-Parma",
      "url": "https://sempremilan.com/mr-100-returns-landucci-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-21T18:00:13+00:00",
      "summary": "Marco Landucci will be the head coach in Milan’s dugout tomorrow as Massimiliano Allegri will be serving a one-game suspension. In short, Mr 100% is back.  When Allegri signed his contract with Milan, thus confirming his return to the club, we all knew that he would wear his heart on his sleeve. In "
    },
    {
      "id": "4937576dcc2d",
      "title": "Allegri admits Scudetto is highly unlikely as things stand: “12 wins and one defeat”",
      "url": "https://sempremilan.com/allegri-admits-scudetto-highly-unlikely-milan",
      "source": "sempremilan.com",
      "date": "2026-02-21T17:30:19+00:00",
      "summary": "Massimiliano Allegri has admitted that it will be very difficult for AC Milan to compete for the Scudetto, with just 13 games remaining of the season.  Due to the 1-1 draw against Como earlier in the week, Milan are now seven points behind their city rivals Inter (before this weekend’s matchday, any"
    },
    {
      "id": "f87a7cdd1651",
      "title": "Opposition insight for Milan-Parma: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-milan-parma-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-21T17:00:00+00:00",
      "summary": "Parma will be hoping to snatch more points from AC Milan tomorrow evening, having frustrated the Rossoneri in the reverse fixture.  After a rough run of results, the Gialloblu have seemingly found a bit of a stride with two consecutive wins, beating Bologna and Hellas Verona. There is some breathing"
    },
    {
      "id": "dadf35171854",
      "title": "Not only Rabiot as Athekame and Fofana could also miss derby against Inter",
      "url": "https://sempremilan.com/not-only-rabiot-athekame-fofana-derby",
      "source": "sempremilan.com",
      "date": "2026-02-21T16:30:00+00:00",
      "summary": "Adrien Rabiot is one yellow card away from suspension, which inevitably has become a big talking point as the derby is around the corner, but the same goes for two more players.  Rabiot missed Milan-Como due to suspension, having received a double yellow against Pisa in the round before. Had he not "
    },
    {
      "id": "0ce5a9e9364d",
      "title": "Milan, Allegri: Leao and Pulisic ‘improving’, I ‘get emotional’ when I talk to Modric",
      "url": "https://football-italia.net/milan-allegri-leao-pulisic-improve-talk-modric/",
      "source": "football-italia.net",
      "date": "2026-02-21T15:04:00+00:00",
      "summary": "Milan coach Massimiliano Allegri says Rafael Leao and Christian Pulisic are ‘improving’ and admits he..."
    },
    {
      "id": "39bd700d0d30",
      "title": "Fabregas: ‘I made a mistake, but some are seeking excuses’ with Como",
      "url": "https://football-italia.net/fabregas-made-mistake-some-seek-excuses-como/",
      "source": "football-italia.net",
      "date": "2026-02-21T13:59:43+00:00",
      "summary": "Cesc Fabregas again takes responsibility for his mistake against Milan, but also hints they are..."
    },
    {
      "id": "7aa3ce96e411",
      "title": "Tresoldi thinks about Milan move ‘every morning’, but expected Italy call",
      "url": "https://football-italia.net/tresoldi-thinks-milan-move-morning-italy-call/",
      "source": "football-italia.net",
      "date": "2026-02-21T12:13:57+00:00",
      "summary": "Nicolò Tresoldi admits he thinks about joining Milan ‘every morning when I wake up’, but..."
    },
    {
      "id": "d9a98da7185e",
      "title": "Fonseca: ‘I deserved more time’ at Milan",
      "url": "https://football-italia.net/fonseca-deserved-more-time-milan/",
      "source": "football-italia.net",
      "date": "2026-02-21T11:31:16+00:00",
      "summary": "Paulo Fonseca says he ‘enjoyed’ his short spell at Milan, but feels he ‘deserved more..."
    },
    {
      "id": "253ce718c287",
      "title": "Bonucci hails Milan coach Allegri: ‘A master, a phenomenon’",
      "url": "https://football-italia.net/italy-gattuso-bonucci-allegri-master-milan/",
      "source": "football-italia.net",
      "date": "2026-02-20T21:08:08+00:00",
      "summary": "Leonardo Bonucci has paid a glowing tribute to AC Milan head coach Massimiliano Allegri, describing..."
    },
    {
      "id": "d57652257213",
      "title": "Former Milan & Juventus defender De Sciglio clarifies collapsed Hradec Kralove move",
      "url": "https://football-italia.net/milan-juventus-defender-de-sciglio-hradec/",
      "source": "football-italia.net",
      "date": "2026-02-20T20:28:03+00:00",
      "summary": "Mattia De Sciglio has broken his silence over his failed transfer to Czech side Hradec..."
    },
    {
      "id": "16dbbff87a34",
      "title": "Milan interested in Club Brugge forward Tresoldi: the situation",
      "url": "https://football-italia.net/milan-interested-club-brugge-forward-tresoldi/",
      "source": "football-italia.net",
      "date": "2026-02-20T18:06:59+00:00",
      "summary": "AC Milan are quietly but decisively building their plans for the summer transfer window, and..."
    },
    {
      "id": "fe2664d29bdc",
      "title": "Extra Champions League spot: Where Italy stands after Inter loss and Bologna win",
      "url": "https://football-italia.net/extra-champions-league-spot-where-italy-stands/",
      "source": "football-italia.net",
      "date": "2026-02-20T16:25:31+00:00",
      "summary": "Italy’s chances of attaining an additional spot in next year’s Champions League remain slim despite..."
    },
    {
      "id": "603a8d098889",
      "title": "Pulisic impresses Milan star: ‘He speaks Italian almost perfectly’",
      "url": "https://football-italia.net/pulisic-impresses-milan-star-italian-perfectly/",
      "source": "football-italia.net",
      "date": "2026-02-20T14:20:48+00:00",
      "summary": "Milan star Rafael Leao is full of praise for USMNT star Christian Pulisic, on and..."
    },
    {
      "id": "14c9f595a9b3",
      "title": "Leao shares Diogo Jota story, promises to ‘make him proud’ at World Cup",
      "url": "https://football-italia.net/leao-diogo-jota-story-make-him-proud-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-20T14:13:03+00:00",
      "summary": "A ‘devastated’ Rafael Leao reveals Diogo Jota wanted to watch a Milan game at San..."
    },
    {
      "id": "5a8780cd73bf",
      "title": "Rafael Leao: Ibrahimovic ‘too demanding’, I ‘don’t go out’ before Milan derby",
      "url": "https://football-italia.net/leao-don-t-go-out-milan-derby-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-20T13:47:07+00:00",
      "summary": "Milan star Rafael Leao admits he avoids going out the week before the derby against..."
    },
    {
      "id": "c765c1d746d1",
      "title": "Frustrated Milan call AIA after controversial refereeing decisions in 1-1 Como draw",
      "url": "https://football-italia.net/frustrated-milan-call-aia-after-como-draw/",
      "source": "football-italia.net",
      "date": "2026-02-20T13:18:03+00:00",
      "summary": "Milan have reportedly been in contact with the Italian referees’ association (AIA) after a series..."
    },
    {
      "id": "18a4afe5a487",
      "title": "Roma the have best defensive record in Europe as Milan, Arsenal and Real Madrid follow",
      "url": "https://football-italia.net/roma-best-defensive-record-milan-arsenal-real/",
      "source": "football-italia.net",
      "date": "2026-02-20T12:36:59+00:00",
      "summary": "Roma are the least beaten defence in the top five European leagues, but Milan and..."
    },
    {
      "id": "46350e123f0a",
      "title": "Today’s Papers – Furious Milan, McTominay’s ‘soft football’",
      "url": "https://football-italia.net/todays-papers-furious-milan-mctominay-soft/",
      "source": "football-italia.net",
      "date": "2026-02-20T08:34:08+00:00",
      "summary": "La Gazzetta dello Sport Furious Milan The club is irritated with the referees, call to..."
    },
    {
      "id": "2e2b8b55e6a6",
      "title": "Why Fabregas cannot be punished with video evidence after Milan 1-1 Como",
      "url": "https://football-italia.net/why-fabregas-cannot-be-punished-video-evidence/",
      "source": "football-italia.net",
      "date": "2026-02-19T18:02:36+00:00",
      "summary": "Many were calling for video evidence to be used in punishing Como coach Cesc Fabregas..."
    },
    {
      "id": "88f321aefd9b",
      "title": "Milan team news: Boost as Pavlovic tests reveal no fracture",
      "url": "https://football-italia.net/milan-team-news-boost-as-pavlovic-tests/",
      "source": "football-italia.net",
      "date": "2026-02-19T15:39:58+00:00",
      "summary": "Milan will breathe a sigh of relief this morning, after medical examinations revealed that Strahinja..."
    },
    {
      "id": "d1035a3b77cf",
      "title": "Video: Fabregas’ shirt tug and touchline confrontation with Allegri",
      "url": "https://football-italia.net/fabregas-shirt-tug-touchline-clash-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-19T12:02:33+00:00",
      "summary": "Watch how Cesc Fabregas pulled the shirt of Alexis Saelemaekers and how Milan coach Massimiliano..."
    }
  ]
}