{
  "lastUpdated": "2026-02-23T22:39:36.472030+00:00",
  "articles": [
    {
      "id": "5eb57af1103e",
      "title": "Ravezzani ironic about Milan's call to the AIA: \"Who did he call? The effects have been seen\"",
      "url": "https://www.milannews.it/news/ravezzani-ironico-sulla-chiamata-del-milan-all-aia-a-chi-ha-telefonato-gli-effetti-si-son-visti-608474",
      "source": "milannews.it",
      "date": "2026-02-23T22:30:00+00:00",
      "summary": "The comment by Fabio Ravezzani, director of TeleLombardia, commented on Milan's defeat at the San Siro against Parma with a tweet on his personal X profile: \"Milan (Furlani?) 5 days ago whispered to the Gazzetta that they had ch ..."
    },
    {
      "id": "4257b7010808",
      "title": "Rossoneri youth sector: all the results of the weekend",
      "url": "https://www.milannews.it/settore-giovanile/settore-giovanile-rossonero-tutti-i-risultati-del-weekend-608503",
      "source": "milannews.it",
      "date": "2026-02-23T22:20:14+00:00",
      "summary": "An intense weekend for the Rossoneri's Youth Sector, with confirmations, goals and hard-fought challenges."
    },
    {
      "id": "e4bffd629335",
      "title": "Zazzaroni on the referee class: \"Poor, they are simply poor\"",
      "url": "https://www.milannews.it/news/zazzaroni-sulla-classe-arbitrale-scarsi-sono-semplicemente-scarsi-608504",
      "source": "milannews.it",
      "date": "2026-02-23T22:10:00+00:00",
      "summary": "In the aftermath of the dubious refereeing episodes in Bergamo for Atalanta-Napoli and at San Siro for Milan-Parma, the Corriere dello Sport had a front page headline on refereeing issues as follows: \"We give up!\"."
    },
    {
      "id": "a69e2a225593",
      "title": "Serie A, the updated standings: Bologna keeps their European hopes alive",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-il-bologna-tiene-vive-le-speranze-europee-608473",
      "source": "milannews.it",
      "date": "2026-02-23T22:00:54+00:00",
      "summary": "With the second victory in two consecutive weekends, something that had been missing for a while, Bologna gained three points which allowed them to overtake Lazio and Sassuolo and move into eighth position."
    },
    {
      "id": "82fc0cdf3ac2",
      "title": "Bologna finds their second victory in a row: a penalty is enough to overcome Udinese",
      "url": "https://www.milannews.it/news/il-bologna-trova-la-seconda-vittoria-di-fila-basta-un-rigore-per-superare-l-udinese-608471",
      "source": "milannews.it",
      "date": "2026-02-23T21:50:38+00:00",
      "summary": "After a dark period, Bologna won again, the second in a row in the league and the third if we also consider the Europa League."
    },
    {
      "id": "ba97a708d1bf",
      "title": "Insults to the referee for decisions against Napoli, his wife misunderstands and stabs him",
      "url": "https://www.milannews.it/news/insulti-all-arbitro-per-le-decisioni-contro-il-napoli-la-moglie-fraintende-e-lo-accoltella-608472",
      "source": "milannews.it",
      "date": "2026-02-23T21:40:20+00:00",
      "summary": "Blood, a knife stuck in the wall and a man rushed to hospital: scenes that should have nothing to do with football, but which occurred in a couple's living room after Atalanta-Napoli."
    },
    {
      "id": "6400055674d9",
      "title": "Pellegatti attacks: \"If we can't talk about the incidents then let's not complain. For Milan it's a penalty on Loftus-Cheek\"",
      "url": "https://www.milannews.it/news/pellegatti-attacca-se-non-possiamo-parlare-degli-episodi-poi-che-non-si-lamentino-per-il-milan-e-rigore-su-loftus-cheek-608456",
      "source": "milannews.it",
      "date": "2026-02-23T21:30:27+00:00",
      "summary": "On his YouTube channel, Carlo Pellegatti commented on Milan-Parma as follows:\n\n\"Milan doesn't care about political weight and therefore we are happy to exit the Scudetto race  because, last week there was a serious foul ..."
    },
    {
      "id": "d25249bfea4c",
      "title": "Milan, Gabbia's absence weighs heavily: 3 defeats out of 4 without the 46",
      "url": "https://www.milannews.it/news/milan-l-assenza-di-gabbia-pesa-3-sconfitte-su-4-senza-il-46-608454",
      "source": "milannews.it",
      "date": "2026-02-23T21:20:32+00:00",
      "summary": "During the warm-up Matteo Gabbia, who initially started, stopped due to a muscle problem which prevented him from entering the field and playing the match."
    },
    {
      "id": "874d8337a68c",
      "title": "Hauge: “I'm in contact with old friends from Milan, tomorrow they will support Bodo”",
      "url": "https://www.milannews.it/news/hauge-sono-in-contatto-con-vecchi-amici-del-milan-domani-tiferanno-bodo-608467",
      "source": "milannews.it",
      "date": "2026-02-23T21:10:24+00:00",
      "summary": "During the pre-match press conference of Inter-Bodo Glimt, a match valid for the second leg of the Champions League play-offs, Hauge, former AC Milan player, spoke like this:\n\nWhat is it like to return to San Siro? \"Beautiful, special stadium and sp..."
    },
    {
      "id": "5e867541e46e",
      "title": "Jimenez confident: \"Leaving Real Madrid? No regrets. The facts have proven me right\"",
      "url": "https://www.milannews.it/news/jimenez-sicuro-via-dal-real-nessun-rimpianto-i-fatti-mi-hanno-dato-ragione-608466",
      "source": "milannews.it",
      "date": "2026-02-23T21:00:48+00:00",
      "summary": "In an interview with AS, former Milan defender Alex Jimenez spoke thus of his farewell to Real Madrid to wear the Rossoneri, a choice he does not regret \n\n\"No regrets. The way things went, I say no."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "fc15ae69c3f0",
      "title": "Berardi on fire with Sassuolo. And he still hopes for the call from the national team",
      "url": "https://www.milannews.it/news/berardi-on-fire-con-il-sassuolo-e-spera-ancora-nella-chiamata-della-nazionale-608423",
      "source": "milannews.it",
      "date": "2026-02-23T20:50:00+00:00",
      "summary": "(ANSA) - REGGIO EMILIA, FEBRUARY 20 - Domenico Berardi, after the brace inflicted on Verona, spoke to Dazn at the end of the match."
    },
    {
      "id": "8f27acf98774",
      "title": "De Winter doesn't give up, the comment on social media about the match against Parma",
      "url": "https://www.milannews.it/news/de-winter-non-molla-il-commento-sui-social-della-partita-contro-il-parma-608463",
      "source": "milannews.it",
      "date": "2026-02-23T20:40:22+00:00",
      "summary": "On her Instagram profile, Koni De Winter posted some shots of last night's match with this caption: \"We keep going\"."
    },
    {
      "id": "37a1c039864e",
      "title": "Chiellini and the psychotherapist Iacopo Fossi show how football is an extraordinary tool for inclusion",
      "url": "https://www.milannews.it/news/chiellini-e-lo-psicoterapeuta-iacopo-fossi-mostrano-come-il-calcio-sia-uno-straordinario-strumento-di-inclusione-608424",
      "source": "milannews.it",
      "date": "2026-02-23T20:30:40+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 20 - The journey of 'Speak Out! Football tells' continues on sostenabilia.it with the sixth episode entitled 'Yes, we can'."
    },
    {
      "id": "b4368c577cda",
      "title": "Pistocchi against Allegri: \"Are you sure he's the right man? The season is reminiscent of the tragicomic one of Juve 23/24\"",
      "url": "https://www.milannews.it/news/pistocchi-contro-allegri-sicuri-sia-l-uomo-giusto-la-stagione-ricorda-quella-tragicomica-della-juve-23-24-608492",
      "source": "milannews.it",
      "date": "2026-02-23T20:20:00+00:00",
      "summary": "The second defeat of Milan in the championship, reasonably, caused discussion."
    },
    {
      "id": "9e6a5cfcb435",
      "title": "Leao, words from a leader: the motivational phrase on social media",
      "url": "https://www.milannews.it/news/leao-parole-da-leader-la-frase-motivazionale-sui-social-608458",
      "source": "milannews.it",
      "date": "2026-02-23T20:10:15+00:00",
      "summary": "This afternoon, Rafa Leao posted a personal photo of himself and a team photo with a motivational phrase that makes it clear that in the Portuguese's mind, nothing is lost."
    },
    {
      "id": "e1f3bb3a08f8",
      "title": "Calvarese: \"Without VAR yesterday there was no discussion, it's a paradox. The problem is technical\"",
      "url": "https://www.milannews.it/news/calvarese-senza-var-ieri-nessuna-discussione-e-un-paradosso-il-problema-e-tecnico-608457",
      "source": "milannews.it",
      "date": "2026-02-23T20:00:12+00:00",
      "summary": "Gianpaolo Calvarese, former Prime referee and moviolista, spoke on Stile TV during Raffaele Auriemma's show “Salite sulla giostra”.\n\n“The problem is technical and training, I'm convinced."
    },
    {
      "id": "7aee93d743b1",
      "title": "Hauge returns to San Siro... and the tunnel is colored red and black!",
      "url": "https://www.milannews.it/gli-ex/hauge-torna-a-san-siro-e-il-tunnel-si-colora-di-rossonero-608491",
      "source": "milannews.it",
      "date": "2026-02-23T19:50:15+00:00",
      "summary": "Jens Petter Hauge returns to San Siro and does so as Inter's opponent, in what for him is a bit of a derby."
    },
    {
      "id": "f3cca5944c2f",
      "title": "Serie A, the updated standings: Fiorentina lights up the battle for salvation, Pisa in trouble",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-la-fiorentina-accende-la-bagarre-salvezza-pisa-inguaiato-608470",
      "source": "milannews.it",
      "date": "2026-02-23T19:40:22+00:00",
      "summary": "Very heavy victory for Fiorentina who, by beating Pisa 1-0, not only won the Derby but also won a very important direct clash for survival."
    },
    {
      "id": "0121e4d2cd1f",
      "title": "AC Milan 0-1 Parma: Five things we learned – headaches emerge all over the pitch",
      "url": "https://sempremilan.com/ac-milan-0-1-parma-five-things-we-learned-headaches-emerge-all-over-the-pitch",
      "source": "sempremilan.com",
      "date": "2026-02-23T19:32:19+00:00",
      "summary": "AC Milan’s 24-game unbeaten run was ended by Parma on Sunday evening at San Siro, and the Scudetto dreams evaporated with it. As is not an uncommon theme so far this season, Milan missed a number of chances to make it an easier game for themselves. Christian Pulisic and Rafael Leao came closest, wit"
    },
    {
      "id": "5f3417089832",
      "title": "Fiorentina wins the derby against Pisa: three very important points in the key to survival",
      "url": "https://www.milannews.it/news/la-fiorentina-vince-il-derby-con-il-pisa-tre-punti-pesantissimi-in-chiave-salvezza-608469",
      "source": "milannews.it",
      "date": "2026-02-23T19:30:00+00:00",
      "summary": "Fiorentina is trying to make a comeback after a very complicated first part of the season, spent practically always in the relegation zone."
    },
    {
      "id": "901e4bbcfa9a",
      "title": "Three consecutive victories for Parma: this hasn't happened since the days of Donadoni. And always against Milan",
      "url": "https://www.milannews.it/news/tre-vittorie-consecutive-per-il-parma-non-accadeva-dai-tempi-di-donadoni-e-sempre-contro-il-milan-608433",
      "source": "milannews.it",
      "date": "2026-02-23T19:20:01+00:00",
      "summary": "Parma have won three consecutive matches in Serie A for the first time since March 2014, with Roberto Donadoni on the bench – on that occasion, the third match was against Milan at the Meazza (4-2). Opta reports it."
    },
    {
      "id": "d5a24629dda4",
      "title": "Loftus-Cheek shares remarkable pre and post-surgery photos – “A heartfelt thanks”",
      "url": "https://sempremilan.com/loftus-cheek-shares-photos-surgery-jaw",
      "source": "sempremilan.com",
      "date": "2026-02-23T18:30:00+00:00",
      "summary": "Ruben Loftus-Cheek underwent an operation on a fractured jaw earlier on Monday, and the midfielder has sent a post-surgery message. When Loftus-Cheek collided with the Parma goalkeeper in the first few minutes of Sunday’s game, it became apparent quickly that something was seriously wrong. The midfi"
    },
    {
      "id": "9c57cd27af27",
      "title": "CM: Renewal close for Milan defender after Spurs rejection – Allegri’s crucial role",
      "url": "https://sempremilan.com/renewal-close-tomori-spurs-rejection-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-23T18:00:00+00:00",
      "summary": "AC Milan are closing in on agreeing a new contract with Fikayo Tomori, something Massimiliano Allegri has been pushing for. As Calciomercato.com report, Allegri was an important factor in getting Tomori back to his near-best form, and the coach has also been a big sponsor of the contract renewal tha"
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "9de5934f77c6",
      "title": "MN: Gabbia undergoes scans after late exclusion from Milan-Parma – the results",
      "url": "https://sempremilan.com/gabbia-scans-late-exclusion-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-23T17:30:00+00:00",
      "summary": "Some clarity on Matteo Gabbia’s condition has arrived after there was some panic in the build-up to the game against Parma. There was a late line-up change for Massimiliano Allegri to make just before kick-off against Parma.  Gabbia pulled up during the warm-ups with muscle discomfort so he was with"
    },
    {
      "id": "14c9d00b6e4f",
      "title": "Official: Loftus-Cheek undergoes operation on fractured jaw – his recovery time",
      "url": "https://sempremilan.com/loftus-cheek-undergoes-operation-fractured-jaw",
      "source": "sempremilan.com",
      "date": "2026-02-23T17:00:00+00:00",
      "summary": "AC Milan have confirmed that Ruben Loftus-Cheek underwent surgery after his nasty injury during Sunday’s game against Parma. There was a rather sickening moment in the first few minutes of the 1-0 defeat at San Siro. Alexis Saelemaekers sent in a rabona cross that Loftus-Cheek tried to meet, but his"
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "0149e8ab47a4",
      "title": "Home struggles and strange coincidences: All the key stats from Milan 0-1 Parma",
      "url": "https://sempremilan.com/all-key-stats-ac-milan-0-1-parma",
      "source": "sempremilan.com",
      "date": "2026-02-23T16:30:00+00:00",
      "summary": "AC Milan’s unbeaten run was snapped at 24 games as they were beaten by Parma on Sunday at San Siro in an encounter with plenty of controversy. Milan missed a number of opportunities to take the lead, the most symbolic of which was Rafael Leao hitting the post. Then, in the closing minutes, Parma got"
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "69936f614a26",
      "title": "CM: Füllkrug not fully convincing Allegri – Milan ‘unlikely’ to use option agreed with West Ham",
      "url": "https://sempremilan.com/milan-unlikely-option-fullkrug-west-ham",
      "source": "sempremilan.com",
      "date": "2026-02-23T16:00:00+00:00",
      "summary": "Niclas Füllkrug started well at AC Milan, but with each passing game his future beyond May becomes less and less certain. As Calciomercato.com write, Massimiliano Allegri highlighted the need for a natural striker in the summer, a target man to be the focal point of the attack. He wanted a player wi"
    },
    {
      "id": "b3e6ce1565e7",
      "title": "Cuomo explains why Milan ‘sorely miss’ Galliani: “If a club feels penalised, they speak up”",
      "url": "https://sempremilan.com/why-galliani-missed-milan-speak-up",
      "source": "sempremilan.com",
      "date": "2026-02-23T15:30:00+00:00",
      "summary": "AC Milan are currently lacking a figure who commands respect and authority within the head offices of Lega Serie A, according to journalist Michael Cuomo. Milan’s 24-game unbeaten run came to an end on Sunday evening as they were beaten by Parma in a game that had plenty of controversy. Ruben Loftus"
    },
    {
      "id": "4f576d5f169c",
      "title": "GdS: Leao and Pulisic ‘struggling together’ despite Allegri’s conviction – the reasons",
      "url": "https://sempremilan.com/leao-pulisic-struggling-together-reasons",
      "source": "sempremilan.com",
      "date": "2026-02-23T15:00:00+00:00",
      "summary": "Massimiliano Allegri designated Rafael Leao and Christian Pulisic as his first choice front two, and yet the pair haven’t clicked. As La Gazzetta dello Sport report, there are only 12 games to go in the Serie A season and yet Leao and Pulisic need more time form a strike partnership worthy of their "
    },
    {
      "id": "2893b9b07d40",
      "title": "Watch: Wasteful Milan and controversial calls see Parma win at San Siro – the highlights",
      "url": "https://sempremilan.com/watch-milan-0-1-parma-highlights",
      "source": "sempremilan.com",
      "date": "2026-02-23T14:30:00+00:00",
      "summary": "AC Milan’s unbeaten run was ended by Parma at San Siro on Sunday evening, and with it any title hopes have probably alse been destroyed. Milan missed a few chances before the only goal of the game, with Rafael Leao’s volley being symbolic of the night. The Portuguese hammered an effort against the i"
    },
    {
      "id": "06175247b220",
      "title": "From Gabbia to Troilo: The many decisions Milan feel have gone against them in 2025-26",
      "url": "https://sempremilan.com/many-decisions-milan-against-them-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-23T14:00:00+00:00",
      "summary": "AC Milan are far from happy with the officiating this season, which they believe has cost them several points along the way. The fall-out continues after Milan’s home defeat against Parma, which ended their 24-game unbeaten run in the league and saw Inter move 10 points clear at the top of the table"
    },
    {
      "id": "ffb50b86a96b",
      "title": "Ordine believes Milan must ‘watch out’ for chasing pack: “The magic has been interrupted”",
      "url": "https://sempremilan.com/ordine-milan-watch-out-chasing-pack",
      "source": "sempremilan.com",
      "date": "2026-02-23T13:35:00+00:00",
      "summary": "AC Milan suffered their most damaging result of the season so far at San Siro on Sunday night as they were beaten 1-0 by Parma. Milan missed a number of big chances to take the lead, coming closes with Rafael Leao’s volley that hit the inside of the post. Then, in the closing minutes, Parma […]\nThe "
    },
    {
      "id": "0ccc0fa537e9",
      "title": "Moretto: Maignan ‘closed the door’ on approach from Juventus – the background",
      "url": "https://sempremilan.com/maignan-closed-door-approach-juventus",
      "source": "sempremilan.com",
      "date": "2026-02-23T13:10:00+00:00",
      "summary": "AC Milan managed to obtain Mike Maignan’s renewal after months of negotiations, but there was interest from rivals Juventus. During the summer window it looked certain that Maignan’s time at Milan was coming to an end. Chelsea tried to sign him before the Club World Cup, and even though he remained "
    },
    {
      "id": "3ee264ad577f",
      "title": "GdS: Milan’s AIA call ‘ineffective’ – why there is further anger about officiating",
      "url": "https://sempremilan.com/why-milan-further-anger-officiating",
      "source": "sempremilan.com",
      "date": "2026-02-23T12:45:00+00:00",
      "summary": "AC Milan have been left angered by officiating for the second time in just a few days, this time following the shock defeat to Parma. As La Gazzetta dello Sport write, Milan’s polite call to the AIA was ‘ineffective’. In fact, the effect was the opposite of what was hoped for. After the Como draw, t"
    },
    {
      "id": "0da24353115d",
      "title": "‘We got 54 points this way’ – Landucci responds strongly to idea of three-man attack",
      "url": "https://sempremilan.com/landucci-responds-idea-three-man-attack",
      "source": "sempremilan.com",
      "date": "2026-02-23T12:20:00+00:00",
      "summary": "AC Milan’s assistant coach Marco Landucci answered some difficult questions after the loss against Parma, including one about the attacking configuration. Landucci stepped into the dugout for the fifth time this season with Massimiliano Allegri suspended again. The previous games saw wins over Bari,"
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6d24314da5c6",
      "title": "Parma boss Cuesta sends message to Loftus-Cheek and dodges question about Troilo goal",
      "url": "https://sempremilan.com/parma-cuesta-loftus-cheek-troilo-goal",
      "source": "sempremilan.com",
      "date": "2026-02-23T11:55:00+00:00",
      "summary": "Parma head coach Carlos Cuesta sent his thoughts to Ruben Loftus-Cheek, and dodged a question about the winner against AC Milan. Back in 1993, Milan went into a home game against Parma with a 58-game unbeaten run on the line, and lost 1-0 to an Asprilla free-kick. While last night it was only a 24-g"
    },
    {
      "id": "c00978e91e0f",
      "title": "CM: Pulisic loses aim amid possible distractions – goal drought reaches two months",
      "url": "https://sempremilan.com/pulisic-loses-aim-drought-two-months",
      "source": "sempremilan.com",
      "date": "2026-02-23T11:30:00+00:00",
      "summary": "Christian Pulisic has been decisive for AC Milan since arriving in 2023, but he is not going through the best patch of form at the moment. As Calciomercato.com recall, Milan’s 24-game unbeaten run went up in smoke last night as they not only lost against Parma, but failed to score. Even fielding the"
    },
    {
      "id": "51e337fc67bb",
      "title": "‘The On-Field Review is not fair’ – Loftus-Cheek and Troilo incidents divide expert opinion",
      "url": "https://sempremilan.com/loftus-cheek-troilo-divide-expert-opinion",
      "source": "sempremilan.com",
      "date": "2026-02-23T11:05:00+00:00",
      "summary": "AC Milan’s defeat to Parma had a couple of highly controversial decisions, which have been the subject of debate from experts and pundits. The first one came just a few minutes in: a cross from Alexis Saelemaekers on the left side was cleared by a defender a split second before the Parma goalkeeper "
    },
    {
      "id": "db464e29a86d",
      "title": "A swathe of disappointing performances: Player ratings from Milan-Parma from Italian papers",
      "url": "https://sempremilan.com/player-ratings-milan-0-1-parma-italian-papers",
      "source": "sempremilan.com",
      "date": "2026-02-23T10:40:00+00:00",
      "summary": "AC Milan’s 24-game unbeaten run fell at San Siro on Sunday as they lost to Parma 1-0, while the Scudetto hopes probably went with it. The only goal of the game was a controversial one 10 minutes from time, as Troilo rose at the far post to head in a corner. It was initially disallowed […]\nThe post A"
    },
    {
      "id": "4d37804875f9",
      "title": "CorSport: Just like 1993 – Parma end Milan’s unbeaten run again as title dream evaporates",
      "url": "https://sempremilan.com/parma-end-milan-unbeaten-run-again-1993",
      "source": "sempremilan.com",
      "date": "2026-02-23T10:15:00+00:00",
      "summary": "AC Milan needed to win to keep the Scudetto race alive against Parma on Sunday, but instead their unbeaten run was ended. As Corriere dello Sport (via MilanNews) write this morning, the game against Parma should have been a chance for Milan to show that they are fully over their hoodoo against teams"
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "7d1eaf8982a2",
      "title": "Serie A | Milan 0-1 Parma – Player Ratings as Troilo and Corvi batten down the hatches",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-player-ratings/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:09:16+00:00",
      "summary": "Milan fell to a late 1-0 defeat to Parma this evening, after they were unable..."
    },
    {
      "id": "0338d8d0b0d7",
      "title": "Serie A | Milan 0-1 Parma: Rossoneri suffer shocking first defeat in 24 rounds",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-shocking-defeat-24/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:05:53+00:00",
      "summary": "Milan paid the price for insipid finishing and sluggish defending, as Parma inflicted their first..."
    },
    {
      "id": "ad92e7503a8c",
      "title": "Ex-West Ham & Villa man Reo-Coker: ‘Fabregas pull on Saelemaekers inexcusable’",
      "url": "https://football-italia.net/ex-west-ham-villa-man-reo-coker-fabregas/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:50:32+00:00",
      "summary": "Former West Ham and Aston Villa midfielder turned CBS Sports Golazo pundit Nigel Reo-Coker has..."
    },
    {
      "id": "be4ffa2fa372",
      "title": "Milan double blow as Loftus-Cheek and Gabbia suffer injuries",
      "url": "https://football-italia.net/milan-double-loftus-cheek-gabbia-injuries/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:25:58+00:00",
      "summary": "Milan suffered two major injuries in their match against Parma, as Matteo Gabbia pulled out..."
    },
    {
      "id": "a426ed6a1955",
      "title": "Landucci: ‘Milan focus on our journey, believe in Leao’",
      "url": "https://football-italia.net/landucci-milan-focus-journey-believe-in-leao/",
      "source": "football-italia.net",
      "date": "2026-02-22T16:40:03+00:00",
      "summary": "Milan assistant manager Marco Landucci shrugs off talk of the Scudetto race with rivals Inter..."
    },
    {
      "id": "47258cff203b",
      "title": "Serie A official line-ups: Milan vs. Parma",
      "url": "https://football-italia.net/serie-a-official-line-ups-milan-vs-parma/",
      "source": "football-italia.net",
      "date": "2026-02-22T15:54:34+00:00",
      "summary": "Milan welcome Christian Pulisic and Adrien Rabiot back to the starting XI with Rafael Leao..."
    }
  ]
}