{
  "lastUpdated": "2026-02-08T11:21:59.347028+00:00",
  "articles": [
    {
      "id": "fafdddf70700",
      "title": "MN - Milan Women, the update on the injured players",
      "url": "https://www.milannews.it/milan-femminile/mn-milan-femminile-il-punto-sulle-giocatrici-infortunate-606757",
      "source": "milannews.it",
      "date": "2026-02-08T11:13:05+00:00",
      "summary": "The point on the injured AC Milan Women's players ahead of today's championship match away to Roma: \n\nBabb: left knee meniscus surgery\n\nCernoia: left flexor muscle problem \n\nDonolato ..."
    },
    {
      "id": "24bcf10fa1cb",
      "title": "QS: Getting the max from little – how Allegri has utilised super subs the best in Serie A",
      "url": "https://sempremilan.com/how-allegri-utilised-super-subs",
      "source": "sempremilan.com",
      "date": "2026-02-08T11:05:00+00:00",
      "summary": "Massimiliano Allegri might use less substitutions than every other manager in Serie A, but he uses them the most effectively. As Quotidiano Sportivo write, Milan are second in the table, and their unbeaten streak (22 games: 14 wins, eight draws) is unmatched in Europe. All this is with an extra-smal"
    },
    {
      "id": "e6442caa6d1b",
      "title": "Rabiot, what numbers! The irreplaceable leader of Allegri's Milan",
      "url": "https://www.milannews.it/primo-piano/rabiot-che-numeri-il-leader-insostituibile-del-milan-di-allegri-606753",
      "source": "milannews.it",
      "date": "2026-02-08T11:00:47+00:00",
      "summary": "Is what we are seeing at Milan the best Rabiot ever? Adrien himself answered this question on Tuesday after the 3-0 defeat of the Devil at Bologna, confirming that he felt very good, but explained ..."
    },
    {
      "id": "0bf4796891e6",
      "title": "Serie A Women, the official lineups of Roma-Milan",
      "url": "https://www.milannews.it/milan-femminile/serie-a-femminile-le-formazioni-ufficiali-di-roma-milan-606756",
      "source": "milannews.it",
      "date": "2026-02-08T10:48:40+00:00",
      "summary": "These are the official lineups for Roma-Milan, a match valid for the 13th matchday of the Women's Serie A scheduled today at 12.30:\n\nROME: Bald, Heatley, Viens, Csiki, Giugliano, Dragoni, Oladipo, Greggi, Bergamaschi, Thogersen, Babajid."
    },
    {
      "id": "75c4dc105c21",
      "title": "GdS: Milan expected to have key duo back against Pisa – the latest from the treatment room",
      "url": "https://sempremilan.com/milan-saelemaekers-pulisic-pisa-treatment-room",
      "source": "sempremilan.com",
      "date": "2026-02-08T10:40:00+00:00",
      "summary": "AC Milan do not return to action until Friday night against Pisa, but information is emerging on the conditions of certain players. After Tuesday’s win against Bologna and a recovery session the next day, Massimiliano Allegri gave his players some rest. Milan will not play this weekend, as the match"
    },
    {
      "id": "85fa61a5e209",
      "title": "A month until the Milan derby: the Milan and Inter calendars compared",
      "url": "https://www.milannews.it/news/un-mese-al-derby-di-milano-i-calendari-di-milan-e-inter-a-confronto-606752",
      "source": "milannews.it",
      "date": "2026-02-08T10:36:59+00:00",
      "summary": "The Milan derby scheduled in a month will say a lot, but the previous weeks could also be very important in the championship fight between Milan and Inter, currently separated in the standings by five points."
    },
    {
      "id": "540ffbaaee95",
      "title": "Ambrosini and the anecdote from the final in Istanbul: \"Here's what happened at half-time\"",
      "url": "https://www.milannews.it/gli-ex/ambrosini-e-l-aneddoto-della-finale-di-istanbul-ecco-cos-e-successo-all-intervallo-606751",
      "source": "milannews.it",
      "date": "2026-02-08T10:24:31+00:00",
      "summary": "For years we have been talking about what happened during half-time of the 2005 Champions League final which was played in Istanbul between Milan and Liverpool, with the Rossoneri leading 3-0 at half-time."
    },
    {
      "id": "d52054d7ae01",
      "title": "Footmercato: Vlahovic aware crucial decision awaits as Milan pitch project – the competition",
      "url": "https://sempremilan.com/vlahovic-crucial-decision-milan-chelsea-barcelona",
      "source": "sempremilan.com",
      "date": "2026-02-08T10:15:00+00:00",
      "summary": "Dusan Vlahovic is heading towards a free transfer in the summer, but his destination remains a mystery at this point. Footmercato report that Vlahović was no longer certain about continuing his adventure with Juventus even last year.At the end of August, the striker’s situation had taken a ‘major tu"
    },
    {
      "id": "ae0faad37e31",
      "title": "Milan Women, Coach Bakker presents the match against league leaders Roma",
      "url": "https://www.milannews.it/milan-femminile/milan-femminile-coach-bakker-presenta-la-gara-contro-la-capolista-roma-606749",
      "source": "milannews.it",
      "date": "2026-02-08T10:12:04+00:00",
      "summary": "Today at 12.30 the Milan Women will be engaged on the pitch of league leaders Roma in the match valid for the 13th matchday of the Serie A Women."
    },
    {
      "id": "3a7823ab7dd0",
      "title": "Juventus working on the renewal of McKennie. On the American Marseille, Milan, Inter and Roma",
      "url": "https://www.milannews.it/news/juventus-al-lavoro-per-il-rinnovo-di-mckennie-sull-americano-marsiglia-milan-inter-e-roma-606750",
      "source": "milannews.it",
      "date": "2026-02-08T10:00:55+00:00",
      "summary": "After Kenan Yildiz, who extended in the last few hours until 2030, Juventus is also working to secure other players, such as Weston McKennie, a midfielder born in 1988 whose contract expires at the end of this season ..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "ec05173dcf11",
      "title": "‘I want to thank Milan’ – Baresi reflects on recovery after proud Olympic moment",
      "url": "https://sempremilan.com/baresi-reflects-recovery-milan-olympic",
      "source": "sempremilan.com",
      "date": "2026-02-08T09:50:00+00:00",
      "summary": "There was an emotional moment for Franco Baresi as he was a torchbearer at San Siro for the Milan Cortina 2026 Winter Olympics. Back in August, an official statement was posted on the club’s website: “AC Milan announces that, following routine medical checks, our Honorary Vice President Franco Bares"
    },
    {
      "id": "3f0ba02acdb2",
      "title": "Baresi: \"Representing your country for an Olympics is a unique opportunity. And then doing it in Milan and at San Siro which has been my home for decades...\"",
      "url": "https://www.milannews.it/news/baresi-rappresentare-il-proprio-paese-per-un-olimpiade-e-un-occasione-unica-e-poi-farlo-a-milano-e-a-san-siro-che-e-stata-casa-mia-per-decenni-606736",
      "source": "milannews.it",
      "date": "2026-02-08T09:46:42+00:00",
      "summary": "Franco Baresi, former Rossoneri captain who underwent surgery to remove a lung nodulation in August, gave a nice interview to Corriere della Sera in which he talked about his emotions when he ..."
    },
    {
      "id": "c2783d12a16f",
      "title": "Milan, Ardon Jashari's long run-up: the Swiss looks for more space",
      "url": "https://www.milannews.it/news/milan-la-lunga-rincorsa-di-ardon-jashari-lo-svizzero-cerca-piu-spazio-606748",
      "source": "milannews.it",
      "date": "2026-02-08T09:34:53+00:00",
      "summary": "No AC Milan fan can forget the endless negotiations that AC Milan had with Club Brugge for Ardon Jashari in the summer: weeks and weeks of rumors and indiscretions, until the final agreement that allowed the Swiss ..."
    },
    {
      "id": "4bfa5151bba5",
      "title": "Reports: Alex Jimenez’s permanent Bournemouth move sealed – the terms and figures",
      "url": "https://sempremilan.com/alex-jimenez-permanent-bournemouth-terms-figures",
      "source": "sempremilan.com",
      "date": "2026-02-08T09:25:00+00:00",
      "summary": "Alex Jimenez is by all intents and purposes now officially a Bournemouth player on a permanent basis, reports claim. Just when it looked like Jimenez would remain to be part of Massimiliano Allegri’s plans, Milan made the decision in the summer to allow him to join Bournemouth on an initial loan dea"
    },
    {
      "id": "64fc36d8fb93",
      "title": "Serie A Women, the results of yesterday's matches. Today at 12.30 Rome-Milan",
      "url": "https://www.milannews.it/milan-femminile/serie-a-femminile-i-risultati-delle-gare-di-ieri-oggi-alle-12-30-roma-milan-606746",
      "source": "milannews.it",
      "date": "2026-02-08T09:22:37+00:00",
      "summary": "The FIGC website reports yesterday's results of the matches valid for the 13th matchday of the Women's Serie A: \"The 13th matchday of the Serie A Women Athora 2025-26 opens with two away successes and a home success, in the three advance matches ..."
    },
    {
      "id": "1f2cd3d3c8fd",
      "title": "Bartesaghi renewal, signing close: extension until 2031 with tripled salary",
      "url": "https://www.milannews.it/calciomercato-milan/rinnovo-bartesaghi-firma-vicina-prolungamento-fino-al-2031-con-ingaggio-triplicato-606742",
      "source": "milannews.it",
      "date": "2026-02-08T09:10:13+00:00",
      "summary": "After having renewed Mike Maignan's contract, Milan is also preparing to lock down another very regular player, namely Davide Bartesaghi: as today's edition of Corriere dello Sport reported this morning, the signing of ..."
    },
    {
      "id": "883a1e052de8",
      "title": "Saelemaekers-Pulisic, Pisa goal. The conditions of Fullkrug and Leao",
      "url": "https://www.milannews.it/primo-piano/saelemaekers-pulisic-obiettivo-pisa-le-condizioni-di-fullkrug-e-leao-606745",
      "source": "milannews.it",
      "date": "2026-02-08T09:00:40+00:00",
      "summary": "After Tuesday's victory against Bologna and the training session the following day, Massimiliano Allegri gave his players some rest given that Milan will not play this weekend (the match against Como is ..."
    },
    {
      "id": "0338895b77fd",
      "title": "GdS: ‘Max the magician’ – how a ‘new Milan’ has been created through acquisitions",
      "url": "https://sempremilan.com/max-magician-new-milan-created-acquisitions",
      "source": "sempremilan.com",
      "date": "2026-02-08T09:00:00+00:00",
      "summary": "AC Milan’s summer transfer window has divided opinion in the months that follow, but now there are obvious green shoots. As La Gazzetta dello Sport (seen below) report, the mercato often plays out in a league of its own as big signings fail while low-cost acquisitions that prove to be hugely impactf"
    },
    {
      "id": "86279940550c",
      "title": "Baresi: \"How am I now? The worst is over, little by little I'm recovering my daily life\"",
      "url": "https://www.milannews.it/rassegna-stampa/baresi-come-sto-ora-il-peggio-e-passato-pian-piano-sto-recuperando-la-mia-quotidianita-606735",
      "source": "milannews.it",
      "date": "2026-02-08T08:47:22+00:00",
      "summary": "Franco Baresi, former AC Milan captain who underwent surgery to remove a lung nodulation in August, interviewed by Corriere della Sera, spoke of his condition as follows: \"In those moments you understand many things."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "31705bfb43ce",
      "title": "CorSport headlines: \"Top Rabiot, Allegri's delegate\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-corsport-titola-top-rabiot-il-delegato-di-allegri-606744",
      "source": "milannews.it",
      "date": "2026-02-08T08:35:12+00:00",
      "summary": "Today's edition of Corriere dello Sport has the headline this morning: \"Top Rabiot, Allegri's delegate\"."
    },
    {
      "id": "3ec2a971af31",
      "title": "Milan, training resumes today: Allegri aims for three recoveries for Pisa",
      "url": "https://www.milannews.it/rassegna-stampa/milan-oggi-la-ripresa-degli-allenamenti-allegri-punta-a-tre-recuperi-per-il-pisa-606743",
      "source": "milannews.it",
      "date": "2026-02-08T08:23:53+00:00",
      "summary": "After the three days of rest granted by Max Allegri, this afternoon Milan will meet at Milanello to resume training in view of the away match in Pisa scheduled for Friday 13 February."
    },
    {
      "id": "76895fb26e0d",
      "title": "CorSport: \"Bartesaghi and Tomori, two more renewals ready\"",
      "url": "https://www.milannews.it/rassegna-stampa/corsport-bartesaghi-e-tomori-pronti-altri-due-rinnovi-606741",
      "source": "milannews.it",
      "date": "2026-02-08T08:11:58+00:00",
      "summary": "\"Bartesaghi and Tomori, two more renewals ready\": this is the headline in Corriere dello Sport this morning, explaining that, after having made Mike Maignan's very important extension official in recent days, the Rossoneri are now close ..."
    },
    {
      "id": "47740a1027e2",
      "title": "The QS on Milan: \"Allegri changes least of all, but whoever comes in affects and decides\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-qs-sul-milan-allegri-cambia-meno-di-tutti-ma-chi-entra-incide-e-decide-606739",
      "source": "milannews.it",
      "date": "2026-02-08T07:59:05+00:00",
      "summary": "The Quotidiano Sportivo on newsstands today has this headline on Milan: \"Allegri changes the least of all, but whoever comes in affects and decides\"."
    },
    {
      "id": "6ef5631a67a4",
      "title": "Baresi talks about his emotions when he brought the Olympic Flame to San Siro",
      "url": "https://www.milannews.it/rassegna-stampa/baresi-racconta-le-sue-emozioni-quando-ha-portato-la-fiamma-olimpica-a-san-siro-606734",
      "source": "milannews.it",
      "date": "2026-02-08T07:48:58+00:00",
      "summary": "Franco Baresi, former Rossoneri captain who underwent surgery to remove a lung nodulation in August, gave a nice interview to Corriere della Sera in which he talked about his emotions when he ..."
    },
    {
      "id": "eb55f96fe962",
      "title": "Towards Pisa, Gazzetta: \"Saelemaekers and Pulisic are trying to recover\"",
      "url": "https://www.milannews.it/rassegna-stampa/verso-il-pisa-gazzetta-saelemaekers-e-pulisic-tentano-il-recupero-606733",
      "source": "milannews.it",
      "date": "2026-02-08T07:36:35+00:00",
      "summary": "\"Saelemaekers and Pulisic attempt recovery\": this is the headline in La Gazzetta dello Sport this morning, explaining that the Belgian and the American, both struggling with muscle problems, have continued even in these last days of recovery ..."
    },
    {
      "id": "7fb91bef076b",
      "title": "Tuttosport and the role of right midfielder at Milan: \"Fofana, Ricci and Loftus: all Max's options\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-e-il-ruolo-di-mezzala-destra-al-milan-fofana-ricci-e-loftus-tutte-le-opzioni-di-max-606732",
      "source": "milannews.it",
      "date": "2026-02-08T07:24:36+00:00",
      "summary": "Tuttosport on newsstands this morning has the following headline on the role of right midfielder at Milan: \"Fofana, Ricci and Loftus: all Max's options\"."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "b7bcbeaf716f",
      "title": "Di Stefano explains difference with Allegri as Pioli also ‘wanted to win 1-0’",
      "url": "https://sempremilan.com/di-stefano-difference-allegri-pioli-win-1-0",
      "source": "sempremilan.com",
      "date": "2026-02-07T19:22:07+00:00",
      "summary": "Peppe Di Stefano has shared an interesting background on the difference between Stefano Pioli and Massimiliano Allegri, with the latter opting to do things fully his way.  Pioli achieved a lot of success during his five-year spell at the club, winning the Scudetto in 2021-22 and reaching the Champio"
    },
    {
      "id": "37d5a6207d9a",
      "title": "‘We are almost there’ – Gimenez fuels idea of early return with positive message",
      "url": "https://sempremilan.com/almost-gimenez-fuels-idea-early-return",
      "source": "sempremilan.com",
      "date": "2026-02-07T18:49:39+00:00",
      "summary": "Santiago Gimenez has sent a positive message to the AC Milan fans, stating that it’s not long before he will be back on the pitch.  The Mexican striker has been on the sidelines since the end of October, when it was decided that he would stop to try to recover from an ankle injury. In […]\nThe post ‘"
    },
    {
      "id": "58ea8db069af",
      "title": "Opinions, latest news, match results and more: Subscribe to our free weekly newsletter",
      "url": "https://sempremilan.com/opinion-news-subscribe-free-weekly-newsletter",
      "source": "sempremilan.com",
      "date": "2026-02-07T18:01:06+00:00",
      "summary": "Every week, Oliver and Isak of the SempreMilan team send out a newsletter to keep you posted on all things AC Milan, from the latest match results to news and interesting stories.  In this day and age, it can be incredibly difficult to keep up with everything that happens around a football team. We "
    },
    {
      "id": "2df72e7dae81",
      "title": "Road to the derby: A look at Milan and Inter’s fixtures before the big clash",
      "url": "https://sempremilan.com/road-derby-milan-inters-fixtures-before",
      "source": "sempremilan.com",
      "date": "2026-02-07T17:40:00+00:00",
      "summary": "Just four matchdays remain before the big Derby della Madonnina clash between AC Milan and Inter. With only five points separating the teams still, it’s possible that the game could decide a whole lot.  Considering that Milan have been able to keep up with Inter so far, sort of, the Scudetto race is"
    },
    {
      "id": "042089288980",
      "title": "GdS: Criticism partially put to bed after successful January for Milan’s signings",
      "url": "https://sempremilan.com/gds-criticism-partially-bed-january-milan",
      "source": "sempremilan.com",
      "date": "2026-02-07T17:05:56+00:00",
      "summary": "AC Milan are starting to benefit from their summer and winter signings, as highlighted by a report, after six months that were filled with hefty criticism.  As Gazzetta dello Sport points out, the comments from fans and pundits are much less harsh than they used to be, while the criticism is pretty "
    },
    {
      "id": "3f5d1fdc4a7b",
      "title": "How Cardinale and De Laurentiis want to rescue Serie A’s TV rights",
      "url": "https://sempremilan.com/how-cardinale-rescue-seriea-tv-rights",
      "source": "sempremilan.com",
      "date": "2026-02-07T16:30:04+00:00",
      "summary": "If you ask 100 people what the main problem with Serie A is, I think an overwhelming majority would say the TV rights revenue. While it risks becoming a scapegoat to explain all of the league’s problems (not a healthy mindset), it’s hard to argue against its importance. So, how do you fix it? Gerry "
    },
    {
      "id": "f258db7cc381",
      "title": "Baresi says ‘my legs were shaking’ during torch duties at Olympics inauguration",
      "url": "https://sempremilan.com/baresi-legs-shaking-torch-duties-olympics",
      "source": "sempremilan.com",
      "date": "2026-02-07T15:59:02+00:00",
      "summary": "Franco Baresi was one of the torchbearers at the inauguration of the Winter Olympics at San Siro yesterday. As he revealed afterwards, it was an experience that he will never forget.  The Winter Olympics are underway in Milano-Cortina and yesterday, the inauguration was held at San Siro. It is preci"
    },
    {
      "id": "27cf54da36ce",
      "title": "Costs of Maignan’s new deal highlight just how important star renewals are",
      "url": "https://sempremilan.com/costs-maignan-new-deal-important-renewals",
      "source": "sempremilan.com",
      "date": "2026-02-07T15:14:27+00:00",
      "summary": "The financials of Mike Maignan’s renewal have highlighted just how important it is to renew your star players, rather than going out and signing new ones.  Contract renewals have been a hot topic, and a sensitive one as well, at Milan since the departures of Gigio Donnarumma and Hakan Calhanoglu. In"
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "d9bbe93c80c0",
      "title": "Official: AC Milan Women announce two signings after key departure",
      "url": "https://sempremilan.com/official-ac-milan-women-announce-kamczyk-sesay",
      "source": "sempremilan.com",
      "date": "2026-02-07T14:46:18+00:00",
      "summary": "AC Milan Women have announced the signings of Ewelina Kamczyk and Mawa Sesay in the last few days, strengthening the side after a pretty big departure.  Two weeks ago, Milan confirmed the sale of their star forward Evelyn Ijeh to NC Courage. It is believed that the Rossoneri got a decent chunk of ca"
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "4b26b43fe7d4",
      "title": "Milan Primavera 0-1 Lazio: Three red cards shown in yet another defeat",
      "url": "https://sempremilan.com/milan-primavera-0-1-lazio-red-cards-defeat",
      "source": "sempremilan.com",
      "date": "2026-02-07T14:16:28+00:00",
      "summary": "Milan Primavera suffered a tough defeat against Lazio earlier this afternoon, definitely held back by the fact that two of their players were sent off. After the big defeat against Hellas Verona last weekend, the hope was that Giovanni Renna’s boys would be able to turn things around this time out. "
    },
    {
      "id": "b448fa404442",
      "title": "Longo: Milan have ‘earmarked’ €8m for young striker as negotiations continue",
      "url": "https://sempremilan.com/longo-milan-earmarked-8m-young-striker",
      "source": "sempremilan.com",
      "date": "2026-02-07T13:52:22+00:00",
      "summary": "AC Milan are still hoping to secure the services of Andrej Kostic and according to a report, they have earmarked €8m for the operation in the summer.  Kostic, who currently plays for Partizan Belgrade, was heavily linked with the Rossoneri last month and at one point, the move seemed imminent. Then,"
    },
    {
      "id": "c23e9467b328",
      "title": "Romano confirms Inter ‘was never an option’ for Maignan amid Milan renewal",
      "url": "https://sempremilan.com/romano-confirms-inter-never-option-maignan",
      "source": "sempremilan.com",
      "date": "2026-02-07T13:22:47+00:00",
      "summary": "Mike Maignan was courted by several clubs before AC Milan announced the contract renewal, but Inter was never an option for the goalkeeper.  On Saturday last week, Milan confirmed that Maignan had signed a new contract with the club until 2031. As such, a tiring saga was put to an end and it was cer"
    },
    {
      "id": "7f3e5913cce8",
      "title": "First shot at redemption: Milan’s run of revenge starts with Pisa return",
      "url": "https://sempremilan.com/first-shot-milans-run-revenge-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-07T12:30:00+00:00",
      "summary": "Next week’s clash against Pisa will be AC Milan’s first shot at revenge, following four now infamous games earlier in the season.  Just as Milan’s strong record against the top rivals has been highlighted this season, the same can be said for their struggles against the bottom-half sides. It all ste"
    },
    {
      "id": "8974911f0f07",
      "title": "GdS: Pulisic eyeing return for Pisa-Milan after working on his days off",
      "url": "https://sempremilan.com/gds-pulisic-return-pisa-milan-working",
      "source": "sempremilan.com",
      "date": "2026-02-07T12:00:00+00:00",
      "summary": "Christian Pulisic is eyeing a full recovery for AC Milan’s game against Pisa, eager to turn a corner after being on the sidelines for some time.  The American has been struggling with bursitis, i.e. an inflammation, in recent weeks and that’s why he has barely featured for the Rossoneri. Rather than"
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    },
    {
      "id": "0bbe5dfeba4c",
      "title": "Milan vs. Como postponed for 2026 Winter Olympics opening ceremony: when will it be played?",
      "url": "https://football-italia.net/milan-vs-como-postponed-2026-olympics-when/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:59:54+00:00",
      "summary": "With the Stadio Meazza in San Siro unavailable for the 2026 Winter Olympics opening ceremony,..."
    },
    {
      "id": "7c148df4d4cd",
      "title": "Glasner opens up on Mateta’s failed Milan medical: ‘It wasn’t a big surprise’",
      "url": "https://football-italia.net/glasner-on-matetas-failed-milan-medical/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:55:13+00:00",
      "summary": "Crystal Palace head coach Oliver Glasner has admitted that ‘it wasn’t a big big surprise’..."
    },
    {
      "id": "c10c6a922ef6",
      "title": "San Siro’s last dance at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/san-siro-last-dance-winter-olympics-ceremony/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:23:58+00:00",
      "summary": "The opening ceremony of the 2026 Milan Cortina Winter Olympics will take place today at..."
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    },
    {
      "id": "b17892f94874",
      "title": "Hazard: ‘I was a Milan fan’, ‘special’ relationship with Sarri, but Mourinho the best",
      "url": "https://football-italia.net/hazard-milan-fan-sarri-special-mourinho-best/",
      "source": "football-italia.net",
      "date": "2026-02-05T10:54:34+00:00",
      "summary": "Former Belgian star Eden Hazard reveals he was a Milan fan as a kid and..."
    },
    {
      "id": "f86a3c2aa1e5",
      "title": "Del Piero: Juventus ‘must’ have title belief, but avoids Yildiz comparison",
      "url": "https://football-italia.net/del-piero-juventus-title-no-yildiz-comparison/",
      "source": "football-italia.net",
      "date": "2026-02-05T09:35:42+00:00",
      "summary": "Juventus legend Alessandro Del Piero feels the Bianconeri can still aim for the Serie A..."
    },
    {
      "id": "a5543b121859",
      "title": "Marotta: ‘Inter approve of rotation, Milan have an advantage for Scudetto’",
      "url": "https://football-italia.net/marotta-inter-approve-rotation-milan-advantage/",
      "source": "football-italia.net",
      "date": "2026-02-04T19:52:47+00:00",
      "summary": "Inter President Beppe Marotta backs the squad rotation for the Coppa Italia quarter-final with Torino..."
    },
    {
      "id": "9de86510452c",
      "title": "Why Inter vs. Torino Coppa Italia clash moved for 2026 Winter Olympics",
      "url": "https://football-italia.net/why-inter-vs-torino-coppa-italia-clash-moved/",
      "source": "football-italia.net",
      "date": "2026-02-04T17:23:22+00:00",
      "summary": "Tonight’s Coppa Italia quarter-final is technically Inter hosting Torino, but the 2026 Winter Olympics mean..."
    },
    {
      "id": "d1ee46184128",
      "title": "Milan eyeing Italy striker for summer transfer window but unwilling to spend €62m",
      "url": "https://football-italia.net/milan-eyeing-italy-striker-for-summer/",
      "source": "football-italia.net",
      "date": "2026-02-04T16:31:09+00:00",
      "summary": "Wednesday’s reports claim that Milan are eyeing a potential move for Italy international Moise Kean..."
    },
    {
      "id": "2b1e8827ad38",
      "title": "Capello analyses Milan’s 3-0 win over Bologna: ‘Foolish not to consider the Scudetto’",
      "url": "https://football-italia.net/capello-analyses-milans-3-0-win-over-bologna/",
      "source": "football-italia.net",
      "date": "2026-02-04T12:42:25+00:00",
      "summary": "Fabio Capello has had his say on Milan’s recent 3-0 victory over Bologna in Serie..."
    },
    {
      "id": "b268dce71cdf",
      "title": "Today’s Papers – Milan impress in Bologna, Yildiz extends with Juventus",
      "url": "https://football-italia.net/todays-papers-milan-impress-in-bologna-yildiz-extends-with-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-04T08:29:55+00:00",
      "summary": "La Gazzetta dello Sport “What the Devil!” Milan overwhelm Bologna (3-0) and remain five points..."
    },
    {
      "id": "a7d106533e6a",
      "title": "Allegri: ‘Important to reach 50 points, but Milan have to do better’",
      "url": "https://football-italia.net/allegri-important-for-milan-to-reach-50-points/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:52:34+00:00",
      "summary": "Massimiliano Allegri believes that there is still room for improvement for his Milan side, despite..."
    },
    {
      "id": "6b625068a1fd",
      "title": "Italiano: ‘Bologna can’t put in two consecutive top-level performances’",
      "url": "https://football-italia.net/italiano-bologna-two-consecutive-performances/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:42:19+00:00",
      "summary": "Vincenzo Italiano was left bemused and questioning why his Bologna side do not seem able..."
    }
  ]
}