{
  "lastUpdated": "2026-02-18T14:42:18.978832+00:00",
  "articles": [
    {
      "id": "2de6b29188a3",
      "title": "Champions League, the playoffs continue: the matches scheduled for tonight",
      "url": "https://www.milannews.it/news/champions-league-continuano-i-playoff-le-gare-in-programma-stasera-607815",
      "source": "milannews.it",
      "date": "2026-02-18T14:40:00+00:00",
      "summary": "The first legs of the Champions League playoffs will continue this evening. After the defeats of Juventus and Atalanta, Inter are also on the field this evening in the difficult away game at Bodo."
    },
    {
      "id": "bf9ccd1935e8",
      "title": "Milan, historic record of capital gains in a season: the data",
      "url": "https://www.milannews.it/news/milan-record-storico-di-plusvalenze-in-una-stagione-il-dato-607870",
      "source": "milannews.it",
      "date": "2026-02-18T14:30:05+00:00",
      "summary": "In the last two weeks, Milan has completed two transfers which have brought around 20 million euros into AC Milan's coffers: first there was the redemption of Alex Jimenez by Bournemouth, then that of Tommaso Pobega who is p ..."
    },
    {
      "id": "0cbf3162da79",
      "title": "CM: Milan and Juventus retain interest in Parma star despite renewal – the situation",
      "url": "https://sempremilan.com/milan-juventus-parma-pellegrino-renewal-situation",
      "source": "sempremilan.com",
      "date": "2026-02-18T14:30:00+00:00",
      "summary": "It is well-known that AC Milan are looking for the right striker in view of the summer, and a domestic option is gaining momentum. As Calciomercato.com report, Parma’s survival depends primarily on the goals of Mateo Pellegrino, the centre-forward who has been a regular starter in the Gialloblu’s at"
    },
    {
      "id": "5d86b9881b20",
      "title": "UEFA ranking, the race for fifth place: Italy's position after the Champions League evening",
      "url": "https://www.milannews.it/news/ranking-uefa-la-corsa-al-quinto-posto-la-posizione-dell-italia-dopo-la-serata-di-champions-607812",
      "source": "milannews.it",
      "date": "2026-02-18T14:20:00+00:00",
      "summary": "Champions League Tuesday does not bring Italy any closer to fifth place in the Champions League next season, with Juventus and Atalanta's defeats against Galatasaray and Borussia Dortmund respectively."
    },
    {
      "id": "a466756544d7",
      "title": "Giletti and the VAR: \"Fantastic decisions since the beginning of the year, we need to clarify\"",
      "url": "https://www.milannews.it/news/giletti-e-il-var-da-inizio-anno-decisioni-allucinanti-serve-fare-chiarezza-607794",
      "source": "milannews.it",
      "date": "2026-02-18T14:10:00+00:00",
      "summary": "Massimo Giletti, on TMW Radio, spoke like this about the VAR after Inter-Juve: \"Marotta's words? If we do like him, going back in time talking about other cases, we won't get out of it."
    },
    {
      "id": "3ecccc1bff44",
      "title": "Why is Milan vs. Como the only Serie A match being played on Wednesday?",
      "url": "https://football-italia.net/why-is-milan-como-being-played-on-wednesday/",
      "source": "football-italia.net",
      "date": "2026-02-18T14:08:50+00:00",
      "summary": "Milan are due to take on Como in Serie A on Sunday evening, the only..."
    },
    {
      "id": "3c8f692c7f20",
      "title": "LIVE MN - Towards Milan-Como: Jashari is back in midfield, the Nkunku-Leao pair up front",
      "url": "https://www.milannews.it/primo-piano/live-mn-verso-milan-como-si-rivede-jashari-a-centrocampo-in-avanti-la-coppia-nkunku-leao-607854",
      "source": "milannews.it",
      "date": "2026-02-18T14:00:00+00:00",
      "summary": "This is Milan's probable lineup: (3-5-2) Maignan; Tomori, De Winter, Pavlovic; Athekame, Jashari, Modric, Ricci, Bartesaghi; Nkunku, Leao.\n\nFriends of MilanNews."
    },
    {
      "id": "fd7c00ea74cc",
      "title": "De Paola: \"If sport abdicates its educational role it's over\"",
      "url": "https://www.milannews.it/news/de-paola-se-lo-sport-abdica-nel-suo-ruolo-educativo-e-finita-607805",
      "source": "milannews.it",
      "date": "2026-02-18T14:00:00+00:00",
      "summary": "Paolo De Paola spoke like this to TMW Radio after the great chaos in Inter-Juventus: \"By now it is made to understand that it is taken for granted that a player can mislead the referee by simulating."
    },
    {
      "id": "5abfc55eb210",
      "title": "GdS: Cardinale aiming to enforce three key RedBird concepts with increased Milan presence",
      "url": "https://sempremilan.com/cardinale-redbird-concepts-increased-milan-presence",
      "source": "sempremilan.com",
      "date": "2026-02-18T14:00:00+00:00",
      "summary": "Gerry Cardinale has visited Milanello twice in quick succession (at least by his usual timescale), and more frequent trips could follow. La Gazzetta dello Sport‘s report begins by outlining the ‘three corporate cornerstones’ around which RedBird Capital want to run Milan: continuity, stability, cent"
    },
    {
      "id": "a16ead29b4c7",
      "title": "MN - D'Amico on Milan-Como: \"If the Rossoneri interpret it with personality, they take it home\"",
      "url": "https://www.milannews.it/news/mn-d-amico-su-milan-como-se-i-rossoneri-la-interpretano-con-personalita-la-portano-a-casa-607835",
      "source": "milannews.it",
      "date": "2026-02-18T13:50:00+00:00",
      "summary": "Tonight Milan will host Como at San Siro to try to put pressure on Inter. To address these topics, he spoke to MilanNews."
    },
    {
      "id": "2db5574fad51",
      "title": "Towards Milan-Como, the balance of the precedents at San Siro between the two teams",
      "url": "https://www.milannews.it/news/verso-milan-como-il-bilancio-dei-precedenti-a-san-siro-tra-le-due-squadre-607846",
      "source": "milannews.it",
      "date": "2026-02-18T13:41:14+00:00",
      "summary": "In view of Milan-Como this evening, the Lega Calcio Serie A website reports these statistics on the two teams: \"There are 17 previous meetings between the two teams at Milan's home ground: 10 Rossoneri victories (last 2-1, Serie A 2024/25), 5 ..."
    },
    {
      "id": "8263b5a32c55",
      "title": "Sky: Loftus-Cheek to miss Como game with physical problem – who will replace him",
      "url": "https://sempremilan.com/loftus-cheek-miss-como-who-replace",
      "source": "sempremilan.com",
      "date": "2026-02-18T13:35:00+00:00",
      "summary": "There is some late and not very great injury news for AC Milan on the day of their game against Pisa at San Siro. According to what is being reported by Sky (via MilanNews), Massimiliano Allegri had made a decision on the attacking duo that he was going to field against Como: it was going […]\nThe po"
    },
    {
      "id": "eb060911f496",
      "title": "Italy’s extra Champions League spot fades away after Juventus and Atalanta losses",
      "url": "https://football-italia.net/italys-extra-champions-league-spot-fades-away/",
      "source": "football-italia.net",
      "date": "2026-02-18T13:33:42+00:00",
      "summary": "Italy’s chances of receiving an extra spot in next season’s Champions League were dealt another..."
    },
    {
      "id": "f1337579d355",
      "title": "MN - Verheyen believes in Jashari: \"He will become a fundamental player for Milan\"",
      "url": "https://www.milannews.it/news/mn-verheyen-crede-in-jashari-diventera-un-giocatore-fondamentale-nel-milan-607863",
      "source": "milannews.it",
      "date": "2026-02-18T13:29:14+00:00",
      "summary": "Gert Verheyen, former Bruges player, spoke thus to Milannews."
    },
    {
      "id": "ffa731a782af",
      "title": "Biasin analyzes Milan-Como: \"Two determining factors for the Rossoneri\". Here are the ones",
      "url": "https://www.milannews.it/news/biasin-analizza-milan-como-due-fattori-determinanti-per-i-rossoneri-ecco-quali-607785",
      "source": "milannews.it",
      "date": "2026-02-18T13:20:00+00:00",
      "summary": "Fabrizio Biasin, in his editorial on TMW, said this about Milan-Como: \"Do Milan's Scudetto fate depend on tonight's match against Como? Probable, and it will depend above all on two factors: 1) How Milan will manage to ..."
    },
    {
      "id": "b5d64e9f26a8",
      "title": "Expulsions in Serie A from the 21/22 season to today: 21 red cards for Milan, only 5 for Inter",
      "url": "https://www.milannews.it/news/espulsioni-in-serie-a-dalla-stagione-21-22-a-oggi-21-rossi-per-il-milan-solo-5-per-l-inter-607869",
      "source": "milannews.it",
      "date": "2026-02-18T13:11:42+00:00",
      "summary": "This evening against Como, Massimiliano Allegri will have to do without Adrien Rabiot, sent off (double yellow) on Friday against Pisa and stopped for a match by the Sports Judge."
    },
    {
      "id": "d1f59558ae92",
      "title": "Giletti on the Var: \"I've seen some havoc this year, no one attacking Rocchi\"",
      "url": "https://www.milannews.it/news/giletti-sul-var-ho-visto-degli-scempi-quest-anno-nessuno-che-attacca-rocchi-607792",
      "source": "milannews.it",
      "date": "2026-02-18T13:10:00+00:00",
      "summary": "Massimi Giletti spoke to TMW Radio about the Kalulu-Bastoni chaos like this: \"When Rocchi's boss doesn't phone the head of the referees but Gravina, we've reached the end."
    },
    {
      "id": "23da12719f38",
      "title": "Liberali thanks Fonseca and Milan but reveals why he left: “I have no regrets”",
      "url": "https://sempremilan.com/liberali-fonseca-milan-no-regrets-left",
      "source": "sempremilan.com",
      "date": "2026-02-18T13:10:00+00:00",
      "summary": "Mattia Liberali has thanked AC Milan for what they have given him in his young career, including his debut in Serie A. Liberali rather surprisingly left Milan on a permanent basis to join Catanzaro in the summer mercato, and while he had some difficulties initially, he has begun to shine in Serie B."
    },
    {
      "id": "d31d356deb5e",
      "title": "Amoroso and the experience at Milan: \"I hoped to play more, but Galliani was clear with me...\"",
      "url": "https://www.milannews.it/gli-ex/amoroso-e-l-esperienza-al-milan-speravo-di-giocare-di-piu-ma-galliani-era-stato-chiaro-con-me-607831",
      "source": "milannews.it",
      "date": "2026-02-18T13:00:28+00:00",
      "summary": "Marcio Amoroso, former striker of, among others, Udinese and Milan, spoke to the Gazzetta dello Sport about his experience with the Rossoneri: \"It was the winter of 2006, before the World Cup in Germany."
    },
    {
      "id": "523efa2a0d3c",
      "title": "MN EXCLUSIVE - Bruges legend, Verheyen: \"I believe in Jashari, he's a top player. The important thing, however, is that he doesn't give up. Three pennies to Milan? He's not ready yet\"",
      "url": "https://www.milannews.it/esclusive-mn/esclusiva-mn-leggenda-bruges-verheyen-credo-in-jashari-e-un-top-l-importante-pero-e-che-non-si-butti-giu-tresoldi-al-milan-non-e-ancora-pronto-607853",
      "source": "milannews.it",
      "date": "2026-02-18T13:00:01+00:00",
      "summary": "As it seems, Ardon Jashari will take Adrien Rabiot's place in Massimiliano Allegri's eleven against Como this evening."
    },
    {
      "id": "9edb565d936d",
      "title": "MN - D'Amico on the refereeing class: \"Sometimes too touchy and self-referential\"",
      "url": "https://www.milannews.it/news/mn-d-amico-sulla-classe-arbitrale-a-volte-troppo-permalosa-e-autoreferenziale-607840",
      "source": "milannews.it",
      "date": "2026-02-18T12:50:00+00:00",
      "summary": "Tonight Milan will host Como at San Siro to try to put pressure on Inter. But these are moments in which Italian football is facing complicated days."
    },
    {
      "id": "443466535bb1",
      "title": "PROBABLE LINEUP - Milan-Como: physical problem for Loftus, Nkunku plays",
      "url": "https://www.milannews.it/news/probabile-formazione-milan-como-problema-fisico-per-loftus-gioca-nkunku-607620",
      "source": "milannews.it",
      "date": "2026-02-18T12:45:00+00:00",
      "summary": "MILAN-COMO, THE PROBABLE LINE-UP\n16 Maignan\n23 Tomori, 5 De Winter, 31 Pavlovic\n24 Athekame, 30 Jashari, 14 Modric, 4 Ricci, 33 Bartesaghi\n18 Nkunku, 10 Leao\n\nDependent"
    },
    {
      "id": "57223f4804cd",
      "title": "The five key battles that could win or lose the game for Milan against Como",
      "url": "https://sempremilan.com/five-key-battles-milan-como-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-18T12:45:00+00:00",
      "summary": "It has been a while since AC Milan ran out in front of their home fans at San Siro – one month to be exact – but they will do so again tonight. There is plenty of attention surrounding the ‘rematch’ between Milan and Como, after the 3-1 win for the Rossoneri last month sparked […]\nThe post The five "
    },
    {
      "id": "8adc1150b9f8",
      "title": "Towards Milan-Como: physical problem for Loftus, Nkunku plays with Leao from the 1st minute",
      "url": "https://www.milannews.it/news/verso-milan-como-problema-fisico-per-loftus-gioca-nkunku-con-leao-dal-1-607867",
      "source": "milannews.it",
      "date": "2026-02-18T12:41:42+00:00",
      "summary": "News in the probable AC Milan lineup that will take to the field from the first minute against Como this evening: the presence of Ruben Loftus-Cheek in attack seemed certain, but the Englishman is not at his best due to a physical problem and here ..."
    },
    {
      "id": "6e8ccb197068",
      "title": "Official: Bologna sign Milan midfielder on permanent basis",
      "url": "https://football-italia.net/bologna-sign-milan-midfielder-on-permanent/",
      "source": "football-italia.net",
      "date": "2026-02-18T12:41:09+00:00",
      "summary": "Bologna have officially announced their signing of Tommaso Pobega on a definitive, permanent transfer from..."
    },
    {
      "id": "d12c2fcfd4a4",
      "title": "Cousins: \"Many referees see VAR as a way to justify their performances\"",
      "url": "https://www.milannews.it/news/cugini-molti-arbitri-vedono-il-var-come-un-modo-per-giustificare-le-proprie-prestazioni-607787",
      "source": "milannews.it",
      "date": "2026-02-18T12:40:00+00:00",
      "summary": "Mimmo Cugini, on TMW Radio, spoke about VAR like this: \"I believe there was too much fuel on the fire and too much poison."
    },
    {
      "id": "ba5957d1e9ee",
      "title": "Double postponement in the seasonal matches between Milan and Como: since the 2019/20 season the same match has not been postponed for both the first leg and the second leg",
      "url": "https://www.milannews.it/news/doppio-rinvio-nelle-sfide-stagionali-tra-milan-e-como-era-dalla-stagione-2019-20-che-la-stessa-gara-non-veniva-rinviata-sia-all-andata-che-al-ritorno-607845",
      "source": "milannews.it",
      "date": "2026-02-18T12:30:02+00:00",
      "summary": "In view of Milan-Como this evening, the Lega Calcio Serie A website reports these statistics on the two teams: \"There are 17 previous meetings between the two teams at Milan's home ground: 10 Rossoneri victories (last 2-1, Serie A 2024/25), 5 ..."
    },
    {
      "id": "5407f821f3ea",
      "title": "Tonight Milan-Como, Biasin: \"The Rossoneri's Scudetto fate depends on tonight's match\"",
      "url": "https://www.milannews.it/news/stasera-milan-como-biasin-le-sorti-scudetto-dei-rossoneri-passano-dal-match-di-stasera-607784",
      "source": "milannews.it",
      "date": "2026-02-18T12:20:00+00:00",
      "summary": "Fabrizio Biasin, in his editorial on TMW, spoke like this about Milan-Como: \"Do Milan's Scudetto fate depend on tonight's match against Como? Probable, and it will depend above all on two factors: 1) How Milan will manage to ..."
    },
    {
      "id": "cdd85edb01a3",
      "title": "GdS: Home again at last – 75,000 fans expected at San Siro for first game in a month",
      "url": "https://sempremilan.com/home-at-last-come-75000",
      "source": "sempremilan.com",
      "date": "2026-02-18T12:20:00+00:00",
      "summary": "Exactly one month after the last time (against Lecce, a 1-0 win), AC Milan will play a home league game at San Siro. As La Gazzetta dello Sport (seen below) recall, back on January 18 Milan hosted Lecce and Niclas Füllkrug scoring the winning goal. Then came the unusual run of three consecutive away"
    },
    {
      "id": "0b70e8e15b15",
      "title": "CM: When Gimenez should return for Milan and the two reasons it could be crucial",
      "url": "https://sempremilan.com/when-gimenez-return-two-reasons-crucial",
      "source": "sempremilan.com",
      "date": "2026-02-18T11:55:00+00:00",
      "summary": "AC Milan’s Santiago Gimenez has been out since December 18th, but his return is getting closer with each passing day. As Calciomercato.com recall, Gimenez had to undergo arthroscopic surgery to fix a lingering issue in his right ankle, but now there is a ‘glimmer of light at the end of the tunnel’. "
    },
    {
      "id": "9bee6e15eb43",
      "title": "CorSport: A chance to end a drought – Leao to return to the XI against Como",
      "url": "https://sempremilan.com/chance-end-drought-leao-return-como",
      "source": "sempremilan.com",
      "date": "2026-02-18T11:30:00+00:00",
      "summary": "AC Milan need to continue their winning ways against Como or they risk Inter running away with the title, and Rafael Leao will be key again. As Corriere dello Sport (via MilanPress) report this morning, Milan are chasing their city rivals against with the derby in early March on the horizon. They wi"
    },
    {
      "id": "5964f9085752",
      "title": "Moretto reveals Milan’s strategy regarding Bartesaghi: “At the end of the season”",
      "url": "https://sempremilan.com/moretto-milan-strategy-bartesaghi-end-season",
      "source": "sempremilan.com",
      "date": "2026-02-18T11:05:00+00:00",
      "summary": "AC Milan are planning to sit down with Davide Bartesaghi and discuss a contract renewal, but not for a few more weeks. Bartesaghi came into the season as the back-up on the left side with Pervis Estupinan having signed from Brighton. However, after the Ecuadorian picked up an injury, the Milan acade"
    },
    {
      "id": "82b74bc659f8",
      "title": "GdS: Predicted XIs for AC Milan vs. Como – changes in each department",
      "url": "https://sempremilan.com/predicted-xis-milan-como-changes-department",
      "source": "sempremilan.com",
      "date": "2026-02-18T10:40:00+00:00",
      "summary": "AC Milan will play at San Siro for the first time in 31 days tonight as they welcome Lombardy neighbours Como. There is a lot of intrigue surrounding this game for a couple of reasons. Firstly, Milan’s 3-1 against Como last month sparked a debate about style of play versus getting results, with Cesc"
    },
    {
      "id": "7044dcedc704",
      "title": "Tuttosport: Ricci and Jashari in line for big chance vs. Como – why Allegri will pick them",
      "url": "https://sempremilan.com/ricci-jashari-big-chance-como-why",
      "source": "sempremilan.com",
      "date": "2026-02-18T10:15:00+00:00",
      "summary": "Massimiliano Allegri will be forced to make changes tonight against Como, and appears to have finally settled on his line-up. As Tuttosport (via MilanNews) report this morning, the most significant change will be in midfield, with a significant absence: Adrien Rabiot. The Frenchman was handed a one-"
    },
    {
      "id": "4a89cd0e7212",
      "title": "Official: Tommaso Pobega completes full AC Milan exit as Bologna confirm permanent deal",
      "url": "https://sempremilan.com/official-pobega-bologna-milan-permanent-deal",
      "source": "sempremilan.com",
      "date": "2026-02-18T09:50:00+00:00",
      "summary": "Tommaso Pobega’s loan spell at Bologna has been turned into a permanent one after various clauses were triggered, it has been confirmed. After the winter window closed, Alex Jimenez’s move to AFC Bournemouth from Milan was turned from a loan into a permanent deal, both clubs recently confirmed. The "
    },
    {
      "id": "326b4faa031d",
      "title": "GdS: Milan playing for their Scudetto dream – Allegri’s plan to take Como down again",
      "url": "https://sempremilan.com/milan-playing-scudetto-dream-allegri-como",
      "source": "sempremilan.com",
      "date": "2026-02-18T09:25:00+00:00",
      "summary": "After doubts for months about when and even where the game would be played, AC Milan will finally host Como at San Siro tonight. As La Gazzetta dello Sport (seen below) write this morning, in other eras you might have thought it was a classic David versus Goliath showdown. In reality, Como are now c"
    },
    {
      "id": "f5ba944f0536",
      "title": "Serie A: Milan vs. Como – Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-milan-vs-como-probable-line-ups/",
      "source": "football-italia.net",
      "date": "2026-02-18T09:16:33+00:00",
      "summary": "Milan will be without several of their key first team players when they take on..."
    },
    {
      "id": "0ec14d34c804",
      "title": "Gallery: ‘Scudetto dream on the line’, ‘Objective -5’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/front-pages-18-february-milan-como",
      "source": "sempremilan.com",
      "date": "2026-02-18T09:00:00+00:00",
      "summary": "It has been one month since AC Milan last played a home league game, but they are back under the San Siro lights tonight to face Como. Milan made it consecutive away wins on Friday night against Pisa, but they were forced to fight right until the final whistle in an eventual 2-1 victory. Inter then "
    },
    {
      "id": "88e05da709e9",
      "title": "Today’s Papers: An historic Juve blunder, Galagoal, Bastoni apology",
      "url": "https://football-italia.net/today-papers-historic-juve-blunder-galagoal/",
      "source": "football-italia.net",
      "date": "2026-02-18T08:37:44+00:00",
      "summary": "La Gazzetta dello Sport  Not like that  An historic gaffe in the Champions League Bremer..."
    },
    {
      "id": "2be7c9561fb8",
      "title": "MN: Predicted Milan XI to face Como – Leao returns to starting XI as Allegri trials new midfield",
      "url": "https://sempremilan.com/predicted-milan-xi-face-como-leao-returns",
      "source": "sempremilan.com",
      "date": "2026-02-17T19:30:00+00:00",
      "summary": "AC Milan manager Massimiliano Allegri is expected to make a number of changes to his starting XI to face Como on Wednesday night.  With Adrien Rabiot out, it was impossible that Allegri would go unchanged for this game. However, most would not have expected the number of changes that the Italian is "
    },
    {
      "id": "abe57cceabd3",
      "title": "Fabregas discusses previous Milan links and revenge after reverse fixture: “Not ready to win the Scudetto”",
      "url": "https://sempremilan.com/fabregas-previous-milan-links-revenge-fixture",
      "source": "sempremilan.com",
      "date": "2026-02-17T19:00:00+00:00",
      "summary": "Cesc Fabregas will hope to get one back on AC Milan after his Como side were beaten 3-1 earlier in the season. He hopes things go differently at San Siro tomorrow.  It is understandable why Fabregas is considered to be one of the brightest new coaches in European football currently. He holds a lot o"
    },
    {
      "id": "64642d1e16e0",
      "title": "Moretto: Camarda’s future ‘remains to be seen’ – Milan could consider ‘permanent deal’",
      "url": "https://sempremilan.com/camarda-future-milan-could-consider-permanent-deal",
      "source": "sempremilan.com",
      "date": "2026-02-17T18:25:12+00:00",
      "summary": "It seemed that Francesco Camarda could have been the heir to AC Milan’s striker spot, but this may not be the case anymore.  There can be no denying that Camarda has had it tough in recent years. The youngster shot onto the scene after an impressive youth career, making his debut at just 15 years […"
    },
    {
      "id": "6a8e6e18e30b",
      "title": "Serie A preview: AC Milan vs. Como – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-ac-milan-como-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-17T18:00:00+00:00",
      "summary": "AC Milan have a rare midweek fixture to contest on Wednesday night, as they welcome Como to San Siro for a rescheduled game. The match was originally meant to be played the weekend before last, but was moved due to the Winter Olympic opening ceremony causing a clash at San Siro. Nonetheless, it is a"
    },
    {
      "id": "e7b3cce9b801",
      "title": "CM: Allegri could revert Milan to 4-3-3 when Leao and Pulisic return – the idea",
      "url": "https://sempremilan.com/allegri-revert-milan-433-leao-pulisic-return",
      "source": "sempremilan.com",
      "date": "2026-02-17T17:30:00+00:00",
      "summary": "With Christian Pulisic and Rafael Leao returning, AC Milan have a much healthier-looking front line. As a result, they could be used in their more natural positions again. The idea to play a 4-3-3 with Milan was there from the start for Massimiliano Allegri. In fact, he actually started with the for"
    },
    {
      "id": "9c6f67289b8c",
      "title": "Allegri addresses idea of Fabregas rivalry and dig from Como fans: “Results through performances”",
      "url": "https://sempremilan.com/allegri-addresses-idea-fabregas-rivalry-como-dig",
      "source": "sempremilan.com",
      "date": "2026-02-17T17:00:00+00:00",
      "summary": "There has been a bit of a spat between Como and AC Milan manager Massimiliano Allegri since their meeting earlier this season.  Before the first game between the sides, Cesc Fabregas and Allegri were quite complimentary to one another, appreciating the work of the other and celebrating their work th"
    },
    {
      "id": "6f0a372ca4ee",
      "title": "How much Milan will earn as Pobega completes permanent Bologna move",
      "url": "https://football-italia.net/milan-earn-pobega-permanent-bologna-move/",
      "source": "football-italia.net",
      "date": "2026-02-17T14:16:49+00:00",
      "summary": "Reports in Italy claim that Tommaso Pobega has formally joined Bologna on a permanent deal..."
    },
    {
      "id": "185e6c8ca2a4",
      "title": "Allegri: Pulisic doubt for Milan, Inter ‘clear title favourites’",
      "url": "https://football-italia.net/allegri-pulisic-doubt-milan-inter-favourite/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:44:56+00:00",
      "summary": "Milan coach Massimiliano Allegri says Christian Pulisic is in doubt for tomorrow’s Serie A match..."
    },
    {
      "id": "28770c59c3ab",
      "title": "Allegri weighs in on diving debate and asks for offside rule change",
      "url": "https://football-italia.net/allegri-weighs-in-on-diving-debate/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:28:16+00:00",
      "summary": "Massimiliano Allegri has had his say on the diving debate that has cropped up in..."
    },
    {
      "id": "04fdb1372c8f",
      "title": "Why Milan director Tare was fined after win over Pisa",
      "url": "https://football-italia.net/why-milan-director-tare-fined-after-win-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:12:36+00:00",
      "summary": "Milan director Igli Tare was fined €10,000 after the Rossoneri’s 2-1 win over Pisa on..."
    },
    {
      "id": "068c9b768450",
      "title": "Official: Juventus directors Comolli and Chiellini given lengthy bans after Derby d’Italia",
      "url": "https://football-italia.net/official-juventus-comolli-and-chiellini-banned/",
      "source": "football-italia.net",
      "date": "2026-02-17T12:58:31+00:00",
      "summary": "Juventus directors Damien Comolli and Giorgio Cheillini, plus players Pierre Kalulu, Nicolo Barella and Hakan..."
    },
    {
      "id": "825c7f4cae9c",
      "title": "Inter vs. Juventus refereeing upset Milan too – report",
      "url": "https://football-italia.net/inter-vs-juventus-refereeing-upset-milan-too/",
      "source": "football-italia.net",
      "date": "2026-02-16T14:46:52+00:00",
      "summary": "Corriere dello Sport reports that the officiating in Inter-Juventus did not infuriate the Bianconeri only,..."
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    }
  ]
}