{
  "lastUpdated": "2026-02-23T18:00:45.033696+00:00",
  "articles": [
    {
      "id": "9c57cd27af27",
      "title": "CM: Renewal close for Milan defender after Spurs rejection – Allegri’s crucial role",
      "url": "https://sempremilan.com/renewal-close-tomori-spurs-rejection-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-23T18:00:00+00:00",
      "summary": "AC Milan are closing in on agreeing a new contract with Fikayo Tomori, something Massimiliano Allegri has been pushing for. As Calciomercato.com report, Allegri was an important factor in getting Tomori back to his near-best form, and the coach has also been a big sponsor of the contract renewal tha"
    },
    {
      "id": "73e98bca23fd",
      "title": "Pellegatti harsh: \"Marotta, Comolli, Manna spoke, it wasn't Landucci who should have complained yesterday but a manager\"",
      "url": "https://www.milannews.it/news/pellegatti-duro-hanno-parlato-marotta-comolli-manna-non-doveva-lamentarsi-landucci-ieri-ma-un-dirigente-608449",
      "source": "milannews.it",
      "date": "2026-02-23T17:50:11+00:00",
      "summary": "During last night's episode of Pressing, Carlo Pellegatti expressed himself as follows on the case of the Parma goal:\n\n\"Landucci didn't protest after the match, but it doesn't have to be Landucci, Landucci is rightly a coach, ..."
    },
    {
      "id": "0fca734de764",
      "title": "Turin, Baroni sacked: the arrival of D'Aversa is official in his place",
      "url": "https://www.milannews.it/news/torino-esonerato-baroni-al-suo-posto-e-ufficiale-l-arrivo-di-d-aversa-608481",
      "source": "milannews.it",
      "date": "2026-02-23T17:40:28+00:00",
      "summary": "Torino has sacked Marco Baroni: it was already in the air from the final whistle of the match that the Granata lost at Ferraris against Genoa 3-0 and it was made official in the afternoon."
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "1054758dcf78",
      "title": "Adani attacks: \"Piccinini did not take into consideration or communicate Troilo's foul on Bartesaghi. And the VAR? Dead!\"",
      "url": "https://www.milannews.it/news/adani-attacca-piccinini-non-ha-preso-in-considerazione-ne-comunicato-il-fallo-di-troilo-su-bartesaghi-e-il-var-morto-608443",
      "source": "milannews.it",
      "date": "2026-02-23T17:30:39+00:00",
      "summary": "During the usual appointment with \"La Domenica Sportiva\", the former footballer Daniele Adani commented on the highly contested episode that decided Milan-Parma, namely Troilo's goal spoiled by a foul by the ducal defender himself..."
    },
    {
      "id": "9de5934f77c6",
      "title": "MN: Gabbia undergoes scans after late exclusion from Milan-Parma – the results",
      "url": "https://sempremilan.com/gabbia-scans-late-exclusion-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-23T17:30:00+00:00",
      "summary": "Some clarity on Matteo Gabbia’s condition has arrived after there was some panic in the build-up to the game against Parma. There was a late line-up change for Massimiliano Allegri to make just before kick-off against Parma.  Gabbia pulled up during the warm-ups with muscle discomfort so he was with"
    },
    {
      "id": "c531a6f19aac",
      "title": "Milan: Loftus Cheek's condition after surgery",
      "url": "https://www.milannews.it/news/milan-le-condizioni-di-loftus-cheek-dopo-l-intervento-chirurgico-608483",
      "source": "milannews.it",
      "date": "2026-02-23T17:20:50+00:00",
      "summary": "(ANSA) - MILAN, FEBRUARY 23 - weeks out for Loftus Cheek. Milan communicates this."
    },
    {
      "id": "1cc9478d3295",
      "title": "MN - Former referee Carmagnini: \"Anything happens every Sunday. The referees are adapting to the level of Italian football\"",
      "url": "https://www.milannews.it/news/mn-l-ex-arbitro-carmagnini-ogni-domenica-ne-succedono-di-ogni-gli-arbitri-si-stanno-adeguando-al-livello-del-calcio-italiano-608462",
      "source": "milannews.it",
      "date": "2026-02-23T17:10:44+00:00",
      "summary": "Milan-Parma leaves a legacy of incandescent controversies: from Valenti's block on Maignan to the possible foul by Troilo, scorer of the decisive goal, on Bartesaghi."
    },
    {
      "id": "a303bed95f12",
      "title": "MN - For Gabbia, strain on the flexors of the right thigh. Muscle-tendon injuries excluded",
      "url": "https://www.milannews.it/news/mn-per-gabbia-risentimento-ai-flessori-della-coscia-destra-escluse-lesioni-muscolo-tendinee-608480",
      "source": "milannews.it",
      "date": "2026-02-23T17:02:46+00:00",
      "summary": "The editorial staff of MilanNews.it understands that during yesterday's pre-match warm-up, Matteo Gabbia reported a strain on the flexors of his right thigh."
    },
    {
      "id": "14c9d00b6e4f",
      "title": "Official: Loftus-Cheek undergoes operation on fractured jaw – his recovery time",
      "url": "https://sempremilan.com/loftus-cheek-undergoes-operation-fractured-jaw",
      "source": "sempremilan.com",
      "date": "2026-02-23T17:00:00+00:00",
      "summary": "AC Milan have confirmed that Ruben Loftus-Cheek underwent surgery after his nasty injury during Sunday’s game against Parma. There was a rather sickening moment in the first few minutes of the 1-0 defeat at San Siro. Alexis Saelemaekers sent in a rabona cross that Loftus-Cheek tried to meet, but his"
    },
    {
      "id": "0caabec6cf07",
      "title": "Pistocchi: \"Any deliberate contact with the goalkeeper inside the goal area should always be sanctioned: the referee had made the correct decision\"",
      "url": "https://www.milannews.it/news/pistocchi-ogni-contatto-deliberato-sul-portiere-all-interno-dell-area-di-porta-andrebbe-sempre-sanzionato-l-arbitro-aveva-preso-la-decisione-corretta-608440",
      "source": "milannews.it",
      "date": "2026-02-23T16:50:14+00:00",
      "summary": "Maurizio Pistocchi, journalist, expressed himself as follows on"
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "71aecf1e8334",
      "title": "Pasotto: \"There is only one, very small consolation for Milan who falls thunderously at home to Parma\"",
      "url": "https://www.milannews.it/news/pasotto-c-e-una-unica-magrissima-consolazione-per-il-milan-che-cade-fragorosamente-in-casa-col-parma-608436",
      "source": "milannews.it",
      "date": "2026-02-23T16:40:24+00:00",
      "summary": "Marco Pasotto, journalist, expressed himself as follows in La Gazzetta dello Sport on Milan-Parma: \"It started with a -10 and a +8, and that's how it ended."
    },
    {
      "id": "68c9c999007a",
      "title": "PHOTO - Before and after, Loftus shows the results of the operation after the bad injury",
      "url": "https://www.milannews.it/news/foto-prima-e-dopo-loftus-mostra-i-risultati-dell-operazione-dopo-il-brutto-infortunio-608479",
      "source": "milannews.it",
      "date": "2026-02-23T16:38:37+00:00",
      "summary": "Through his Instagram stories, Ruben Loftus-Cheek, who suffered a very bad injury last night (fracture of the alveolar process of the jaw), warned that the surgery was a perfect success."
    },
    {
      "id": "8390a1a2a7b4",
      "title": "OFFICIAL: Operation Loftus-Cheek successful. Recovery time estimated at 8 weeks",
      "url": "https://www.milannews.it/news/ufficiale-operazione-loftus-cheek-riuscita-tempi-di-recupero-stimati-in-8-settimane-608478",
      "source": "milannews.it",
      "date": "2026-02-23T16:36:13+00:00",
      "summary": "AC Milan announces that Ruben Loftus-Cheek, yesterday, suffered a significant facial trauma which resulted in the fracture of the alveolar process of the jaw."
    },
    {
      "id": "15f81fdffc22",
      "title": "Varriale doubtful: \"But why doesn't VAR intervene on the disallowed goal in Bergamo and instead does it on the disallowed one in Parma?\"",
      "url": "https://www.milannews.it/news/varriale-dubbioso-ma-perche-il-var-non-interviene-su-gol-annullato-a-bergamo-e-invece-lo-fa-su-quello-annullato-a-parma-608441",
      "source": "milannews.it",
      "date": "2026-02-23T16:30:56+00:00",
      "summary": "Enrico Varriale, journalist, expressed himself as follows on X commenting on Milan's defeat against Parma: \"By beating Milan, Parma gives the scudetto to Inter."
    },
    {
      "id": "0149e8ab47a4",
      "title": "Home struggles and strange coincidences: All the key stats from Milan 0-1 Parma",
      "url": "https://sempremilan.com/all-key-stats-ac-milan-0-1-parma",
      "source": "sempremilan.com",
      "date": "2026-02-23T16:30:00+00:00",
      "summary": "AC Milan’s unbeaten run was snapped at 24 games as they were beaten by Parma on Sunday at San Siro in an encounter with plenty of controversy. Milan missed a number of opportunities to take the lead, the most symbolic of which was Rafael Leao hitting the post. Then, in the closing minutes, Parma got"
    },
    {
      "id": "fe5e35aae632",
      "title": "Parma conquers San Siro 12 years after the last time. In March 2014 it ended 2-4 for the ducals",
      "url": "https://www.milannews.it/news/il-parma-espugna-san-siro-12-anni-dopo-l-ultima-volta-nel-marzo-2014-era-finita-2-4-per-i-ducali-608429",
      "source": "milannews.it",
      "date": "2026-02-23T16:22:46+00:00",
      "summary": "Parma won an away match against Milan in Serie A for the first time since March 2014 (4-2). Opta reports it."
    },
    {
      "id": "2d3530b8afbd",
      "title": "Trevisani: \"Milan is having a good championship, but the quality of play isn't improving\"",
      "url": "https://www.milannews.it/news/trevisani-il-milan-sta-facendo-un-campionato-di-buon-livello-ma-non-migliora-la-qualita-di-gioco-608438",
      "source": "milannews.it",
      "date": "2026-02-23T16:11:28+00:00",
      "summary": "Riccardo Trevisani, journalist, expressed himself to Pressing about Milan after the defeat against Parma: \"Milan are having a good championship, but they are not improving the quality of play, they are not improving their exposure..."
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "ef49f0e7b831",
      "title": "MN - former referee Carmagnini on Piccinini's OFR: \"He had full vision of everything, no one could tell him if it was a foul or not a foul\"",
      "url": "https://www.milannews.it/news/mn-l-ex-arbitro-carmagnini-sull-ofr-di-piccinini-aveva-piena-visione-di-tutto-nessuno-poteva-dirgli-se-era-fallo-o-non-fallo-608461",
      "source": "milannews.it",
      "date": "2026-02-23T16:00:58+00:00",
      "summary": "Milan-Parma leaves a legacy of incandescent controversies: from Valenti's block on Maignan to the possible foul by Troilo, scorer of the decisive goal, on Bartesaghi."
    },
    {
      "id": "a889b85a5e98",
      "title": "MN - Tests have ruled out injuries for Matteo Gabbia",
      "url": "https://www.milannews.it/news/mn-gli-esami-hanno-escluso-lesioni-per-matteo-gabbia-608468",
      "source": "milannews.it",
      "date": "2026-02-23T16:00:40+00:00",
      "summary": "Following the tests carried out today, the editorial staff of MilanNews.it learned that injuries to Matteo Gabbia have been ruled out."
    },
    {
      "id": "69936f614a26",
      "title": "CM: Füllkrug not fully convincing Allegri – Milan ‘unlikely’ to use option agreed with West Ham",
      "url": "https://sempremilan.com/milan-unlikely-option-fullkrug-west-ham",
      "source": "sempremilan.com",
      "date": "2026-02-23T16:00:00+00:00",
      "summary": "Niclas Füllkrug started well at AC Milan, but with each passing game his future beyond May becomes less and less certain. As Calciomercato.com write, Massimiliano Allegri highlighted the need for a natural striker in the summer, a target man to be the focal point of the attack. He wanted a player wi"
    },
    {
      "id": "02b6f062c568",
      "title": "Bergomi: \"Milan have been playing this way all year. Parma defends well and if you don't unlock them straight away it becomes difficult\"",
      "url": "https://www.milannews.it/news/bergomi-il-milan-e-tutto-l-anno-che-gioca-in-questa-maniera-il-parma-si-difende-bene-e-se-non-la-sblocchi-subito-diventa-difficile-608386",
      "source": "milannews.it",
      "date": "2026-02-23T15:50:34+00:00",
      "summary": "Giuseppe Bergomi, former Inter player and now commentator for Sky Sport 24, intervened after the match of Milan-Parma 0-1 and commented on the performance of the Rossoneri team: \"Milan is everything ..."
    },
    {
      "id": "74bbb36e04ec",
      "title": "Messi's Inter Miami knocked out in the first of the North American championship",
      "url": "https://www.milannews.it/news/l-inter-miami-di-messi-ko-nella-prima-del-campionato-nordamericano-608420",
      "source": "milannews.it",
      "date": "2026-02-23T15:41:10+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 22 - Los Angeles FC sent a message on the opening day of the MLS season by defeating Lionel Messi's Inter Miami, the reigning champion of the North American football championship, 3-0."
    },
    {
      "id": "65bbfa9944b8",
      "title": "Bucchioni on Troilo's goal: \"The varista Camplone decides to become the protagonist. Valenti is clever...\"",
      "url": "https://www.milannews.it/news/bucchioni-sul-gol-di-troilo-il-varista-camplone-decide-di-diventare-protagonista-valenti-fa-la-furbata-608410",
      "source": "milannews.it",
      "date": "2026-02-23T15:30:52+00:00",
      "summary": "During the usual appointment with his editorial for TMW, the journalist Enzo Bucchioni could not help but talk about what happened in the last weekend of the championship, yet another tainted by gross refereeing errors: \n ..."
    },
    {
      "id": "b3e6ce1565e7",
      "title": "Cuomo explains why Milan ‘sorely miss’ Galliani: “If a club feels penalised, they speak up”",
      "url": "https://sempremilan.com/why-galliani-missed-milan-speak-up",
      "source": "sempremilan.com",
      "date": "2026-02-23T15:30:00+00:00",
      "summary": "AC Milan are currently lacking a figure who commands respect and authority within the head offices of Lega Serie A, according to journalist Michael Cuomo. Milan’s 24-game unbeaten run came to an end on Sunday evening as they were beaten by Parma in a game that had plenty of controversy. Ruben Loftus"
    },
    {
      "id": "5a926882b362",
      "title": "AC Milan hadn't taken at least 25 shots in a Serie A match without scoring since April 2022",
      "url": "https://www.milannews.it/news/era-da-aprile-2022-che-il-milan-non-effettuava-almeno-25-tiri-in-un-match-di-serie-a-senza-segnare-608428",
      "source": "milannews.it",
      "date": "2026-02-23T15:20:01+00:00",
      "summary": "Since April 2022 (33 vs Bologna) AC Milan had not taken at least 25 shots in a Serie A match without scoring (25 vs Parma). Opta reports it."
    },
    {
      "id": "3fdaa96c8cdd",
      "title": "Criscitiello: \"Milan delivers the scudetto to Inter who will win the tricolor without having done anything special\"",
      "url": "https://www.milannews.it/news/criscitiello-il-milan-consegna-lo-scudetto-all-inter-che-vincera-il-tricolore-senza-aver-fatto-nulla-di-particolare-608408",
      "source": "milannews.it",
      "date": "2026-02-23T15:10:56+00:00",
      "summary": "During the usual appointment with his editorial for Sportitalia, director Michele Criscitiello spoke about Milan and beyond, defining the championship issue as closed in a championship which, according to him, is mediocre and worthless ..."
    },
    {
      "id": "4f576d5f169c",
      "title": "GdS: Leao and Pulisic ‘struggling together’ despite Allegri’s conviction – the reasons",
      "url": "https://sempremilan.com/leao-pulisic-struggling-together-reasons",
      "source": "sempremilan.com",
      "date": "2026-02-23T15:00:00+00:00",
      "summary": "Massimiliano Allegri designated Rafael Leao and Christian Pulisic as his first choice front two, and yet the pair haven’t clicked. As La Gazzetta dello Sport report, there are only 12 games to go in the Serie A season and yet Leao and Pulisic need more time form a strike partnership worthy of their "
    },
    {
      "id": "2893b9b07d40",
      "title": "Watch: Wasteful Milan and controversial calls see Parma win at San Siro – the highlights",
      "url": "https://sempremilan.com/watch-milan-0-1-parma-highlights",
      "source": "sempremilan.com",
      "date": "2026-02-23T14:30:00+00:00",
      "summary": "AC Milan’s unbeaten run was ended by Parma at San Siro on Sunday evening, and with it any title hopes have probably alse been destroyed. Milan missed a few chances before the only goal of the game, with Rafael Leao’s volley being symbolic of the night. The Portuguese hammered an effort against the i"
    },
    {
      "id": "06175247b220",
      "title": "From Gabbia to Troilo: The many decisions Milan feel have gone against them in 2025-26",
      "url": "https://sempremilan.com/many-decisions-milan-against-them-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-23T14:00:00+00:00",
      "summary": "AC Milan are far from happy with the officiating this season, which they believe has cost them several points along the way. The fall-out continues after Milan’s home defeat against Parma, which ended their 24-game unbeaten run in the league and saw Inter move 10 points clear at the top of the table"
    },
    {
      "id": "ffb50b86a96b",
      "title": "Ordine believes Milan must ‘watch out’ for chasing pack: “The magic has been interrupted”",
      "url": "https://sempremilan.com/ordine-milan-watch-out-chasing-pack",
      "source": "sempremilan.com",
      "date": "2026-02-23T13:35:00+00:00",
      "summary": "AC Milan suffered their most damaging result of the season so far at San Siro on Sunday night as they were beaten 1-0 by Parma. Milan missed a number of big chances to take the lead, coming closes with Rafael Leao’s volley that hit the inside of the post. Then, in the closing minutes, Parma […]\nThe "
    },
    {
      "id": "0ccc0fa537e9",
      "title": "Moretto: Maignan ‘closed the door’ on approach from Juventus – the background",
      "url": "https://sempremilan.com/maignan-closed-door-approach-juventus",
      "source": "sempremilan.com",
      "date": "2026-02-23T13:10:00+00:00",
      "summary": "AC Milan managed to obtain Mike Maignan’s renewal after months of negotiations, but there was interest from rivals Juventus. During the summer window it looked certain that Maignan’s time at Milan was coming to an end. Chelsea tried to sign him before the Club World Cup, and even though he remained "
    },
    {
      "id": "3ee264ad577f",
      "title": "GdS: Milan’s AIA call ‘ineffective’ – why there is further anger about officiating",
      "url": "https://sempremilan.com/why-milan-further-anger-officiating",
      "source": "sempremilan.com",
      "date": "2026-02-23T12:45:00+00:00",
      "summary": "AC Milan have been left angered by officiating for the second time in just a few days, this time following the shock defeat to Parma. As La Gazzetta dello Sport write, Milan’s polite call to the AIA was ‘ineffective’. In fact, the effect was the opposite of what was hoped for. After the Como draw, t"
    },
    {
      "id": "0da24353115d",
      "title": "‘We got 54 points this way’ – Landucci responds strongly to idea of three-man attack",
      "url": "https://sempremilan.com/landucci-responds-idea-three-man-attack",
      "source": "sempremilan.com",
      "date": "2026-02-23T12:20:00+00:00",
      "summary": "AC Milan’s assistant coach Marco Landucci answered some difficult questions after the loss against Parma, including one about the attacking configuration. Landucci stepped into the dugout for the fifth time this season with Massimiliano Allegri suspended again. The previous games saw wins over Bari,"
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6d24314da5c6",
      "title": "Parma boss Cuesta sends message to Loftus-Cheek and dodges question about Troilo goal",
      "url": "https://sempremilan.com/parma-cuesta-loftus-cheek-troilo-goal",
      "source": "sempremilan.com",
      "date": "2026-02-23T11:55:00+00:00",
      "summary": "Parma head coach Carlos Cuesta sent his thoughts to Ruben Loftus-Cheek, and dodged a question about the winner against AC Milan. Back in 1993, Milan went into a home game against Parma with a 58-game unbeaten run on the line, and lost 1-0 to an Asprilla free-kick. While last night it was only a 24-g"
    },
    {
      "id": "c00978e91e0f",
      "title": "CM: Pulisic loses aim amid possible distractions – goal drought reaches two months",
      "url": "https://sempremilan.com/pulisic-loses-aim-drought-two-months",
      "source": "sempremilan.com",
      "date": "2026-02-23T11:30:00+00:00",
      "summary": "Christian Pulisic has been decisive for AC Milan since arriving in 2023, but he is not going through the best patch of form at the moment. As Calciomercato.com recall, Milan’s 24-game unbeaten run went up in smoke last night as they not only lost against Parma, but failed to score. Even fielding the"
    },
    {
      "id": "51e337fc67bb",
      "title": "‘The On-Field Review is not fair’ – Loftus-Cheek and Troilo incidents divide expert opinion",
      "url": "https://sempremilan.com/loftus-cheek-troilo-divide-expert-opinion",
      "source": "sempremilan.com",
      "date": "2026-02-23T11:05:00+00:00",
      "summary": "AC Milan’s defeat to Parma had a couple of highly controversial decisions, which have been the subject of debate from experts and pundits. The first one came just a few minutes in: a cross from Alexis Saelemaekers on the left side was cleared by a defender a split second before the Parma goalkeeper "
    },
    {
      "id": "db464e29a86d",
      "title": "A swathe of disappointing performances: Player ratings from Milan-Parma from Italian papers",
      "url": "https://sempremilan.com/player-ratings-milan-0-1-parma-italian-papers",
      "source": "sempremilan.com",
      "date": "2026-02-23T10:40:00+00:00",
      "summary": "AC Milan’s 24-game unbeaten run fell at San Siro on Sunday as they lost to Parma 1-0, while the Scudetto hopes probably went with it. The only goal of the game was a controversial one 10 minutes from time, as Troilo rose at the far post to head in a corner. It was initially disallowed […]\nThe post A"
    },
    {
      "id": "4d37804875f9",
      "title": "CorSport: Just like 1993 – Parma end Milan’s unbeaten run again as title dream evaporates",
      "url": "https://sempremilan.com/parma-end-milan-unbeaten-run-again-1993",
      "source": "sempremilan.com",
      "date": "2026-02-23T10:15:00+00:00",
      "summary": "AC Milan needed to win to keep the Scudetto race alive against Parma on Sunday, but instead their unbeaten run was ended. As Corriere dello Sport (via MilanNews) write this morning, the game against Parma should have been a chance for Milan to show that they are fully over their hoodoo against teams"
    },
    {
      "id": "81618ec3638b",
      "title": "Reports: Loftus-Cheek set for surgery with season-ending injury feared – Corvi’s gesture",
      "url": "https://sempremilan.com/loftus-cheek-surgery-season-ending-injury-feared",
      "source": "sempremilan.com",
      "date": "2026-02-23T09:50:00+00:00",
      "summary": "In addition to losing the game late on, there was another negative note for AC Milan on Sunday as Ruben Loftus-Cheek had to be stretchered off. As MilanNews recall, Loftus-Cheek had to leave the San Siro pitch just minutes into the match against Parma, taken to hospital on a stretcher and in a neck "
    },
    {
      "id": "ecf0a15c0181",
      "title": "GdS: Toothless and timid – why Milan showed familiar failings in loss to Parma",
      "url": "https://sempremilan.com/why-milan-showed-familiar-failings-parma",
      "source": "sempremilan.com",
      "date": "2026-02-23T09:25:00+00:00",
      "summary": "AC Milan’s unbeaten streak was ended by Parma at San Siro on Sunday, and now the Scudetto dream has probably vanished for good. As La Gazzetta dello Sport (seen below) report, Massimiliano Allegri’s pre-match calculation was that Milan needed to win 12 of their last 13 games to catch Inter and win t"
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "7d1eaf8982a2",
      "title": "Serie A | Milan 0-1 Parma – Player Ratings as Troilo and Corvi batten down the hatches",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-player-ratings/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:09:16+00:00",
      "summary": "Milan fell to a late 1-0 defeat to Parma this evening, after they were unable..."
    },
    {
      "id": "0338d8d0b0d7",
      "title": "Serie A | Milan 0-1 Parma: Rossoneri suffer shocking first defeat in 24 rounds",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-shocking-defeat-24/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:05:53+00:00",
      "summary": "Milan paid the price for insipid finishing and sluggish defending, as Parma inflicted their first..."
    },
    {
      "id": "ad92e7503a8c",
      "title": "Ex-West Ham & Villa man Reo-Coker: ‘Fabregas pull on Saelemaekers inexcusable’",
      "url": "https://football-italia.net/ex-west-ham-villa-man-reo-coker-fabregas/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:50:32+00:00",
      "summary": "Former West Ham and Aston Villa midfielder turned CBS Sports Golazo pundit Nigel Reo-Coker has..."
    },
    {
      "id": "be4ffa2fa372",
      "title": "Milan double blow as Loftus-Cheek and Gabbia suffer injuries",
      "url": "https://football-italia.net/milan-double-loftus-cheek-gabbia-injuries/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:25:58+00:00",
      "summary": "Milan suffered two major injuries in their match against Parma, as Matteo Gabbia pulled out..."
    },
    {
      "id": "a426ed6a1955",
      "title": "Landucci: ‘Milan focus on our journey, believe in Leao’",
      "url": "https://football-italia.net/landucci-milan-focus-journey-believe-in-leao/",
      "source": "football-italia.net",
      "date": "2026-02-22T16:40:03+00:00",
      "summary": "Milan assistant manager Marco Landucci shrugs off talk of the Scudetto race with rivals Inter..."
    },
    {
      "id": "47258cff203b",
      "title": "Serie A official line-ups: Milan vs. Parma",
      "url": "https://football-italia.net/serie-a-official-line-ups-milan-vs-parma/",
      "source": "football-italia.net",
      "date": "2026-02-22T15:54:34+00:00",
      "summary": "Milan welcome Christian Pulisic and Adrien Rabiot back to the starting XI with Rafael Leao..."
    },
    {
      "id": "cdb760fc8c2d",
      "title": "Serie A: Milan vs. Parma: Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-milan-vs-parma-probable-line-ups-2/",
      "source": "football-italia.net",
      "date": "2026-02-22T09:17:18+00:00",
      "summary": "Christian Pulisic and Rafael Leao look set to partner each other in attack for just..."
    }
  ]
}