{
  "lastUpdated": "2026-02-24T11:39:45.674699+00:00",
  "articles": [
    {
      "id": "251efe86af7d",
      "title": "Di Chiara on the Champions League fight: \"I still see Milan as ahead\"",
      "url": "https://www.milannews.it/news/di-chiara-sulla-lotta-champions-il-milan-lo-vedo-ancora-in-vantaggio-608542",
      "source": "milannews.it",
      "date": "2026-02-24T11:30:00+00:00",
      "summary": "Alberto Di Chiara, on TMW Radio, spoke like this about the Champions League fight: \"I still see Milan as ahead, but they alternate behind. Juve seemed to have found their verve again and have now lost some matches."
    },
    {
      "id": "1eaf0cf69210",
      "title": "Tunnel change and talks with old Milan team-mates: Hauge at home ahead of San Siro return",
      "url": "https://sempremilan.com/hauge-at-home-milan-inter-bodo-glimt",
      "source": "sempremilan.com",
      "date": "2026-02-24T11:30:00+00:00",
      "summary": "Jens Petter Hauge has admitted that Bodo/Glimt’s Champions League play-off second leg against Inter will have a bit of extra meaning. Hauge’s story is somewhat of a fairytale given that he first played at San Siro for Bodo against Milan in a Europa League play-off, impressing with a wonderful goal a"
    },
    {
      "id": "f9b438c199c1",
      "title": "Pizzi and the Champions League fight: \"Milan, be careful. However, the Rossoneri have an advantage\"",
      "url": "https://www.milannews.it/news/pizzi-e-la-lotta-champions-milan-attento-i-rossoneri-pero-hanno-un-vantaggio-608543",
      "source": "milannews.it",
      "date": "2026-02-24T11:20:00+00:00",
      "summary": "Fausto Pizzi, on TMW Radio, spoke about the Champions League fight: \"It will be a beautiful fight. Juve and Atalanta can hope, they have to be careful up front."
    },
    {
      "id": "b7393955c7d3",
      "title": "Serious mistakes, but the club's silence is also not good. Lock down the Champions League then targeted purchases. Watch out for the backlash",
      "url": "https://www.milannews.it/editoriale/errori-gravi-ma-pure-il-silenzio-del-club-non-va-bene-blindare-la-champions-poi-acquisti-mirati-occhio-al-contraccolpo-608490",
      "source": "milannews.it",
      "date": "2026-02-24T11:15:36+00:00",
      "summary": "It would be wrong to reduce everything to refereeing episodes, and equally wrong not to consider VAR errors just for the sake of going against Max Allegri. When analyzing Milan's current moment, both factors must be taken into account."
    },
    {
      "id": "012f83675f85",
      "title": "Moretto: \"Kirovski-Milan Futuro, positive dialogues to continue together\"",
      "url": "https://www.milannews.it/news/moretto-kirovski-milan-futuro-dialoghi-positivi-per-continuare-insieme-608559",
      "source": "milannews.it",
      "date": "2026-02-24T11:10:00+00:00",
      "summary": "Matteo Moretto, on Fabrizio Romano's YouTube channel, spoke thus about Milan Futuro and the situation relating to Jovan Kirovski: \"It was still 2025 when I told you that there would be changes within the organigr ..."
    },
    {
      "id": "bfe010df21ac",
      "title": "Reports: Gabbia’s scan provides positive news – return vs. Cremonese a possibility",
      "url": "https://sempremilan.com/gabbia-return-vs-cremonese-a-possibility",
      "source": "sempremilan.com",
      "date": "2026-02-24T11:05:00+00:00",
      "summary": "Sunday’s match against Parma brought bad news, not only for AC Milan’s title pursuit but also on the injury front too. In the space of a few minutes, Massimiliano Allegri lost two players. The first was Matteo Gabbia, who was warming up as normal getting ready for a start in the middle of the three-"
    },
    {
      "id": "0ceb3cfd5179",
      "title": "Milan, the Scudetto dream fades: small indigestibles and an \"enemy\" San Siro",
      "url": "https://www.milannews.it/primo-piano/milan-sfuma-il-sogno-scudetto-piccole-indigeste-ed-un-san-siro-nemico-608558",
      "source": "milannews.it",
      "date": "2026-02-24T11:00:00+00:00",
      "summary": "Milan tried until the end to keep the Scudetto race alive, but after the heavy home defeat against Parma Massimiliano Allegri's team slipped to -10 from the top, virtually handing the tricolor to their rivals..."
    },
    {
      "id": "106eed3b4790",
      "title": "Bonanni: \"Contact Corvi-Loftus Cheek from a penalty, Troilo's goal could be legal\"",
      "url": "https://www.milannews.it/news/bonanni-contatto-corvi-loftus-cheek-da-rigore-il-gol-di-troilo-puo-essere-regolare-608545",
      "source": "milannews.it",
      "date": "2026-02-24T10:50:00+00:00",
      "summary": "Massimo Bonanni, connected on TMW Radio, spoke like this about the controversial refereeing episodes in Milan-Parma: I believe that the contact between Corvi and Loftus Cheek was a penalty, while Troilo's goal may have been legal.\""
    },
    {
      "id": "d29483dae09e",
      "title": "Canovi on Milan with a view to the Scudetto: \"A disappointment, he should have dared more\"",
      "url": "https://www.milannews.it/news/canovi-sul-milan-in-ottica-scudetto-una-delusione-avrebbe-dovuto-osare-di-piu-608550",
      "source": "milannews.it",
      "date": "2026-02-24T10:40:00+00:00",
      "summary": "Dario Canovi, transfer operator, was interviewed by TMW and spoke thus about Milan with a view to the Scudetto: \"He could have been an opponent, but it's a disappointment because he should have dared more to think about ..."
    },
    {
      "id": "444653021d6b",
      "title": "Seven home wins in 13 games: Lorenzo and Stefano analyse Milan’s San Siro struggles",
      "url": "https://sempremilan.com/milan-san-siro-struggles-7-wins-13-games",
      "source": "sempremilan.com",
      "date": "2026-02-24T10:40:00+00:00",
      "summary": "AC Milan played two home games last week, and they failed to win either of them. As a result, the Scudetto dream has ended before March.  Milan’s home form has become a big problem. They have won just over half of their games at San Siro this season, with seven wins, four draws and two […]\nThe post "
    },
    {
      "id": "dfa5afe95abe",
      "title": "Galli: \"Blocks have always existed, but in any case you cannot prevent the goalkeeper from reaching the ball or going into the trajectory\"",
      "url": "https://www.milannews.it/news/galli-i-blocchi-sono-sempre-esistiti-ma-in-ogni-caso-non-si-puo-impedire-al-portiere-di-raggiungere-la-palla-o-di-andare-in-traiettoria-608553",
      "source": "milannews.it",
      "date": "2026-02-24T10:30:11+00:00",
      "summary": "Speaking in the columns of La Gazzetta dello Sport, former Milan number 1 Giovanni Galli had his say on Parma's goal, spoiled not only by a Troilo-Bartesaghi contact, but above all by a block by Valenti on Mike Maignan: \n\n&q ..."
    },
    {
      "id": "2472253e43ee",
      "title": "Matri on Milan's problem: \"He doesn't have the ability to manage moments\"",
      "url": "https://www.milannews.it/news/matri-sul-problema-del-milan-non-ha-la-gestione-dei-momenti-608556",
      "source": "milannews.it",
      "date": "2026-02-24T10:20:03+00:00",
      "summary": "During the usual appointment with the DAZN program \"4-3-3\", the former Milan and Juventus striker, among others, Alessandro Matri, spoke about Milan, focusing on the analysis of what could be the real problem ..."
    },
    {
      "id": "b310a608bcd9",
      "title": "GdS: Wrong decision, long absence and renewal doubt – Milan angry after Loftus-Cheek blow",
      "url": "https://sempremilan.com/milan-angry-after-loftus-cheek-blow",
      "source": "sempremilan.com",
      "date": "2026-02-24T10:15:00+00:00",
      "summary": "AC Milan will be without Ruben Loftus-Cheek for an extended period of time, and it is a double blow for the club to digest. As La Gazzetta dello Sport (seen below) write this morning, Loftus-Cheek was left ‘bloodied and toothless, with swollen and bruised lips’ after Milan-Parma, but that could also"
    },
    {
      "id": "49fa7c0311f0",
      "title": "Allegri working to find the best Pulisic for this final rush",
      "url": "https://www.milannews.it/news/allegri-al-lavoro-per-ritrovare-il-miglior-pulisic-per-questo-rush-finale-608555",
      "source": "milannews.it",
      "date": "2026-02-24T10:10:51+00:00",
      "summary": "Massimiliano Allegri is not the type to raise the white flag."
    },
    {
      "id": "3ba10898aedb",
      "title": "New year, same problem: the small ones remain indigestible for Milan",
      "url": "https://www.milannews.it/news/anno-nuovo-stesso-problema-le-piccole-restano-indigeste-per-il-milan-608549",
      "source": "milannews.it",
      "date": "2026-02-24T10:00:55+00:00",
      "summary": "Regardless of what may have happened with referee Piccinini and VAR, Sunday afternoon's match against Parma was yet another match where Milan lost points against teams on the right side of the table..."
    },
    {
      "id": "8992b644e385",
      "title": "The injury could affect Loftus-Cheek's future at Milan",
      "url": "https://www.milannews.it/news/l-infortunio-potrebbe-condizionare-il-futuro-al-milan-di-loftus-cheek-608551",
      "source": "milannews.it",
      "date": "2026-02-24T09:50:59+00:00",
      "summary": "The ugly clash with Corvi in ​​Milan-Parma actually put an end, well in advance, to Ruben Loftus-Cheek's season."
    },
    {
      "id": "a7bf1928cf35",
      "title": "MN: Power, pace and predictability – several critical flaws in Milan recently exposed",
      "url": "https://sempremilan.com/several-critical-flaws-milan-recently-exposed",
      "source": "sempremilan.com",
      "date": "2026-02-24T09:50:00+00:00",
      "summary": "AC Milan lost for just the second time in 26 league games against Parma on Sunday, yet it did highlight some issues that must addressed. MilanNews write that the bitter defeat at San Siro has laid bare several of Milan’s critical issues that the draw with Como had already begun to highlight on Wedne"
    },
    {
      "id": "eb26eed7c8f7",
      "title": "Milan annoyed by refereeing errors, but around Milanello they opt for silence",
      "url": "https://www.milannews.it/news/milan-infastidito-dai-torti-arbitrali-ma-dalle-parti-di-milanello-si-opta-per-il-silenzio-608547",
      "source": "milannews.it",
      "date": "2026-02-24T09:40:23+00:00",
      "summary": "Milan-Parma was only the latest in a dossier of matches which saw the Rossoneri team being damaged in some way by rather dubious refereeing decisions."
    },
    {
      "id": "c91d1bba56e4",
      "title": "Galli has no doubts: \"Maignan suffered a block on Sunday. It's a foul, end of discussions\"",
      "url": "https://www.milannews.it/news/galli-non-ha-dubbi-domenica-maignan-ha-subito-un-blocco-e-fallo-fine-delle-discussioni-608552",
      "source": "milannews.it",
      "date": "2026-02-24T09:30:57+00:00",
      "summary": "Speaking in the columns of La Gazzetta dello Sport, former Milan number 1 Giovanni Galli had his say on Parma's goal, spoiled not only by a Troilo-Bartesaghi contact, but above all by a block by Valenti on Mike Maignan: \n\n&q ..."
    },
    {
      "id": "4ac189b3d03b",
      "title": "GdS: Three reasons Milan’s Scudetto pursuit ended but optimism should remain",
      "url": "https://sempremilan.com/three-reasons-milan-scudetto-pursuit-ended",
      "source": "sempremilan.com",
      "date": "2026-02-24T09:25:00+00:00",
      "summary": "AC Milan have fallen 10 points behind Inter after taking one point from their last two games, and the Scudetto dream is now over. La Gazzetta dello Sport ask the question: if things end this way, will anyone say that ‘Milan lost the Scudetto’? They will not, because the Rossoneri were not the favour"
    },
    {
      "id": "3ed0ec6486db",
      "title": "Beccantini on CorSport: \"The \"discovery\" of simulators\"",
      "url": "https://www.milannews.it/news/beccantini-sul-corsport-la-scoperta-dei-simulatori-608546",
      "source": "milannews.it",
      "date": "2026-02-24T09:20:39+00:00",
      "summary": "During his usual appointment with his column for Il Corriere dello Sport \"Playback\", Roberto Beccantini obviously talked about Serie A, focusing in particular on a category that is being talked about with a certain ..."
    },
    {
      "id": "c3f578bab42d",
      "title": "Milan, how many refereeing errors. CorSport: \"Bad mood at Milanello, but silence is chosen\"",
      "url": "https://www.milannews.it/news/milan-quanti-torti-arbitrali-il-corsport-malumore-a-milanello-ma-si-sceglie-il-silenzio-608517",
      "source": "milannews.it",
      "date": "2026-02-24T09:10:00+00:00",
      "summary": "Milan-Parma brought with it controversy over yet another refereeing errors. Today's edition of Corriere dello Sport headlines: \"Bad mood at Milanello, but silence is chosen\"."
    },
    {
      "id": "7f748124fa96",
      "title": "Pulisic, where have you gone? Few minutes and zero goals in 2026, the American no longer has an impact",
      "url": "https://www.milannews.it/primo-piano/pulisic-dove-sei-finito-pochi-minuti-e-zero-gol-nel-2026-l-americano-non-incide-piu-608548",
      "source": "milannews.it",
      "date": "2026-02-24T09:00:00+00:00",
      "summary": "Milan is not experiencing a happy moment. First the draw against Como, then the defeat against Parma and the consequent -10 from Inter, peppered with several refereeing episodes which only increased the nervousness."
    },
    {
      "id": "f59d6dc82a64",
      "title": "CorSport: Allegri the ‘psychologist’ – previous experience key to avoid Milan collapse",
      "url": "https://sempremilan.com/allegri-psychologist-previous-experience-avoid-collapse",
      "source": "sempremilan.com",
      "date": "2026-02-24T09:00:00+00:00",
      "summary": "AC Milan find themselves 10 points off top spot and with their unbeaten run over, but Massimiliano Allegri must rally the troops. As Corriere dello Sport (via MilanNews) write this morning, it’s been a difficult few days for Milan, who find themselves well behind rivals Inter after poor results agai"
    },
    {
      "id": "fe1fff355dc2",
      "title": "La Gazzetta: \"Gabbia relief, no injury to the right flexor\"",
      "url": "https://www.milannews.it/rassegna-stampa/la-gazzetta-sollievo-gabbia-nessuna-lesione-al-flessore-destro-608539",
      "source": "milannews.it",
      "date": "2026-02-24T08:50:00+00:00",
      "summary": "Sigh of relief for Milan and Matteo Gabbia. The Rossoneri player had withdrawn before the start of the match against Parma and it was thought that he had a significant muscle injury, but fortunately this is not the case."
    },
    {
      "id": "af0191216a1b",
      "title": "Today’s Papers: Champions League, Inter-Bodo/Glimt, McKennie renewal",
      "url": "https://football-italia.net/todays-papers-champions-league-inter-bodo/",
      "source": "football-italia.net",
      "date": "2026-02-24T08:41:35+00:00",
      "summary": "La Gazzetta dello Sport  In with the goals  Champions League: Inter looking for the comeback..."
    },
    {
      "id": "e710f65cc79b",
      "title": "Tuttosport returns to the words of Loftus-Cheek: \"Hard blow, but the worst is over\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-torna-sulle-parole-di-loftus-cheek-duro-colpo-ma-il-peggio-e-passato-608514",
      "source": "milannews.it",
      "date": "2026-02-24T08:40:00+00:00",
      "summary": "First the plane crash, then the landing on the turf of San Siro. How scary for Ruben Loftus-Cheek during Milan-Parma."
    },
    {
      "id": "5e690766dee0",
      "title": "CorSport on Milan: \"Tris for the Champions League spot\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-corsport-sul-milan-tris-per-il-posto-champions-608516",
      "source": "milannews.it",
      "date": "2026-02-24T08:30:00+00:00",
      "summary": "After the defeat against Parma, Milan must look forward. The Devil's objective must be what Max Allegri has always declared, qualification for the next Champions League."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "0121e4d2cd1f",
      "title": "AC Milan 0-1 Parma: Five things we learned – headaches emerge all over the pitch",
      "url": "https://sempremilan.com/ac-milan-0-1-parma-five-things-we-learned-headaches-emerge-all-over-the-pitch",
      "source": "sempremilan.com",
      "date": "2026-02-23T19:32:19+00:00",
      "summary": "AC Milan’s 24-game unbeaten run was ended by Parma on Sunday evening at San Siro, and the Scudetto dreams evaporated with it. As is not an uncommon theme so far this season, Milan missed a number of chances to make it an easier game for themselves. Christian Pulisic and Rafael Leao came closest, wit"
    },
    {
      "id": "d5a24629dda4",
      "title": "Loftus-Cheek shares remarkable pre and post-surgery photos – “A heartfelt thanks”",
      "url": "https://sempremilan.com/loftus-cheek-shares-photos-surgery-jaw",
      "source": "sempremilan.com",
      "date": "2026-02-23T18:30:00+00:00",
      "summary": "Ruben Loftus-Cheek underwent an operation on a fractured jaw earlier on Monday, and the midfielder has sent a post-surgery message. When Loftus-Cheek collided with the Parma goalkeeper in the first few minutes of Sunday’s game, it became apparent quickly that something was seriously wrong. The midfi"
    },
    {
      "id": "9c57cd27af27",
      "title": "CM: Renewal close for Milan defender after Spurs rejection – Allegri’s crucial role",
      "url": "https://sempremilan.com/renewal-close-tomori-spurs-rejection-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-23T18:00:00+00:00",
      "summary": "AC Milan are closing in on agreeing a new contract with Fikayo Tomori, something Massimiliano Allegri has been pushing for. As Calciomercato.com report, Allegri was an important factor in getting Tomori back to his near-best form, and the coach has also been a big sponsor of the contract renewal tha"
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "9de5934f77c6",
      "title": "MN: Gabbia undergoes scans after late exclusion from Milan-Parma – the results",
      "url": "https://sempremilan.com/gabbia-scans-late-exclusion-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-23T17:30:00+00:00",
      "summary": "Some clarity on Matteo Gabbia’s condition has arrived after there was some panic in the build-up to the game against Parma. There was a late line-up change for Massimiliano Allegri to make just before kick-off against Parma.  Gabbia pulled up during the warm-ups with muscle discomfort so he was with"
    },
    {
      "id": "14c9d00b6e4f",
      "title": "Official: Loftus-Cheek undergoes operation on fractured jaw – his recovery time",
      "url": "https://sempremilan.com/loftus-cheek-undergoes-operation-fractured-jaw",
      "source": "sempremilan.com",
      "date": "2026-02-23T17:00:00+00:00",
      "summary": "AC Milan have confirmed that Ruben Loftus-Cheek underwent surgery after his nasty injury during Sunday’s game against Parma. There was a rather sickening moment in the first few minutes of the 1-0 defeat at San Siro. Alexis Saelemaekers sent in a rabona cross that Loftus-Cheek tried to meet, but his"
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "0149e8ab47a4",
      "title": "Home struggles and strange coincidences: All the key stats from Milan 0-1 Parma",
      "url": "https://sempremilan.com/all-key-stats-ac-milan-0-1-parma",
      "source": "sempremilan.com",
      "date": "2026-02-23T16:30:00+00:00",
      "summary": "AC Milan’s unbeaten run was snapped at 24 games as they were beaten by Parma on Sunday at San Siro in an encounter with plenty of controversy. Milan missed a number of opportunities to take the lead, the most symbolic of which was Rafael Leao hitting the post. Then, in the closing minutes, Parma got"
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "69936f614a26",
      "title": "CM: Füllkrug not fully convincing Allegri – Milan ‘unlikely’ to use option agreed with West Ham",
      "url": "https://sempremilan.com/milan-unlikely-option-fullkrug-west-ham",
      "source": "sempremilan.com",
      "date": "2026-02-23T16:00:00+00:00",
      "summary": "Niclas Füllkrug started well at AC Milan, but with each passing game his future beyond May becomes less and less certain. As Calciomercato.com write, Massimiliano Allegri highlighted the need for a natural striker in the summer, a target man to be the focal point of the attack. He wanted a player wi"
    },
    {
      "id": "b3e6ce1565e7",
      "title": "Cuomo explains why Milan ‘sorely miss’ Galliani: “If a club feels penalised, they speak up”",
      "url": "https://sempremilan.com/why-galliani-missed-milan-speak-up",
      "source": "sempremilan.com",
      "date": "2026-02-23T15:30:00+00:00",
      "summary": "AC Milan are currently lacking a figure who commands respect and authority within the head offices of Lega Serie A, according to journalist Michael Cuomo. Milan’s 24-game unbeaten run came to an end on Sunday evening as they were beaten by Parma in a game that had plenty of controversy. Ruben Loftus"
    },
    {
      "id": "4f576d5f169c",
      "title": "GdS: Leao and Pulisic ‘struggling together’ despite Allegri’s conviction – the reasons",
      "url": "https://sempremilan.com/leao-pulisic-struggling-together-reasons",
      "source": "sempremilan.com",
      "date": "2026-02-23T15:00:00+00:00",
      "summary": "Massimiliano Allegri designated Rafael Leao and Christian Pulisic as his first choice front two, and yet the pair haven’t clicked. As La Gazzetta dello Sport report, there are only 12 games to go in the Serie A season and yet Leao and Pulisic need more time form a strike partnership worthy of their "
    },
    {
      "id": "2893b9b07d40",
      "title": "Watch: Wasteful Milan and controversial calls see Parma win at San Siro – the highlights",
      "url": "https://sempremilan.com/watch-milan-0-1-parma-highlights",
      "source": "sempremilan.com",
      "date": "2026-02-23T14:30:00+00:00",
      "summary": "AC Milan’s unbeaten run was ended by Parma at San Siro on Sunday evening, and with it any title hopes have probably alse been destroyed. Milan missed a few chances before the only goal of the game, with Rafael Leao’s volley being symbolic of the night. The Portuguese hammered an effort against the i"
    },
    {
      "id": "06175247b220",
      "title": "From Gabbia to Troilo: The many decisions Milan feel have gone against them in 2025-26",
      "url": "https://sempremilan.com/many-decisions-milan-against-them-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-23T14:00:00+00:00",
      "summary": "AC Milan are far from happy with the officiating this season, which they believe has cost them several points along the way. The fall-out continues after Milan’s home defeat against Parma, which ended their 24-game unbeaten run in the league and saw Inter move 10 points clear at the top of the table"
    },
    {
      "id": "ffb50b86a96b",
      "title": "Ordine believes Milan must ‘watch out’ for chasing pack: “The magic has been interrupted”",
      "url": "https://sempremilan.com/ordine-milan-watch-out-chasing-pack",
      "source": "sempremilan.com",
      "date": "2026-02-23T13:35:00+00:00",
      "summary": "AC Milan suffered their most damaging result of the season so far at San Siro on Sunday night as they were beaten 1-0 by Parma. Milan missed a number of big chances to take the lead, coming closes with Rafael Leao’s volley that hit the inside of the post. Then, in the closing minutes, Parma […]\nThe "
    },
    {
      "id": "0ccc0fa537e9",
      "title": "Moretto: Maignan ‘closed the door’ on approach from Juventus – the background",
      "url": "https://sempremilan.com/maignan-closed-door-approach-juventus",
      "source": "sempremilan.com",
      "date": "2026-02-23T13:10:00+00:00",
      "summary": "AC Milan managed to obtain Mike Maignan’s renewal after months of negotiations, but there was interest from rivals Juventus. During the summer window it looked certain that Maignan’s time at Milan was coming to an end. Chelsea tried to sign him before the Club World Cup, and even though he remained "
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "7d1eaf8982a2",
      "title": "Serie A | Milan 0-1 Parma – Player Ratings as Troilo and Corvi batten down the hatches",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-player-ratings/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:09:16+00:00",
      "summary": "Milan fell to a late 1-0 defeat to Parma this evening, after they were unable..."
    },
    {
      "id": "0338d8d0b0d7",
      "title": "Serie A | Milan 0-1 Parma: Rossoneri suffer shocking first defeat in 24 rounds",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-shocking-defeat-24/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:05:53+00:00",
      "summary": "Milan paid the price for insipid finishing and sluggish defending, as Parma inflicted their first..."
    },
    {
      "id": "ad92e7503a8c",
      "title": "Ex-West Ham & Villa man Reo-Coker: ‘Fabregas pull on Saelemaekers inexcusable’",
      "url": "https://football-italia.net/ex-west-ham-villa-man-reo-coker-fabregas/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:50:32+00:00",
      "summary": "Former West Ham and Aston Villa midfielder turned CBS Sports Golazo pundit Nigel Reo-Coker has..."
    },
    {
      "id": "be4ffa2fa372",
      "title": "Milan double blow as Loftus-Cheek and Gabbia suffer injuries",
      "url": "https://football-italia.net/milan-double-loftus-cheek-gabbia-injuries/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:25:58+00:00",
      "summary": "Milan suffered two major injuries in their match against Parma, as Matteo Gabbia pulled out..."
    },
    {
      "id": "a426ed6a1955",
      "title": "Landucci: ‘Milan focus on our journey, believe in Leao’",
      "url": "https://football-italia.net/landucci-milan-focus-journey-believe-in-leao/",
      "source": "football-italia.net",
      "date": "2026-02-22T16:40:03+00:00",
      "summary": "Milan assistant manager Marco Landucci shrugs off talk of the Scudetto race with rivals Inter..."
    }
  ]
}