{
  "lastUpdated": "2026-02-17T18:56:13.479098+00:00",
  "articles": [
    {
      "id": "1c5fd0ae2295",
      "title": "MN - Cuomo: \"That Allegri and Tare think they are fighting for the scudetto is a different matter, but Milan must not lose contact with reality\"",
      "url": "https://www.milannews.it/news/mn-cuomo-che-allegri-e-tare-pensino-di-lottare-per-lo-scudetto-e-un-altro-paio-di-maniche-ma-il-milan-non-deve-perdere-contatto-con-la-realta-607755",
      "source": "milannews.it",
      "date": "2026-02-17T18:50:55+00:00",
      "summary": "Michael Cuomo of TeleLombardia spoke exclusively to the microphones of the MilanNews YouTube channel."
    },
    {
      "id": "185923da5a9a",
      "title": "Milan, Allegri charts the course: \"We are in the most important months of the season, everything is decided here\"",
      "url": "https://www.milannews.it/news/milan-allegri-traccia-la-rotta-siamo-nei-mesi-piu-importanti-della-stagione-qui-si-decide-tutto-607731",
      "source": "milannews.it",
      "date": "2026-02-17T18:40:05+00:00",
      "summary": "In view of the next championship match, tomorrow evening at San Siro against Como, Milan coach Massimiliano Allegri spoke as follows in the press conference:\n\n\"It's important because we are in the last 3..."
    },
    {
      "id": "da1e1c9b37fa",
      "title": "Fabregas on Milan: \"They are a great team, they have only lost 2 games\"",
      "url": "https://www.milannews.it/l-avversario/fabregas-sul-milan-sono-una-grandissima-squadra-hanno-perso-solo-2-partite-607744",
      "source": "milannews.it",
      "date": "2026-02-17T18:30:39+00:00",
      "summary": "On the eve of Milan-Como, a match valid for the recovery of the 24th matchday of Serie A Enilive, the Lariani coach Cesc Fabregas spoke at the press conference to present tomorrow's important match against the team of ..."
    },
    {
      "id": "64642d1e16e0",
      "title": "Moretto: Camarda’s future ‘remains to be seen’ – Milan could consider ‘permanent deal’",
      "url": "https://sempremilan.com/camarda-future-milan-could-consider-permanent-deal",
      "source": "sempremilan.com",
      "date": "2026-02-17T18:25:12+00:00",
      "summary": "It seemed that Francesco Camarda could have been the heir to AC Milan’s striker spot, but this may not be the case anymore.  There can be no denying that Camarda has had it tough in recent years. The youngster shot onto the scene after an impressive youth career, making his debut at just 15 years […"
    },
    {
      "id": "1fcfd2043918",
      "title": "Towards Milan-Como: Cesc Fabregas' squad for tomorrow's match",
      "url": "https://www.milannews.it/l-avversario/verso-milan-como-i-convocati-di-cesc-fabregas-per-la-partita-di-domani-607763",
      "source": "milannews.it",
      "date": "2026-02-17T18:20:51+00:00",
      "summary": "Below are the Como squad for the match scheduled for tomorrow evening at San Siro against Massimiliano Allegri's AC Milan, valid for the second half of the 24th matchday of Serie A Enlive: \n\n1 BUTEZ Jean\n2 KEMPF Marc\n3 VALLEY Alex\r ..."
    },
    {
      "id": "114387b385cf",
      "title": "Ventura: \"Milan are holding their own, but with great difficulty. I don't think Inter have any chance of losing this Scudetto\"",
      "url": "https://www.milannews.it/news/ventura-il-milan-sta-tenendo-botta-ma-con-grande-fatica-non-credo-che-l-inter-abbia-possibilita-di-perdere-questo-scudetto-607697",
      "source": "milannews.it",
      "date": "2026-02-17T18:11:57+00:00",
      "summary": "Giampiero Ventura, coach, expressed himself to StileTV on the Scudetto fight: \"I don't think Inter have any chance of losing this scudetto, because I don't see any opponents who are up to it."
    },
    {
      "id": "dee5cfa1ff32",
      "title": "Moretto: \"Bartesaghi and Milan will return to talk about the possible renewal towards the end of the season\"",
      "url": "https://www.milannews.it/calciomercato-milan/moretto-bartesaghi-ed-il-milan-torneranno-a-parlare-del-possibile-rinnovo-verso-la-fine-della-stagione-607752",
      "source": "milannews.it",
      "date": "2026-02-17T18:00:00+00:00",
      "summary": "Almost surprisingly, Davide Bartesaghi has carved out an important space for himself with Milan this year, also scoring his first goals in Serie A as a professional."
    },
    {
      "id": "6a8e6e18e30b",
      "title": "Serie A preview: AC Milan vs. Como – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-ac-milan-como-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-17T18:00:00+00:00",
      "summary": "AC Milan have a rare midweek fixture to contest on Wednesday night, as they welcome Como to San Siro for a rescheduled game. The match was originally meant to be played the weekend before last, but was moved due to the Winter Olympic opening ceremony causing a clash at San Siro. Nonetheless, it is a"
    },
    {
      "id": "ef5410da6706",
      "title": "Inter, Chivu: \"We need to stop being moralistic! Nobody criticized Maradona for his goal, we were wronged in Naples\"",
      "url": "https://www.milannews.it/news/inter-chivu-bisogna-smetterla-di-fare-i-moralisti-maradona-nessuno-lo-ha-criticato-per-il-gol-di-mano-noi-abbiamo-subito-un-torto-a-napoli-607761",
      "source": "milannews.it",
      "date": "2026-02-17T17:50:10+00:00",
      "summary": "Cristian Chivu, Inter coach, expressed himself as follows in a press conference from Bodo:\n\nHow much is it worth playing a game like this? \"This is a different competition and we know how important it is and the route..."
    },
    {
      "id": "21092dbd8396",
      "title": "MN - San Siro towards the sold-out for Milan-Como tomorrow evening",
      "url": "https://www.milannews.it/news/mn-san-siro-verso-il-sold-out-per-milan-como-di-domani-sera-607762",
      "source": "milannews.it",
      "date": "2026-02-17T17:40:34+00:00",
      "summary": "San Siro is ready to turn red and black exactly one month after the last time. Since that Milan-Lecce, Massimiliano Allegri's team played first in Rome, then in Bologna and finally in Pisa, scoring 7 out of the 9 points available."
    },
    {
      "id": "e7b3cce9b801",
      "title": "CM: Allegri could revert Milan to 4-3-3 when Leao and Pulisic return – the idea",
      "url": "https://sempremilan.com/allegri-revert-milan-433-leao-pulisic-return",
      "source": "sempremilan.com",
      "date": "2026-02-17T17:30:00+00:00",
      "summary": "With Christian Pulisic and Rafael Leao returning, AC Milan have a much healthier-looking front line. As a result, they could be used in their more natural positions again. The idea to play a 4-3-3 with Milan was there from the start for Massimiliano Allegri. In fact, he actually started with the for"
    },
    {
      "id": "c95e216b23b9",
      "title": "The referees at Open VAR: \"Bastoni's simulation could absolutely have been there, the contact was slight\"",
      "url": "https://www.milannews.it/news/gli-arbitri-a-open-var-la-simulazione-di-bastoni-ci-poteva-assolutamente-stare-il-contatto-e-stato-lieve-607760",
      "source": "milannews.it",
      "date": "2026-02-17T17:28:58+00:00",
      "summary": "Andrea De Marco, responsible for institutional relations at Can A and B, expressed himself as follows to Open Var on Dazn on the Bastoni-Kalulu case: \"The simulation could absolutely have been there, the contact was slight."
    },
    {
      "id": "dc52806f7856",
      "title": "Three 0-3 in a row: Como in great shape away from home. He will arrive at San Siro with a desire for poker",
      "url": "https://www.milannews.it/news/tre-0-3-di-fila-como-in-formissima-in-trasferta-arrivera-a-san-siro-con-voglia-di-poker-607679",
      "source": "milannews.it",
      "date": "2026-02-17T17:20:09+00:00",
      "summary": "Como have won each of their last three away games in the league (all with a score of 3-0, against Lecce, Pisa and Lazio) and with a success they would reach four away victories in a row for the first time in their history in Serie A."
    },
    {
      "id": "986bc758fd13",
      "title": "Accardi: \"To lose the Scudetto, Inter would have to become a team of drunks\"",
      "url": "https://www.milannews.it/news/accardi-l-inter-per-perdere-lo-scudetto-dovrebbe-diventare-una-squadra-di-ubriachi-607694",
      "source": "milannews.it",
      "date": "2026-02-17T17:10:14+00:00",
      "summary": "Thus transfer operator Beppe Accardi told TuttoMercatoWeb.com: \"Inter-Juventus? I've seen the controversy but it's part of football."
    },
    {
      "id": "46c462026304",
      "title": "MN EXCLUSIVE - Cuomo: \"Scudetto? I believe it, but Milan must not lose contact with reality\"",
      "url": "https://www.milannews.it/primo-piano/esclusiva-mn-cuomo-scudetto-ci-credo-ma-il-milan-non-deve-perdere-contatto-con-la-realta-607748",
      "source": "milannews.it",
      "date": "2026-02-17T17:00:10+00:00",
      "summary": "Michael Cuomo of TeleLombardia spoke exclusively to the microphones of the MilanNews YouTube channel."
    },
    {
      "id": "9c6f67289b8c",
      "title": "Allegri addresses idea of Fabregas rivalry and dig from Como fans: “Results through performances”",
      "url": "https://sempremilan.com/allegri-addresses-idea-fabregas-rivalry-como-dig",
      "source": "sempremilan.com",
      "date": "2026-02-17T17:00:00+00:00",
      "summary": "There has been a bit of a spat between Como and AC Milan manager Massimiliano Allegri since their meeting earlier this season.  Before the first game between the sides, Cesc Fabregas and Allegri were quite complimentary to one another, appreciating the work of the other and celebrating their work th"
    },
    {
      "id": "9233e72bc1f3",
      "title": "Moretto: \"Camarda, meeting about the future at the end of the season. It remains to be seen whether Milan will evaluate offers with loans or even on a permanent basis\"",
      "url": "https://www.milannews.it/calciomercato-milan/moretto-camarda-a-fine-stagione-incontro-per-il-futuro-da-capire-se-il-milan-valutera-offerte-con-prestiti-oppure-anche-a-titolo-definitivo-607751",
      "source": "milannews.it",
      "date": "2026-02-17T16:49:31+00:00",
      "summary": "Francesco Camarda remained in Lecce despite his shoulder injury and is preparing to finish the season in Salento before returning to Milan."
    },
    {
      "id": "285f5a86e969",
      "title": "Bastoni: \"I made a mistake, but I noticed a lot of falsehood and fake respectability\"",
      "url": "https://www.milannews.it/news/bastoni-ho-sbagliato-ma-ho-notato-tanta-falsita-e-finto-perbenismo-607750",
      "source": "milannews.it",
      "date": "2026-02-17T16:40:09+00:00",
      "summary": "On the eve of Bodo Glimt-Inter, a match valid for the first leg of the Champions League playoffs, the Nerazzurri defender Alessandro Bastoni spoke at the press conference to put an end to all the rumours, criticisms and anything else that the ..."
    },
    {
      "id": "dd34a6059d49",
      "title": "PROBABLE LINEUP - Milan-Como, Loftus is up front. Jashari-Fofana runoff",
      "url": "https://www.milannews.it/news/probabile-formazione-milan-como-in-avanti-c-e-loftus-ballottaggio-jashari-fofana-607620",
      "source": "milannews.it",
      "date": "2026-02-17T16:36:00+00:00",
      "summary": "MILAN-COMO, THE PROBABLE LINE-UP\n16 Maignan\n23 Tomori, 5 De Winter, 31 Pavlovic\n24 Athekame, 30 Jashari, 14 Modric, 4 Ricci, 33 Bartesaghi\n8 Loftus-Cheek, 10 Leao\n\nDependent"
    },
    {
      "id": "543d732f54a2",
      "title": "Sky - Milan, with Como Ricci starting. Loftus in attack, Jashari plays for his place with Fofana",
      "url": "https://www.milannews.it/news/sky-milan-col-como-ricci-titolare-loftus-in-attacco-jashari-si-gioca-il-posto-con-fofana-607749",
      "source": "milannews.it",
      "date": "2026-02-17T16:33:28+00:00",
      "summary": "Peppe Di Stefano reports, live from Milanello on Sky Sport 24, that tomorrow evening against Como, replacing the suspended Rabiot will be Ricci, who came in very well against Pisa."
    },
    {
      "id": "2349b8184a18",
      "title": "Matri questions himself: \"It will be curious to see with what characteristics Allegri will replace Rabiot\"",
      "url": "https://www.milannews.it/news/matri-si-interroga-sara-curioso-vedere-con-quali-caratteristiche-allegri-sostituira-rabiot-607669",
      "source": "milannews.it",
      "date": "2026-02-17T16:30:43+00:00",
      "summary": "AC Milan, after returning to the field and winning at Pisa last Friday thanks to a super goal from Luka Modric, returns to the field on Wednesday evening to recover the twenty-fourth matchday of the Serie A Eniliv championship ..."
    },
    {
      "id": "dc689886e878",
      "title": "Sporting Judge: Rabiot’s suspension confirmed and Igli Tare fined €10,000",
      "url": "https://sempremilan.com/rabiot-suspension-confirmed-tare-fined-10k",
      "source": "sempremilan.com",
      "date": "2026-02-17T16:30:00+00:00",
      "summary": "After the conclusion of the latest round of Serie A action, the Sports Judge has reviewed the weekend and AC Milan have received another fine. It was certainly not the worst weekend for Milan, as they managed to beat Pisa 2-1 away from home. A first win of the season against one of the new […]\nThe p"
    },
    {
      "id": "9d5d080a5211",
      "title": "No team has gained more points than Milan against teams currently in the top half of the table",
      "url": "https://www.milannews.it/news/nessuna-squadra-ha-guadagnato-piu-punti-del-milan-contro-formazioni-attualmente-nella-parte-alta-della-classifica-607678",
      "source": "milannews.it",
      "date": "2026-02-17T16:22:31+00:00",
      "summary": "No team has gained more points than Milan against teams currently in the top half of the Serie A table (25 in 11 matches, equal to Inter but in 12 matches), as well as being the best defense in these matches (six goals out of ..."
    },
    {
      "id": "f8c4b81b1d5c",
      "title": "Ramazzotti: \"Allegri did not hide from Cardinale his satisfaction with what the players are doing\"",
      "url": "https://www.milannews.it/news/ramazzotti-allegri-non-ha-nascosto-a-cardinale-la-sua-soddisfazione-per-quello-che-stanno-facendo-i-giocatori-607691",
      "source": "milannews.it",
      "date": "2026-02-17T16:11:12+00:00",
      "summary": "Andrea Ramazzotti, journalist, expressed himself as follows in La Gazzetta dello Sport on Cardinale's visit to Milanello: \"Waiting for Cardinale at Milanello was the entire management, from CEO Giorgio Furlani to sporting director Igli..."
    },
    {
      "id": "d94b9483348e",
      "title": "Fabregas towards Milan: \"We must do the right things and do them well\"",
      "url": "https://www.milannews.it/l-avversario/fabregas-verso-il-milan-dobbiamo-fare-le-cose-giuste-e-bene-607743",
      "source": "milannews.it",
      "date": "2026-02-17T16:00:00+00:00",
      "summary": "On the eve of Milan-Como, a match valid for the recovery of the 24th matchday of Serie A Enilive, the Lariani coach Cesc Fabregas spoke at the press conference to present tomorrow's important match against the team of ..."
    },
    {
      "id": "10bb032e69e7",
      "title": "Opposition insight for Milan-Como: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-milan-como-form-predicted-xi",
      "source": "sempremilan.com",
      "date": "2026-02-17T16:00:00+00:00",
      "summary": "AC Milan face Como for the second time in less than five weeks at San Siro on Wednesday night, hoping to do another double over them. Originally the game was planned to be played in Australia because of the Winter Olympic opening ceremony causing a clash at San Siro. However, that plan was thankfull"
    },
    {
      "id": "bb5d6100ee66",
      "title": "SempreMilan Podcast: Episode 401 – Livin’ La Pisa Luka",
      "url": "https://sempremilan.com/sempremilan-podcast-episode-401-livin-la-pisa-luka",
      "source": "sempremilan.com",
      "date": "2026-02-17T15:30:00+00:00",
      "summary": "Join Oli, Anthony and ‪BdairBall as they recap the narrow victory against Pisa, and preview two huge home games against Como and Parma. This week’s topics include… ↳ Modric to the rescue ↳ Allegri vs. Fabregas: The rematch ↳ Parma come to San Siro ↳ Worried about Pulisic? Want more Milan content? Ch"
    },
    {
      "id": "6baf7ae5df59",
      "title": "Report: Milan ‘likely to snub’ offers for Pulisic this summer with Premier League interest expected to rise",
      "url": "https://sempremilan.com/milan-likely-snub-offers-for-pulisic",
      "source": "sempremilan.com",
      "date": "2026-02-17T15:00:00+00:00",
      "summary": "Premier League clubs like Manchester United, Liverpool and Arsenal have all taken an interest in Christian Pulisic, but AC Milan are likely to reject any approaches. In the past few months, the reports regarding Pulisic’s future have mainly consisted of updates on a renewal at Milan. However, consid"
    },
    {
      "id": "8c4090acdbf6",
      "title": "GdS: 4000km and 30° – why Inter’s trip to Norway could influence the title race",
      "url": "https://sempremilan.com/why-inter-trip-to-norway-influence-title-race",
      "source": "sempremilan.com",
      "date": "2026-02-17T14:30:00+00:00",
      "summary": "This season, AC Milan have held hope for the Scudetto thanks to their scheduling, mainly. Now, that could come into play.  So far, Milan have not really had an advantage from a lack of Europe, or the regular cups. However, we are now in the infamous business end of the season, and this is where […]\n"
    },
    {
      "id": "6f0a372ca4ee",
      "title": "How much Milan will earn as Pobega completes permanent Bologna move",
      "url": "https://football-italia.net/milan-earn-pobega-permanent-bologna-move/",
      "source": "football-italia.net",
      "date": "2026-02-17T14:16:49+00:00",
      "summary": "Reports in Italy claim that Tommaso Pobega has formally joined Bologna on a permanent deal..."
    },
    {
      "id": "9e811f816382",
      "title": "Tuttosport: ‘Practically opposite’ – Allegri and Fabregas clash causes intrigue ahead of Milan-Como",
      "url": "https://sempremilan.com/allegri-fabregas-clash-intrigues-milan-como",
      "source": "sempremilan.com",
      "date": "2026-02-17T14:00:00+00:00",
      "summary": "AC Milan facing Como should be an interesting game, solely in terms of the table. However, it looks likely to be a decent clash tactically, too. As coaches go, it is difficult to find coaches further apart than Cesc Fabregas and Massimiliano Allegri. Even after the reverse fixture, the Spaniard was "
    },
    {
      "id": "185e6c8ca2a4",
      "title": "Allegri: Pulisic doubt for Milan, Inter ‘clear title favourites’",
      "url": "https://football-italia.net/allegri-pulisic-doubt-milan-inter-favourite/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:44:56+00:00",
      "summary": "Milan coach Massimiliano Allegri says Christian Pulisic is in doubt for tomorrow’s Serie A match..."
    },
    {
      "id": "9c881dea8c96",
      "title": "Kirovski explains why talented trio Dutu, Sia and Ibrahimovic Jr. left Milan: “The number one objective”",
      "url": "https://sempremilan.com/kirovski-explains-why-talented-trio-left-milan",
      "source": "sempremilan.com",
      "date": "2026-02-17T13:35:00+00:00",
      "summary": "In January, AC Milan parted with a number of young talents, including Maximilian Ibrahimovic, who has been around the first team for a few years.  It is nothing new for young players to be sold. After all, the academy cannot always produce first-team-level players, and when opportunities arise, it m"
    },
    {
      "id": "28770c59c3ab",
      "title": "Allegri weighs in on diving debate and asks for offside rule change",
      "url": "https://football-italia.net/allegri-weighs-in-on-diving-debate/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:28:16+00:00",
      "summary": "Massimiliano Allegri has had his say on the diving debate that has cropped up in..."
    },
    {
      "id": "04fdb1372c8f",
      "title": "Why Milan director Tare was fined after win over Pisa",
      "url": "https://football-italia.net/why-milan-director-tare-fined-after-win-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:12:36+00:00",
      "summary": "Milan director Igli Tare was fined €10,000 after the Rossoneri’s 2-1 win over Pisa on..."
    },
    {
      "id": "2773473df824",
      "title": "Report: Arsenal ready to trigger €50m clause to beat Milan to Real Madrid talent",
      "url": "https://sempremilan.com/arsenal-50m-milan-valdepenas-real-madrid",
      "source": "sempremilan.com",
      "date": "2026-02-17T13:10:00+00:00",
      "summary": "AC Milan face competition from Arsenal to land Real Madrid talent Victor Valdepenas, and they are apparently readying a big offer. Milan are always keeping an eye out on young talent around Europe, and Valdepeñas is the latest name from Real Madrid to enter their radar, after having previous signed "
    },
    {
      "id": "068c9b768450",
      "title": "Official: Juventus directors Comolli and Chiellini given lengthy bans after Derby d’Italia",
      "url": "https://football-italia.net/official-juventus-comolli-and-chiellini-banned/",
      "source": "football-italia.net",
      "date": "2026-02-17T12:58:31+00:00",
      "summary": "Juventus directors Damien Comolli and Giorgio Cheillini, plus players Pierre Kalulu, Nicolo Barella and Hakan..."
    },
    {
      "id": "bf894e517688",
      "title": "Marotta insists Milan and Inter have ‘excellent relationship’ and stresses importance of stadium",
      "url": "https://sempremilan.com/marotta-milan-inter-excellent-relationship-stadium",
      "source": "sempremilan.com",
      "date": "2026-02-17T12:45:00+00:00",
      "summary": "Inter president Giuseppe Marotta has reiterated that he and the club have a great relationship with AC Milan, and commented on the stadium project. The Nerazzurri have been at the centre of a storm since Saturday night’s game against Juventus at San Siro, which they won 3-2 in controversial circumst"
    },
    {
      "id": "d2e7b1ed04b6",
      "title": "‘No one like him in football’ – Real Madrid star Vinicius Jr. reveals why he ‘really misses’ Modric",
      "url": "https://sempremilan.com/no-one-like-modric-vinicius-jr",
      "source": "sempremilan.com",
      "date": "2026-02-17T12:20:00+00:00",
      "summary": "Vinicius Jr. has become the latest to wax lyrical about AC Milan star and Real Madrid legend Luka Modric, revealing an anecdote that proves his point. Modric arrived at Milan in the summer window on a free transfer, ticking off something that was no doubt on his career bucket list as a boyhood fan o"
    },
    {
      "id": "8009a35c8808",
      "title": "Tuttosport: Fabregas also facing dilemmas ahead of Milan revenge mission – the latest",
      "url": "https://sempremilan.com/fabregas-dilemmas-milan-revenge-mission",
      "source": "sempremilan.com",
      "date": "2026-02-17T11:55:00+00:00",
      "summary": "The eyes of Serie A will be on San Siro for the midweek game between AC Milan and Como, but both coaches have selection doubts. Massimiliano Allegri has some questions marks to resolve in each department due to a combination of suspensions and the conditions of some players. However, Cesc Fabregas –"
    },
    {
      "id": "47e1301c9a71",
      "title": "Allegri discusses selection doubts, Inter-Juventus drama, injuries and Fabregas battle",
      "url": "https://sempremilan.com/allegri-doubts-inter-juventus-injuries-fabregas",
      "source": "sempremilan.com",
      "date": "2026-02-17T11:30:00+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri has responded to questions on the title race, the Inter-Juventus drama, and the selection doubts he faces. This is the second time in just over a month that Milan and Como will face each other. The Rossoneri beat their Lombardy neighbours by the lake with an "
    },
    {
      "id": "e477fe2afb25",
      "title": "Vitiello: Modric ‘truly happy’ at Milan – what could become the ‘added incentive to stay’",
      "url": "https://sempremilan.com/modric-happy-milan-added-incentive-stay",
      "source": "sempremilan.com",
      "date": "2026-02-17T11:05:00+00:00",
      "summary": "Luka Modric will have the final say regarding his future, but AC Milan hope that a Champions League fairytale could tempt him. Modric signed a one-year deal when he arrived from Real Madrid on a free transfer in the summer mercato, but with the option for an extra 12 months. At the time of his […]\nT"
    },
    {
      "id": "3096501bf856",
      "title": "TMW: Milan could rekindle interest with Dortmund expected to drop price for striker",
      "url": "https://sempremilan.com/milan-dortmund-guirassy-drop-asking-price",
      "source": "sempremilan.com",
      "date": "2026-02-17T10:40:00+00:00",
      "summary": "Borussia Dortmund’s asking price for Serhou Guirassy is expected to drop, and AC Milan could reignite their interest in him. Over the weekend, Guirassy netted two goals in Dortmund’s most recent Bundesliga match against Mainz to keep their league hopes alive. Now they are six points behind league le"
    },
    {
      "id": "5cf8e7badd26",
      "title": "GdS: Lega meeting debut first, San Siro return next – Cardinale could attend Milan derby",
      "url": "https://sempremilan.com/lega-debut-san-siro-return-cardinale",
      "source": "sempremilan.com",
      "date": "2026-02-17T10:15:00+00:00",
      "summary": "Gerry Cardinale’s presence in Milan over the past couple of days has made headlines, and he is already thinking about his next visit. As La Gazzetta dello Sport (seen below) report, Cardinale was at Milanello on Sunday, the Lega Nord offices in Milan on Monday, and soon could be back at San Siro to "
    },
    {
      "id": "483dacecf8e7",
      "title": "Tuttosport: The question marks Allegri will resolve in final session before visit of Como",
      "url": "https://sempremilan.com/question-marks-allegri-resolve-como-milan",
      "source": "sempremilan.com",
      "date": "2026-02-17T09:50:00+00:00",
      "summary": "If AC Milan are to remain in the Scudetto race, they need another win against Como on Wednesday night. Massimiliano Allegri has some doubts to resolve. Inter are currently eight points ahead of Milan, who must win their game in hand versus Como tomorrow in order to make it five points again. Otherwi"
    },
    {
      "id": "825c7f4cae9c",
      "title": "Inter vs. Juventus refereeing upset Milan too – report",
      "url": "https://football-italia.net/inter-vs-juventus-refereeing-upset-milan-too/",
      "source": "football-italia.net",
      "date": "2026-02-16T14:46:52+00:00",
      "summary": "Corriere dello Sport reports that the officiating in Inter-Juventus did not infuriate the Bianconeri only,..."
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    },
    {
      "id": "9c729c8148a4",
      "title": "Pisa forced to field third-choice goalkeeper in Serie A match against Milan",
      "url": "https://football-italia.net/pisa-forced-3rd-choice-goalkeeper-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T13:04:11+00:00",
      "summary": "Second-choice Pisa goalkeeper Simone Scuffet has been ruled out of tonight’s Serie A match against..."
    },
    {
      "id": "e6e4778300f1",
      "title": "Report Milan call McKennie for possible USMNT reunion with Pulisic",
      "url": "https://football-italia.net/milan-call-mckennie-usmnt-reunion-pulisic/",
      "source": "football-italia.net",
      "date": "2026-02-13T12:43:07+00:00",
      "summary": "Milan have reportedly begun preliminary talks with Weston McKennie’s entourage as the Juventus midfielder is..."
    }
  ]
}