{
  "lastUpdated": "2026-02-12T15:51:44.292587+00:00",
  "articles": [
    {
      "id": "2c9bf7c3ebe0",
      "title": "Towards Pisa-Milan, Allegri keeps his attention high. And recover pieces",
      "url": "https://www.milannews.it/podcast-mn/verso-pisa-milan-allegri-tiene-alta-l-attenzione-e-recupera-pezzi-607197",
      "source": "milannews.it",
      "date": "2026-02-12T15:40:10+00:00",
      "summary": "Allegri's press conference on the eve of Pisa-Milan was short and clear."
    },
    {
      "id": "dee7a1a881ca",
      "title": "Pellegatti reveals: \"Not all of Milan's many souls were convinced to give 7 million, including bonuses, to a 31-year-old player\"",
      "url": "https://www.milannews.it/calciomercato-milan/pellegatti-rivela-non-tutte-le-tante-anime-del-milan-erano-convinte-di-dare-7-milioni-bonus-compresi-a-un-giocatore-di-31-anni-607117",
      "source": "milannews.it",
      "date": "2026-02-12T15:30:45+00:00",
      "summary": "During his editorial for MilanNews."
    },
    {
      "id": "2feb9b020dff",
      "title": "‘Don’t ask me why’ – Journalist reveals Milan made a January move for Brighton attacker",
      "url": "https://sempremilan.com/journalist-reveals-milan-january-move",
      "source": "sempremilan.com",
      "date": "2026-02-12T15:30:00+00:00",
      "summary": "There have been questions about AC Milan’s mercato antics for a while now, and this week, another has arisen regarding the choice to pursue one player. In January, Milan were rather quiet. It was not a shock; the budget was not there for excessive spending, and there was no point adding names for th"
    },
    {
      "id": "b696fde20e98",
      "title": "Italian Cup, Como-Inter on 3 March. A few days later there is the derby",
      "url": "https://www.milannews.it/news/coppa-italia-il-3-marzo-como-inter-pochi-giorni-dopo-c-e-il-derby-607185",
      "source": "milannews.it",
      "date": "2026-02-12T15:20:51+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 12 - The Lega Serie A has announced the program for the semi-finals of the Italian Cup. Tuesday 3 March starts with Como-Inter, at 9pm."
    },
    {
      "id": "ad01d191bf0c",
      "title": "Pisa, Hiljemark: \"I've seen many Milan matches: they are very strong, but they also have some limitations\"",
      "url": "https://www.milannews.it/l-avversario/pisa-hiljemark-ho-visto-tante-partite-del-milan-sono-fortissimi-ma-hanno-anche-qualche-limite-607193",
      "source": "milannews.it",
      "date": "2026-02-12T15:10:13+00:00",
      "summary": "Oscar Hiljemark, Pisa coach, spoke thus about the match against Milan in a program tomorrow evening in a video released by the Tuscan club: \"After only three days of training we played a good match in fa ..."
    },
    {
      "id": "3fb25d99bedb",
      "title": "Pulisic returns, but with half serve: Allegri thinks about a surprise move against Pisa",
      "url": "https://www.milannews.it/primo-piano/pulisic-torna-ma-a-mezzo-servizio-allegri-pensa-alla-mossa-a-sorpresa-contro-il-pisa-607173",
      "source": "milannews.it",
      "date": "2026-02-12T15:00:00+00:00",
      "summary": "Christian Pulisic's performance this season has been decisive and impactful so far. Goals, assists, appearances."
    },
    {
      "id": "5f051e035dab",
      "title": "Official: Date and time confirmed for Cremonese-Milan in Serie A round 27",
      "url": "https://sempremilan.com/date-time-confirmed-cremonese-milan-serie-a-round-27",
      "source": "sempremilan.com",
      "date": "2026-02-12T15:00:00+00:00",
      "summary": "This afternoon, the latest set of Serie A fixtures has been released. As a result, AC Milan now know the official date and time for their game against Cremonese at the start of March. Some big fixtures are coming up for Milan, and many will already be looking ahead to the game against Inter at […]\nT"
    },
    {
      "id": "8fae06824ccd",
      "title": "Pisa-Milan, Fabbri referee. At VAR Aureliano and Serra",
      "url": "https://www.milannews.it/l-arbitro/pisa-milan-arbitra-fabbri-al-var-aureliano-e-serra-607194",
      "source": "milannews.it",
      "date": "2026-02-12T14:48:17+00:00",
      "summary": "The referee for Pisa-Milan has been appointed, a match valid for the 25th matchday of Serie A scheduled for tomorrow evening at 8.45pm: Michael Fabbri will referee the match, while Aureliano and Serra will be in charge of VAR."
    },
    {
      "id": "4f2d72775968",
      "title": "Pulisic says: \"Your favorite thing at Milan? Going to the stadium and seeing the fans, hearing them cheer by shouting your name and supporting the team... There is nothing comparable\"",
      "url": "https://www.milannews.it/news/pulisic-racconta-la-cosa-preferita-al-milan-andare-allo-stadio-e-vedere-i-tifosi-sentirli-esultare-urlando-il-tuo-nome-e-supportare-la-squadra-non-c-e-607188",
      "source": "milannews.it",
      "date": "2026-02-12T14:40:46+00:00",
      "summary": "Christian Pulisic, interviewed exclusively by Access Hollywood, a well-known American television program, made these statements on Milan: \n\nYou have been at Milan since 2023, such an iconic club… What is your favorite thing ..."
    },
    {
      "id": "920d63893aaa",
      "title": "Order on Pulisic's renewal: \"Give yourselves peace! His contract includes a unilateral option in favor of Milan\"",
      "url": "https://www.milannews.it/calciomercato-milan/ordine-sul-rinnovo-di-pulisic-datevi-pace-il-suo-contratto-prevede-opzione-unilaterale-a-favore-del-milan-607111",
      "source": "milannews.it",
      "date": "2026-02-12T14:30:55+00:00",
      "summary": "During his editorial for MilanNews.it, journalist Franco Ordine expressed himself as follows on Pulisic's renewal: \"To achieve these results we will need the contribution of the entire squad."
    },
    {
      "id": "225af3bab4d4",
      "title": "GdS: Serie A debut in 1989 to return as coach – Allegri gets ready for ‘special’ Pisa rematch",
      "url": "https://sempremilan.com/serie-a-debut-pisa-allegri-special-rematch",
      "source": "sempremilan.com",
      "date": "2026-02-12T14:30:00+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri will return to his old stomping ground on Friday night, facing his former club Pisa. As La Gazzetta dello Sport recall, it all started at the Arena Garibaldi, which has now changed its name due to a sponsorship agreement. For Allegri, it will always be the st"
    },
    {
      "id": "94bac832e350",
      "title": "Allegri on his team: \"It's a group that wants revenge and has great moral values\"",
      "url": "https://www.milannews.it/news/allegri-sulla-sua-squadra-e-un-gruppo-che-ha-voglia-di-rivalsa-e-con-grandi-valori-morali-607177",
      "source": "milannews.it",
      "date": "2026-02-12T14:22:19+00:00",
      "summary": "On the eve of the match against Pisa, Massimiliano Allegri spoke about his team like this in the press conference:\n\nHow is the team? Yesterday we heard about the dinner."
    },
    {
      "id": "00edaaaae844",
      "title": "Juventus set price tag for Gatti as Milan, Napoli and Premier League clubs queue up",
      "url": "https://football-italia.net/juventus-set-price-tag-for-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-12T14:21:33+00:00",
      "summary": "Juventus reportedly have a price tag in mind when it comes to a potential sale..."
    },
    {
      "id": "00e578161ad5",
      "title": "Guidi: \"On the penultimate day of the transfer market, Milan called Brighton for the loan of Enciso\"",
      "url": "https://www.milannews.it/calciomercato-milan/guidi-il-penultimo-giorno-di-mercato-il-milan-ha-chiamato-il-brighton-per-il-prestito-di-enciso-607113",
      "source": "milannews.it",
      "date": "2026-02-12T14:11:19+00:00",
      "summary": "Marco Guidi, journalist from La Gazzetta dello Sport, expressed himself to MilanVibes on a behind-the-scenes look at Milan's transfer market: “On the penultimate day of the transfer market, I'll give it to you for sure, Milan called Brighton&nbs ..."
    },
    {
      "id": "6a37a4a91a76",
      "title": "Atalanta, serious injury for De Ketelaere. Recovery times still uncertain",
      "url": "https://www.milannews.it/news/atalanta-infortunio-pesante-per-de-ketelaere-tempi-di-recupero-ancora-incerti-607108",
      "source": "milannews.it",
      "date": "2026-02-12T14:00:41+00:00",
      "summary": "(ANSA) - BERGAMO, FEBRUARY 11 - Lesion to the posterior horn of the right meniscus for Charles De Ketelaere."
    },
    {
      "id": "196a83cddc90",
      "title": "Ordine outlines the message Allegri wanted to send with dinner: “The real climb begins”",
      "url": "https://sempremilan.com/ordine-message-allegri-send-team-dinner",
      "source": "sempremilan.com",
      "date": "2026-02-12T14:00:00+00:00",
      "summary": "Franco Ordine believes the decisive part of the season is about to start for AC Milan, hence the big team dinner organised. In case you missed the news from Sky’s Peppe Di Stefano on Wednesday, Milan held a dinner at a hotel in the city which featured not only the first team squad but many […]\nThe p"
    },
    {
      "id": "e02ef3588fef",
      "title": "Baresi and the Olympic Flame. Allegri says: \"An exciting moment. Now we're waiting for him at Milanello\"",
      "url": "https://www.milannews.it/news/baresi-e-la-fiamma-olimpica-allegri-racconta-un-momento-emozionante-ora-lo-aspettiamo-a-milanello-607174",
      "source": "milannews.it",
      "date": "2026-02-12T13:50:39+00:00",
      "summary": "Massimiliano Allegri, who spoke today at the press conference in Milanello, commented on the emotions he felt seeing Franco Baresi carry the Olympic Flame at the inauguration ceremony of the Winter Olympics: \"The ..."
    },
    {
      "id": "9b25096ad73c",
      "title": "Pulisic reassures everyone about his condition: \"I feel much better\"",
      "url": "https://www.milannews.it/news/pulisic-rassicura-tutti-sulle-sue-condizioni-mi-sento-molto-meglio-607187",
      "source": "milannews.it",
      "date": "2026-02-12T13:40:26+00:00",
      "summary": "Christian Pulisic, interviewed exclusively by Access Hollywood, a well-known American television program, made these statements: \n\nWe saw you rejoice with a heart when your family is at the stadium:\n“ ..."
    },
    {
      "id": "a3da33e6eddc",
      "title": "Pulisic sheds light on what he loves about AC Milan, upcoming World Cup and life in Italy",
      "url": "https://sempremilan.com/pulisic-love-milan-world-cup-life-italy",
      "source": "sempremilan.com",
      "date": "2026-02-12T13:35:00+00:00",
      "summary": "Christian Pulisic has provided an update on his injury, as well as lifting the lid on various aspects of his time at AC Milan so far. There are always a lot of eyes on Pulisic, given that he is the most recognisable football player from the USA, and given that they are about to go […]\nThe post Pulis"
    },
    {
      "id": "f3dbb4fe9a87",
      "title": "Milan U13 conquers Dubai: Rossoneri ready for the Dubai Intercontinental Football Cup",
      "url": "https://www.milannews.it/news/il-milan-u13-alla-conquista-di-dubai-rossoneri-pronti-per-la-dubai-intercontinental-football-cup-607180",
      "source": "milannews.it",
      "date": "2026-02-12T13:30:00+00:00",
      "summary": "New important international event for Milan Under 13 and its youth sector."
    },
    {
      "id": "56f166173bac",
      "title": "Allegri applauds Italian sport: \"We must be proud, not always beating ourselves up\"",
      "url": "https://www.milannews.it/news/allegri-applaude-lo-sport-italiano-dobbiamo-essere-orgogliosi-non-sempre-darci-bastonate-addosso-607175",
      "source": "milannews.it",
      "date": "2026-02-12T13:20:05+00:00",
      "summary": "Massimiliano Allegri, who spoke today at the press conference in Milanello, commented on the emotions he felt seeing Franco Baresi carry the Olympic Flame at the inauguration ceremony of the Winter Olympics: \"The ..."
    },
    {
      "id": "efaa03f8a591",
      "title": "Allegri: \"In Como and Rome we made a lot of mistakes at the beginning, in Bologna it didn't happen\"",
      "url": "https://www.milannews.it/news/allegri-a-como-e-a-roma-abbiamo-sbagliato-molto-all-inizio-a-bologna-non-e-successo-607171",
      "source": "milannews.it",
      "date": "2026-02-12T13:11:55+00:00",
      "summary": "Massimiliano Allegri released these statements today at a press conference:\n\nWould you sign for the Scudetto play-off with Inter today?\n\"At the moment Inter have 23 games, 18 wins and only one draw."
    },
    {
      "id": "514bf5b0f365",
      "title": "Schira: Pulisic ‘happy’ at Milan but expected contract as Liverpool circle – the situation",
      "url": "https://sempremilan.com/pulisic-happy-milan-liverpool-circle-situation",
      "source": "sempremilan.com",
      "date": "2026-02-12T13:10:00+00:00",
      "summary": "Liverpool are weighing up a move to bring Christian Pulisic back to the Premier League, according to a report from one journalist. As a reminder, Pulisic is no stranger to the Premier League, having joined Chelsea from Borussia Dortmund in 2019 for a fee widely reported to be €64m. He made 145 appea"
    },
    {
      "id": "5ed347b2332f",
      "title": "Pulisic: \"I feel much better. I'm close to being where I want to be\"",
      "url": "https://www.milannews.it/primo-piano/pulisic-mi-sento-molto-meglio-sono-vicino-ad-essere-dove-vorrei-607186",
      "source": "milannews.it",
      "date": "2026-02-12T13:00:00+00:00",
      "summary": "Chrisitan Pulisic, AC Milan striker, was interviewed exclusively by Access Hollywood, a well-known American television programme. These are his statements:\n\nWe heard your Italian, it's incredible."
    },
    {
      "id": "80b84a1b661b",
      "title": "Milan player Brignone is an Olympic champion. Compliments from Milan: \"You are a phenomenon, Fede!\"",
      "url": "https://www.milannews.it/news/la-milanista-brignone-e-campionessa-olimpica-i-complimenti-del-milan-sei-un-fenomeno-fede-607184",
      "source": "milannews.it",
      "date": "2026-02-12T12:50:57+00:00",
      "summary": "Federica Brignone is the new Olympic champion in Super G: the Milanese skier, a great AC Milan fan, won the gold medal in Cortina ahead of the French Miradoli and the Austrian Huetter."
    },
    {
      "id": "8c7c1ace3789",
      "title": "Allegri previews Pisa vs. Milan and gives injury update: ‘Pulisic only has 15-20 minutes’",
      "url": "https://football-italia.net/allegri-previews-pisa-vs-milan-injury-update/",
      "source": "football-italia.net",
      "date": "2026-02-12T12:49:06+00:00",
      "summary": "Massimiliano Allegri has shared his thoughts ahead of Milan’s upcoming Serie A clash against Pisa..."
    },
    {
      "id": "c58463a64570",
      "title": "Moretto reveals Allegri called Juventus defender: “No unanimity within the Milan world”",
      "url": "https://sempremilan.com/moretto-allegri-juventus-gatti-no-unanimity",
      "source": "sempremilan.com",
      "date": "2026-02-12T12:45:00+00:00",
      "summary": "AC Milan tried to see if there was an opening to sign Federico Gatti in the winter window, but were unable to pursue a deal. Milan were linked with a number of different central defenders during the January mercato, but in the end they decided to stay as they are. One of the most frequently […]\nThe "
    },
    {
      "id": "c04139af4bce",
      "title": "Allegri returns to Pisa where he made his debut in Serie A as a footballer: \"It's important to go happy and return happier\"",
      "url": "https://www.milannews.it/news/allegri-torna-a-pisa-dove-aveva-esordito-in-a-da-calciatore-e-importante-andare-contenti-e-tornare-piu-contenti-607167",
      "source": "milannews.it",
      "date": "2026-02-12T12:40:18+00:00",
      "summary": "These are the words of Massimiliano Allegri in the press conference on tomorrow's match against Pisa: \n\nWe return to the field after almost 10 days."
    },
    {
      "id": "b420c5d2bd27",
      "title": "Brignone, what a feat: Olympic gold in Super G. The skier is a big AC Milan fan",
      "url": "https://www.milannews.it/news/brignone-che-impresa-oro-olimpico-in-super-g-la-sciatrice-e-una-grande-tifosa-del-milan-607181",
      "source": "milannews.it",
      "date": "2026-02-12T12:30:58+00:00",
      "summary": "Historic achievement by Federica Brignone who won the gold medal in the Super G which took place this morning in Cortina valid for the Winter Olympics."
    },
    {
      "id": "71c32d5efbab",
      "title": "Capello explains why Allegri and Milan should try chase Inter down: “They’re the closest”",
      "url": "https://sempremilan.com/capello-why-milan-chase-inter-closest",
      "source": "sempremilan.com",
      "date": "2026-02-12T12:20:00+00:00",
      "summary": "Fabio Capello has given an updated view on how he sees the Scudetto race at present, confirming his belief that AC Milan are Inter’s main rivals. A glance at the Serie A table seems to show Inter running away with it given that they are eight points clear. However, there are four games for Milan […]"
    },
    {
      "id": "f21e40e4567e",
      "title": "CorSport: Milan continue talks with Bayern Munich midfielder in bid to beat competition",
      "url": "https://sempremilan.com/milan-continues-talks-goretzka-bayern-atletico",
      "source": "sempremilan.com",
      "date": "2026-02-12T11:55:00+00:00",
      "summary": "AC Milan have not given up on the idea of signing Leon Goretzka, and are keeping contacts alive to see if they can pull off the coup. Goretzka’s fate was sealed last month when Christoph Freund – a director at Bayern Munich – did a press conference held together with coach Vincent Kompany, in which "
    },
    {
      "id": "b4f39f97b2b7",
      "title": "Allegri discusses injuries, favourable round, Milan’s ‘natural habitat’ and being ‘hungry for revenge’",
      "url": "https://sempremilan.com/allegri-injuries-pisa-round-milan-revenge",
      "source": "sempremilan.com",
      "date": "2026-02-12T11:30:00+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri has provided a fitness update ahead of the trip to Pisa, playing down the Scudetto pursuit once again. While a glance at the present table shows Inter eight points ahead and Roma just four points back in fifth place, Milan simply have to seize the opportunity"
    },
    {
      "id": "3e2b69a629df",
      "title": "Official: AFC Bournemouth sign Alex Jimenez on permanent transfer from Milan",
      "url": "https://football-italia.net/official-milan-sell-jimenez-to-bournemouth/",
      "source": "football-italia.net",
      "date": "2026-02-12T11:19:57+00:00",
      "summary": "Premier League side AFC Bournemouth have officially announced the signing of Alex Jimenez on a..."
    },
    {
      "id": "0cc6d02b24ed",
      "title": "Tuttosport: Dilemmas in defence and attack – Allegri to make final decisions before Pisa trip",
      "url": "https://sempremilan.com/dilemmas-defence-attack-allegri-decisions-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-12T11:05:00+00:00",
      "summary": "After almost two weeks without a match, AC Milan are ready to return to Serie A action against Pisa away from home on Friday night. Ahead of this match, Massimiliano Allegri can be happy with the recovery of Christian Pulisic, while it will take a few more days to see Alexis Saelemaekers back on the"
    },
    {
      "id": "42f85f11f3f3",
      "title": "CM: Liberali begins to shine in Serie B – the truth about his future and summer Milan exit",
      "url": "https://sempremilan.com/liberali-truth-milan-exit-future",
      "source": "sempremilan.com",
      "date": "2026-02-12T10:40:00+00:00",
      "summary": "Not much had been heard about Mattia Liberali following his rather surprising summer exit, but the weekend may have provided a turning point. As Calciomercato.com report, Catanzaro’s pursuit of the dream called Serie A can definitively add a new weapon to its arsenal. Liberali has been providing pos"
    },
    {
      "id": "642dc092f64f",
      "title": "‘Create financial difficulties’ – Moretto highlights potential issue for Milan in Pulisic talks",
      "url": "https://sempremilan.com/moretto-potential-issue-milan-pulisic-talks",
      "source": "sempremilan.com",
      "date": "2026-02-12T10:15:00+00:00",
      "summary": "There has once again been panic spreading among the AC Milan fan base regarding Christian Pulisic’s future, and a clarification has arrived. Earlier in the week, Tuttomercatoweb published a story about Pulisic, claiming that the forward expected a contract offer from Milan by now, and that both Arse"
    },
    {
      "id": "28f58ec2a812",
      "title": "Official: Alex Jimenez completes full AC Milan exit as Bournemouth confirm permanent deal",
      "url": "https://sempremilan.com/official-alex-jimenez-bournemouth-milan-permanent",
      "source": "sempremilan.com",
      "date": "2026-02-12T09:50:00+00:00",
      "summary": "Alex Jimenez’s move to AFC Bournemouth from AC Milan has been turned from a loan into a permanent deal, both clubs have confirmed. Jimenez joined Bournemouth towards the end of the summer transfer window on an initial loan deal. The formula was a bit more complex than that though: it included an opt"
    },
    {
      "id": "4a00219e8ebf",
      "title": "Camarda responds to silly stories after Inter answer: “My Milanismo cannot be questioned”",
      "url": "https://sempremilan.com/camarda-responds-inter-milanismo-cannot-questioned",
      "source": "sempremilan.com",
      "date": "2026-02-12T09:25:00+00:00",
      "summary": "Francesco Camarda has been forced to respond on social media after ridiculous accusations following an answer he gave about playing for Inter. It is rather remarkable that this has even become a story, but we will provide some context nonetheless. Camarda was a guest on the Panini Sport Italia YouTu"
    },
    {
      "id": "f4dab64d9e5d",
      "title": "GdS: ‘Milan chase’ – how Allegri plans to keep Inter under pressure during derby run-in",
      "url": "https://sempremilan.com/milan-chase-allegri-plans-inter-pressure",
      "source": "sempremilan.com",
      "date": "2026-02-12T09:00:00+00:00",
      "summary": "AC Milan have four league games before the derby against Inter in early March, and their mission is simple: to cut the gap. As La Gazzetta dello Sport (seen below) report, Inter currently have an eight-point lead over Milan but they have played one game more. The numbers will only balance out (more "
    },
    {
      "id": "b6c36ecd9191",
      "title": "From SOS to potential logjam: How the future of Milan’s attack could be decided in 15 games",
      "url": "https://sempremilan.com/how-future-milan-attack-decided-15-games",
      "source": "sempremilan.com",
      "date": "2026-02-11T20:01:53+00:00",
      "summary": "The attacking department has not allowed Massimiliano Allegri to rest easy this season so far, for various different reasons. We start from a premise: going int the 2025-26 season, Allegri had earmarked Rafael Leao and Christian Pulisic as the duo that he wanted to spearhead his 3-5-2 system. There "
    },
    {
      "id": "3f942ce678a8",
      "title": "De Winter talks favoured role, adaptation at Milan and first goal – video",
      "url": "https://sempremilan.com/de-winter-favoured-role-adaptation-milan-goal",
      "source": "sempremilan.com",
      "date": "2026-02-11T18:55:27+00:00",
      "summary": "Koni De Winter has given a third interview to the media in the past 24 hours, this time speaking to AC Milan’s official channels. It would be fair to say that De Winter is in demand, having already spoken to SportMediaset and Tuttosport over the past day. It is deserved time in the limelight for […]"
    },
    {
      "id": "b8aff92d98d7",
      "title": "GdS: Barcelona ‘obstacle’, salary, Milan interest – why Vlahovic is taking time over his future",
      "url": "https://sempremilan.com/barcelona-salary-milan-interest-vlahovic-future",
      "source": "sempremilan.com",
      "date": "2026-02-11T18:14:22+00:00",
      "summary": "Dusan Vlahovic has not yet made a decision regarding his future beyond this season yet, but AC Milan are at the window. Vlahovic’s five years with Juventus have seen him rack up 162 appearances so far, with 64 goals and 16 assists. He has six goals this season – three each in Serie A and […]\nThe pos"
    },
    {
      "id": "f17bb4131b53",
      "title": "MN: Milan fans left angry again after ‘unorganised’ Pisa ticketing situation – the reasons",
      "url": "https://sempremilan.com/milan-fans-angry-pisa-the-reasons",
      "source": "sempremilan.com",
      "date": "2026-02-11T17:47:03+00:00",
      "summary": "There is once again drama concerning AC Milan’s away sector in the build-up to a game, this time Friday’s trip to Pisa. As MilanNews report, Milan fans ‘have suffered yet more deplorable organisational treatment’ regarding the sale of away tickets. For the game at the Arena Garibaldi, there was no p"
    },
    {
      "id": "6b7c62dbc4ab",
      "title": "How much Milan and Real Madrid earn from Jimenez’s Bournemouth move as documents signed",
      "url": "https://football-italia.net/milan-real-madrid-earn-jimenez-bournemouth/",
      "source": "football-italia.net",
      "date": "2026-02-11T15:20:29+00:00",
      "summary": "Fabrizio Romano confirms that Milan and Bournemouth have signed the documents for Alex Jimenez’s permanent..."
    },
    {
      "id": "12df281becc6",
      "title": "Milan handed Pulisic injury boost for Pisa clash",
      "url": "https://football-italia.net/milan-pulisic-injury-boost-for-pisa-clash/",
      "source": "football-italia.net",
      "date": "2026-02-11T14:19:12+00:00",
      "summary": "Milan star Christian Pulisic returned to group training on Wednesday, meaning he’ll probably be available..."
    },
    {
      "id": "6cf456b44487",
      "title": "De Winter hopes Milan help him get Belgium 2026 World Cup spot",
      "url": "https://football-italia.net/de-winter-hope-milan-beligum-spot-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-11T11:44:07+00:00",
      "summary": "Milan defender Koni De Winter hopes that his performances with the Rossoneri this season will..."
    },
    {
      "id": "394a459f8eaf",
      "title": "Mateta mystery deepens, Crystal Palace insist failed Milan transfer ‘does not need surgery’",
      "url": "https://football-italia.net/mateta-mystery-crystal-palacefailed-milan-move/",
      "source": "football-italia.net",
      "date": "2026-02-10T17:19:18+00:00",
      "summary": "Jean-Philippe Mateta failed a medical test with Milan to scupper his €30m transfer from Crystal..."
    },
    {
      "id": "44962c2fbe63",
      "title": "Jimenez feared limited Milan playing time, Nico Paz ‘ready’ for Real Madrid return",
      "url": "https://football-italia.net/jimenez-fear-limited-milan-time-paz-madrid/",
      "source": "football-italia.net",
      "date": "2026-02-10T14:42:00+00:00",
      "summary": "Alex Jimenez feared he’d get limited playing time at Milan, so he joined Bournemouth last..."
    },
    {
      "id": "303da62cf040",
      "title": "Report Pulisic waits for Milan contract offer as Liverpool and Arsenal loom",
      "url": "https://football-italia.net/pulisic-waits-milan-contract-liverpool-arsenal/",
      "source": "football-italia.net",
      "date": "2026-02-10T12:04:47+00:00",
      "summary": "Liverpool and Arsenal are reportedly interested in Milan star Christian Pulisic, who hasn’t yet received..."
    },
    {
      "id": "f688f227c904",
      "title": "Gattuso meets Italy players across the globe ahead of World Cup play-off",
      "url": "https://football-italia.net/gattuso-meets-italy-players-globe-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:54:51+00:00",
      "summary": "Denied a training retreat this month, Italy coach Gennaro Gattuso has taken his World Cup..."
    },
    {
      "id": "e43af22dbbb7",
      "title": "Nkunku: France have three teams to win World Cup, Rabiot ‘a beast’",
      "url": "https://football-italia.net/france-3-teams-win-world-cup-rabiot-beast/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:23:18+00:00",
      "summary": "During his interview with Gazzetta dello Sport, Milan striker Christopher Nkunku praised many of his Rossoneri..."
    },
    {
      "id": "b12a747674d2",
      "title": "Nkunku: ‘Never’ wanted to leave Milan, Ibrahimovic hasn’t changed",
      "url": "https://football-italia.net/nkunku-never-wanted-leave-milan-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:00:31+00:00",
      "summary": "Milan striker Christopher Nkunku insists he didn’t consider leaving the Rossoneri in the January transfer..."
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    }
  ]
}