{
  "lastUpdated": "2026-02-19T23:28:53.466572+00:00",
  "articles": [
    {
      "id": "a646bfa68c6f",
      "title": "Cagni on Allegri after the argument with Fabregas: \"He must understand that there is no point in doing certain things. He has a duty towards those who pay and watch you\"",
      "url": "https://www.milannews.it/news/cagni-su-allegri-dopo-la-lite-con-fabregas-deve-capire-che-non-ha-senso-fare-certe-cose-ha-un-dovere-nei-confronti-di-chi-ti-paga-e-guarda-608019",
      "source": "milannews.it",
      "date": "2026-02-19T23:20:35+00:00",
      "summary": "During the usual appointment with Maracanà, a program broadcast on the frequencies of TMW Radio, mister Gigi Cagni talked about Serie A, focusing on the chaos that arose last night between Cesc Fabregas and Massimiliano Allegri."
    },
    {
      "id": "2c3775c71a18",
      "title": "Amoroso: \"Pippo Inzaghi was a statement, he had a magnetic attraction for the ball\"",
      "url": "https://www.milannews.it/gli-ex/amoroso-pippo-inzaghi-era-una-sentenza-aveva-un-attrazione-magnetica-per-il-pallone-607832",
      "source": "milannews.it",
      "date": "2026-02-19T23:11:28+00:00",
      "summary": "Marcio Amoroso, former striker of, among others, Udinese and Milan, spoke to the Gazzetta dello Sport about his experience with the Rossoneri: \"It was the winter of 2006, before the World Cup in Germany."
    },
    {
      "id": "159eb71966aa",
      "title": "What will I do when I grow up? Allegri went beyond the limits with Leao and Pulisic out of condition. Only Sartori instead of Tare. Every Scaroni outing is a blow to history",
      "url": "https://www.milannews.it/editoriale/cosa-faro-da-grande-allegri-oltre-i-limiti-con-leao-e-pulisic-fuori-condizione-solo-sartori-al-posto-di-tare-ogni-uscita-di-scaroni-e-un-colpo-alla-st-608013",
      "source": "milannews.it",
      "date": "2026-02-19T23:00:01+00:00",
      "summary": "The trouble, the big trouble, is that it is difficult to appreciate, much less enjoy: the results of this season are sensational compared to the last 2 championships, but settling for second place, 7 points behind Inter when we are only m ..."
    },
    {
      "id": "3a65efaec36a",
      "title": "De Paola: \"In every team there are simulators, but that doesn't mean it's good\"",
      "url": "https://www.milannews.it/news/de-paola-in-ogni-squadra-ci-sono-dei-simulatori-ma-questo-non-significa-che-vada-bene-607810",
      "source": "milannews.it",
      "date": "2026-02-19T22:50:00+00:00",
      "summary": "Paolo De Paola spoke like this to TMW Radio after the Bastoni-Kalulu chaos: \"Unfortunately in every team there are simulators, but this doesn't mean it's okay."
    },
    {
      "id": "e3bda4d9ebb2",
      "title": "Pasotto explains: \"Fabregas hindered Saelemaekers, practically preventing Milan from restarting. At that point, things got very heated\"",
      "url": "https://www.milannews.it/news/pasotto-spiega-fabregas-ha-ostacolato-saelemaekers-impedendo-praticamente-una-ripartenza-del-milan-a-quel-punto-gli-animi-si-sono-surriscaldati-parecc-607973",
      "source": "milannews.it",
      "date": "2026-02-19T22:40:41+00:00",
      "summary": "Marco Pasotto, journalist, expressed himself as follows in La Gazzetta dello Sport on what happened after the match between Milan and Como: \"Tension on the pitch and tension also after the match."
    },
    {
      "id": "1e79260d6e5b",
      "title": "Brambati keeps the championship race open: \"For Allegri's spirit, I don't consider anything finished yet\"",
      "url": "https://www.milannews.it/news/brambati-tiene-aperta-la-corsa-scudetto-per-lo-spirito-di-allegri-non-reputo-ancora-finito-nulla-608020",
      "source": "milannews.it",
      "date": "2026-02-19T22:30:40+00:00",
      "summary": "During the usual appointment with Maracanà, a program broadcast on the frequencies of TMW Radio, former player Massimo Brambati talked about Serie A, focusing on the chaos that arose last night between Cesc Fabregas and Massimiliano Allegr ..."
    },
    {
      "id": "4432ccad51e4",
      "title": "Cagni: \"Allegri? Someone who earns millions can't do certain things. Fabregas made a big deal, then he apologized\"",
      "url": "https://www.milannews.it/news/cagni-allegri-uno-che-guadagna-milioni-non-puo-fare-certe-cose-fabregas-l-ha-fatta-grossa-poi-ha-chiesto-scusa-608018",
      "source": "milannews.it",
      "date": "2026-02-19T22:20:33+00:00",
      "summary": "During the usual appointment with Maracanà, a program broadcast on the frequencies of TMW Radio, mister Gigi Cagni talked about Serie A, focusing on the chaos that arose last night between Cesc Fabregas and Massimiliano Allegri."
    },
    {
      "id": "7e5c536bbe25",
      "title": "Chaos between Allegri and Fabregas, Bucchioni: \"The problem is the rules\"",
      "url": "https://www.milannews.it/news/caos-tra-allegri-e-fabregas-bucchioni-il-problema-sono-le-regole-608017",
      "source": "milannews.it",
      "date": "2026-02-19T22:10:21+00:00",
      "summary": "During the usual appointment with Maracanà, a program broadcast on the frequencies of TMW Radio, the journalist Enzo Bucchioni talked about Serie A, focusing on the chaos that arose last night between Cesc Fabregas and Massimiliano Allegri."
    },
    {
      "id": "373144174ae8",
      "title": "Valentini: \"Football is losing style. Conte responding to Spalletti, Bastoni and Allegri's expulsion yesterday...\"",
      "url": "https://www.milannews.it/news/valentini-il-calcio-sta-perdendo-stile-conte-che-risponde-a-spalletti-bastoni-e-l-espulsione-di-ieri-di-allegri-608015",
      "source": "milannews.it",
      "date": "2026-02-19T22:00:59+00:00",
      "summary": "During the usual appointment with Maracanà, a program broadcast on the frequencies of TMW Radio, the former FIGC manager Antonello Valentini spoke about Serie A, also focusing on the draw achieved last night at San Siro between Mil ..."
    },
    {
      "id": "e0ac1d6f9aab",
      "title": "From Naples: \"A draw between Milan and Como? Inter have made an important contribution to the championship\"",
      "url": "https://www.milannews.it/news/di-napoli-pari-tra-milan-e-como-spallata-importante-al-campionato-da-parte-dell-inter-608014",
      "source": "milannews.it",
      "date": "2026-02-19T21:50:32+00:00",
      "summary": "During the usual appointment with Maracanà, a program broadcast on the frequencies of TMW Radio, the former attacker Arturo Di Napoli spoke about Serie A, focusing in particular on the draw that took place last night at San Siro between Milan and ..."
    },
    {
      "id": "d1c43d8e63f3",
      "title": "Juventus, racist insults on social media towards Kelly. The defender responds harshly",
      "url": "https://www.milannews.it/news/juventus-insulti-razzisti-sui-social-a-kelly-il-difensore-risponde-duramente-607852",
      "source": "milannews.it",
      "date": "2026-02-19T21:40:58+00:00",
      "summary": "(ANSA) - TURIN, FEBRUARY 18 - Juventus defender Lloyd Kelly was the victim of racist insults on social media."
    },
    {
      "id": "88a76e24ba3c",
      "title": "Passerini: \"Nothing is impossible. The Scudetto operation could even reopen, but now an undertaking will be needed\"",
      "url": "https://www.milannews.it/news/passerini-nulla-e-impossibile-l-operazione-scudetto-potrebbe-anche-riaprirsi-ma-ora-servira-un-impresa-607974",
      "source": "milannews.it",
      "date": "2026-02-19T21:30:39+00:00",
      "summary": "Carlos Passerini, journalist, expressed himself as follows in the Corriere della Sera on Milan-Como: \"Only a draw. And Inter remain far away."
    },
    {
      "id": "17fd7ed77df5",
      "title": "Against Como, Milan reached a milestone for the third time: here's which one",
      "url": "https://www.milannews.it/news/contro-il-como-il-milan-ha-raggiunto-un-traguardo-per-la-terza-volta-ecco-quale-607956",
      "source": "milannews.it",
      "date": "2026-02-19T21:22:00+00:00",
      "summary": "A bitter draw for Milan against Como, but the unbeaten streak continues."
    },
    {
      "id": "d75ec6a90580",
      "title": "Parma, Strefezza towards Milan: \"We want to compete and try to win\"",
      "url": "https://www.milannews.it/l-avversario/parma-strefezza-verso-il-milan-vogliamo-giocarcela-e-provare-a-vincere-608009",
      "source": "milannews.it",
      "date": "2026-02-19T21:10:48+00:00",
      "summary": "Gabriel Strefezza integrated very well into Parma, with Carlos Cuesta immediately throwing him into the fray in his first appearances in the ducal shirt."
    },
    {
      "id": "e955bb9e6021",
      "title": "Leao booked against Como: for him it is the second sanction of the championship",
      "url": "https://www.milannews.it/news/leao-ammonito-contro-il-como-per-lui-e-la-seconda-sanzione-del-campionato-607997",
      "source": "milannews.it",
      "date": "2026-02-19T21:00:03+00:00",
      "summary": "As reported by the press release number 131 of the Sports Judge Gerardo Mastrandrea also signed by the president of the Lega Serie A Ezio Simonelli, Rafael Leao was given the second sanction of his championship; it means that the ..."
    },
    {
      "id": "e21cc474fb08",
      "title": "Moretto takes stock of Tomori's renewal: \"We are discussing the final figure and the length of the new contract\"",
      "url": "https://www.milannews.it/news/moretto-fa-il-punto-sul-rinnovo-di-tomori-si-sta-discutendo-sulla-cifra-finale-e-la-lunghezza-del-nuovo-contratto-608033",
      "source": "milannews.it",
      "date": "2026-02-19T20:50:13+00:00",
      "summary": "During the usual appointment with the video update on Fabrizio Romano's YouTube channel, Matteo Moretto took stock of the movements at Milan, focusing in particular on the issue of Fikayo Tomori's renewal: ..."
    },
    {
      "id": "c97b5ac3474f",
      "title": "Europa League: Bologna wins 1-0 at Brann thanks to Castro's goal",
      "url": "https://www.milannews.it/news/europa-league-il-bologna-vince-1-0-in-casa-del-brann-grazie-alla-rete-di-castro-608032",
      "source": "milannews.it",
      "date": "2026-02-19T20:40:18+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 19 - A goal from Castro in the 9th minute gave Bologna victory on the Brann pitch, in Norway, in the first leg of the Europa League playoffs."
    },
    {
      "id": "8d726eebf322",
      "title": "Milan Foundation, increasingly inclusive museum and headquarters with Tag System",
      "url": "https://www.milannews.it/news/fondazione-milan-museo-e-sede-sempre-piu-inclusivi-con-tag-system-608031",
      "source": "milannews.it",
      "date": "2026-02-19T20:30:45+00:00",
      "summary": "(ANSA) - MILAN, FEBRUARY 19 - An increasingly accessible museum to be able to experience football to the full and with greater inclusiveness."
    },
    {
      "id": "fa66506f9bb3",
      "title": "Milan-Como data: ball possession in favor of the Devil. Balance on shots on goal",
      "url": "https://www.milannews.it/news/i-dati-di-milan-como-possesso-palla-a-favore-del-diavolo-equilibrio-sui-tiri-in-porta-607945",
      "source": "milannews.it",
      "date": "2026-02-19T20:21:00+00:00",
      "summary": "Milan did not go beyond the 1-1 draw at home against Como, thus seeing the possibility of returning to -5 behind Inter disappear."
    },
    {
      "id": "05c9fee5fbe2",
      "title": "At least 10 goals and assists: only Leao and Lautaro have achieved this in the last six Serie A championships",
      "url": "https://www.milannews.it/news/almeno-10-tra-gol-e-assist-solo-leao-e-lautaro-ci-sono-riusciti-negli-ultimi-sei-campionati-di-serie-a-607982",
      "source": "milannews.it",
      "date": "2026-02-19T20:10:13+00:00",
      "summary": "Rafael Leão (eight goals and two assists this season) is the second player to have been involved in at least 10 goals in each of the last six Serie A seasons (since 2020/21), after Lautaro Martínez. Opta reports it."
    },
    {
      "id": "69ca8cc56c24",
      "title": "GdS: ‘Jashari like Modric’ – €34m man showing signs of massive potential",
      "url": "https://sempremilan.com/jashari-like-modric-signs-of-potential",
      "source": "sempremilan.com",
      "date": "2026-02-19T19:30:00+00:00",
      "summary": "Since joining AC Milan, Ardon Jashari has not had it easy. An injury stopped his season, and then he has been limited for minutes. However, he has not given up.  Many would have struggled if they were given the cards that Jashari was dealt. Ultimately, the youngster has had it tough for a player who"
    },
    {
      "id": "5c375aee8cdc",
      "title": "AC Milan 1-1 Como: Five things we learned – dreams fade, a star shines and a rivalry is born",
      "url": "https://sempremilan.com/ac-milan-1-1-como-five-things-we-learned",
      "source": "sempremilan.com",
      "date": "2026-02-19T19:00:00+00:00",
      "summary": "AC Milan’s faint title hopes are hanging by a thread after they were forced to come from behind to earn a 1-1 draw against Como. Milan’s game at San Siro on Wednesday night was their first at home in exactly one month, and it was a hotly anticipated rematch after the 3-1 victory in Como […]\nThe post"
    },
    {
      "id": "a2c302f03c7b",
      "title": "TMW: Milan beaten by Dortmund to Brazilian starlet – the latest",
      "url": "https://sempremilan.com/milan-beaten-by-dortmund-brazilian-starlet",
      "source": "sempremilan.com",
      "date": "2026-02-19T18:30:00+00:00",
      "summary": "AC Milan made an approach for young full-back Kaua Prates in the winter mercato, but they have been beaten to his signing by Borussia Dortmund.  In the past month, Milan took a look at a number of impressive young talents, with the intention of strengthening the Futuro set-up. Indeed, it has since b"
    },
    {
      "id": "2e2b8b55e6a6",
      "title": "Why Fabregas cannot be punished with video evidence after Milan 1-1 Como",
      "url": "https://football-italia.net/why-fabregas-cannot-be-punished-video-evidence/",
      "source": "football-italia.net",
      "date": "2026-02-19T18:02:36+00:00",
      "summary": "Many were calling for video evidence to be used in punishing Como coach Cesc Fabregas..."
    },
    {
      "id": "67ea6b5c6432",
      "title": "TMW: Tom Brady, Olympic stars and Gattuso – San Siro hosts several famous faces",
      "url": "https://sempremilan.com/tom-brady-olympic-stars-gattuso-san-siro",
      "source": "sempremilan.com",
      "date": "2026-02-19T18:00:00+00:00",
      "summary": "It is nothing new for San Siro to host celebrities, and for the game between AC Milan and Como, there were several notable faces in attendance.  For many, San Siro is a box office stadium to attend once in their life, and with the recent news about its closure, a new stadium is to be […]\nThe post TM"
    },
    {
      "id": "3589546d74c3",
      "title": "CorSport: Milan in the hands of the best – Allegri’s experience crucial to this moment",
      "url": "https://sempremilan.com/milan-in-hands-of-the-best-allegri-experience",
      "source": "sempremilan.com",
      "date": "2026-02-19T17:30:00+00:00",
      "summary": "Whilst it may not feel positive for AC Milan currently, they can have faith that Massimiliano Allegri will guide them through this moment successfully. At this moment, it is difficult to see Milan having an exciting end to the season. They are seven points clear in the Champions League places, but t"
    },
    {
      "id": "d4a68d83fb78",
      "title": "First meeting to press room row: How Allegri-Fabregas tension arose",
      "url": "https://sempremilan.com/how-allegri-fabregas-tension-arose",
      "source": "sempremilan.com",
      "date": "2026-02-19T17:00:00+00:00",
      "summary": "Seeing a rivalry develop in real time is something strange, and with AC Milan manager Massimiliano Allegri and Como’s coach Cesc Fabregas, it is happening.  After the latest game, it cannot be denied that Fabregas and Allegri are rivals. The dislike is clear, and it has largely been one-sided, if no"
    },
    {
      "id": "d552387df9a2",
      "title": "GdS: ‘A sigh of relief’ – Pavlovic will not face long absence after avoiding fracture",
      "url": "https://sempremilan.com/pavlovic-not-face-long-absence-avoid-fracture",
      "source": "sempremilan.com",
      "date": "2026-02-19T16:30:00+00:00",
      "summary": "AC Milan sighed last night when Strahinja Pavlovic was forced to be subbed off at half-time, and it seemed serious. However, tests, thankfully, show otherwise.  In recent years, Milan have been seriously unlucky with injuries, and this season has been no different. Perhaps it can be argued that they"
    },
    {
      "id": "aa3ccea1bb99",
      "title": "Watch: Leao’s lob sees Milan extend unbeaten run with draw vs. Como – the highlights",
      "url": "https://sempremilan.com/highlights-from-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T16:00:00+00:00",
      "summary": "AC Milan managed to salvage a draw yesterday against Como, after the visitors took the lead in the first half. Offensively speaking, it was one of the worst Milan performances of the season at San Siro, as they managed less than 1 xG. Nevertheless, they still got a result, being effective, even if t"
    },
    {
      "id": "88f321aefd9b",
      "title": "Milan team news: Boost as Pavlovic tests reveal no fracture",
      "url": "https://football-italia.net/milan-team-news-boost-as-pavlovic-tests/",
      "source": "football-italia.net",
      "date": "2026-02-19T15:39:58+00:00",
      "summary": "Milan will breathe a sigh of relief this morning, after medical examinations revealed that Strahinja..."
    },
    {
      "id": "27873a4bfc49",
      "title": "‘Its not about sprints, it’s a marathon’ – Milan players react after disappointing Como draw",
      "url": "https://sempremilan.com/players-react-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T15:30:00+00:00",
      "summary": "AC Milan were forced to settle for a draw against Como on Wednesday night, and some of the team have posted messages about the result.  It is a game where Milan can look back with some allowance. After all, they keep their unbeaten run whilst being far from their best, while their Head-To-Head recor"
    },
    {
      "id": "7cb100489dc6",
      "title": "When coaches get involved: Milan rightly furious after Chivu and Fabregas incidents",
      "url": "https://sempremilan.com/milan-rightly-furious-chivu-fabregas",
      "source": "sempremilan.com",
      "date": "2026-02-19T15:00:00+00:00",
      "summary": "This season, AC Milan have been subjected to a few occasions where managers have been wrongly involved in games, yet nothing has ever been done with it.  Last night’s involvement from Cesc Fabregas brings up an uneasy question again, why are Milan the victims of coaches getting involved in games. If"
    },
    {
      "id": "61851f5fc6dd",
      "title": "Hauge refers to Inter clash as ‘the derby’ and admits ‘special meaning’: “Always nice”",
      "url": "https://sempremilan.com/hauge-refers-to-inter-clash-as-the-derby-special-meaning",
      "source": "sempremilan.com",
      "date": "2026-02-19T14:30:00+00:00",
      "summary": "Jens Petter Hauge never really hit the levels that AC Milan hoped for, but the Norwegian winger still keeps the club close to his heart. After leaving Milan, the young winger has gone on to have a pretty decent interesting career. Of course, the initial hopes were that he would be a key figure for ["
    },
    {
      "id": "acb2506abbea",
      "title": "Jashari’s arrival and xG lows: All the key stats from Milan 1-1 Como",
      "url": "https://sempremilan.com/all-the-key-stats-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T14:00:00+00:00",
      "summary": "AC Milan were held to a 1-1 draw by Como at San Siro on Wednesday night, here are some of the key stats from the game.  It was certainly not a game to shout about from a Milan perspective. In fact, it was a game to forget. From poor officiating to the goal conceded, the […]\nThe post Jashari’s arriva"
    },
    {
      "id": "99590206d996",
      "title": "Longoni: ‘Milan barely manage to win’ – Scudetto dream is over for the Rossoneri this season",
      "url": "https://sempremilan.com/barely-manage-win-scudetto-dream-over-for-milan",
      "source": "sempremilan.com",
      "date": "2026-02-19T13:35:00+00:00",
      "summary": "This season, AC Milan have been in the Scudetto fight, but they have often been their own downfall, rather than anyone else damaging them.  It has been a while since Milan last lost, yet, despite that feeling, they are not sitting at the top of the table, as many would expect. Indeed, despite losing"
    },
    {
      "id": "b328421ec01d",
      "title": "Sporting Judge: Fabregas left unpunished for now as Allegri’s ban is confirmed",
      "url": "https://sempremilan.com/fabregas-unpunished-allegri-ban-confirmed",
      "source": "sempremilan.com",
      "date": "2026-02-19T13:10:00+00:00",
      "summary": "This morning, the Sporting Judge has released its standard statement about the action from the previous day, and AC Milan may be a little shocked. Given it was the only game left of the matchday, the Sporting Judge has released a specific statement for the game between Milan and Como, detailing the "
    },
    {
      "id": "1cd8c2d9d292",
      "title": "‘You never know’ – Allegri references the Scudetto whilst admitting Champions League priority remains",
      "url": "https://sempremilan.com/allegri-references-scudetto-champions-league-focus",
      "source": "sempremilan.com",
      "date": "2026-02-19T12:45:00+00:00",
      "summary": "Massimiliano Allegri has focused on the Champions League all season, but it seems that he is not shutting down the hope of AC Milan winning the title.  Throughout the season so far, Milan have been involved in a title conversation. They have certainly been in better positions, and they have not real"
    },
    {
      "id": "626b83eb2b83",
      "title": "GdS: Milan’s road to the derby and hopes regarding Inter’s fixture congestion",
      "url": "https://sempremilan.com/milan-road-to-derby-inter-fixture-congestion",
      "source": "sempremilan.com",
      "date": "2026-02-19T12:20:00+00:00",
      "summary": "AC Milan, despite dropping points at San Siro, will still have a slight hope of the Scudetto, despite the seven-point gap being solidified.  The draw against Como hurts. Whilst the Scudetto has never been the end goal for this season, it has been there, and Milan have probably allowed themselves to "
    },
    {
      "id": "d1035a3b77cf",
      "title": "Video: Fabregas’ shirt tug and touchline confrontation with Allegri",
      "url": "https://football-italia.net/fabregas-shirt-tug-touchline-clash-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-19T12:02:33+00:00",
      "summary": "Watch how Cesc Fabregas pulled the shirt of Alexis Saelemaekers and how Milan coach Massimiliano..."
    },
    {
      "id": "6652087a182f",
      "title": "MN: Pavlovic lucky to avoid fibula fracture but sustains large hematoma – the details",
      "url": "https://sempremilan.com/pavlovic-undergoing-tests-forced-exit",
      "source": "sempremilan.com",
      "date": "2026-02-19T11:50:00+00:00",
      "summary": "Strahinja Pavlovic has been key for AC Milan this season, and he will now be absent after being forced to leave the pitch after a rough tackle. There have been a number of improved players this season for Milan. Indeed, since Massimiliano Allegri’s arrival, a case can be made for several of the Ross"
    },
    {
      "id": "dd9b7c273588",
      "title": "Jashari feels Milan did better against Como in draw than reverse fixture: “We were dangerous”",
      "url": "https://sempremilan.com/jashari-feels-milan-did-better-como-draw-reverse",
      "source": "sempremilan.com",
      "date": "2026-02-19T11:30:00+00:00",
      "summary": "Ardon Jashari got a chance to play in a more advanced role on Wednesday night, and he was largely impressive for AC Milan. When Jashari signed, it seemed he would fluctuate across the midfield positions. Instead, he has regularly stepped in for Luka Modric, and whilst he has done solidly, he should "
    },
    {
      "id": "8029d346e637",
      "title": "‘Something I’m not proud of’ – Fabregas apologises for ‘unsportsmanlike’ Saelemaekers grab",
      "url": "https://sempremilan.com/im-not-proud-fabregas-apologises-saelemaekers-grab",
      "source": "sempremilan.com",
      "date": "2026-02-19T11:05:00+00:00",
      "summary": "Cesc Fabregas created one of the big talking points for this game, and AC Milan will rightly be annoyed by the decision to send Massimiliano Allegri off. When looking at the game on paper, Allegri being sent off would make most think that the Milan manager had done something, and whilst this would b"
    },
    {
      "id": "5332dfeea45e",
      "title": "Maignan mistake costly as Leao saves the day: Player ratings from Milan-Como from Italian papers",
      "url": "https://sempremilan.com/player-ratings-milan-como-1-1",
      "source": "sempremilan.com",
      "date": "2026-02-19T10:40:00+00:00",
      "summary": "AC Milan were left to deal with another frustrating game when they faced Como on Wednesday night, and they will now face the consequences moving forward. In a game where Milan could’ve really cemented their position as a Scudetto challenger, they were unable to get three points. Both keepers were at"
    },
    {
      "id": "8e22ac8839a0",
      "title": "What Allegri told Fabregas in heated post-match clash: ‘You are a kid’",
      "url": "https://football-italia.net/what-allegri-told-fabregas-kid-milan-como/",
      "source": "football-italia.net",
      "date": "2026-02-19T09:09:48+00:00",
      "summary": "More details emerge about the confrontation between Milan coach Massimiliano Allegri and Como’s Cesc Fabregas..."
    },
    {
      "id": "d3f0ece0dd15",
      "title": "Today’s Papers – Bodo shaming, Italy cry, Leao saves Milan",
      "url": "https://football-italia.net/today-papers-bodo-shaming-italy-cry-leao-milan/",
      "source": "football-italia.net",
      "date": "2026-02-19T08:42:54+00:00",
      "summary": "La Gazzetta dello Sport Inter, three slaps But they are still +7 in Serie A...."
    },
    {
      "id": "f24c9ac03bd7",
      "title": "Allegri and Fabregas bad blood after Como coach ‘unsporting behaviour’",
      "url": "https://football-italia.net/allegri-fabregas-bad-blood-como-unsporting/",
      "source": "football-italia.net",
      "date": "2026-02-18T23:07:22+00:00",
      "summary": "There is bad blood between Max Allegri and Cesc Fabregas, as they had another row..."
    },
    {
      "id": "60f4f709567f",
      "title": "Leao and Jashari believe Milan ‘played better’ than in victory over Como",
      "url": "https://football-italia.net/leao-jashari-believe-milan-played-better-como/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:53:55+00:00",
      "summary": "Rafael Leao and Ardon Jashari argue Milan ‘played better’ in their 1-1 draw than they..."
    },
    {
      "id": "0886a97f78fb",
      "title": "Allegri: ‘A valuable Milan point, Fabregas fouled Saelemaekers’",
      "url": "https://football-italia.net/allegri-valuable-milan-point-fabregas-fouled/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:34:39+00:00",
      "summary": "Max Allegri insists Milan must see the 1-1 draw with Como as ‘a valuable point’..."
    },
    {
      "id": "72872cf860f0",
      "title": "Fabregas: ‘Como proud of 1-1 Milan draw, apology for Allegri’ row",
      "url": "https://football-italia.net/fabregas-como-proud-of-1-1-milan-draw-apology/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:19:36+00:00",
      "summary": "Cesc Fabregas apologised for his touchline row with Max Allegri, but was ‘very proud’ of..."
    },
    {
      "id": "d7ed67655616",
      "title": "Serie A | Milan 1-1 Como: Leao magic rescues Maignan howler",
      "url": "https://football-italia.net/serie-a-milan-1-1-como-leao-magic-save-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-18T21:46:39+00:00",
      "summary": "Rafael Leao’s remarkable lob cancelled out a Mike Maignan howler on Nico Paz, as Milan..."
    },
    {
      "id": "f3ddcbad229c",
      "title": "Serie A and UCL Liveblog: Milan vs. Como and Bodo/Glimt vs. Inter",
      "url": "https://football-italia.net/serie-a-ucl-liveblog-milan-como-bodo-inter/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:45:19+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "1c9558aed7a3",
      "title": "Tare shrugs off Milan Scudetto talk, reassuring news on Leao",
      "url": "https://football-italia.net/tare-shrugs-off-milan-scudetto-reassuring-leao/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:33:33+00:00",
      "summary": "Milan director Igli Tare shrugs off Scudetto talk ahead of tonight’s rescheduled clash with Como..."
    },
    {
      "id": "383f8ba5a703",
      "title": "Fabregas hint at Como False 9 experiment ‘to hurt Milan’",
      "url": "https://football-italia.net/fabregas-hint-at-como-false-9-experiment-milan/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:25:43+00:00",
      "summary": "Cesc Fabregas gives hints who is playing False 9 for Como this evening against Milan,..."
    },
    {
      "id": "740924179509",
      "title": "Serie A official Week 24 line-ups: Milan vs. Como",
      "url": "https://football-italia.net/serie-a-official-wk-24-line-ups-milan-vs-como/",
      "source": "football-italia.net",
      "date": "2026-02-18T18:39:09+00:00",
      "summary": "Milan have Rafael Leao and Christopher Nkunku upfront for the rescheduled Serie A clash with..."
    },
    {
      "id": "480f0a07090d",
      "title": "Milan optimistic over one-year Modric extension",
      "url": "https://football-italia.net/milan-optimistic-over-modric-extension/",
      "source": "football-italia.net",
      "date": "2026-02-18T17:17:48+00:00",
      "summary": "Milan are working hard to sign Luka Modric to a new one-year contract extension, after..."
    },
    {
      "id": "6dc5a25930b4",
      "title": "Milan team news: Loftus-Cheek set to miss Como clash; Nkunku to start instead",
      "url": "https://football-italia.net/milan-team-news-loftus-cheek-como-nkunku/",
      "source": "football-italia.net",
      "date": "2026-02-18T15:19:36+00:00",
      "summary": "Milan are preparing to host Como at San Siro this evening, as the Rossoneri look..."
    },
    {
      "id": "3ecccc1bff44",
      "title": "Why is Milan vs. Como the only Serie A match being played on Wednesday?",
      "url": "https://football-italia.net/why-is-milan-como-being-played-on-wednesday/",
      "source": "football-italia.net",
      "date": "2026-02-18T14:08:50+00:00",
      "summary": "Milan are due to take on Como in Serie A on Sunday evening, the only..."
    },
    {
      "id": "eb060911f496",
      "title": "Italy’s extra Champions League spot fades away after Juventus and Atalanta losses",
      "url": "https://football-italia.net/italys-extra-champions-league-spot-fades-away/",
      "source": "football-italia.net",
      "date": "2026-02-18T13:33:42+00:00",
      "summary": "Italy’s chances of receiving an extra spot in next season’s Champions League were dealt another..."
    },
    {
      "id": "6e8ccb197068",
      "title": "Official: Bologna sign Milan midfielder on permanent basis",
      "url": "https://football-italia.net/bologna-sign-milan-midfielder-on-permanent/",
      "source": "football-italia.net",
      "date": "2026-02-18T12:41:09+00:00",
      "summary": "Bologna have officially announced their signing of Tommaso Pobega on a definitive, permanent transfer from..."
    },
    {
      "id": "f5ba944f0536",
      "title": "Serie A: Milan vs. Como – Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-milan-vs-como-probable-line-ups/",
      "source": "football-italia.net",
      "date": "2026-02-18T09:16:33+00:00",
      "summary": "Milan will be without several of their key first team players when they take on..."
    }
  ]
}