{
  "lastUpdated": "2026-02-06T20:32:26.001129+00:00",
  "articles": [
    {
      "id": "f9bd99750ca4",
      "title": "Di Stefano says: \"Modric is such an intelligent boy that in my opinion he shares the 'I play, I don't play' dynamic with Allegri.\"",
      "url": "https://www.milannews.it/news/di-stefano-racconta-modric-e-talmente-un-ragazzo-intelligente-che-secondo-me-lui-condivide-con-allegri-le-dinamiche-io-gioco-io-non-gioco-606616",
      "source": "milannews.it",
      "date": "2026-02-06T20:30:09+00:00",
      "summary": "Peppe Di Stefano, SkySport journalist, expressed himself to MilanVibes about Luka Modric: \"I know that he wants to play at a high level."
    },
    {
      "id": "36598f3eac10",
      "title": "Former Milan Brescianini and former Juve player Rugani out of Fiorentina's new UEFA list",
      "url": "https://www.milannews.it/news/l-ex-milan-brescianini-e-l-ex-juve-rugani-fuori-dalla-nuova-lista-uefa-della-fiorentina-606610",
      "source": "milannews.it",
      "date": "2026-02-06T20:21:29+00:00",
      "summary": "(ANSA) - FLORENCE, FEBRUARY 5 - Fiorentina has communicated the UEFA list to play in the next Conference playoffs. League scheduled for February 19th and 26th against the Polish side Jagiellonia."
    },
    {
      "id": "af199199b98e",
      "title": "Caressa: \"Milan feels stronger than two months ago: team has grown\"",
      "url": "https://www.milannews.it/news/caressa-il-milan-si-sente-piu-forte-di-due-mesi-fa-squadra-cresciuta-606600",
      "source": "milannews.it",
      "date": "2026-02-06T20:12:21+00:00",
      "summary": "The commentator and journalist of Sky Sport Fabio Caressa intervened on his YouTube channel to offer his super-commentary on the 23rd day of the Serie A Enilive championship, which took place last weekend ..."
    },
    {
      "id": "5ee5d23d1fbe",
      "title": "He could have been Milan's number 9, now he is out of the squad at Roma: Dovbyk excluded from the UEFA list",
      "url": "https://www.milannews.it/news/poteva-essere-il-9-del-milan-ora-e-fuori-rosa-alla-roma-dovbyk-escluso-dalla-lista-uefa-606609",
      "source": "milannews.it",
      "date": "2026-02-06T20:00:46+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 05 - Roma has released the UEFA list with the players who will be able to take part in the direct elimination phase starting from the round of 16 of the Europa League. The new signings Malen, Vaz and Zaragoza have been added."
    },
    {
      "id": "cb4e1e906639",
      "title": "De Vecchi: \"I know Cissé well. He has always proven himself to be an important attacking midfielder because he has offered above-average performances\"",
      "url": "https://www.milannews.it/news/de-vecchi-conosco-bene-cisse-si-e-sempre-dimostrato-un-centrocampista-d-attacco-importante-perche-ha-offerto-prestazioni-sopra-la-media-606615",
      "source": "milannews.it",
      "date": "2026-02-06T19:50:48+00:00",
      "summary": "Walter De Vecchi, for years one of the managers of Milan's youth sector, expressed himself thus on Radio Rossonera about Alphadjo Cissé: “I know Cissé well."
    },
    {
      "id": "a445aa00f419",
      "title": "The Moroccan federation denies rumors about coach Regragui's resignation",
      "url": "https://www.milannews.it/news/la-federazione-del-marocco-smentisce-le-voci-sulle-dimissioni-del-ct-regragui-606608",
      "source": "milannews.it",
      "date": "2026-02-06T19:40:57+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 06 - The Moroccan Football Federation (FRMF) has issued an official statement in which it \"categorically denies\" the information spread by some information sites according to which the national coach, Hoalid Regragui, will have ..."
    },
    {
      "id": "718616e757b9",
      "title": "Pasotto praises Athekame: \"The right foot is definitely educated. Just like him. He's starting to blossom now\"",
      "url": "https://www.milannews.it/news/pasotto-elogia-athekame-il-piede-destro-e-decisamente-educato-proprio-come-lui-sta-iniziando-a-sbocciare-adesso-606614",
      "source": "milannews.it",
      "date": "2026-02-06T19:30:42+00:00",
      "summary": "Marco Pasotto, journalist, expressed himself as follows in La Gazzetta dello Sport on Zachary Athekame: \"The right foot is definitely polite. Just like him."
    },
    {
      "id": "832c26b70f10",
      "title": "Juventus’ marketing director suggests Inter and Milan are no the only competitors: “Fighting the same mission”",
      "url": "https://sempremilan.com/juventus-marketing-director-inter-milan-rivals",
      "source": "sempremilan.com",
      "date": "2026-02-06T19:30:00+00:00",
      "summary": "Juventus, Inter and AC Milan are the three biggest teams in Italian football, and they fight for everything in the league, including the marketing shares. Being the biggest club in Italy is a title that three clubs have historically fought for, and they still do. Of course, they are Inter, Juve and "
    },
    {
      "id": "f0505bd9296b",
      "title": "From the breakup at San Siro to the farewell: Schuurs terminates his contract with Torino",
      "url": "https://www.milannews.it/news/dalla-rottura-a-san-siro-all-addio-schuurs-rescinde-con-il-torino-606606",
      "source": "milannews.it",
      "date": "2026-02-06T19:20:48+00:00",
      "summary": "(ANSA) - TURIN, 06 FEB - Torino has made official the termination of Perr Schuurs' contract, the Dutch defender ends his adventure with the Granata six months early."
    },
    {
      "id": "62565c1b8b18",
      "title": "Gozzini: \"To widen the margin on fifth place, Milan must correct the trend with the lower profile teams\"",
      "url": "https://www.milannews.it/news/gozzini-per-ampliare-il-margine-sul-quinto-posto-il-milan-deve-correggere-l-andamento-con-le-squadre-di-piu-basso-profilo-606613",
      "source": "milannews.it",
      "date": "2026-02-06T19:10:24+00:00",
      "summary": "Alessandra Gozzini, journalist, expressed herself as follows in La Gazzetta dello Sport on Milan's numbers: \"There are images that have become happily familiar to Milan fans: the team celebrating in front of the fans, the red people ..."
    },
    {
      "id": "a8ae1ab6706b",
      "title": "Loftus-Cheek, Bologna's goal is not enough: other responses are needed on the pitch",
      "url": "https://www.milannews.it/primo-piano/loftus-cheek-il-gol-di-bologna-non-basta-servono-altre-risposte-sul-campo-606627",
      "source": "milannews.it",
      "date": "2026-02-06T19:00:04+00:00",
      "summary": "Massimiliano Allegri's confidence is an important sign, but it cannot be the only thing to hold on to."
    },
    {
      "id": "5fde8e902429",
      "title": "Bonus Podcast with Oliver and Anthony: A look at the Milan Mercato ‘What Ifs’",
      "url": "https://sempremilan.com/bonus-podcast-oliver-anthony-milan-mercato-what-ifs",
      "source": "sempremilan.com",
      "date": "2026-02-06T19:00:00+00:00",
      "summary": "With the mercato just closing, and Jean-Philippe Mateta not joining AC Milan, Oli and Anthony looked at a few others who could’ve stayed or joined. The mercato is a strange time, isn’t it. Ultimately, it is a very volatile period for football clubs, and we saw this again with Mateta’s failed move to"
    },
    {
      "id": "8d3406611e7e",
      "title": "Guidi: \"What the numbers don't tell is Rabiot's contribution in terms of mentality and experience\"",
      "url": "https://www.milannews.it/news/guidi-cio-che-i-numeri-non-raccontano-e-l-apporto-in-fatto-di-mentalita-ed-esperienza-di-rabiot-606611",
      "source": "milannews.it",
      "date": "2026-02-06T18:50:30+00:00",
      "summary": "Marco Guidi, journalist, expressed himself in La Gazzetta dello Sport about Adrien Rabiot: \"What the numbers don't tell is the contribution in terms of mentality and experience."
    },
    {
      "id": "1b0f15a61ae4",
      "title": "Deferred arrest and precautionary custody for the Inter fan who threw the firecracker",
      "url": "https://www.milannews.it/news/arresto-differito-e-custodia-cautelare-per-il-tifoso-interista-che-ha-lanciato-il-petardo-606604",
      "source": "milannews.it",
      "date": "2026-02-06T18:40:55+00:00",
      "summary": "(ANSA) - MILAN, 06 FEB - He caused a \"serious danger to the safety of the players and other people present in the stands\" and there is a risk that he could commit other crimes of the same kind due to his \"..."
    },
    {
      "id": "ca84e9c173a2",
      "title": "Verona, Sammarco: \"Cissé did well to go to Catanzaro, he demonstrated all his value. Good luck with his career\"",
      "url": "https://www.milannews.it/news/verona-sammarco-cisse-ha-fatto-bene-ad-andare-al-catanzaro-ha-dimostrato-tutto-il-suo-valore-in-bocca-al-lupo-per-la-sua-carriera-606625",
      "source": "milannews.it",
      "date": "2026-02-06T18:30:03+00:00",
      "summary": "Paolo Sammarco, new manager of Verona promoted by the Primavera, expressed himself thus on Alphadjo Cissé, Milan's new signing taken from the Gialloblu, in a press conference: \"About Cisse I think he did him..."
    },
    {
      "id": "da29123a3f19",
      "title": "Tuttosport: ‘Protect their star’ – Premier League interest another reason for Milan’s Bartesaghi renewal",
      "url": "https://sempremilan.com/premier-league-interest-reason-bartesaghi-renewal",
      "source": "sempremilan.com",
      "date": "2026-02-06T18:30:00+00:00",
      "summary": "Davide Bartesaghi will renew his deal with AC Milan shortly it seems, and the reasoning behind the move is quite clear.  There can be no denying that Milan want to renew Bartesaghi’s contract for his performances. Since taking the spot from Pervis Estupinan, the Italian has shown the potential that "
    },
    {
      "id": "be8b7b067979",
      "title": "Serie A Women, the 13th matchday programme: Milan at home to league leaders Roma",
      "url": "https://www.milannews.it/milan-femminile/serie-a-women-il-programma-della-13-giornata-milan-in-casa-della-capolista-roma-606594",
      "source": "milannews.it",
      "date": "2026-02-06T18:22:45+00:00",
      "summary": "This is the program for the 13th matchday of the Women's Serie A scheduled between Saturday 7 and Sunday 8 February:\n\nGenoa-Lazio (Saturday 7th at 12.30pm)\nSassuolo-Parma (Saturday 7th at 12.30pm)\nComo Women-Juventus (Saturday 7th at 3pm)\nRoma-Milan (Sunday 8 ..."
    },
    {
      "id": "0deabdc5bbed",
      "title": "Order: \"After seven months of Allegri's work, the improvements are there for everyone to see, even his fiercest critics\"",
      "url": "https://www.milannews.it/news/ordine-dopo-sette-mesi-di-lavoro-di-allegri-i-miglioramenti-sono-sotto-gli-occhi-di-tutti-persino-dei-suoi-piu-accaniti-critici-606618",
      "source": "milannews.it",
      "date": "2026-02-06T18:11:27+00:00",
      "summary": "Franco Ordine, journalist, expressed himself in the Corriere dello Sport about Massimiliano Allegri: \"There are three good reasons to explain the healthy realism with which Max Allegri continues to look at the rear-view mirror to ..."
    },
    {
      "id": "9340fad49f43",
      "title": "Rome, Robinio Vaz also stops: muscle injury",
      "url": "https://www.milannews.it/news/roma-si-ferma-anche-robinio-vaz-lesione-muscolare-606581",
      "source": "milannews.it",
      "date": "2026-02-06T18:00:34+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 06 - More problems at Roma."
    },
    {
      "id": "ea845ae93036",
      "title": "Devil’s Advocate: Vilified for diligence – why Milan’s medical approach should provoke pride",
      "url": "https://sempremilan.com/why-milan-medical-approach-pride-vilified",
      "source": "sempremilan.com",
      "date": "2026-02-06T18:00:00+00:00",
      "summary": "The winter transfer window closed on Monday evening, and yet the storm surrounding AC Milan has continued to rage on. As we headed into the final day of the mercato, the now infamous ‘Deadline Day™’, it seemed that Milan would be surprise protagonists, at least relative to the amount of activity in "
    },
    {
      "id": "948a5e137435",
      "title": "Cuomo: \"I see many games of sacrifice on Leao's part, I see that he tries to make a comeback but he grits his teeth and little can be said to him\"",
      "url": "https://www.milannews.it/news/cuomo-vedo-tante-partite-di-sacrificio-da-parte-di-leao-vedo-che-tenta-di-strappare-ma-stringe-i-denti-e-gli-si-puo-dire-poco-606617",
      "source": "milannews.it",
      "date": "2026-02-06T17:50:37+00:00",
      "summary": "Michael Cuomo, journalist, expressed himself to Milan Vibes about Rafael Leao: “I think that strong players manage themselves, Leao remains the Serie A footballer most capable of determining the fate of ..."
    },
    {
      "id": "1182c510dc34",
      "title": "Bennacer, here we go again: thigh strain for the Algerian",
      "url": "https://www.milannews.it/news/bennacer-ci-risiamo-stiramento-alla-coscia-per-l-algerino-606596",
      "source": "milannews.it",
      "date": "2026-02-06T17:40:29+00:00",
      "summary": "Between the summer and winter sessions, Milan sent several players on loan, not just youngsters from the Rossoneri academy."
    },
    {
      "id": "aeb92825ad5b",
      "title": "Inter, Thuram: \"Sometimes there are also those who lose a bet because of you and accuse you, forgetting that the choice to bet was theirs\"",
      "url": "https://www.milannews.it/news/inter-thuram-a-volte-c-e-anche-chi-perde-una-scommessa-per-colpa-tua-e-ti-accusa-dimenticando-che-la-scelta-di-scommettere-e-stata-la-loro-606624",
      "source": "milannews.it",
      "date": "2026-02-06T17:30:02+00:00",
      "summary": "Marcus Thuram, Inter striker, expressed himself thus to CBS: \"People are obsessed with numbers. Often they don't even watch the matches and assign the man of the match to whoever scored, even without having turned on the TV."
    },
    {
      "id": "3ff45066af09",
      "title": "6 February 1955: Cesare Maldini's first goal for the Rossoneri",
      "url": "https://www.milannews.it/gli-ex/6-febbraio-1955-il-primo-gol-in-rossonero-di-cesare-maldini-606593",
      "source": "milannews.it",
      "date": "2026-02-06T17:20:12+00:00",
      "summary": "On 6 February 1955, on the occasion of a Triestina-Milan match valid for the 18th matchday of Serie A, Cesare Maldini scored his first goal in the Rossoneri shirt: the former AC Milan defender scored the temporary 2-2 goal in the 50th minute (the challenge was ..."
    },
    {
      "id": "3f94b471ceb0",
      "title": "CM: Newcastle star Tonali wants ‘return to Italy’ – Milan’s stance amid obvious preference",
      "url": "https://sempremilan.com/newcastle-star-tonali-wants-return-italy-milan-stance",
      "source": "sempremilan.com",
      "date": "2026-02-06T17:18:46+00:00",
      "summary": "AC Milan could be put onto high alert this summer, with Sandro Tonali wanting a move back to Italy at the end of the season, a report writes. There have been rumours about Tonali’s immediate future for some time now, and it seemed through the January mercato that there was a chance he could leave […"
    },
    {
      "id": "5aed586443e6",
      "title": "Photos: New predictions for AC Milan’s 2026-27 away and third shirts arrive",
      "url": "https://sempremilan.com/new-predictions-milan-2026-27-away-third-shirt",
      "source": "sempremilan.com",
      "date": "2026-02-06T17:00:00+00:00",
      "summary": "Although we are not done with the 2025-26 season, it already seems that people have a good idea on what the new AC Milan shirt will look like. It is nothing new for kits to leak early online. In fact, around now will be the time that kits are being finalised for the new season. […]\nThe post Photos: "
    },
    {
      "id": "6d945158e1dd",
      "title": "Sia explains leaving Milan is not easy but excited for the future: “A player who adapts”",
      "url": "https://sempremilan.com/sia-explains-leaving-milan-not-easy",
      "source": "sempremilan.com",
      "date": "2026-02-06T16:30:00+00:00",
      "summary": "Diego Sia left AC Milan last month to join CD Mirandes in the Spanish second division, and it will be hoped that he can go to the next level. The Milan Futuro is good until players reach a certain level. At that point, it is crucial that they take another step by departing on loan. […]\nThe post Sia "
    },
    {
      "id": "d17faab3701b",
      "title": "GdS: Buzz returns to San Siro as Milan can expect sell-outs for next three fixtures",
      "url": "https://sempremilan.com/buzz-returns-san-siro-milan-expect-sell-outs",
      "source": "sempremilan.com",
      "date": "2026-02-06T16:00:00+00:00",
      "summary": "Last season, it felt like the fans were struggling to find a connection with the AC Milan squad, and it showed at San Siro. On several occasions last season, Milan faced scrutiny over their games at San Siro. For the Champions League clash against Liverpool, there were questions over the pricing of "
    },
    {
      "id": "ab37403d8396",
      "title": "‘We didn’t reach an agreement’ – Independiente director discusses Milan’s Arizala pursuit",
      "url": "https://sempremilan.com/independiente-director-milan-arizala-pursuit",
      "source": "sempremilan.com",
      "date": "2026-02-06T15:30:00+00:00",
      "summary": "Juan Arizala seemed to be one of the first names for the January mercato. However, AC Milan did not land the young full-back, with him instead heading to Udinese. Before the New Year, there were several links between Milan and Independiente de Medellin full-back, Arizala, who was seen as a player fo"
    },
    {
      "id": "12379695ae01",
      "title": "CM: Positive updates arrive about Leao and Pulisic with Pisa targeted – their conditions",
      "url": "https://sempremilan.com/positive-updates-arrive-leao-pulisic-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-06T15:00:00+00:00",
      "summary": "Thanks to a specific recovery plan, AC Milan hope to have their star duo back for the game against Pisa next weekend, reports suggest. This season, Massimiliano Allegri and Milan have been massively unlucky with injuries. Unfortunately, two players have suffered more than others. Of course, that duo"
    },
    {
      "id": "0bbe5dfeba4c",
      "title": "Milan vs. Como postponed for 2026 Winter Olympics opening ceremony: when will it be played?",
      "url": "https://football-italia.net/milan-vs-como-postponed-2026-olympics-when/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:59:54+00:00",
      "summary": "With the Stadio Meazza in San Siro unavailable for the 2026 Winter Olympics opening ceremony,..."
    },
    {
      "id": "7c148df4d4cd",
      "title": "Glasner opens up on Mateta’s failed Milan medical: ‘It wasn’t a big surprise’",
      "url": "https://football-italia.net/glasner-on-matetas-failed-milan-medical/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:55:13+00:00",
      "summary": "Crystal Palace head coach Oliver Glasner has admitted that ‘it wasn’t a big big surprise’..."
    },
    {
      "id": "37e0db54836f",
      "title": "Catanzaro director discusses Cissè’s decision to stay after Milan option: “Out of respect”",
      "url": "https://sempremilan.com/catanzaro-director-discusses-cisse-decision",
      "source": "sempremilan.com",
      "date": "2026-02-06T14:30:00+00:00",
      "summary": "When AC Milan bought Alphadjo Cissè, they were not buying a player to immediately join the squad. Instead, the youngster is one for the future. It was a mercato for the Futuro last month, as opposed to Milan spending heavily on the first team, like they did last year. As a result, they made a […]\nTh"
    },
    {
      "id": "c10c6a922ef6",
      "title": "San Siro’s last dance at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/san-siro-last-dance-winter-olympics-ceremony/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:23:58+00:00",
      "summary": "The opening ceremony of the 2026 Milan Cortina Winter Olympics will take place today at..."
    },
    {
      "id": "f8ff85e81010",
      "title": "MN: ‘Exam passed’ – Athekame shows promise against Bologna as confidence emerges",
      "url": "https://sempremilan.com/athekame-shows-promise-bologna-exam-passed",
      "source": "sempremilan.com",
      "date": "2026-02-06T14:00:00+00:00",
      "summary": "When Zachary Athekame joined AC Milan, there were questions about what role he would play in the squad. Those still remain, but he is fighting back. There have been several questions this year about the recruitment from the summer, and Athekame has been subject to them. Not naturally a wing-back, hi"
    },
    {
      "id": "a8297bee82be",
      "title": "CorSport: Nkunku’s ‘resurgence through goals’ – goal tally matched after Milan’s push",
      "url": "https://sempremilan.com/nkunku-resurgence-goal-tally-matched-milan-push",
      "source": "sempremilan.com",
      "date": "2026-02-06T13:35:00+00:00",
      "summary": "Christopher Nkunku was pushed towards the door by AC Milan in January, but now, he could be the one doing the pushing.  It seemed for most of the month that Nkunku would go. After all, he was under a lot of pressure to leave Milan just six months after arriving from the Premier League. It […]\nThe po"
    },
    {
      "id": "277dd6de88ef",
      "title": "‘Milan is like a second home’ – Ibrahimovic thanks Italy after Olympic torchbearer duties",
      "url": "https://sempremilan.com/ibrahimovic-thanks-italy-olympic-torch",
      "source": "sempremilan.com",
      "date": "2026-02-06T13:10:00+00:00",
      "summary": "Zlatan Ibrahimovic carried the Olympic Torch around the streets of Milano earlier today, and the AC Milan legend has spoken after. There are few faces more identifiable than Ibrahimovic’s across Europe, and especially in Milano, given he represented both sides of the city. Now, his work is with Mila"
    },
    {
      "id": "0091aa3c6dbe",
      "title": "Falk: Arsenal made late move for Goretzka as Premier League appeal grows – Milan still at the door",
      "url": "https://sempremilan.com/arsenal-late-move-goretzka-premier-league-appeal",
      "source": "sempremilan.com",
      "date": "2026-02-06T12:45:00+00:00",
      "summary": "Leon Goretzka was a long-term interest for AC Milan, and it seems that over the next few months, they will continue to pursue the midfielder. However, their mission is more difficult. Given the situation with Goretzka, it is nothing new that bringing him to San Siro in the summer will be a challenge"
    },
    {
      "id": "3ba5bd8352eb",
      "title": "Tuttosport: Milan sitting on €60m war chest to bolster Allegri’s squad – the situation",
      "url": "https://sempremilan.com/milan-sitting-60m-war-chest-boost-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-06T12:20:00+00:00",
      "summary": "It seems increasingly likely that AC Milan will return to the Champions League next season, which will be a financial boost. But it will not be the only boost they receive. At present, it seems difficult to imagine a season finale where Milan are not in the premier European competition next season. "
    },
    {
      "id": "ff24cf09068f",
      "title": "Watch: Ibrahimovic carries Olympic Torch through Milano before opening ceremony",
      "url": "https://sempremilan.com/ibrahimovic-carries-olympic-torch-milano",
      "source": "sempremilan.com",
      "date": "2026-02-06T11:55:00+00:00",
      "summary": "This morning, Zlatan Ibrahimovic enjoyed the chance to be an official torchbearer for the Milan-Cortina 2026 Winter Olympics. Today, the Winter Olympics begin, so the final few torch bearers are taking their chance to carry the flame through Milan, ahead of the opening ceremony at San Siro. Of cours"
    },
    {
      "id": "644c8d0ca56c",
      "title": "Glasner speaks on Mateta’s failed Milan move and confirms knee issue: “Since November”",
      "url": "https://sempremilan.com/glasner-speaks-mateta-failed-milan-move-knee-issue",
      "source": "sempremilan.com",
      "date": "2026-02-06T11:30:00+00:00",
      "summary": "There were rumours that Jean-Philippe Mateta had a knee issue before AC Milan found it, and those suggestions were confirmed by Oliver Glasner. The move for Mateta seemed to be happening at the last minute, with Milan looking to get a deal done quickly, having swooped in late. Things seemed to be pr"
    },
    {
      "id": "4f475c13c3a3",
      "title": "CorSport: Differences noticeable in defence as Milan are significantly better than last year",
      "url": "https://sempremilan.com/differences-noticeable-milan-significantly-better",
      "source": "sempremilan.com",
      "date": "2026-02-06T11:05:00+00:00",
      "summary": "Last season, AC Milan had several issues across the pitch and, in fairness, off of it as well. Now, those problems are fading. Looking back at the situation 12 months ago, Milan had just spent a fortune in the January mercato in an attempt to settle the club. Throughout the season, protests had been"
    },
    {
      "id": "315a62229379",
      "title": "Moretto: Modric’s renewal ‘needs time’ – why his Milan future is uncertain currently",
      "url": "https://sempremilan.com/modric-renewal-needs-time-milan-future-uncertain",
      "source": "sempremilan.com",
      "date": "2026-02-06T10:40:00+00:00",
      "summary": "In an ideal world, AC Milan will extend Luka Modric’s contract next season, given they have the option to do so in his deal already, but it is not that simple.  When Modric joined Milan, an insurance clause was inserted, where the Rossoneri would have the option of an extra year if all parties wante"
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    },
    {
      "id": "b17892f94874",
      "title": "Hazard: ‘I was a Milan fan’, ‘special’ relationship with Sarri, but Mourinho the best",
      "url": "https://football-italia.net/hazard-milan-fan-sarri-special-mourinho-best/",
      "source": "football-italia.net",
      "date": "2026-02-05T10:54:34+00:00",
      "summary": "Former Belgian star Eden Hazard reveals he was a Milan fan as a kid and..."
    },
    {
      "id": "f86a3c2aa1e5",
      "title": "Del Piero: Juventus ‘must’ have title belief, but avoids Yildiz comparison",
      "url": "https://football-italia.net/del-piero-juventus-title-no-yildiz-comparison/",
      "source": "football-italia.net",
      "date": "2026-02-05T09:35:42+00:00",
      "summary": "Juventus legend Alessandro Del Piero feels the Bianconeri can still aim for the Serie A..."
    },
    {
      "id": "a5543b121859",
      "title": "Marotta: ‘Inter approve of rotation, Milan have an advantage for Scudetto’",
      "url": "https://football-italia.net/marotta-inter-approve-rotation-milan-advantage/",
      "source": "football-italia.net",
      "date": "2026-02-04T19:52:47+00:00",
      "summary": "Inter President Beppe Marotta backs the squad rotation for the Coppa Italia quarter-final with Torino..."
    },
    {
      "id": "9de86510452c",
      "title": "Why Inter vs. Torino Coppa Italia clash moved for 2026 Winter Olympics",
      "url": "https://football-italia.net/why-inter-vs-torino-coppa-italia-clash-moved/",
      "source": "football-italia.net",
      "date": "2026-02-04T17:23:22+00:00",
      "summary": "Tonight’s Coppa Italia quarter-final is technically Inter hosting Torino, but the 2026 Winter Olympics mean..."
    },
    {
      "id": "d1ee46184128",
      "title": "Milan eyeing Italy striker for summer transfer window but unwilling to spend €62m",
      "url": "https://football-italia.net/milan-eyeing-italy-striker-for-summer/",
      "source": "football-italia.net",
      "date": "2026-02-04T16:31:09+00:00",
      "summary": "Wednesday’s reports claim that Milan are eyeing a potential move for Italy international Moise Kean..."
    },
    {
      "id": "2b1e8827ad38",
      "title": "Capello analyses Milan’s 3-0 win over Bologna: ‘Foolish not to consider the Scudetto’",
      "url": "https://football-italia.net/capello-analyses-milans-3-0-win-over-bologna/",
      "source": "football-italia.net",
      "date": "2026-02-04T12:42:25+00:00",
      "summary": "Fabio Capello has had his say on Milan’s recent 3-0 victory over Bologna in Serie..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-04T11:21:04+00:00",
      "summary": "Recent reports claim that Alex Jimenez’s loan move to AFC Bournemouth is set to be..."
    },
    {
      "id": "b268dce71cdf",
      "title": "Today’s Papers – Milan impress in Bologna, Yildiz extends with Juventus",
      "url": "https://football-italia.net/todays-papers-milan-impress-in-bologna-yildiz-extends-with-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-04T08:29:55+00:00",
      "summary": "La Gazzetta dello Sport “What the Devil!” Milan overwhelm Bologna (3-0) and remain five points..."
    },
    {
      "id": "a7d106533e6a",
      "title": "Allegri: ‘Important to reach 50 points, but Milan have to do better’",
      "url": "https://football-italia.net/allegri-important-for-milan-to-reach-50-points/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:52:34+00:00",
      "summary": "Massimiliano Allegri believes that there is still room for improvement for his Milan side, despite..."
    },
    {
      "id": "6b625068a1fd",
      "title": "Italiano: ‘Bologna can’t put in two consecutive top-level performances’",
      "url": "https://football-italia.net/italiano-bologna-two-consecutive-performances/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:42:19+00:00",
      "summary": "Vincenzo Italiano was left bemused and questioning why his Bologna side do not seem able..."
    },
    {
      "id": "258cd38cc2c7",
      "title": "Player ratings: Bologna 0-3 Milan – French connection (and some UK)",
      "url": "https://football-italia.net/ratings-bologna-0-3-milan-french-connection/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:12:07+00:00",
      "summary": "A combination of Milan’s French stars and Englishman Ruben Loftus-Cheek were among the best players..."
    },
    {
      "id": "a85b54e36767",
      "title": "Serie A | Bologna 0-3 Milan: Who needs Mateta?",
      "url": "https://football-italia.net/serie-a-bologna-0-3-milan-who-needs-mateta/",
      "source": "football-italia.net",
      "date": "2026-02-03T21:40:19+00:00",
      "summary": "Milan were unable to seal a deadline day transfer for Crystal Palace striker Jean-Philippe Mateta,..."
    },
    {
      "id": "ce1a398b6a46",
      "title": "Serie A Liveblog: Bologna vs. Milan",
      "url": "https://football-italia.net/serie-a-liveblog-bologna-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-03T19:45:46+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "14b7ffb82d41",
      "title": "Three different experts warned Milan against Mateta signing",
      "url": "https://football-italia.net/three-experts-warned-milan-off-mateta/",
      "source": "football-italia.net",
      "date": "2026-02-03T19:17:56+00:00",
      "summary": "Reports in Italy claim that three different medical experts advised Milan against signing Crystal Palace..."
    },
    {
      "id": "f9e41c5bf4af",
      "title": "Serie A: Bologna vs. Milan – Confirmed line-ups",
      "url": "https://football-italia.net/serie-a-bologna-milan-confirmed-line-ups/",
      "source": "football-italia.net",
      "date": "2026-02-03T18:50:01+00:00",
      "summary": "Milan will have to do without Rafael Leao, Christian Pulisic and Alexis Saelemaekers in their..."
    }
  ]
}