{
  "lastUpdated": "2026-02-21T09:28:17.533647+00:00",
  "articles": [
    {
      "id": "e43c8c4ebbeb",
      "title": "GdS: ‘The yellow of Rabiot’ – Milan happy and worried about key player’s return",
      "url": "https://sempremilan.com/gds-yellow-rabiot-milan-happy-worried",
      "source": "sempremilan.com",
      "date": "2026-02-21T09:25:13+00:00",
      "summary": "Adrien Rabiot is back after serving a one-game suspension, but another game of rest could be on the cards for the Frenchman, which worries AC Milan and Massimiliano Allegri.  As highlighted by today’s edition of Gazzetta dello Sport (see photo below), the good news for Milan is that Rabiot will be b"
    },
    {
      "id": "100102772424",
      "title": "Against Parma for a new goal: it would be the second time in Milan's history",
      "url": "https://www.milannews.it/news/contro-il-parma-per-un-nuovo-traguardo-sarebbe-la-seconda-volta-nella-storia-del-milan-608181",
      "source": "milannews.it",
      "date": "2026-02-21T09:24:00+00:00",
      "summary": "After the home draw against Como, Milan will return to San Siro tomorrow evening to challenge Parma. The Rossoneri must remain close to Inter, avoiding losing further ground."
    },
    {
      "id": "7e2b0a8ab29f",
      "title": "Milan, against Parma for a new goal: here's what it is",
      "url": "https://www.milannews.it/news/milan-contro-il-parma-per-un-nuovo-traguardo-ecco-quale-608169",
      "source": "milannews.it",
      "date": "2026-02-21T09:12:00+00:00",
      "summary": "After the match against Como, Milan will host Parma on Sunday. As today's edition of Corriere dello Sport reminds us, the Devil is targeting the twenty-fifth consecutive useful result in the championship."
    },
    {
      "id": "d0e2abb15837",
      "title": "From Leao and Pulisic: Allegri and his senators for the final rush",
      "url": "https://www.milannews.it/primo-piano/da-leao-e-pulisic-allegri-e-i-suoi-senatori-per-il-rush-finale-608213",
      "source": "milannews.it",
      "date": "2026-02-21T09:00:00+00:00",
      "summary": "There is little to say and nothing to hide: we have reached the key period of the season."
    },
    {
      "id": "dde537f040fd",
      "title": "Gallery: ‘Rabiot troubling Milan’, ‘Two playmakers’ – Today’s headlines in Italian papers",
      "url": "https://sempremilan.com/gallery-rabiot-milan-playmakers-italian-papers",
      "source": "sempremilan.com",
      "date": "2026-02-21T09:00:00+00:00",
      "summary": "AC Milan will be back in action tomorrow, taking on Parma at home, but there are a few concerns for Massimiliano Allegri. Above all, Adrien Rabiot must be managed carefully.  Rabiot missed the 1-1 draw against Como due to a suspension, having received a red card in the game before. Subsequently, he "
    },
    {
      "id": "b60b72670454",
      "title": "The latest towards Parma: \"Pavlovic out, Gabbia and Saelemaekers return. Doubts ahead\"",
      "url": "https://www.milannews.it/rassegna-stampa/le-ultime-verso-parma-pavlovic-fuori-tornano-gabbia-e-saelemaekers-dubbi-davanti-608203",
      "source": "milannews.it",
      "date": "2026-02-21T08:48:00+00:00",
      "summary": "Everything is ready for the match that Milan will play tomorrow against Parma. Massimiliano Allegri has several training doubts that he will perhaps resolve starting from this afternoon's press conference."
    },
    {
      "id": "6de19016a013",
      "title": "Milan, Parma is on Saturday. CorSport: \"Alexis wants the job from the start\"",
      "url": "https://www.milannews.it/rassegna-stampa/milan-sabato-c-e-il-parma-il-corsport-alexis-vuole-il-posto-dall-inizio-608168",
      "source": "milannews.it",
      "date": "2026-02-21T08:36:00+00:00",
      "summary": "After the draw against Como, Milan cannot make mistakes against Parma, to avoid losing further ground on Inter. Massimiliano Allegri will be able to fully count on Alexis Saelemaekers, who is fully recovered."
    },
    {
      "id": "17af1fff198a",
      "title": "Milan-Parma, Rabiot returns. Tuttosport: \"The Frenchman returns with the Emilians\"",
      "url": "https://www.milannews.it/rassegna-stampa/milan-parma-torna-rabiot-tuttosport-il-francese-rientra-con-gli-emiliani-608174",
      "source": "milannews.it",
      "date": "2026-02-21T08:24:00+00:00",
      "summary": "Milan can no longer lose any more points along the way. After the draw against Como, tomorrow the Devil will seek immediate redemption against Parma."
    },
    {
      "id": "8c8d15013112",
      "title": "CorSport returns to Leao's words to CBS: \"The derby is a question of life and death\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-corsport-torna-sulle-parole-di-leao-alla-cbs-il-derby-e-una-questione-di-vita-o-di-morte-608167",
      "source": "milannews.it",
      "date": "2026-02-21T08:12:00+00:00",
      "summary": "He scored the equalizer against Como, now Rafa Leao must continue to score to drag Milan along."
    },
    {
      "id": "21114439ada1",
      "title": "La Gazzetta: \"From Maignan to Leao and Pulisic. Allegri calls his leaders\"",
      "url": "https://www.milannews.it/rassegna-stampa/la-gazzetta-da-maignan-a-leao-e-pulisic-allegri-chiama-i-suoi-leader-608201",
      "source": "milannews.it",
      "date": "2026-02-21T08:00:00+00:00",
      "summary": "Key period of the championship. Milan will return to the field tomorrow to face Parma, and Massimiliano Allegri will need all his driving force."
    },
    {
      "id": "0ec1a5de15ed",
      "title": "The opening QS: \"Jashari-Modric, Allegri is studying a new Milan with double play\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-qs-in-apertura-jashari-modric-allegri-studia-un-nuovo-milan-col-doppio-play-608165",
      "source": "milannews.it",
      "date": "2026-02-21T07:48:00+00:00",
      "summary": "After the home draw against Como, Milan will host Parma on Sunday. The objective is to win so as not to lose further distance on Inter."
    },
    {
      "id": "0b322da46268",
      "title": "Tuttosport: \"Rabiot is back, Milan's energy accelerator\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-riecco-rabiot-l-acceleratore-energetico-del-milan-608173",
      "source": "milannews.it",
      "date": "2026-02-21T07:36:00+00:00",
      "summary": "After the draw against Como, Milan will return to San Siro tomorrow to host Parma. Massimiliano Allegri will be able to count on what will be an important presence until the end of the season, Adrien Rabiot."
    },
    {
      "id": "493c165a9683",
      "title": "CorSport: \"There is more Milan with Rabiot\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-corsport-c-e-piu-milan-con-rabiot-608166",
      "source": "milannews.it",
      "date": "2026-02-21T07:24:00+00:00",
      "summary": "After the home draw against Como, Milan will return to San Siro on Sunday, this time to challenge Parma. Adrien Rabiot, suspended on Wednesday, should also return to the pitch."
    },
    {
      "id": "ff66043db894",
      "title": "La Gazzetta on Milan: \"Rabiot's mystery\"",
      "url": "https://www.milannews.it/rassegna-stampa/la-gazzetta-sul-milan-il-giallo-di-rabiot-608199",
      "source": "milannews.it",
      "date": "2026-02-21T07:12:00+00:00",
      "summary": "After the draw against Como, Milan will return to San Siro tomorrow to challenge Parma. And he will do it with an extra Adrien Rabiot."
    },
    {
      "id": "4f91949366c1",
      "title": "Milan, Rabiot returns: the Frenchman and the importance of always having him on the pitch",
      "url": "https://www.milannews.it/primo-piano/milan-torna-rabiot-il-francese-e-l-importanza-di-averlo-sempre-in-campo-608177",
      "source": "milannews.it",
      "date": "2026-02-21T07:00:00+00:00",
      "summary": "The draw against Como still hurts, but there is no time to look back because tomorrow there is already another obstacle to overcome."
    },
    {
      "id": "8d08f230c48c",
      "title": "Ticket sales for Milan-Turin opened yesterday but no date is yet known",
      "url": "https://www.milannews.it/news/aperta-ieri-la-vendita-dei-biglietti-per-milan-torino-per-cui-ancora-non-si-conosce-data-608164",
      "source": "milannews.it",
      "date": "2026-02-21T06:48:56+00:00",
      "summary": "In the last home match of the month of March, Milan will take the field against Turin on the 30th matchday of the Serie A championship."
    },
    {
      "id": "2c4d27634ca9",
      "title": "Therapy for Pavlovic yesterday: we are trying to recover him for Cremona. The point",
      "url": "https://www.milannews.it/news/ieri-terapie-per-pavlovic-si-prova-a-recuperarlo-per-cremona-il-punto-608159",
      "source": "milannews.it",
      "date": "2026-02-21T06:36:52+00:00",
      "summary": "According to what the MilanNews editorial team learned yesterday."
    },
    {
      "id": "7663cfbbabfc",
      "title": "Serie A, the updated standings: today Inter can extend, Juve can shorten",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-oggi-l-inter-puo-allungare-la-juve-puo-accorciare-608128",
      "source": "milannews.it",
      "date": "2026-02-21T06:24:55+00:00",
      "summary": "After Friday's advance, Sassuolo, victorious 3-0 over Hellas Verona, dreams big and moves up to eighth place in the standings, overtaking both Lazio and Bologna who will have to respond later in the weekend."
    },
    {
      "id": "ee32a73e58d3",
      "title": "Verona sinks: today the 26th round continues with Juve and Inter on the pitch",
      "url": "https://www.milannews.it/news/il-verona-affonda-oggi-il-26-turno-prosegue-con-juve-e-inter-in-campo-608158",
      "source": "milannews.it",
      "date": "2026-02-21T06:12:00+00:00",
      "summary": "The 26th round of the Serie A Enilive championship opened with yet another thud for Hellas Verona, who fell to the blows of Sassuolo away, who had a very easy time, archiving the final 3-0 in just over ..."
    },
    {
      "id": "efc20ddd5b45",
      "title": "Where and when to see Max Allegri's conference on the eve of Milan-Parma",
      "url": "https://www.milannews.it/news/dove-e-quando-vedere-la-conferenza-di-max-allegri-alla-vigilia-di-milan-parma-608160",
      "source": "milannews.it",
      "date": "2026-02-21T06:00:00+00:00",
      "summary": "Today, the day before Milan-Parma, a match valid for the 26th matchday of Serie A scheduled for Sunday at 6pm at San Siro, Massimiliano Allegri's usual press conference will be held in Milanello: the Livorno coach will respond to the ..."
    },
    {
      "id": "4dc5ccb75397",
      "title": "Order: \"Deeply disappointed by Fabregas for two reasons\"",
      "url": "https://www.milannews.it/news/ordine-profondamente-deluso-da-fabregas-per-due-motivi-608137",
      "source": "milannews.it",
      "date": "2026-02-21T00:00:00+00:00",
      "summary": "Cesc Fabregas did not make a good impression at San Siro on Wednesday during the match between Milan and Como, which ended 1-1."
    },
    {
      "id": "aa55b0821f2b",
      "title": "Serafini on Scaroni: \"I've seen some inadequate Rossoneri presidents, but at least they kept quiet\"",
      "url": "https://www.milannews.it/news/serafini-su-scaroni-ne-ho-visti-di-presidenti-rossoneri-inadeguati-ma-almeno-stavano-zitti-608103",
      "source": "milannews.it",
      "date": "2026-02-20T23:50:50+00:00",
      "summary": "This is an extract from today's editorial by Luca Serafini on Milannews."
    },
    {
      "id": "253ce718c287",
      "title": "Bonucci hails Milan coach Allegri: ‘A master, a phenomenon’",
      "url": "https://football-italia.net/italy-gattuso-bonucci-allegri-master-milan/",
      "source": "football-italia.net",
      "date": "2026-02-20T21:08:08+00:00",
      "summary": "Leonardo Bonucci has paid a glowing tribute to AC Milan head coach Massimiliano Allegri, describing..."
    },
    {
      "id": "d57652257213",
      "title": "Former Milan & Juventus defender De Sciglio clarifies collapsed Hradec Kralove move",
      "url": "https://football-italia.net/milan-juventus-defender-de-sciglio-hradec/",
      "source": "football-italia.net",
      "date": "2026-02-20T20:28:03+00:00",
      "summary": "Mattia De Sciglio has broken his silence over his failed transfer to Czech side Hradec..."
    },
    {
      "id": "b4c07c67d722",
      "title": "Goals, hugs, pleas and a marathon without sprints: Leao showing signs of leadership",
      "url": "https://sempremilan.com/gols-hugs-leao-showing-signs-leadership",
      "source": "sempremilan.com",
      "date": "2026-02-20T20:24:35+00:00",
      "summary": "Rafael Leao is never far away from media attention. Whether it is praise or criticism, everyone seems to have an opinion on AC Milan’s No.10. What’s clear to everyone is that Leao is not playing at 100%, and hasn’t been for weeks now. After an initial groin strain, the issue seems to have become pub"
    },
    {
      "id": "fc4c7699f362",
      "title": "Offers for Leao and Pulisic ‘difficulties’ – Sky journalist can see ‘revolution’ in Milan’s attack",
      "url": "https://sempremilan.com/leao-pulisic-sky-revolution-milan-attack",
      "source": "sempremilan.com",
      "date": "2026-02-20T19:00:00+00:00",
      "summary": "Sky journalist Peppe Di Stefano has told us that a ‘revolution’ in attack is possible for AC Milan this summer, with Rafael Leao and Christian Pulisic potentially involved. Heading into the 2025-26 campaign, Massimiliano Allegri put Pulisic and Leao at the heart of his plans. He designed the 3-5-2 s"
    },
    {
      "id": "6485afe58c54",
      "title": "Central overloads and the 8-second rule: Tactical analysis of AC Milan 1-1 Como",
      "url": "https://sempremilan.com/tactical-analysis-ac-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-20T18:30:00+00:00",
      "summary": "AC Milan and Como played out a 1-1 draw at San Siro on Wednesday night, a result that further dents the fading Scudetto hopes. In the previous three meetings between the two Lombardy sides, it is Como who had taken the lead. It became four in a row when Nico Paz got the opener, profiting […]\nThe pos"
    },
    {
      "id": "16dbbff87a34",
      "title": "Milan interested in Club Brugge forward Tresoldi: the situation",
      "url": "https://football-italia.net/milan-interested-club-brugge-forward-tresoldi/",
      "source": "football-italia.net",
      "date": "2026-02-20T18:06:59+00:00",
      "summary": "AC Milan are quietly but decisively building their plans for the summer transfer window, and..."
    },
    {
      "id": "e84ed0204b87",
      "title": "Longo: Why Milan have no intention of considering ‘counter-productive’ Camarda sale",
      "url": "https://sempremilan.com/milan-no-intention-considering-camarda-sale",
      "source": "sempremilan.com",
      "date": "2026-02-20T18:00:00+00:00",
      "summary": "AC Milan are not even considering the idea of permanently selling Francesco Camarda at the moment, according to Daniele Longo. Some Milan fans were spooked earlier this week when the reliable Matteo Moretto suggested that the Rossoneri could even consider a permanent deal for Camarda in the summer, "
    },
    {
      "id": "4350f225de2e",
      "title": "MN: The calm head in a storm – how Allegri continues to uphold Milan’s values",
      "url": "https://sempremilan.com/how-allegri-continues-uphold-milan-values",
      "source": "sempremilan.com",
      "date": "2026-02-20T17:30:00+00:00",
      "summary": "In a title and top four race full of drama and tension, AC Milan can turn to their experienced customer: Massimiliano Allegri. Allegri has found himself in the headlines after getting yet another red card on Wednesday night, though this time there seems to be unanimous agreement that he acted correc"
    },
    {
      "id": "956e5d86b837",
      "title": "‘It was in Cardinale’s plans’ – Colombo believes Galliani’s Milan return was ‘very close’",
      "url": "https://sempremilan.com/galliani-milan-return-close-cardinale-plans",
      "source": "sempremilan.com",
      "date": "2026-02-20T17:00:00+00:00",
      "summary": "Adriano Galliani could have returned to AC Milan last summer, a journalist has claimed, but now the idea seems more remote. As he revealed in the interview with Corriere della Sera published today, Galliani’s strong bond with Milan is one he still feels to this day. Today isn’t just any day though: "
    },
    {
      "id": "6686cb2c6759",
      "title": "Como star Baturina discusses ‘dream’ Modric battle and jokes about shirt swapping",
      "url": "https://sempremilan.com/como-baturina-dream-modric-shirt-swapping",
      "source": "sempremilan.com",
      "date": "2026-02-20T16:30:00+00:00",
      "summary": "Como forward Martin Baturina has joked that AC Milan should make more shirts for Luka Modric to wear and swap with opponents. Baturina showed himself to be a top talent during the two games against Milan and in general this season, with four goals and seven assists to his name playing mostly on the "
    },
    {
      "id": "fe2664d29bdc",
      "title": "Extra Champions League spot: Where Italy stands after Inter loss and Bologna win",
      "url": "https://football-italia.net/extra-champions-league-spot-where-italy-stands/",
      "source": "football-italia.net",
      "date": "2026-02-20T16:25:31+00:00",
      "summary": "Italy’s chances of attaining an additional spot in next year’s Champions League remain slim despite..."
    },
    {
      "id": "bbd93c2676e4",
      "title": "Longo: Milan remain in talks with Bayern midfielder – their stance and the competition",
      "url": "https://sempremilan.com/milan-talks-goretzka-stance-competition",
      "source": "sempremilan.com",
      "date": "2026-02-20T16:00:00+00:00",
      "summary": "AC Milan are still in the hunt to sign Leon Goretzka on a free transfer from Bayern Munich, but there is competition to beat. It was reported by multiple sources last month that Milan are keen on exploring the opportunity to add a midfielder with experience and quality without having to pay a transf"
    },
    {
      "id": "07b6caa4fb37",
      "title": "Braida recalls why Milan adventure with Berlusconi was so special: “I was struck by his vision”",
      "url": "https://sempremilan.com/braida-why-milan-adventure-special-berlusconi",
      "source": "sempremilan.com",
      "date": "2026-02-20T15:30:00+00:00",
      "summary": "Ariedo Braida has praised the pioneering vision that Silvio Berlusconi possessed, claiming that he felt AC Milan was his ‘destiny’. It is exactly 40 years to the day that Berlusconi officially completed the acquisition of Milan, a team riddled with debt that had tasted Serie B. He took them to the t"
    },
    {
      "id": "8f3d13138725",
      "title": "SM Exclusive: Sky’s Peppe Di Stefano on Mateta, Maignan, Allegri, RedBird, summer plans and more",
      "url": "https://sempremilan.com/di-stefano-exclusive-mateta-maignan-allegri-more",
      "source": "sempremilan.com",
      "date": "2026-02-20T15:00:00+00:00",
      "summary": "AC Milan are a club that generate more media attention than most, and at any one time there are often various burning issues. The last few weeks and months have been dominated by various stories, such as the hiring of Igli Tare, the return of Massimiliano Allegri, the merits of the summer signings, "
    },
    {
      "id": "3fe78aa6f9de",
      "title": "Watch: Seedorf, Gattuso, Kaka and more – Jashari picks between Milan midfield greats",
      "url": "https://sempremilan.com/jashari-picks-between-milan-midfield-greats",
      "source": "sempremilan.com",
      "date": "2026-02-20T14:30:00+00:00",
      "summary": "Ardon Jashari is beginning to capture the hearts and minds of AC Milan fans with his recent performances, which he hopes will be a springboard. Having arrived for over €35m from Club Brugge in the summer, Jashari had to deal with the blow of a fractured fibula that greatly complicated his first year"
    },
    {
      "id": "603a8d098889",
      "title": "Pulisic impresses Milan star: ‘He speaks Italian almost perfectly’",
      "url": "https://football-italia.net/pulisic-impresses-milan-star-italian-perfectly/",
      "source": "football-italia.net",
      "date": "2026-02-20T14:20:48+00:00",
      "summary": "Milan star Rafael Leao is full of praise for USMNT star Christian Pulisic, on and..."
    },
    {
      "id": "14c9f595a9b3",
      "title": "Leao shares Diogo Jota story, promises to ‘make him proud’ at World Cup",
      "url": "https://football-italia.net/leao-diogo-jota-story-make-him-proud-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-20T14:13:03+00:00",
      "summary": "A ‘devastated’ Rafael Leao reveals Diogo Jota wanted to watch a Milan game at San..."
    },
    {
      "id": "511faf978a06",
      "title": "MN: Nine goals at 50% – questions arise about Leao’s management but production persists",
      "url": "https://sempremilan.com/questions-leao-management-production-persists",
      "source": "sempremilan.com",
      "date": "2026-02-20T14:01:32+00:00",
      "summary": "Rafael Leao continues to play through the pain barrier in the hopes of helping AC Milan’s cause, but he is having to play with the handbrake on. As MilanNews write, Leao’s season is a story of ‘brilliance and resilience’. The forward has been productive despite numerous physical issues since August,"
    },
    {
      "id": "5a8780cd73bf",
      "title": "Rafael Leao: Ibrahimovic ‘too demanding’, I ‘don’t go out’ before Milan derby",
      "url": "https://football-italia.net/leao-don-t-go-out-milan-derby-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-20T13:47:07+00:00",
      "summary": "Milan star Rafael Leao admits he avoids going out the week before the derby against..."
    },
    {
      "id": "459c30f9e2ec",
      "title": "Barcelona defender responds to Milan links and Maldini comparison: “That’s what they’re saying”",
      "url": "https://sempremilan.com/barcelona-martin-milan-links-maldini",
      "source": "sempremilan.com",
      "date": "2026-02-20T13:30:00+00:00",
      "summary": "Barcelona defender Gerard Martin has seemingly confirmed that he is not interesting in joining AC Milan in the summer. The rumours that Milan are considering a move for Martin ahead of the summer, given their desire to sign a versatile centre-back who has experience playing for a top club at a top l"
    },
    {
      "id": "c765c1d746d1",
      "title": "Frustrated Milan call AIA after controversial refereeing decisions in 1-1 Como draw",
      "url": "https://football-italia.net/frustrated-milan-call-aia-after-como-draw/",
      "source": "football-italia.net",
      "date": "2026-02-20T13:18:03+00:00",
      "summary": "Milan have reportedly been in contact with the Italian referees’ association (AIA) after a series..."
    },
    {
      "id": "fc3b9a0cb3fb",
      "title": "‘Not Inter’ – Leao reveals why he rejected advances from Milan’s rivals",
      "url": "https://sempremilan.com/not-inter-leao-why-rejected-rivals",
      "source": "sempremilan.com",
      "date": "2026-02-20T13:00:00+00:00",
      "summary": "Rafael Leao has admitted that he turned down Inter because he was waiting and hoping for AC Milan to make a move. Leao arrived at Milan in the 2019 summer window from Lille, and has since become one of the faces of Serie A in the following half-decade. He has been a pivotal figure for the […]\nThe po"
    },
    {
      "id": "18a4afe5a487",
      "title": "Roma the have best defensive record in Europe as Milan, Arsenal and Real Madrid follow",
      "url": "https://football-italia.net/roma-best-defensive-record-milan-arsenal-real/",
      "source": "football-italia.net",
      "date": "2026-02-20T12:36:59+00:00",
      "summary": "Roma are the least beaten defence in the top five European leagues, but Milan and..."
    },
    {
      "id": "435e215d11cb",
      "title": "CM: Milan face battle for Juventus star – Barcelona declared ‘ready’ for ‘big signing’",
      "url": "https://sempremilan.com/milan-battle-vlahovic-barcelona-ready-signing",
      "source": "sempremilan.com",
      "date": "2026-02-20T12:30:00+00:00",
      "summary": "Barcelona have announced ambitious transfer plans ahead of the summer, which could see them rival AC Milan for a striker. As Calciomercato.com recall, Barcelona’s president Joan Laporta talked quite boldly about their plans for the upcoming summer transfer window: “If it’s necessary to make a big si"
    },
    {
      "id": "aa80a302acd8",
      "title": "Capello critical of Como after Fabregas and Milan debacle: “They protest like crazy”",
      "url": "https://sempremilan.com/capello-critical-como-fabregas-milan-debacle",
      "source": "sempremilan.com",
      "date": "2026-02-20T12:00:00+00:00",
      "summary": "Fabio Capello has criticised Como for the way that they acted during the draw against AC Milan at San Siro on Wednesday night. There has been another big fall-out after a Milan-Como game, this time because of the way that Cesc Fabregas behaved on the touchline. The Spanish coach pulled back Alexis S"
    },
    {
      "id": "63a3114676fb",
      "title": "Reports: Derby in doubt for Inter captain Lautaro due to calf strain – the latest",
      "url": "https://sempremilan.com/derby-doubt-inter-lautaro-calf-strain",
      "source": "sempremilan.com",
      "date": "2026-02-20T11:30:00+00:00",
      "summary": "Inter could be without their captain and talisman Lautaro Martinez for the derby next month, according to reports. Inter’s Champions League trip to Norway on Wednesday wasn’t just a disaster because of the result (the Nerazzurri lost 3-1 to Bodo/Glimt) but also because Lautaro Martinez was injured, "
    },
    {
      "id": "d3663991af98",
      "title": "GdS: Milan feared season-ending injury for Pavlovic which sparked fury",
      "url": "https://sempremilan.com/milan-feared-season-ending-injury-pavlovic",
      "source": "sempremilan.com",
      "date": "2026-02-20T11:05:00+00:00",
      "summary": "AC Milan had strong fears that they would lose Strahinja Pavlovic for the rest of the season after what happened against Como. There has been a lot of attention drawn towards the challenge made by Van der Brempt in the first half of Milan’s draw against Como on Wednesday night. Not even a card was ["
    },
    {
      "id": "46350e123f0a",
      "title": "Today’s Papers – Furious Milan, McTominay’s ‘soft football’",
      "url": "https://football-italia.net/todays-papers-furious-milan-mctominay-soft/",
      "source": "football-italia.net",
      "date": "2026-02-20T08:34:08+00:00",
      "summary": "La Gazzetta dello Sport Furious Milan The club is irritated with the referees, call to..."
    },
    {
      "id": "2e2b8b55e6a6",
      "title": "Why Fabregas cannot be punished with video evidence after Milan 1-1 Como",
      "url": "https://football-italia.net/why-fabregas-cannot-be-punished-video-evidence/",
      "source": "football-italia.net",
      "date": "2026-02-19T18:02:36+00:00",
      "summary": "Many were calling for video evidence to be used in punishing Como coach Cesc Fabregas..."
    },
    {
      "id": "88f321aefd9b",
      "title": "Milan team news: Boost as Pavlovic tests reveal no fracture",
      "url": "https://football-italia.net/milan-team-news-boost-as-pavlovic-tests/",
      "source": "football-italia.net",
      "date": "2026-02-19T15:39:58+00:00",
      "summary": "Milan will breathe a sigh of relief this morning, after medical examinations revealed that Strahinja..."
    },
    {
      "id": "d1035a3b77cf",
      "title": "Video: Fabregas’ shirt tug and touchline confrontation with Allegri",
      "url": "https://football-italia.net/fabregas-shirt-tug-touchline-clash-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-19T12:02:33+00:00",
      "summary": "Watch how Cesc Fabregas pulled the shirt of Alexis Saelemaekers and how Milan coach Massimiliano..."
    },
    {
      "id": "8e22ac8839a0",
      "title": "What Allegri told Fabregas in heated post-match clash: ‘You are a kid’",
      "url": "https://football-italia.net/what-allegri-told-fabregas-kid-milan-como/",
      "source": "football-italia.net",
      "date": "2026-02-19T09:09:48+00:00",
      "summary": "More details emerge about the confrontation between Milan coach Massimiliano Allegri and Como’s Cesc Fabregas..."
    },
    {
      "id": "d3f0ece0dd15",
      "title": "Today’s Papers – Bodo shaming, Italy cry, Leao saves Milan",
      "url": "https://football-italia.net/today-papers-bodo-shaming-italy-cry-leao-milan/",
      "source": "football-italia.net",
      "date": "2026-02-19T08:42:54+00:00",
      "summary": "La Gazzetta dello Sport Inter, three slaps But they are still +7 in Serie A...."
    },
    {
      "id": "f24c9ac03bd7",
      "title": "Allegri and Fabregas bad blood after Como coach ‘unsporting behaviour’",
      "url": "https://football-italia.net/allegri-fabregas-bad-blood-como-unsporting/",
      "source": "football-italia.net",
      "date": "2026-02-18T23:07:22+00:00",
      "summary": "There is bad blood between Max Allegri and Cesc Fabregas, as they had another row..."
    },
    {
      "id": "60f4f709567f",
      "title": "Leao and Jashari believe Milan ‘played better’ than in victory over Como",
      "url": "https://football-italia.net/leao-jashari-believe-milan-played-better-como/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:53:55+00:00",
      "summary": "Rafael Leao and Ardon Jashari argue Milan ‘played better’ in their 1-1 draw than they..."
    },
    {
      "id": "0886a97f78fb",
      "title": "Allegri: ‘A valuable Milan point, Fabregas fouled Saelemaekers’",
      "url": "https://football-italia.net/allegri-valuable-milan-point-fabregas-fouled/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:34:39+00:00",
      "summary": "Max Allegri insists Milan must see the 1-1 draw with Como as ‘a valuable point’..."
    },
    {
      "id": "72872cf860f0",
      "title": "Fabregas: ‘Como proud of 1-1 Milan draw, apology for Allegri’ row",
      "url": "https://football-italia.net/fabregas-como-proud-of-1-1-milan-draw-apology/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:19:36+00:00",
      "summary": "Cesc Fabregas apologised for his touchline row with Max Allegri, but was ‘very proud’ of..."
    },
    {
      "id": "d7ed67655616",
      "title": "Serie A | Milan 1-1 Como: Leao magic rescues Maignan howler",
      "url": "https://football-italia.net/serie-a-milan-1-1-como-leao-magic-save-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-18T21:46:39+00:00",
      "summary": "Rafael Leao’s remarkable lob cancelled out a Mike Maignan howler on Nico Paz, as Milan..."
    }
  ]
}