{
  "lastUpdated": "2026-02-01T11:20:44.521218+00:00",
  "articles": [
    {
      "id": "82aaa2586964",
      "title": "LIVE MN - Primavera, Verona-Milan (2-0): Verona doubles",
      "url": "https://www.milannews.it/la-primavera/live-mn-primavera-verona-milan-2-0-raddoppio-verona-605970",
      "source": "milannews.it",
      "date": "2026-02-01T11:14:00+00:00",
      "summary": "59' Milan risk with Casagrande knocked down in the Rossoneri area."
    },
    {
      "id": "65bf1dead0bf",
      "title": "MN - Milan Women, the update on the injured players",
      "url": "https://www.milannews.it/milan-femminile/mn-milan-femminile-il-punto-sulle-giocatrici-infortunate-605972",
      "source": "milannews.it",
      "date": "2026-02-01T11:12:00+00:00",
      "summary": "The Milan Femminile will be playing against Genoa today at 12.30 in the match valid for the first return day of the Serie A Women's championship."
    },
    {
      "id": "76ce0cc6ab5b",
      "title": "Moretto: “Milan not intending to proceed for Disasi”",
      "url": "https://www.milannews.it/calciomercato-milan/moretto-milan-non-intenzionato-a-procedere-per-disasi-605975",
      "source": "milannews.it",
      "date": "2026-02-01T11:07:42+00:00",
      "summary": "As reported on his profile X, Matteo Moretto has in fact officially shut down the rumors that spoke of a possible arrival of Disasi in the Rossoneri shirt."
    },
    {
      "id": "f719c8a34e8e",
      "title": "GdS: ‘Forever Milan’ – Maignan statement arrives with new long-term renewal",
      "url": "https://sempremilan.com/forever-milan-maignan-statement-renewal",
      "source": "sempremilan.com",
      "date": "2026-02-01T11:05:00+00:00",
      "summary": "At one point Mike Maignan seemed certain to be leaving AC Milan on a free transfer, but he was all smiles after renewing his deal on Saturday. As La Gazzetta dello Sport (seen below) report, Milan and Maignan have strengthened their bond, with the aim of continuing to write new pages of Rossoneri hi"
    },
    {
      "id": "5e4beb64166b",
      "title": "Milan, in Bologna without Saelemaekers. Pulisic is also in doubt",
      "url": "https://www.milannews.it/primo-piano/milan-a-bologna-senza-saelemaekers-anche-pulisic-in-dubbio-605956",
      "source": "milannews.it",
      "date": "2026-02-01T11:00:00+00:00",
      "summary": "Between one transfer story and another, Milan is waiting to understand whether Crystal Palace will release Mateta or not already during this window, the time of Dall'Ara's match against Vincen's Bologna is approaching ..."
    },
    {
      "id": "6b0fb848d063",
      "title": "Saelemaekers misses Bologna: Loftus-Cheek ready in his place",
      "url": "https://www.milannews.it/news/saelemaekers-salta-bologna-al-suo-posto-pronto-loftus-cheek-605964",
      "source": "milannews.it",
      "date": "2026-02-01T10:48:47+00:00",
      "summary": "Ahead of Bologna, Massimiliano Allegri has to deal with the condition of Alexis Saelemaekers."
    },
    {
      "id": "0b7258c7bc86",
      "title": "MN - Spring in emergency between injuries and absences: the point",
      "url": "https://www.milannews.it/la-primavera/mn-primavera-in-emergenza-tra-infortuni-ed-assenze-il-punto-605971",
      "source": "milannews.it",
      "date": "2026-02-01T10:48:44+00:00",
      "summary": "Milan Primavera is on the pitch against Hellas Verona of the same age for the fourth return day of the Primavera 1 championship."
    },
    {
      "id": "fb21b94b215c",
      "title": "By lunchtime Milan will give a definitive answer for Disasi",
      "url": "https://www.milannews.it/calciomercato-milan/entro-ora-di-pranzo-il-milan-dara-una-risposta-definitiva-per-disasi-605973",
      "source": "milannews.it",
      "date": "2026-02-01T10:42:40+00:00",
      "summary": "By lunchtime Milan will give a definitive answer for Axel Disasi."
    },
    {
      "id": "38cf2cee2d25",
      "title": "Reports: Milan seal signing of 18-year-old attacking talent from Chelsea – the details",
      "url": "https://sempremilan.com/milan-sign-chelsea-yahya-idrissi-regragui",
      "source": "sempremilan.com",
      "date": "2026-02-01T10:40:00+00:00",
      "summary": "AC Milan have closed yet another deal with Chelsea, as Yahya Idrissi Regragui is set to sign for the club in the coming hours. According to Gianluca Di Marzio and Luca Maninetti, Milan have secured the signing of Regragui on a permanent deal. The 18-year-old actually arrived at La Madonnina clinic t"
    },
    {
      "id": "1aa50f740f35",
      "title": "Order on the renewal of Maignan: \"A phone call extends life\"",
      "url": "https://www.milannews.it/news/ordine-sul-rinnovo-di-maignan-una-telefonata-allunga-la-vita-605961",
      "source": "milannews.it",
      "date": "2026-02-01T10:36:40+00:00",
      "summary": "During the usual appointment with his commentary for Il Corriere dello Sport, Franco Ordine commented on the important contract renewal of Mike Maignan, which until a few months ago was unthinkable: \n\n\"Just a few months ago, June..."
    },
    {
      "id": "3e92c9cf6b6c",
      "title": "January transfer liveblog: Boga has Juventus medical, Lookman to join Atletico Madrid",
      "url": "https://football-italia.net/january-transfer-liveblog-rumours-done-deals-2/",
      "source": "football-italia.net",
      "date": "2026-02-01T10:30:41+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "d43a85e049e6",
      "title": "Licari on Mateta: \"He doesn't score a lot, but Allegri could enhance his skills as a fast counter-attacker\"",
      "url": "https://www.milannews.it/news/licari-su-mateta-non-segna-a-valanga-ma-allegri-ne-potrebbe-esaltare-le-doti-da-contropiedista-veloce-605954",
      "source": "milannews.it",
      "date": "2026-02-01T10:24:16+00:00",
      "summary": "During the usual appointment with his \"commentary\" for La Gazzetta dello Sport, Fabio Licari spoke about Milan and the latest transfer market movements of the Rossoneri club, which in addition to anticipating has in fact revealed that ..."
    },
    {
      "id": "9b50f9559e56",
      "title": "CorSport: The front and the back – Allegri’s two selection doubts ahead of Bologna trip",
      "url": "https://sempremilan.com/allegri-two-selection-doubts-bologna",
      "source": "sempremilan.com",
      "date": "2026-02-01T10:15:00+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri has a couple of doubts to resolve regarding the team he will field against Bologna. Having won three out of six league games to begin 2026, there is pressure on Milan to return to winning ways at the Stadio Renato dall’Ara, otherwise the risk of Inter running"
    },
    {
      "id": "9c006db24af2",
      "title": "Calamai: \"News like Maignan's signing creates positive electricity, the kind the Devil needs to fight for the scudetto\"",
      "url": "https://www.milannews.it/news/calamai-notizie-come-la-firma-di-maignan-creano-elettricita-positiva-quella-di-cui-ha-bisogno-il-diavolo-per-lottare-per-lo-scudetto-605950",
      "source": "milannews.it",
      "date": "2026-02-01T10:12:00+00:00",
      "summary": "During the usual appointment with his editorial for TMW, my colleague Luca Calamai spoke about Juventus, Napoli, Berardi and also Milan, focusing in particular on the very important renewal of Mike Maignan, who was practically tied ..."
    },
    {
      "id": "10cf521ce1eb",
      "title": "Mateta weave. La Gazzetta: \"Nkunku will stay even if the center forward arrives. The green light from Palace is missing\"",
      "url": "https://www.milannews.it/rassegna-stampa/intreccio-mateta-la-gazzetta-nkunku-rimarra-anche-se-arriva-il-centravanti-manca-il-via-libera-del-palace-605944",
      "source": "milannews.it",
      "date": "2026-02-01T10:00:19+00:00",
      "summary": "Jean-Philippe Mateta's story seriously risks becoming a soap opera."
    },
    {
      "id": "665f68585080",
      "title": "GdS: ‘Mateta intrigue’ – Milan left in suspense as Crystal Palace search for replacement",
      "url": "https://sempremilan.com/mateta-intrigue-palace-replacement-milan-suspense",
      "source": "sempremilan.com",
      "date": "2026-02-01T09:50:00+00:00",
      "summary": "AC Milan are still hopeful of getting Jean-Philippe Mateta late in the window, but they have been left waiting by Crystal Palace. La Gazzetta dello Sport (seen below) write that Mateta was in London yesterday, along with his agent – Paul Latouche – awaiting Crystal Palace’s approval to fly to Milan."
    },
    {
      "id": "a636dd67f0b9",
      "title": "Serie A: Pisa sacks Gilardino after the defeat against Sassuolo",
      "url": "https://www.milannews.it/news/serie-a-il-pisa-esonera-gilardino-dopo-la-sconfitta-col-sassuolo-605957",
      "source": "milannews.it",
      "date": "2026-02-01T09:48:49+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 1 - Pisa has sacked Alberto Gilardino. The 3-1 home defeat against Sassuolo was fatal for the Tuscan coach."
    },
    {
      "id": "460b0b52e84a",
      "title": "All about Mateta. CorSport: \"These are decisive hours\"",
      "url": "https://www.milannews.it/rassegna-stampa/tutto-su-mateta-il-corsport-sono-ore-decisive-605945",
      "source": "milannews.it",
      "date": "2026-02-01T09:35:16+00:00",
      "summary": "Now or never, this is the motto they are repeating to each other from the fourth floor of Casa Milan in these hours."
    },
    {
      "id": "0b7877301941",
      "title": "Maignan ‘very, very happy’ after signing Milan renewal: “I want more trophies”",
      "url": "https://sempremilan.com/maignan-very-happy-milan-more-trophies",
      "source": "sempremilan.com",
      "date": "2026-02-01T09:25:00+00:00",
      "summary": "Mike Maignan has stated that he is ‘very happy’ after signing his contract renewal with AC Milan until 2031. The long-awaited news became official last night as Maignan put pen to paper on a new multi-year extension. A few months ago such an outcome seemed unthinkable, but talks progressed positivel"
    },
    {
      "id": "49c01e250772",
      "title": "Spring: the official lineups of Hellas Verona-Milan",
      "url": "https://www.milannews.it/la-primavera/primavera-le-formazioni-ufficiali-di-hellas-verona-milan-605965",
      "source": "milannews.it",
      "date": "2026-02-01T09:24:02+00:00",
      "summary": "Below are the official lineups for Hellas Verona-Milan, a match valid for the 4th return day of the Primavera 1 championship."
    },
    {
      "id": "ff62f3ce71ad",
      "title": "MN - Massimiliano Allegri's press conference tomorrow on the eve of Bologna",
      "url": "https://www.milannews.it/news/mn-domani-la-conferenza-stampa-di-massimiliano-allegri-alla-vigilia-di-bologna-605960",
      "source": "milannews.it",
      "date": "2026-02-01T09:12:45+00:00",
      "summary": "Milan is preparing to face Bologna on the 23rd matchday of Serie A Enlive. Kick-off scheduled for 8pm."
    },
    {
      "id": "d6957a2a7722",
      "title": "Milan, race against time: from Mateta to Disasi and beyond",
      "url": "https://www.milannews.it/primo-piano/milan-corsa-contro-il-tempo-da-mateta-a-disasi-e-non-solo-605955",
      "source": "milannews.it",
      "date": "2026-02-01T09:00:29+00:00",
      "summary": "\"Until the end\", as Allegri directed. Milan will continue to try for Jean-Philippe Mateta until the transfer window closes, set for tomorrow at 8pm."
    },
    {
      "id": "8b2f72c7ae7e",
      "title": "Watch: Cisse and Regragui arrive to undergo medicals ahead of joining Milan",
      "url": "https://sempremilan.com/cisse-regragui-arrive-medicals-milan",
      "source": "sempremilan.com",
      "date": "2026-02-01T09:00:00+00:00",
      "summary": "It is already a busy day at La Madonnina clinic, as two players have arrived for medicals ahead of joining AC Milan. It emerged on Saturday that Milan have closed a deal with Hellas Verona for their young talent Alphadjo Cisse, hijacking PSV’s move. The Rossoneri will leave the midfielder on loan at"
    },
    {
      "id": "b4efb6b7df43",
      "title": "Telenovela over. CorSera: \"Milan-Maignan, here's the renewal\"",
      "url": "https://www.milannews.it/rassegna-stampa/telenovela-finita-il-corsera-milan-maignan-ecco-il-rinnovo-605952",
      "source": "milannews.it",
      "date": "2026-02-01T08:48:58+00:00",
      "summary": "Until a few months ago it all seemed over."
    },
    {
      "id": "09320e7deaea",
      "title": "Hectic last hours. La Repubblica: \"Milan, pressing on Mateta\"",
      "url": "https://www.milannews.it/rassegna-stampa/ultime-ore-frenetiche-la-repubblica-milan-pressing-su-mateta-605948",
      "source": "milannews.it",
      "date": "2026-02-01T08:36:30+00:00",
      "summary": "Milan is working to try to strengthen and complete Massimiliano Allegri's squad ahead of a frenetic second part of the season, where the objective will obviously be to get back into the top 4 to qualify for the ..."
    },
    {
      "id": "4c2fc5747540",
      "title": "The announcement that makes everyone happy. The QS: \"Maignan-Milan, renewal for life\"",
      "url": "https://www.milannews.it/rassegna-stampa/l-annuncio-che-fa-felici-tutti-il-qs-maignan-milan-rinnovo-a-vita-605947",
      "source": "milannews.it",
      "date": "2026-02-01T08:24:00+00:00",
      "summary": "Fans, team, club. Everyone was waiting for this signature, which has finally arrived."
    },
    {
      "id": "7a8be585ce09",
      "title": "Milan, until the end. Tuttosport: \"All about Mateta and Disasi\"",
      "url": "https://www.milannews.it/rassegna-stampa/milan-fino-alla-fine-tuttosport-tutto-su-mateta-e-disasi-605946",
      "source": "milannews.it",
      "date": "2026-02-01T08:12:00+00:00",
      "summary": "A bit like what happened last year, Milan is taking center stage in these very last days of the transfer market."
    },
    {
      "id": "be4d56b0e6da",
      "title": "Late signings or not: 2025 precedent shows Milan can wait until the final days",
      "url": "https://sempremilan.com/late-signings-2025-precedent-milan-wait",
      "source": "sempremilan.com",
      "date": "2026-01-31T19:00:00+00:00",
      "summary": "The final days of the 2026 January window are upon us, with AC Milan evaluating various opportunities. Taking a look back at last year, it’s clear that a lot can happen towards the end.  All month long, fans have been asking the management to sign a centre-back. Niclas Füllkrug was brought in early "
    },
    {
      "id": "1b9cb60a6c31",
      "title": "Milan move for unhappy Mateta under threat as Crystal Palace struggle to find replacement",
      "url": "https://football-italia.net/milan-move-for-mateta-under-threat-palace/",
      "source": "football-italia.net",
      "date": "2026-01-31T18:40:04+00:00",
      "summary": "Milan’s pursuit of Jean-Philippe Mateta has hit a fresh obstacle as Crystal Palace struggle to..."
    },
    {
      "id": "e04ac95912a5",
      "title": "Official: Maignan signs new deal with Milan until 2031",
      "url": "https://football-italia.net/official-maignan-signs-new-deal-milan-2031/",
      "source": "football-italia.net",
      "date": "2026-01-31T18:20:12+00:00",
      "summary": "AC Milan have secured the long-term future of captain Mike Maignan, with the goalkeeper putting..."
    },
    {
      "id": "3447eecee2d0",
      "title": "Moretto: Only Milan can trigger one-year clause in Maignan’s new contract",
      "url": "https://sempremilan.com/moretto-only-milan-clause-maignans-contract",
      "source": "sempremilan.com",
      "date": "2026-01-31T18:00:00+00:00",
      "summary": "Mike Maignan has signed his contract renewal at Casa Milan, per various sources, and there is one clause in the deal that is worth expanding on.  Earlier this afternoon, Maignan arrived at Milan’s headquarters to sign his contract renewal with the club. Shortly thereafter, it was reported by various"
    },
    {
      "id": "49dff8b35fea",
      "title": "Official: AC Milan announce Mike Maignan has renewed his contract until 2031",
      "url": "https://sempremilan.com/official-ac-milan-announce-maignan-renewed-2030",
      "source": "sempremilan.com",
      "date": "2026-01-31T17:47:17+00:00",
      "summary": "Mike Maignan has officially renewed his contract with AC Milan, signing a deal that will keep him at the club until 2031. It had been in the works for many months, but now it’s official: Maignan’s contract has been renewed. After what looked like an impossible situation in the summer, Massimiliano A"
    },
    {
      "id": "acbda7180f1a",
      "title": "Bianchin: Milan already have loan solution in mind for summer signing Cissè",
      "url": "https://sempremilan.com/bianchin-milan-loan-solution-summer-cisse",
      "source": "sempremilan.com",
      "date": "2026-01-31T17:20:00+00:00",
      "summary": "AC Milan have scheduled the transfer of Alphadjo Cissè for the summer, but as a journalist highlights, he could be sent out on loan almost immediately.  As Gianluca Di Marzio was first to report, Milan managed to hijack PSV Eindhoven’s transfer of the midfielder, unwilling to lose out after followin"
    },
    {
      "id": "07ef2126535f",
      "title": "Bologna duo convinced mid-week success will ‘benefit’ them against Milan",
      "url": "https://sempremilan.com/bologna-duo-success-benefit-against-milan",
      "source": "sempremilan.com",
      "date": "2026-01-31T16:50:00+00:00",
      "summary": "Bologna midfielders Tommaso Pobega and Lewis Ferguson are both looking forward to the game against AC Milan, which is scheduled for Tuesday.  Bologna participated in some mid-week action as they faced Maccabi Tel Aviv in the Europa League, winning the game 3-0. That earned them a good position ahead"
    },
    {
      "id": "797b5d9d49b6",
      "title": "Scanzorosciate 2-2 Milan Futuro: Two early goals not enough for the Rossoneri",
      "url": "https://sempremilan.com/scanzorosciate-2-2-milan-futuro-early-goals",
      "source": "sempremilan.com",
      "date": "2026-01-31T16:20:00+00:00",
      "summary": "Two early goals from Emanuele Sala and Lorenzo Ossola were not enough to clinch three points for Milan Futuro, who are now fifth in the standings.  Last week’s defeat against Casatese Merate was a big blow for Massimo Oddo’s players, who had gained a lot of confidence after beating the league leader"
    },
    {
      "id": "132dcdaa7db5",
      "title": "Maignan has signed new Milan contract to June 2030 plus option",
      "url": "https://football-italia.net/maignan-has-signed-new-milan-contract-to-2030/",
      "source": "football-italia.net",
      "date": "2026-01-31T16:14:20+00:00",
      "summary": "Milan are not expected to announce it until Sunday, but today Mike Maignan signed the..."
    },
    {
      "id": "42d0c67d806f",
      "title": "Bianchin: Crystal Palace still blocking Mateta exit as Milan schedule new talks",
      "url": "https://sempremilan.com/bianchin-crystal-palace-blocking-mateta-milan",
      "source": "sempremilan.com",
      "date": "2026-01-31T15:50:00+00:00",
      "summary": "Crystal Palace are yet to give AC Milan the go-ahead for the transfer of Jean-Philippe Mateta, with the Rossoneri now expected to make new attempts between tonight and tomorrow.  Milan have accelerated their pursuit of Mateta, to say the least, by tabling an offer worth €30m in recent days. However,"
    },
    {
      "id": "1e742de01acd",
      "title": "Report Disasi only wants Milan, tells Chelsea to stall West Ham",
      "url": "https://football-italia.net/report-disasi-milan-chelsea-to-stall-west-ham/",
      "source": "football-italia.net",
      "date": "2026-01-31T15:38:14+00:00",
      "summary": "Reports continue to swirl that Chelsea defender Axel Disasi has chosen Milan as his priority..."
    },
    {
      "id": "eb525da50bfb",
      "title": "Watch: Maignan arrives at Casa Milan to sign contract renewal with the Rossoneri",
      "url": "https://sempremilan.com/watch-maignan-arrives-casa-milan-renewal",
      "source": "sempremilan.com",
      "date": "2026-01-31T15:20:00+00:00",
      "summary": "Mike Maignan has arrived at Casa Milan to sign his contract renewal with AC Milan, extending the deadline to 2030 with an option for an additional year.  Maignan’s contract situation has been the talk of the town for quite some time. Understandably so, as the Frenchman has been absolutely brilliant "
    },
    {
      "id": "0acc002ea460",
      "title": "GdS: Milan reach agreement with Bayern Munich over young full-back Dalpiaz",
      "url": "https://sempremilan.com/gds-milan-agreement-bayern-munich-youngster",
      "source": "sempremilan.com",
      "date": "2026-01-31T14:50:00+00:00",
      "summary": "AC Milan and Bayern Munich have reached an agreement for the transfer of Magnus Dalpiaz, who will be part of the Primavera side.  Earlier this morning, we reported Sky Germany’s story which said that Milan were in talks with Bayern Munich regarding the 18-year-old. Evidently, talks progressed quickl"
    },
    {
      "id": "9293293ce626",
      "title": "Watch: RedBird taking flight with NBA Europe, refinancing and stadium plans",
      "url": "https://sempremilan.com/watch-redbird-nba-refinancing-stadium-plans",
      "source": "sempremilan.com",
      "date": "2026-01-31T14:20:00+00:00",
      "summary": "After securing financing to repay the vendor loan, RedBird and Gerry Cardinale have some big plans for AC Milan, which is something that Oliver and Isak discussed in the latest bonus podcast.  Yesterday afternoon, it was announced that RedBird had repaid the vendor loan to Elliott, with the American"
    },
    {
      "id": "ee31d98d7a0a",
      "title": "Romano: Chelsea outcast leaves West Ham hanging after giving priority to Milan",
      "url": "https://sempremilan.com/romanbo-chelsea-outcast-west-ham-priority-milan",
      "source": "sempremilan.com",
      "date": "2026-01-31T13:50:00+00:00",
      "summary": "Axel Disasi has given full priority to joining AC Milan, who now must decide whether to sign the Chelsea outcast or not.  In addition to a striker, which ended up being Niclas Füllkrug (and possibly Jean-Philippe Mateta), a centre-back was a priority for Milan as they headed into the month. However,"
    },
    {
      "id": "2600a842ee0b",
      "title": "Official: Date and location of Milan vs. Como match confirmed after Australia debacle",
      "url": "https://football-italia.net/date-location-of-milan-vs-como-match-confirmed/",
      "source": "football-italia.net",
      "date": "2026-01-31T13:38:18+00:00",
      "summary": "The Serie A match between Milan and Como, which the league had sought to play..."
    },
    {
      "id": "ec27fee6b6b2",
      "title": "Gordon Singer reflects on Elliott’s ownership of AC Milan: “We are proud”",
      "url": "https://sempremilan.com/singer-reflects-elliotts-ownership-milan-proud",
      "source": "sempremilan.com",
      "date": "2026-01-31T13:20:00+00:00",
      "summary": "Gordon Singer commented on Elliott Management’s official exit from AC Milan yesterday, stating that they are ‘proud’ of what they have achieved.  It was back in the summer of 2018 that Elliott took control of the club, as the Chinese owner Yongong Li defaulted on his loan. Immediately, the American "
    },
    {
      "id": "5477c3fb3f13",
      "title": "Galliani says Milan would have had ‘fewer’ points and ‘not more’ without Allegri",
      "url": "https://sempremilan.com/galliani-milan-fewer-points-without-allegri",
      "source": "sempremilan.com",
      "date": "2026-01-31T12:50:00+00:00",
      "summary": "AC Milan and Massimiliano Allegri have been praised for their results this season, and as argued by Adriano Galliani, the manager is a huge part of that.  There was some scepticism when Milan decided to replace Sergio Conceicao with Allegri in the summer. The Portuguese manager was always going to l"
    },
    {
      "id": "0b0671ae0cfb",
      "title": "Watch: Mateta to AC Milan? Lorenzo and Stefano react to the latest news",
      "url": "https://sempremilan.com/mateta-ac-milan-lorenzo-stefano-react",
      "source": "sempremilan.com",
      "date": "2026-01-31T12:20:00+00:00",
      "summary": "Jean-Philippe Mateta appears to be Milan’s priority on the transfer market at the moment, which is something that Lorenzo and Stefano have reacted to.  In the last few days, Milan have accelerated their pursuit of Crystal Palace’s Mateta, keen on beating the competition rather than waiting until the"
    },
    {
      "id": "9346aac61f82",
      "title": "Two hurdles for Milan to overcome before landing Mateta deal with Crystal Palace",
      "url": "https://football-italia.net/two-hurdles-for-milan-to-overcome-for-mateta/",
      "source": "football-italia.net",
      "date": "2026-01-31T09:22:04+00:00",
      "summary": "Reports in Italy claim that Milan are closing in on a full agreement with Crystal..."
    },
    {
      "id": "fa3dcf4ac29b",
      "title": "Today’s Papers: Milan all in for Mateta, Until the end for Juventus and Kolo Muani",
      "url": "https://football-italia.net/todays-papers-milan-all-in-for-mateta/",
      "source": "football-italia.net",
      "date": "2026-01-31T08:34:07+00:00",
      "summary": "La Gazzetta dello Sport Mateta: It’s a yes  The Frenchman wants Milan immediately Negotiations for..."
    },
    {
      "id": "0e648c8d7668",
      "title": "Glasner confirms Crystal Palace drop Mateta for Forest clash, fuelling Milan speculation",
      "url": "https://football-italia.net/mateta-dropped-not-forest-milan-speculation/",
      "source": "football-italia.net",
      "date": "2026-01-30T16:21:23+00:00",
      "summary": "Crystal Palace coach Oliver Glasner confirms Milan target Jean-Philippe Mateta won’t be part of the..."
    },
    {
      "id": "210e88203f90",
      "title": "Maignan set to sign new Milan contract, Roma ask for Nkunku",
      "url": "https://football-italia.net/maignan-signs-new-milan-contract-roma-nkunku/",
      "source": "football-italia.net",
      "date": "2026-01-30T14:03:32+00:00",
      "summary": "Sky Sport Italia reports that Mike Maignan will put pen to paper on a new..."
    },
    {
      "id": "5d048c937f37",
      "title": "Milan agreement for Mateta who prefers Rossoneri over Nottingham Forest – report",
      "url": "https://football-italia.net/milan-agreement-mateta-nottingham-forest/",
      "source": "football-italia.net",
      "date": "2026-01-30T09:47:40+00:00",
      "summary": "La Gazzetta dello Sport claims Milan have agreed a deal to bring in Jean-Philippe Mateta..."
    },
    {
      "id": "b9cb4f9e51f5",
      "title": "Report Milan fight for Mateta with Nottingham Forest and Juventus",
      "url": "https://football-italia.net/report-milan-mateta-nottingham-forest-juventus/",
      "source": "football-italia.net",
      "date": "2026-01-29T17:31:42+00:00",
      "summary": "Milan are reportedly trying to hijack Nottingham Forest’s bid for Crystal Palace striker Jean-Philippe Mateta,..."
    },
    {
      "id": "69318b559f5a",
      "title": "Milan look to Tottenham, Man City and Lazio for defensive reinforcement",
      "url": "https://football-italia.net/milan-tottenham-man-city-defence-reinforcement/",
      "source": "football-italia.net",
      "date": "2026-01-29T14:07:00+00:00",
      "summary": "According to reports in Italy, Milan are interested in Manchester City defender Nathan Aké, Tottenham’s..."
    },
    {
      "id": "059070d81ac0",
      "title": "Free agent Goretzka targeted with determination by Milan",
      "url": "https://football-italia.net/free-agent-goretzka-targeted-by-ac-milan/",
      "source": "football-italia.net",
      "date": "2026-01-27T20:11:15+00:00",
      "summary": "Milan are pushing hard to agree personal terms with Bayern Munich midfielder Leon Goretzka, who..."
    },
    {
      "id": "fa309b31e0a1",
      "title": "Capello identifies Milan’s biggest ‘flaw’ and explains Inter advantage in Serie A race",
      "url": "https://football-italia.net/capello-identifies-milans-biggest-flaw-and-explains-inter-advantage-in-serie-a-race/",
      "source": "football-italia.net",
      "date": "2026-01-27T17:47:32+00:00",
      "summary": "Fabio Capello has given an in-depth review of the two teams currently fighting for the..."
    },
    {
      "id": "325c906634a1",
      "title": "Milan expected to complete €20m deal for Lazio defender Gila in the summer",
      "url": "https://football-italia.net/milan-expected-20m-deal-for-lazio-gila/",
      "source": "football-italia.net",
      "date": "2026-01-27T13:23:36+00:00",
      "summary": "Milan are already laying the groundwork for their summer rebuild, and a new centre-back is..."
    },
    {
      "id": "5b2cb74dfdb9",
      "title": "Today’s papers – Inter push for Perisic; Napoli in crisis",
      "url": "https://football-italia.net/todays-papers-inter-push-for-perisic-napoli-in-crisis/",
      "source": "football-italia.net",
      "date": "2026-01-27T09:45:13+00:00",
      "summary": "La Gazzetta dello Sport “Inter don’t stop” Inter’s momentum continues both in Serie A and..."
    },
    {
      "id": "46dfb510bd30",
      "title": "Today’s Papers – Juve fly, Inter run away, Milan stopped",
      "url": "https://football-italia.net/todays-papers-juve-fly-milan-stop-inter-run/",
      "source": "football-italia.net",
      "date": "2026-01-26T08:51:22+00:00",
      "summary": "La Gazzetta dello Sport Juve fly and Inter run away The Old Lady dominates, Napoli..."
    },
    {
      "id": "da4eee084e3c",
      "title": "Allegri: ‘Positive Milan result, it was going so well against Roma’",
      "url": "https://football-italia.net/allegri-positive-milan-result-going-well-roma/",
      "source": "football-italia.net",
      "date": "2026-01-25T22:30:10+00:00",
      "summary": "Max Allegri insists Milan were on track for victory at the Stadio Olimpico until the..."
    },
    {
      "id": "91bacc5e5156",
      "title": "Gasperini proud of Roma draw: ‘Milan always dangerous, even when seemingly dominated’",
      "url": "https://football-italia.net/gasperini-proud-roma-milan-always-dangerous/",
      "source": "football-italia.net",
      "date": "2026-01-25T22:16:46+00:00",
      "summary": "Gian Piero Gasperini insists Roma ‘deserve credit’ for their 1-1 draw with second-placed Milan. ‘They..."
    }
  ]
}