{
  "lastUpdated": "2026-02-16T16:41:32.593157+00:00",
  "articles": [
    {
      "id": "3699f52b786c",
      "title": "Napoli, Conte: \"We have 13 games to understand which European competition we will play in\"",
      "url": "https://www.milannews.it/news/napoli-conte-abbiamo-13-partite-per-per-capire-in-quale-competizione-europea-giocheremo-607562",
      "source": "milannews.it",
      "date": "2026-02-16T16:30:46+00:00",
      "summary": "(ANSA) - NAPLES, FEBRUARY 15 - \"I thank the fans who recognized what we are doing this season, honoring the shirt, trying to fight for Naples."
    },
    {
      "id": "afa5c0223baa",
      "title": "Costacurta mentions Maldini in criticism of Bastoni’s actions during Inter-Juventus",
      "url": "https://sempremilan.com/costacurta-mentions-maldini-criticism-bastoni",
      "source": "sempremilan.com",
      "date": "2026-02-16T16:30:00+00:00",
      "summary": "Billy Costacurta had held Alessandro Bastoni in a high regard before this weekend, but it seems the Inter defender has let the AC Milan legend down… This weekend’s game between Inter and Juventus has certainly brought up a bit of controversy with many seeing former Milan defender Pierre Kalulu’s red"
    },
    {
      "id": "74b03e4fa1e3",
      "title": "Rome, fractures ruled out for Wesley: \"Fortunately nothing serious\"",
      "url": "https://www.milannews.it/news/roma-escluse-fratture-per-wesley-per-fortuna-nulla-di-grave-607610",
      "source": "milannews.it",
      "date": "2026-02-16T16:20:48+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 16 - Danger averted for Wesley."
    },
    {
      "id": "5d5be76b67c9",
      "title": "Como, attack to monitor: goals scored and scorers",
      "url": "https://www.milannews.it/l-avversario/como-attacco-da-sorvegliare-gol-segnati-e-marcatori-607609",
      "source": "milannews.it",
      "date": "2026-02-16T16:10:15+00:00",
      "summary": "Como is the Rossoneri's next opponent in Wednesday's match which will be worth the recovery of the 24th matchday."
    },
    {
      "id": "a230b14f0582",
      "title": "Caught Offside: Milan hold talks with Stones but face European heavyweight competition",
      "url": "https://sempremilan.com/milan-hold-talks-stones-face-european-competition",
      "source": "sempremilan.com",
      "date": "2026-02-16T16:00:15+00:00",
      "summary": "This summer, John Stones will be available on a free transfer, and this is piquing the interest of several top European clubs, including AC Milan.  There are a number of opportunities that Milan may look to capitalise on this summer, with a number of ageing elites at the end of their contracts. Of c"
    },
    {
      "id": "9ae4860e26de",
      "title": "Pellegatti: \"Calvelli will become Milan's strong man, a direct emanation of Cardinale\"",
      "url": "https://www.milannews.it/news/pellegatti-calvelli-diventera-uomo-forte-del-milan-diretta-emanazione-di-cardinale-607607",
      "source": "milannews.it",
      "date": "2026-02-16T16:00:03+00:00",
      "summary": "In his YouTube channel, journalist Carlo Pellegatti took stock of the company situation in view of the future:  \n\n\"Yesterday we underlined the presence of Gerry Cardinale several times, we don't know if he will be in San S..."
    },
    {
      "id": "11b90b746126",
      "title": "Milan-Como, referee Mariani: a precedent in the season with the Rossoneri",
      "url": "https://www.milannews.it/l-arbitro/milan-como-arbitra-mariani-un-precedente-in-stagione-con-i-rossoneri-607608",
      "source": "milannews.it",
      "date": "2026-02-16T15:51:30+00:00",
      "summary": "The referee for Milan-Como has been appointed, the second half of the 24th matchday of Serie A which will be played on Wednesday at 8.45pm at San Siro: Maurizio Mariani will referee the match, while Gariglio and Maresca will be in charge of VAR."
    },
    {
      "id": "fc393a781c82",
      "title": "PROBABLE LINEUP - Milan-Como, run-off to replace Rabiot",
      "url": "https://www.milannews.it/news/probabile-formazione-milan-como-ballottaggio-per-sostituire-rabiot-607620",
      "source": "milannews.it",
      "date": "2026-02-16T15:49:01+00:00",
      "summary": "MILAN-COMO, THE PROBABLE LINE-UP\n16 Maignan\n23 Tomori, 46 Gabbia, 31 Pavlovic\n24 Athekame, 19 Fofana, 14 Modric, 4 Ricci, 33 Bartesaghi\n18 Nkunku, 10 Leao\n\nDependent"
    },
    {
      "id": "5348dac1193a",
      "title": "Ravezzani: \"Lately Inter have had players who went over the top too many times\"",
      "url": "https://www.milannews.it/news/ravezzani-ultimamente-l-inter-troppe-volte-ha-avuto-giocatori-che-sono-andati-oltre-le-righe-607605",
      "source": "milannews.it",
      "date": "2026-02-16T15:40:26+00:00",
      "summary": "On his profile X, the director of Telelombardia Fabio Ravezzani commented on Marotta's words released at this morning's Lega Serie A Assembly regarding the Bastoni-Kalulu episode."
    },
    {
      "id": "1e03e0988363",
      "title": "GdS: Milan fans flock to San Siro a month after Lecce win – Como sell-out expected",
      "url": "https://sempremilan.com/milan-fans-flock-san-siro",
      "source": "sempremilan.com",
      "date": "2026-02-16T15:33:08+00:00",
      "summary": "AC Milan are no strangers to a fantastic home support, but after a month away, they can know that they will be well backed at San Siro once again. The recent calendar has been pretty tough for Milan, and it will not get much easier. Indeed, they have faced three games away from home, with […]\nThe po"
    },
    {
      "id": "335ad4c43925",
      "title": "Youth sector: the results of the weekend",
      "url": "https://www.milannews.it/settore-giovanile/settore-giovanile-i-risultati-del-weekend-607602",
      "source": "milannews.it",
      "date": "2026-02-16T15:30:16+00:00",
      "summary": "AC Milan's official website reports the results of the weekend for the Rossoneri Youth Sector teams: \"Many smiles during the weekend for the Rossoneri Youth Sector, starting with the away victories of the two Primavera teams: the ..."
    },
    {
      "id": "e394038d398f",
      "title": "Assembly in the League, Cardinal also present. Here's what he talked about",
      "url": "https://www.milannews.it/news/assemblea-in-lega-anche-cardinale-presente-ecco-di-cosa-ha-parlato-607613",
      "source": "milannews.it",
      "date": "2026-02-16T15:18:23+00:00",
      "summary": "This morning the Lega Serie A Assembly took place at the Milan headquarters, a highly anticipated meeting given the recent events that occurred in the match in Milan between Inter and Juventus."
    },
    {
      "id": "a86b117914be",
      "title": "Cardinal in the League, Simonelli: \"We were very pleased to talk about what the developments and activities in the United States could be\"",
      "url": "https://www.milannews.it/news/cardinale-in-lega-simonelli-ci-ha-fatto-molto-piacere-parlare-di-quelli-che-potrebbero-essere-gli-sviluppi-e-le-attivita-negli-stati-uniti-607611",
      "source": "milannews.it",
      "date": "2026-02-16T15:09:09+00:00",
      "summary": "Ezio Simonelli, president of Lega Calcio Serie A, on the sidelines of today's meeting, declared in a press conference: \"Very calm meeting, we have taken a series of decisions, starting from the start of negotiations to acquire ..."
    },
    {
      "id": "a72244ad87ae",
      "title": "Milan, watch out for the Como trap. Fabregas charges the environment, the first leg defeat didn't go down well",
      "url": "https://www.milannews.it/primo-piano/milan-occhio-alla-trappola-como-fabregas-carica-l-ambiente-non-e-andata-giu-la-sconfitta-dell-andata-607612",
      "source": "milannews.it",
      "date": "2026-02-16T15:00:00+00:00",
      "summary": "Wednesday evening's match at San Siro against Como will be one of the toughest of the start of 2026 for Milan."
    },
    {
      "id": "e86bd0995318",
      "title": "Longo: Comotto showcasing development at Spezia – Milan’s two options for 2026-27",
      "url": "https://sempremilan.com/comotto-showcasing-development-spezia-milan-options",
      "source": "sempremilan.com",
      "date": "2026-02-16T15:00:00+00:00",
      "summary": "AC Milan are pleased with how Christian Comotto’s loan spell at Spezia is going, but they face a decision to make during the summer. Comotto was part of the senior side during the preseason camp, and he had a couple of impressive outings. He did not stay around under Massimiliano Allegri though, ins"
    },
    {
      "id": "28f26a907db2",
      "title": "Totti: \"Return to Roma? We're talking about it and I went to dinner with Gasperini\"",
      "url": "https://www.milannews.it/news/totti-ritorno-alla-roma-ne-stiamo-parlando-e-sono-andato-a-cena-con-gasperini-607606",
      "source": "milannews.it",
      "date": "2026-02-16T14:50:17+00:00",
      "summary": "\"Return to Roma? We are talking about it, there are still some details to be ironed out but I confirm that we are thinking about it. Let's see what can be done."
    },
    {
      "id": "825c7f4cae9c",
      "title": "Inter vs. Juventus refereeing upset Milan too – report",
      "url": "https://football-italia.net/inter-vs-juventus-refereeing-upset-milan-too/",
      "source": "football-italia.net",
      "date": "2026-02-16T14:46:52+00:00",
      "summary": "Corriere dello Sport reports that the officiating in Inter-Juventus did not infuriate the Bianconeri only,..."
    },
    {
      "id": "86816976d0fa",
      "title": "Caressa: \"In my opinion the referees should explain the reasons for their decision. Enough\"",
      "url": "https://www.milannews.it/news/caressa-secondo-me-gli-arbitri-dovrebbero-spiegare-la-motivazione-della-loro-decisione-basta-607558",
      "source": "milannews.it",
      "date": "2026-02-16T14:40:55+00:00",
      "summary": "During the usual appointment with Sky Calcio Club, my colleague Fabrio Caressa spoke about the referees, not entirely agreeing with what has been happening for some time now with the competition program, DAZN, Open Var."
    },
    {
      "id": "1366d19d63bc",
      "title": "Bad news at Atalanta, Raspadori out for 3 weeks",
      "url": "https://www.milannews.it/news/brutte-notizie-in-casa-atalanta-raspadori-out-3-settimane-607598",
      "source": "milannews.it",
      "date": "2026-02-16T14:30:29+00:00",
      "summary": "As reported by the Gazzetta dello Sport, for Giacomo Raspadori there had been talk in recent hours of muscle strain in the left flexor which however could be a low-grade strain."
    },
    {
      "id": "2199667f778a",
      "title": "Watch: How good Luka Modric has been for AC Milan so far in 2025-26",
      "url": "https://sempremilan.com/how-good-luka-modric-milan-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-16T14:30:00+00:00",
      "summary": "Luka Modric is the man of the moment for AC Milan again after his winner in Pisa, and he continues to play at an elite level even at 40. Modric netted late on in Friday night’s game at the Arena Garibaldi to just about keep Milan’s Scudetto hopes alive. It is his second game-winning goal […]\nThe pos"
    },
    {
      "id": "5018a2256f5f",
      "title": "Pellegatti advises: \"Let's not get distracted by episodes that concern others, maximum concentration\"",
      "url": "https://www.milannews.it/news/pellegatti-consiglia-non-distraiamoci-su-episodi-che-riguardano-altri-massima-concentrazione-607597",
      "source": "milannews.it",
      "date": "2026-02-16T14:20:15+00:00",
      "summary": "In his YouTube channel, Carlo Pellegatti talked about the situation in the standings after the end of this day and stated that he did not want to talk about the refereeing incidents in the other matches."
    },
    {
      "id": "717c212daa5f",
      "title": "The current series is the third longest without defeat for Milan in a Serie A season",
      "url": "https://www.milannews.it/news/quella-in-corso-e-la-terza-serie-piu-lunga-senza-sconfitte-per-il-milan-in-una-stagione-di-serie-a-607570",
      "source": "milannews.it",
      "date": "2026-02-16T14:11:09+00:00",
      "summary": "Milan (W15, D8 in the current tournament) equaled its third longest unbeaten run in a Serie A season (23 matches in a row, as between September 1992 and March 1993), behind only a run of 24 matches between December 1..."
    },
    {
      "id": "9db70521f0c4",
      "title": "The Figurine Museum celebrates twenty years with a tribute to Giuseppe Panini",
      "url": "https://www.milannews.it/news/il-museo-della-figurina-celebra-vent-anni-con-un-omaggio-a-giuseppe-panini-607589",
      "source": "milannews.it",
      "date": "2026-02-16T14:00:05+00:00",
      "summary": "(ANSA) - MODENA, FEBRUARY 16 - Twenty years of exhibitions, educational activities and projects have transformed the collection donated by Giuseppe Panini to the Municipality of Modena into a space for discussion, memory and shared imagination: for the occasion, from ..."
    },
    {
      "id": "b1e9821c9c56",
      "title": "Milan failure to Lyon favourite: Emotional Fonseca celebrates 13 straight wins",
      "url": "https://sempremilan.com/milan-failure-lyon-favourite-fonseca-13-wins",
      "source": "sempremilan.com",
      "date": "2026-02-16T14:00:00+00:00",
      "summary": "Things may not have gone well for Paulo Fonseca at AC Milan, but now he is very much a fan favourite at his current club Lyon. Fonseca was hired by Milan to replace Stefano Pioli before the start of the 2024-25 season, but he didn’t even make it into 2025. The Portuguese was sacked after […]\nThe pos"
    },
    {
      "id": "0f09f3547f07",
      "title": "Longhi: \"I believe the VAR protocol is to be condemned above all and not just La Penna\"",
      "url": "https://www.milannews.it/news/longhi-credo-sia-da-condannare-soprattutto-il-protocollo-var-e-non-solo-la-penna-607542",
      "source": "milannews.it",
      "date": "2026-02-16T13:50:00+00:00",
      "summary": "Bruno Longhi, historic journalist and sports commentator, spoke like this after the very serious refereeing error that occurred in Inter-Juventus when Kalulu su Bastoni was sent off."
    },
    {
      "id": "a7c399766f44",
      "title": "The moment in which Cardinale shook hands and hugged Captain Maignan at Milanello was particularly significant",
      "url": "https://www.milannews.it/news/particolarmente-significativo-il-momento-in-cui-cardinale-a-milanello-ha-stretto-la-mano-e-abbracciato-capitan-maignan-607566",
      "source": "milannews.it",
      "date": "2026-02-16T13:40:38+00:00",
      "summary": "Andrea Ramazzotti, journalist, expressed himself as follows in La Gazzetta dello Sport when describing Cardinale's visit to Milanello: \"Cardinale spent time talking with the managers (who were present in full), the technical staff and ..."
    },
    {
      "id": "19f4d6b324cb",
      "title": "MN: Key Saelemaekers update arrives ahead of Milan’s home game vs. Como",
      "url": "https://sempremilan.com/key-saelemaekers-update-arrives-milan-como",
      "source": "sempremilan.com",
      "date": "2026-02-16T13:35:00+00:00",
      "summary": "Some good news has come from Milanello a couple of days before AC Milan welcome Como to San Siro. The Milan squad were in training today continuing to prepare for the rescheduled game against Cesc Fabregas’ side, which will take place on Wednesday night. There are some doubts about the team Massimil"
    },
    {
      "id": "4c9a41e669b3",
      "title": "Rome, Gasperini: \"We emerge from the matches against Milan and Naples with some regrets\"",
      "url": "https://www.milannews.it/news/roma-gasperini-usciamo-dalle-sfide-con-milan-e-napoli-con-qualche-rammarico-607563",
      "source": "milannews.it",
      "date": "2026-02-16T13:30:56+00:00",
      "summary": "(ANSA) - NAPLES, FEBRUARY 15 - \"We always play to impose ourselves, since the beginning of the season. Since then we have grown, in the first round we won many matches but lost the direct clashes, coming close with performances but then falling."
    },
    {
      "id": "4ad81ad1d371",
      "title": "GdS: Division ‘not important’ – why the Milan Futuro project has barely changed since relegation",
      "url": "https://sempremilan.com/why-milan-futuro-project-barely-changed",
      "source": "sempremilan.com",
      "date": "2026-02-16T13:10:00+00:00",
      "summary": "Davide Bartesaghi is a shining example of a Milan Futuro graduate, but now the club want to see more players make the jump. La Gazzetta dello Sport recall how ‘strange’ the two games against Chievo Verona were. On one side were the Futuro, who dropped into Serie D after a failure on the field in […]"
    },
    {
      "id": "4112f5bad99c",
      "title": "Mazzara claims 4-3-3 is ‘the key’ to Milan ‘making the most of their technical potential’",
      "url": "https://sempremilan.com/mazzara-4-3-3-key-milan-most-potential",
      "source": "sempremilan.com",
      "date": "2026-02-16T12:45:00+00:00",
      "summary": "Pietro Mazzara has suggested that Massimiliano Allegri could and should turn to the 4-3-3 more in order to unlock difficult games. Milan made things more difficult than they perhaps should have been on Friday night in Pisa, especially after taking a first-half lead through Ruben Loftus-Cheek. Niclas"
    },
    {
      "id": "959905e70d11",
      "title": "QS: A ‘strong message’ to Milan – stability and centrality behind Cardinale’s visit",
      "url": "https://sempremilan.com/strong-message-cardinale-visit-stability-centrality",
      "source": "sempremilan.com",
      "date": "2026-02-16T12:20:00+00:00",
      "summary": "Gerry Cardinale was once again present at AC Milan’s training ground on Sunday, his second visit in less than one month. As Quotidiano Sportivo recall, Cardinale’s past agenda includes a visit to Milanello in the summer of 2024, an appearance at San Siro in September of that year (his most recent fo"
    },
    {
      "id": "47a89354b790",
      "title": "CaughtOffside: Milan star ‘open’ to Premier League return – Arsenal, Spurs and Man Utd keen",
      "url": "https://sempremilan.com/pulisic-open-manchester-united-arsenal-spurs",
      "source": "sempremilan.com",
      "date": "2026-02-16T11:55:00+00:00",
      "summary": "Speculation about Christian Pulisic’s future at AC Milan continues, with some Premier League clubs keen on landing him. Pulisic is currently under contract until June 2027 at present, but Milan have a one-year option that they can trigger, and they are expected to. However, to resolve his long-term "
    },
    {
      "id": "92ab2443e132",
      "title": "GdS: Leao, Saelemaekers, De Winter and more – Allegri’s doubts ahead of Como game",
      "url": "https://sempremilan.com/leao-saelemaekers-allegri-doubts-como",
      "source": "sempremilan.com",
      "date": "2026-02-16T11:30:00+00:00",
      "summary": "AC Milan are back in action on Wednesday night against Como, and Massimiliano Allegri has some decisions to make. As La Gazzetta dello Sport report, Alexis Saelemaekers also trained separately on Sunday, but will most likely return to full training today. If his left adductor doesn’t cause discomfor"
    },
    {
      "id": "f8fac00794ad",
      "title": "CorSport: Milan aiming to tie English duo down to new deals – the strategy",
      "url": "https://sempremilan.com/milan-tomori-loftus-cheek-new-deals",
      "source": "sempremilan.com",
      "date": "2026-02-16T11:05:00+00:00",
      "summary": "Even though the winter transfer window is now behind us, the AC Milan management are still in negotiations over some deals. It was a rather quiet January for Milan in the end as they signed Niclas Füllkrug from West Ham on loan with option to buy and that was it, with a late deal for […]\nThe post Co"
    },
    {
      "id": "8bf3833fe4c7",
      "title": "Reports: Season over for new Milan signing Alphadjo Cissè with surgery chosen",
      "url": "https://sempremilan.com/season-over-alphadjo-cisse-surgery-chosen",
      "source": "sempremilan.com",
      "date": "2026-02-16T10:40:00+00:00",
      "summary": "There was a lot of excitement about the signing of Alphadjo Cissè, but he is now expected to spend the rest of the season out of action. While the Jean-Philippe Mateta saga dominated the headlines on deadline day a couple of weeks ago, Milan completed the signing of Cissè, the young talent who was d"
    },
    {
      "id": "6d3b9f6092c0",
      "title": "GdS: Ricci the ‘extra man’ for Milan – how he earned Allegri’s full trust",
      "url": "https://sempremilan.com/ricci-extra-man-milan-allegri-trust",
      "source": "sempremilan.com",
      "date": "2026-02-16T10:15:00+00:00",
      "summary": "Samuele Ricci had a big hand in AC Milan’s winning goal against Pisa on Friday, and he has become the ‘extra man’ for Massimiliano Allegri. As La Gazzetta dello Sport write, it was Luka Modric who stole the show after the victory over Pisa. The 40-year-old popped up in the right place at the right ["
    },
    {
      "id": "77cbd929efe4",
      "title": "CorSport: Why Milan have been left angered after Inter-Juventus refereeing debacle",
      "url": "https://sempremilan.com/why-milan-angered-inter-juventus-refereeing",
      "source": "sempremilan.com",
      "date": "2026-02-16T09:50:00+00:00",
      "summary": "AC Milan are internally very discontent with the officiating during Saturday night’s game between Inter and Juventus, a report claims. After beating Pisa on Friday night, Milan were hoping for a favour from Juventus on Saturday, and they were very close to getting one but for Piotr Zielinski’s last-"
    },
    {
      "id": "4e4727f426b3",
      "title": "Moretto: Milan interested in Barcelona centre-back – ‘evaluation’ phase underway",
      "url": "https://sempremilan.com/milan-interested-gerard-martin-barcelona-evaluation",
      "source": "sempremilan.com",
      "date": "2026-02-16T09:25:00+00:00",
      "summary": "AC Milan’s interest in signing FC Barcelona defender Gerard Martin in the summer window has been confirmed by Matteo Moretto. Late last week, it emerged that Milan have a new name on their radar as they explore various options to reinforce the defence. Reports in Spain suggested that Martin is a con"
    },
    {
      "id": "2bd61fa7e59a",
      "title": "GdS: ‘Cardinale’s speech’ – why Milan’s owner was at Milanello again and what he said",
      "url": "https://sempremilan.com/why-cardinale-present-milanello-what-said",
      "source": "sempremilan.com",
      "date": "2026-02-16T09:00:00+00:00",
      "summary": "Gerry Cardinale as at Milanello on Sunday, marking the second time in less than one month that he has been present. As La Gazzetta dello Sport (seen below) write this morning, yesterday morning the founder of RedBird Capital – the fund that controls Milan – showed up at Milanello to meet the team. T"
    },
    {
      "id": "f4aa85284ebf",
      "title": "Tuttosport: Milan courting ‘a new Jimenez’ – how a deal could aid multiple areas",
      "url": "https://sempremilan.com/milan-courting-new-jimenez",
      "source": "sempremilan.com",
      "date": "2026-02-15T19:30:00+00:00",
      "summary": "AC Milan are looking to Real Madrid once again, and there is hope that there is another project player for them to discover. After the success of Alex Jimenez, where Milan made a nice profit, Milan are once again looking to Madrid for another gem to develop. In fact, it seems that one has already […"
    },
    {
      "id": "c9748545a032",
      "title": "GdS: Milan Futuro’s forced reset has been strengthened by recent graduates",
      "url": "https://sempremilan.com/milan-futuro-forced-reset-strengthened",
      "source": "sempremilan.com",
      "date": "2026-02-15T19:00:00+00:00",
      "summary": "AC Milan had big expectations for the Futuro project, and it certainly did not start well with relegation. However, it is still proving to be a success. The relegation to Serie D could have closed the door on the Milan Futuro project. Instead, though, it has been strengthened, and there is a case to"
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    },
    {
      "id": "9c729c8148a4",
      "title": "Pisa forced to field third-choice goalkeeper in Serie A match against Milan",
      "url": "https://football-italia.net/pisa-forced-3rd-choice-goalkeeper-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T13:04:11+00:00",
      "summary": "Second-choice Pisa goalkeeper Simone Scuffet has been ruled out of tonight’s Serie A match against..."
    },
    {
      "id": "e6e4778300f1",
      "title": "Report Milan call McKennie for possible USMNT reunion with Pulisic",
      "url": "https://football-italia.net/milan-call-mckennie-usmnt-reunion-pulisic/",
      "source": "football-italia.net",
      "date": "2026-02-13T12:43:07+00:00",
      "summary": "Milan have reportedly begun preliminary talks with Weston McKennie’s entourage as the Juventus midfielder is..."
    },
    {
      "id": "bb92885e8dfd",
      "title": "Milan make Modric decision, prepare for new contract extensions after Maignan",
      "url": "https://football-italia.net/milan-modric-decision-more-contracts-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-13T11:04:46+00:00",
      "summary": "According to La Gazzetta dello Sport, Fikayo Tomori is expected to be the next Milan..."
    },
    {
      "id": "c682014167e5",
      "title": "Serie A: Pisa vs. Milan – probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/pisa-vs-milan-probable-line-ups-watch-on-tv/",
      "source": "football-italia.net",
      "date": "2026-02-13T08:53:01+00:00",
      "summary": "Ruben Loftus-Cheek and Christopher Nknuku are expected to lead the Milan attack in an away..."
    },
    {
      "id": "d50cee56a1a2",
      "title": "Capello claims Serie A title race wide open: ‘Inter & Juventus, watch out for Milan & Roma’",
      "url": "https://football-italia.net/capello-claims-serie-a-title-race-wide-open/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:30:19+00:00",
      "summary": "Fabio Capello insists the Serie A title race is far from over, warning that Inter..."
    },
    {
      "id": "ef679b7e17ab",
      "title": "Only one Serie A player included in Europe’s best paid footballers in 2026",
      "url": "https://football-italia.net/one-juventus-player-europe-top-20-best-paid/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:01:54+00:00",
      "summary": "Juventus’s Dusan Vlahovic is currently the only Serie A player to feature in the list..."
    },
    {
      "id": "00edaaaae844",
      "title": "Juventus set price tag for Gatti as Milan, Napoli and Premier League clubs queue up",
      "url": "https://football-italia.net/juventus-set-price-tag-for-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-12T14:21:33+00:00",
      "summary": "Juventus reportedly have a price tag in mind when it comes to a potential sale..."
    }
  ]
}