{
  "lastUpdated": "2026-02-19T15:46:49.583984+00:00",
  "articles": [
    {
      "id": "c70e446d691d",
      "title": "Finance in the Municipality of Trieste for access to documents on Triestina",
      "url": "https://www.milannews.it/news/la-finanza-in-comune-a-trieste-per-accesso-agli-atti-sulla-triestina-607965",
      "source": "milannews.it",
      "date": "2026-02-19T15:41:35+00:00",
      "summary": "(ANSA) - TRIESTE, FEBRUARY 18 - The Guardia di Finanza of Trieste today accessed documents in the city hall as part of the ongoing investigation into the Triestina football club."
    },
    {
      "id": "88f321aefd9b",
      "title": "Milan team news: Boost as Pavlovic tests reveal no fracture",
      "url": "https://football-italia.net/milan-team-news-boost-as-pavlovic-tests/",
      "source": "football-italia.net",
      "date": "2026-02-19T15:39:58+00:00",
      "summary": "Milan will breathe a sigh of relief this morning, after medical examinations revealed that Strahinja..."
    },
    {
      "id": "1a6427525ae0",
      "title": "Napoli, Hojlund: \"Removing Milan from the Scudetto is a mistake. But Inter is far ahead\"",
      "url": "https://www.milannews.it/news/napoli-hojlund-togliere-il-milan-dallo-scudetto-e-un-errore-ma-l-inter-e-molto-avanti-608002",
      "source": "milannews.it",
      "date": "2026-02-19T15:30:27+00:00",
      "summary": "Rasmus Hojlund, Napoli striker, spoke to Il Mattino like this about a week that will lead him to face his former Atalanta on Sunday afternoon: \"Atalanta has remained in my heart ..."
    },
    {
      "id": "27873a4bfc49",
      "title": "‘Its not about sprints, it’s a marathon’ – Milan players react after disappointing Como draw",
      "url": "https://sempremilan.com/players-react-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T15:30:00+00:00",
      "summary": "AC Milan were forced to settle for a draw against Como on Wednesday night, and some of the team have posted messages about the result.  It is a game where Milan can look back with some allowance. After all, they keep their unbeaten run whilst being far from their best, while their Head-To-Head recor"
    },
    {
      "id": "f241be15b522",
      "title": "You can't go wrong with the big teams: Milan is the team that has scored the most points against the big teams (without ever losing)",
      "url": "https://www.milannews.it/news/con-le-grandi-non-si-sbaglia-il-milan-e-la-squadra-che-ha-fatto-piu-punti-contro-le-big-senza-mai-perdere-607983",
      "source": "milannews.it",
      "date": "2026-02-19T15:20:29+00:00",
      "summary": "Milan is the team that has gained the most points against teams at the top of the table in this Serie A (26) and is the only one not to have lost against these teams (7W, 5D). Opta reports it."
    },
    {
      "id": "625b8e87555b",
      "title": "Letizia: \"From Wednesday, Inter will emerge certain winners of the Scudetto and with an excellent chance of being able to have their say in the Champions League\"",
      "url": "https://www.milannews.it/news/letizia-dal-mercoledi-l-inter-esce-certa-vincitrice-dello-scudetto-e-con-ottime-chance-di-poter-dire-la-sua-in-champions-607977",
      "source": "milannews.it",
      "date": "2026-02-19T15:10:43+00:00",
      "summary": "Francesco Letizia, journalist, expressed himself as follows on Sportitalia on the Scudetto fight: \"In the end it was evidently true."
    },
    {
      "id": "6c8c7dc0846e",
      "title": "Max, let's face it: this offensive phase is not the best. But it's not just your \"fault\".",
      "url": "https://www.milannews.it/primo-piano/max-diciamocela-tutta-questa-fase-offensiva-non-e-il-massimo-ma-non-e-solo-colpa-tua-608012",
      "source": "milannews.it",
      "date": "2026-02-19T15:00:01+00:00",
      "summary": "Milan's second place is not only the result of results in a broad sense, but also of how this team has faced many matches within the championship."
    },
    {
      "id": "7cb100489dc6",
      "title": "When coaches get involved: Milan rightly furious after Chivu and Fabregas incidents",
      "url": "https://sempremilan.com/milan-rightly-furious-chivu-fabregas",
      "source": "sempremilan.com",
      "date": "2026-02-19T15:00:00+00:00",
      "summary": "This season, AC Milan have been subjected to a few occasions where managers have been wrongly involved in games, yet nothing has ever been done with it.  Last night’s involvement from Cesc Fabregas brings up an uneasy question again, why are Milan the victims of coaches getting involved in games. If"
    },
    {
      "id": "ad7ac25c1cbc",
      "title": "Allegri expelled, Ravezzani: \"We are at a paradox. Then they should disqualify all the coaches every Sunday\"",
      "url": "https://www.milannews.it/news/allegri-espulso-ravezzani-siamo-al-paradosso-allora-dovrebbero-squalificare-tutti-gli-allenatori-ogni-domenica-608011",
      "source": "milannews.it",
      "date": "2026-02-19T14:50:41+00:00",
      "summary": "Today the Sports Judge's statement clarified the reason for Massimiliano Allegri's expulsion in Milan-Como."
    },
    {
      "id": "0f4559a5c7fd",
      "title": "The distances in the standings after the recovery: Milan -7 from the top, Como -5 from fourth place",
      "url": "https://www.milannews.it/news/le-distanze-in-classifica-dopo-il-recupero-milan-a-7-dalla-vetta-como-a-5-dal-quarto-posto-607964",
      "source": "milannews.it",
      "date": "2026-02-19T14:40:07+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 18 - Milan and Como ended the recovery of the 24th matchday of the championship at 1-1, postponed due to the Winter Games. Nico Paz gave Como the lead in the 32nd minute of the first half."
    },
    {
      "id": "59a1574c97e5",
      "title": "Maignan makes a mistake, Leao protects him and says: \"Don't boo us\"",
      "url": "https://www.milannews.it/news/maignan-sbaglia-leao-lo-protegge-e-dice-non-fischiateci-607943",
      "source": "milannews.it",
      "date": "2026-02-19T14:30:00+00:00",
      "summary": "Milan did not go beyond the 1-1 draw at home against Como, seeing the possibility of bringing Inter closer to the top of the table disappear."
    },
    {
      "id": "61851f5fc6dd",
      "title": "Hauge refers to Inter clash as ‘the derby’ and admits ‘special meaning’: “Always nice”",
      "url": "https://sempremilan.com/hauge-refers-to-inter-clash-as-the-derby-special-meaning",
      "source": "sempremilan.com",
      "date": "2026-02-19T14:30:00+00:00",
      "summary": "Jens Petter Hauge never really hit the levels that AC Milan hoped for, but the Norwegian winger still keeps the club close to his heart. After leaving Milan, the young winger has gone on to have a pretty decent interesting career. Of course, the initial hopes were that he would be a key figure for ["
    },
    {
      "id": "6e36b13579e6",
      "title": "Order: \"Scaroni forgets that he has been president of Milan for 8 years. The problem is not Mariani, it's political!\"",
      "url": "https://www.milannews.it/news/ordine-scaroni-dimentica-di-essere-presidente-del-milan-da-8-anni-il-problema-non-e-mariani-e-politico-608010",
      "source": "milannews.it",
      "date": "2026-02-19T14:20:56+00:00",
      "summary": "The well-known journalist Franco Ordine, in the usual Wednesday editorial on MilanNews."
    },
    {
      "id": "a52ae633953e",
      "title": "Licari: \"The first leg counted. There's no other way to explain Fabregas' choice to be a bit of a resultant - no offence, eh - him too\"",
      "url": "https://www.milannews.it/news/licari-l-andata-ha-contato-non-si-spiega-altrimenti-la-scelta-di-fabregas-di-essere-un-po-risultatista-senza-offesa-eh-anche-lui-607969",
      "source": "milannews.it",
      "date": "2026-02-19T14:11:07+00:00",
      "summary": "Fabio Licari, journalist, expressed himself as follows in La Gazzetta dello Sport on Milan-Como: \"Inter would win once again if, from the freezing Bodo, the news of the 3-1 did not arrive which also puts Chivu in trouble after Spallett..."
    },
    {
      "id": "88397fad3c67",
      "title": "Champions League, Tonali's Newcastle overwhelms Qarabag 6-1. Thiaw scores again",
      "url": "https://www.milannews.it/news/champions-il-newcastle-di-tonali-travolge-6-1-il-qarabag-a-segno-ancora-thiaw-607963",
      "source": "milannews.it",
      "date": "2026-02-19T14:00:25+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 18 - Not just Bodo/Glimt-Inter. In the other first legs of the Champions League playoffs played today, Newcastle's 6-1 win at Qarabak in Azerbaijan stands out."
    },
    {
      "id": "acb2506abbea",
      "title": "Jashari’s arrival and xG lows: All the key stats from Milan 1-1 Como",
      "url": "https://sempremilan.com/all-the-key-stats-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T14:00:00+00:00",
      "summary": "AC Milan were held to a 1-1 draw by Como at San Siro on Wednesday night, here are some of the key stats from the game.  It was certainly not a game to shout about from a Milan perspective. In fact, it was a game to forget. From poor officiating to the goal conceded, the […]\nThe post Jashari’s arriva"
    },
    {
      "id": "9d3db375d580",
      "title": "Cuomo: \"Very disappointed with Chivu and Fabregas. And I defend Allegri: his expulsion is indecipherable, unlikely, inadmissible, embarrassing and disrespectful\"",
      "url": "https://www.milannews.it/news/cuomo-delusissimo-da-chivu-e-fabregas-e-difendo-allegri-la-sua-espulsione-e-indecifrabile-inverosimile-irricevibile-imbarazzante-e-irrispettosa-607978",
      "source": "milannews.it",
      "date": "2026-02-19T13:50:36+00:00",
      "summary": "Michael Cuomo, journalist, expressed himself as follows on MilanNews on what happened after the Milan-Como match between Allegri and Fabregas: \"I am not scandalized by these things."
    },
    {
      "id": "c625c6ff20be",
      "title": "Inter will have to win with at least a three-goal margin against Bodo to advance to the Champions League playoffs",
      "url": "https://www.milannews.it/news/l-inter-dovra-vincere-con-almeno-tre-gol-di-scarto-contro-il-bodo-per-passare-i-playoff-di-champions-607962",
      "source": "milannews.it",
      "date": "2026-02-19T13:40:28+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 18 - Inter collapsed under the blows of an unleashed Bodo/Glimt and saw the race to the Champions League round of 16 get complicated."
    },
    {
      "id": "99590206d996",
      "title": "Longoni: ‘Milan barely manage to win’ – Scudetto dream is over for the Rossoneri this season",
      "url": "https://sempremilan.com/barely-manage-win-scudetto-dream-over-for-milan",
      "source": "sempremilan.com",
      "date": "2026-02-19T13:35:00+00:00",
      "summary": "This season, AC Milan have been in the Scudetto fight, but they have often been their own downfall, rather than anyone else damaging them.  It has been a while since Milan last lost, yet, despite that feeling, they are not sitting at the top of the table, as many would expect. Indeed, despite losing"
    },
    {
      "id": "163c30eb59ad",
      "title": "Colombo says: \"Big words fly and a fight between Allegri and Fabregas comes close\"",
      "url": "https://www.milannews.it/news/colombo-racconta-volano-parole-grosse-e-viene-sfiorata-la-rissa-fra-allegri-e-fabregas-607970",
      "source": "milannews.it",
      "date": "2026-02-19T13:30:01+00:00",
      "summary": "Monica Colombo, a journalist, expressed herself in the Corriere della Sera as follows, describing what happened after the Milan-Como match between Allegri and Fabregas: \"Big words fly and a fight between Massimiliano Allegr comes close..."
    },
    {
      "id": "96bed3755bae",
      "title": "Lautaro risks missing the derby? For Chivu he will be missed for a while. He'll take his exams tomorrow",
      "url": "https://www.milannews.it/news/lautaro-rischia-di-saltare-il-derby-per-chivu-manchera-per-un-po-domani-fara-gli-esami-607968",
      "source": "milannews.it",
      "date": "2026-02-19T13:20:16+00:00",
      "summary": "Cristian Chivu, Inter coach, spoke to Sky Sport after the 3-1 defeat in Norway against Bodo/Glimt in the first leg of the Champions League playoff: \"We knew it wouldn't be easy, the first half is the testimony ..."
    },
    {
      "id": "bf013ce82e66",
      "title": "Milan-Parma, referee Piccinini: the trio is complete",
      "url": "https://www.milannews.it/news/milan-parma-arbitra-piccinini-la-terna-completa-608007",
      "source": "milannews.it",
      "date": "2026-02-19T13:10:00+00:00",
      "summary": "CAN AIA has released the referee appointments for the 26th matchday of Serie A. Milan-Parma, scheduled for Sunday at 6pm, will be directed by Mr."
    },
    {
      "id": "b328421ec01d",
      "title": "Sporting Judge: Fabregas left unpunished for now as Allegri’s ban is confirmed",
      "url": "https://sempremilan.com/fabregas-unpunished-allegri-ban-confirmed",
      "source": "sempremilan.com",
      "date": "2026-02-19T13:10:00+00:00",
      "summary": "This morning, the Sporting Judge has released its standard statement about the action from the previous day, and AC Milan may be a little shocked. Given it was the only game left of the matchday, the Sporting Judge has released a specific statement for the game between Milan and Como, detailing the "
    },
    {
      "id": "d842e260a23c",
      "title": "The leader Max: Allegri knows how to manage this delicate phase of the season",
      "url": "https://www.milannews.it/primo-piano/il-condottiero-max-allegri-sa-come-gestire-questa-fase-delicata-della-stagione-607991",
      "source": "milannews.it",
      "date": "2026-02-19T13:00:00+00:00",
      "summary": "A bitter draw for Milan, who didn't go beyond a 1-1 draw against Como. They are now 7 points behind leaders Inter, but Massimiliano Allegri doesn't cause drama."
    },
    {
      "id": "eb328479982d",
      "title": "Gozzini: \"Allegri gets angry when he sees his Como colleague taking it out on Saelemaekers: he goes to the defense of his player and then the argument starts. Mariani sends him off\"",
      "url": "https://www.milannews.it/news/gozzini-allegri-si-arrabbia-quando-vede-il-collega-del-como-prendersela-con-saelemaekers-va-in-difesa-del-suo-giocatore-e-poi-inizia-la-lite-mariani-l-607972",
      "source": "milannews.it",
      "date": "2026-02-19T12:50:04+00:00",
      "summary": "Alessandra Gozzini, journalist, expressed herself in La Gazzetta dello Sport on what happened in the final between Milan and Como: \"The composed Allegri of the day before gave way to the furious Max: sent off ten minutes from ..."
    },
    {
      "id": "1cd8c2d9d292",
      "title": "‘You never know’ – Allegri references the Scudetto whilst admitting Champions League priority remains",
      "url": "https://sempremilan.com/allegri-references-scudetto-champions-league-focus",
      "source": "sempremilan.com",
      "date": "2026-02-19T12:45:00+00:00",
      "summary": "Massimiliano Allegri has focused on the Champions League all season, but it seems that he is not shutting down the hope of AC Milan winning the title.  Throughout the season so far, Milan have been involved in a title conversation. They have certainly been in better positions, and they have not real"
    },
    {
      "id": "ec535c98846b",
      "title": "Calvarese: \"Second yellow card for Saelemaekers? Mariani does well. Fabregas gives a light red\"",
      "url": "https://www.milannews.it/news/calvarese-secondo-giallo-a-saelemaekers-fa-bene-mariani-fabregas-da-rosso-chiaro-608006",
      "source": "milannews.it",
      "date": "2026-02-19T12:40:00+00:00",
      "summary": "Gianpaolo Calvarese, via his Instagram profile, commented on Maurizio Mariani's direction of the match in Milan-Como: \"Let's start from the most difficult episode - the possible second yellow for Saelemaekers..."
    },
    {
      "id": "d5ff64ab8b06",
      "title": "The club's comment at Milan-Como: \"Allegri's team showed a good game, but struggled to materialize the opportunities created\"",
      "url": "https://www.milannews.it/news/il-commento-del-club-a-milan-como-la-squadra-di-allegri-ha-mostrato-un-buon-gioco-ma-ha-faticato-a-concretizzare-le-occasioni-create-607959",
      "source": "milannews.it",
      "date": "2026-02-19T12:30:36+00:00",
      "summary": "Below is AC Milan's comment, via the club's official website, on Milan-Como (1-1):\n\n\"The Milan faced Como on the 24th matchday of Serie A, ending with a 1-1 draw."
    },
    {
      "id": "626b83eb2b83",
      "title": "GdS: Milan’s road to the derby and hopes regarding Inter’s fixture congestion",
      "url": "https://sempremilan.com/milan-road-to-derby-inter-fixture-congestion",
      "source": "sempremilan.com",
      "date": "2026-02-19T12:20:00+00:00",
      "summary": "AC Milan, despite dropping points at San Siro, will still have a slight hope of the Scudetto, despite the seven-point gap being solidified.  The draw against Como hurts. Whilst the Scudetto has never been the end goal for this season, it has been there, and Milan have probably allowed themselves to "
    },
    {
      "id": "d1035a3b77cf",
      "title": "Video: Fabregas’ shirt tug and touchline confrontation with Allegri",
      "url": "https://football-italia.net/fabregas-shirt-tug-touchline-clash-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-19T12:02:33+00:00",
      "summary": "Watch how Cesc Fabregas pulled the shirt of Alexis Saelemaekers and how Milan coach Massimiliano..."
    },
    {
      "id": "6652087a182f",
      "title": "MN: Pavlovic lucky to avoid fibula fracture but sustains large hematoma – the details",
      "url": "https://sempremilan.com/pavlovic-undergoing-tests-forced-exit",
      "source": "sempremilan.com",
      "date": "2026-02-19T11:50:00+00:00",
      "summary": "Strahinja Pavlovic has been key for AC Milan this season, and he will now be absent after being forced to leave the pitch after a rough tackle. There have been a number of improved players this season for Milan. Indeed, since Massimiliano Allegri’s arrival, a case can be made for several of the Ross"
    },
    {
      "id": "dd9b7c273588",
      "title": "Jashari feels Milan did better against Como in draw than reverse fixture: “We were dangerous”",
      "url": "https://sempremilan.com/jashari-feels-milan-did-better-como-draw-reverse",
      "source": "sempremilan.com",
      "date": "2026-02-19T11:30:00+00:00",
      "summary": "Ardon Jashari got a chance to play in a more advanced role on Wednesday night, and he was largely impressive for AC Milan. When Jashari signed, it seemed he would fluctuate across the midfield positions. Instead, he has regularly stepped in for Luka Modric, and whilst he has done solidly, he should "
    },
    {
      "id": "8029d346e637",
      "title": "‘Something I’m not proud of’ – Fabregas apologises for ‘unsportsmanlike’ Saelemaekers grab",
      "url": "https://sempremilan.com/im-not-proud-fabregas-apologises-saelemaekers-grab",
      "source": "sempremilan.com",
      "date": "2026-02-19T11:05:00+00:00",
      "summary": "Cesc Fabregas created one of the big talking points for this game, and AC Milan will rightly be annoyed by the decision to send Massimiliano Allegri off. When looking at the game on paper, Allegri being sent off would make most think that the Milan manager had done something, and whilst this would b"
    },
    {
      "id": "5332dfeea45e",
      "title": "Maignan mistake costly as Leao saves the day: Player ratings from Milan-Como from Italian papers",
      "url": "https://sempremilan.com/player-ratings-milan-como-1-1",
      "source": "sempremilan.com",
      "date": "2026-02-19T10:40:00+00:00",
      "summary": "AC Milan were left to deal with another frustrating game when they faced Como on Wednesday night, and they will now face the consequences moving forward. In a game where Milan could’ve really cemented their position as a Scudetto challenger, they were unable to get three points. Both keepers were at"
    },
    {
      "id": "fb0503218fca",
      "title": "Allegri and Fabregas have expletive argument outside conference room – what happened",
      "url": "https://sempremilan.com/allegri-fabregas-expletive-argument-outside-conference-room",
      "source": "sempremilan.com",
      "date": "2026-02-19T10:15:00+00:00",
      "summary": "After the red card incident for Massimiliano Allegri, tensions were high after AC Milan drew against Como and they boiled over behind closed doors. The relationship between Allegri and Cesc Fabregas has not really been there, ever. Despite the pair seemingly sharing niceties before the first game, t"
    },
    {
      "id": "c7bf1ab24225",
      "title": "Watch: Fabregas holds Saelemaekers back to provoke furious reaction and Allegri red card",
      "url": "https://sempremilan.com/fabregas-holds-saelemaekers-back-allegri-red",
      "source": "sempremilan.com",
      "date": "2026-02-19T09:50:00+00:00",
      "summary": "Massimiliano Allegri was given a red card last night, but it should’ve potentially been the other way around and AC Milan can, and will, feel hard done by.  In split seconds, brief moments can change games and Milan may have witnessed that last night, as Allegri was given a red card on the sidelines"
    },
    {
      "id": "d23444da3ffe",
      "title": "GdS: ‘Leao not enough’ – how Milan’s title aspirations faltered despite Como comeback",
      "url": "https://sempremilan.com/milan-title-aspirations-faltered-como-comeback",
      "source": "sempremilan.com",
      "date": "2026-02-19T09:25:00+00:00",
      "summary": "There was hope that AC Milan could fire their way back into the Scudetto race with a win against Como on Wednesday. However, that wasn’t the case, unfortunately.  This season has been a difficult one to navigate. The Scudetto has never been the goal, but it has hung like a carrot ahead of Milan, the"
    },
    {
      "id": "8e22ac8839a0",
      "title": "What Allegri told Fabregas in heated post-match clash: ‘You are a kid’",
      "url": "https://football-italia.net/what-allegri-told-fabregas-kid-milan-como/",
      "source": "football-italia.net",
      "date": "2026-02-19T09:09:48+00:00",
      "summary": "More details emerge about the confrontation between Milan coach Massimiliano Allegri and Como’s Cesc Fabregas..."
    },
    {
      "id": "b57127cbc69c",
      "title": "Gallery: ‘Leao saves Milan’, ‘Allegri and Fabregas tension’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/front-pages-19-february-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T09:00:00+00:00",
      "summary": "AC Milan’s faint title hopes might have been dealt their biggest blow yet as they could only draw with Como at San Siro on Wednesday night. The away side were gifted the lead with Nico Paz slotted in after Mike Maignan misjudged a pass from inside his own box. Rafael Leao levelled things in the […]\n"
    },
    {
      "id": "d3f0ece0dd15",
      "title": "Today’s Papers – Bodo shaming, Italy cry, Leao saves Milan",
      "url": "https://football-italia.net/today-papers-bodo-shaming-italy-cry-leao-milan/",
      "source": "football-italia.net",
      "date": "2026-02-19T08:42:54+00:00",
      "summary": "La Gazzetta dello Sport Inter, three slaps But they are still +7 in Serie A...."
    },
    {
      "id": "f24c9ac03bd7",
      "title": "Allegri and Fabregas bad blood after Como coach ‘unsporting behaviour’",
      "url": "https://football-italia.net/allegri-fabregas-bad-blood-como-unsporting/",
      "source": "football-italia.net",
      "date": "2026-02-18T23:07:22+00:00",
      "summary": "There is bad blood between Max Allegri and Cesc Fabregas, as they had another row..."
    },
    {
      "id": "6cd158fc0eef",
      "title": "‘We always look only at ourselves’ – Gabbia remaining calm despite ‘two points dropped’",
      "url": "https://sempremilan.com/gabbia-calm-only-look-at-ourselves",
      "source": "sempremilan.com",
      "date": "2026-02-18T23:03:24+00:00",
      "summary": "Matteo Gabbia has insisted that AC Milan are only focused on themselves, but admitted the two points dropped against Como stings. Milan’s faint Scudetto hopes might have finally faded as they were held to a 1-1 draw by Como at San Siro on Wednesday night. Nico Paz profited from Mike Maignan’s stray "
    },
    {
      "id": "60f4f709567f",
      "title": "Leao and Jashari believe Milan ‘played better’ than in victory over Como",
      "url": "https://football-italia.net/leao-jashari-believe-milan-played-better-como/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:53:55+00:00",
      "summary": "Rafael Leao and Ardon Jashari argue Milan ‘played better’ in their 1-1 draw than they..."
    },
    {
      "id": "2ec206e3513f",
      "title": "Watch: “Scudetto is… finito” – Lorenzo’s instant reaction to Como 1-1 AC Milan",
      "url": "https://sempremilan.com/lorenzos-instant-reaction-milan-1-1-como-2026",
      "source": "sempremilan.com",
      "date": "2026-02-18T22:41:39+00:00",
      "summary": "Lorenzo reacts to AC Milan’s 1-1 draw against Como straight after the full-time whistle. Two huge goalkeeping errors heavily impacted the game, especially Maignan’s, and the absence of Rabiot was certainly felt. Tonight’s game was a must-win for the Rossoneri, sitting eight points behind Inter befor"
    },
    {
      "id": "8161e32b44f9",
      "title": "Allegri analyses Como draw and red card incident involving Fabregas: “I’ll slide tackle them”",
      "url": "https://sempremilan.com/allegri-como-draw-red-card-fabregas",
      "source": "sempremilan.com",
      "date": "2026-02-18T22:38:33+00:00",
      "summary": "Massimiliano Allegri has hit out at how Cesc Fabregas acted before his red card, and assessed AC Milan’s draw with Como. There has been a bit of needle between Milan and Como since the former won 3-1 at the Stadio Sinigaglia back in January 15, in a game where Cesc Fabregas was keen to point […]\nThe"
    },
    {
      "id": "0886a97f78fb",
      "title": "Allegri: ‘A valuable Milan point, Fabregas fouled Saelemaekers’",
      "url": "https://football-italia.net/allegri-valuable-milan-point-fabregas-fouled/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:34:39+00:00",
      "summary": "Max Allegri insists Milan must see the 1-1 draw with Como as ‘a valuable point’..."
    },
    {
      "id": "cbf84c44f8e7",
      "title": "Bartesaghi insists point against Como is ‘very important’ after ‘tough match’",
      "url": "https://sempremilan.com/bartesaghi-point-como-very-important",
      "source": "sempremilan.com",
      "date": "2026-02-18T22:33:47+00:00",
      "summary": "Davide Bartesaghi spoke to the media after AC Milan’s 1-1 draw against Como and insisted that it is a very important point for the Rossoneri.  Milan headed into the game eight points behind their city rivals Inter in the standings, thus in need of three points to keep the Scudetto race alive (more o"
    },
    {
      "id": "72872cf860f0",
      "title": "Fabregas: ‘Como proud of 1-1 Milan draw, apology for Allegri’ row",
      "url": "https://football-italia.net/fabregas-como-proud-of-1-1-milan-draw-apology/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:19:36+00:00",
      "summary": "Cesc Fabregas apologised for his touchline row with Max Allegri, but was ‘very proud’ of..."
    },
    {
      "id": "d7ed67655616",
      "title": "Serie A | Milan 1-1 Como: Leao magic rescues Maignan howler",
      "url": "https://football-italia.net/serie-a-milan-1-1-como-leao-magic-save-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-18T21:46:39+00:00",
      "summary": "Rafael Leao’s remarkable lob cancelled out a Mike Maignan howler on Nico Paz, as Milan..."
    },
    {
      "id": "f3ddcbad229c",
      "title": "Serie A and UCL Liveblog: Milan vs. Como and Bodo/Glimt vs. Inter",
      "url": "https://football-italia.net/serie-a-ucl-liveblog-milan-como-bodo-inter/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:45:19+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "1c9558aed7a3",
      "title": "Tare shrugs off Milan Scudetto talk, reassuring news on Leao",
      "url": "https://football-italia.net/tare-shrugs-off-milan-scudetto-reassuring-leao/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:33:33+00:00",
      "summary": "Milan director Igli Tare shrugs off Scudetto talk ahead of tonight’s rescheduled clash with Como..."
    },
    {
      "id": "383f8ba5a703",
      "title": "Fabregas hint at Como False 9 experiment ‘to hurt Milan’",
      "url": "https://football-italia.net/fabregas-hint-at-como-false-9-experiment-milan/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:25:43+00:00",
      "summary": "Cesc Fabregas gives hints who is playing False 9 for Como this evening against Milan,..."
    },
    {
      "id": "740924179509",
      "title": "Serie A official Week 24 line-ups: Milan vs. Como",
      "url": "https://football-italia.net/serie-a-official-wk-24-line-ups-milan-vs-como/",
      "source": "football-italia.net",
      "date": "2026-02-18T18:39:09+00:00",
      "summary": "Milan have Rafael Leao and Christopher Nkunku upfront for the rescheduled Serie A clash with..."
    },
    {
      "id": "480f0a07090d",
      "title": "Milan optimistic over one-year Modric extension",
      "url": "https://football-italia.net/milan-optimistic-over-modric-extension/",
      "source": "football-italia.net",
      "date": "2026-02-18T17:17:48+00:00",
      "summary": "Milan are working hard to sign Luka Modric to a new one-year contract extension, after..."
    },
    {
      "id": "6dc5a25930b4",
      "title": "Milan team news: Loftus-Cheek set to miss Como clash; Nkunku to start instead",
      "url": "https://football-italia.net/milan-team-news-loftus-cheek-como-nkunku/",
      "source": "football-italia.net",
      "date": "2026-02-18T15:19:36+00:00",
      "summary": "Milan are preparing to host Como at San Siro this evening, as the Rossoneri look..."
    },
    {
      "id": "3ecccc1bff44",
      "title": "Why is Milan vs. Como the only Serie A match being played on Wednesday?",
      "url": "https://football-italia.net/why-is-milan-como-being-played-on-wednesday/",
      "source": "football-italia.net",
      "date": "2026-02-18T14:08:50+00:00",
      "summary": "Milan are due to take on Como in Serie A on Sunday evening, the only..."
    },
    {
      "id": "eb060911f496",
      "title": "Italy’s extra Champions League spot fades away after Juventus and Atalanta losses",
      "url": "https://football-italia.net/italys-extra-champions-league-spot-fades-away/",
      "source": "football-italia.net",
      "date": "2026-02-18T13:33:42+00:00",
      "summary": "Italy’s chances of receiving an extra spot in next season’s Champions League were dealt another..."
    },
    {
      "id": "6e8ccb197068",
      "title": "Official: Bologna sign Milan midfielder on permanent basis",
      "url": "https://football-italia.net/bologna-sign-milan-midfielder-on-permanent/",
      "source": "football-italia.net",
      "date": "2026-02-18T12:41:09+00:00",
      "summary": "Bologna have officially announced their signing of Tommaso Pobega on a definitive, permanent transfer from..."
    },
    {
      "id": "f5ba944f0536",
      "title": "Serie A: Milan vs. Como – Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-milan-vs-como-probable-line-ups/",
      "source": "football-italia.net",
      "date": "2026-02-18T09:16:33+00:00",
      "summary": "Milan will be without several of their key first team players when they take on..."
    },
    {
      "id": "88e05da709e9",
      "title": "Today’s Papers: An historic Juve blunder, Galagoal, Bastoni apology",
      "url": "https://football-italia.net/today-papers-historic-juve-blunder-galagoal/",
      "source": "football-italia.net",
      "date": "2026-02-18T08:37:44+00:00",
      "summary": "La Gazzetta dello Sport  Not like that  An historic gaffe in the Champions League Bremer..."
    }
  ]
}