{
  "lastUpdated": "2026-02-08T14:26:02.868874+00:00",
  "articles": [
    {
      "id": "a70f5753faed",
      "title": "LIVE MN - Milan Futuro-Virtus Ciserano (0-0): end of the first half",
      "url": "https://www.milannews.it/primo-piano/live-mn-milan-futuro-virtus-ciserano-0-0-fine-primo-tempo-606766",
      "source": "milannews.it",
      "date": "2026-02-08T14:20:00+00:00",
      "summary": "The first half of the game was not very exciting, but there were still great opportunities: two for Milan, a post and a miracle, and two for Virtus, a shot just wide and a miracle from Torriani."
    },
    {
      "id": "600ea7054efa",
      "title": "Women's Serie A, Roma-Milan 1-0: the former Bergamaschi player knocks out the Rossonere",
      "url": "https://www.milannews.it/milan-femminile/serie-a-femminile-roma-milan-1-0-l-ex-bergamaschi-stende-le-rossonere-606763",
      "source": "milannews.it",
      "date": "2026-02-08T14:15:42+00:00",
      "summary": "It ends 1-0 for the hosts who defeat the Rossonere with a goal from the former Bergamaschi player which came just a few minutes after Van Dooren's direct expulsion for a bad foul in midfield."
    },
    {
      "id": "ab4ea9a04e98",
      "title": "Roma 1-0 AC Milan Women: Ex-player Bergamaschi returns to haunt Rossonere",
      "url": "https://sempremilan.com/roma-1-0-ac-milan-women-match-report",
      "source": "sempremilan.com",
      "date": "2026-02-08T14:04:20+00:00",
      "summary": "AC Milan Women suffered a setback on Sunday afternoon as they were beaten by Roma away from home, in a game with just one goal. Milan Femminile had another positive result on Sunday afternoon as they beat Genoa 2-1 thanks to a late goal. Again it was Kayleigh van Dooren who netted a brace, opening ["
    },
    {
      "id": "e738b1b78a7c",
      "title": "Baresi and the illness: \"Here's what it taught me. The affection of the people helped me overcome the most difficult moments\"",
      "url": "https://www.milannews.it/news/baresi-e-la-malattia-ecco-cosa-mi-ha-insegnato-l-affetto-della-gente-mi-ha-aiutato-a-superare-i-momenti-piu-difficili-606737",
      "source": "milannews.it",
      "date": "2026-02-08T14:00:43+00:00",
      "summary": "Franco Baresi, former AC Milan captain who underwent surgery to remove a lung nodulation in August, interviewed by Corriere della Sera, spoke of his condition as follows: \"In those moments you understand many things."
    },
    {
      "id": "5d35fbee0f3e",
      "title": "Serie A, the Emilian derby at Parma: the updated rankings",
      "url": "https://www.milannews.it/news/serie-a-al-parma-il-derby-emiliano-la-classifica-aggiornata-606755",
      "source": "milannews.it",
      "date": "2026-02-08T13:48:08+00:00",
      "summary": "Thanks to a goal from Ordonez in added time in the second half, Parma beat Dall'Ara in Bologna and took home three golden points for their standings."
    },
    {
      "id": "a812d5fbe4c1",
      "title": "Serie A, Parma's big coup in Bologna: a goal from Ordonez in the 95th minute was decisive",
      "url": "https://www.milannews.it/news/serie-a-colpo-grosso-del-parma-a-bologna-decisivo-un-gol-di-ordonez-al-95-606767",
      "source": "milannews.it",
      "date": "2026-02-08T13:36:41+00:00",
      "summary": "Very important victory for Parma in the Emilian derby at Bologna's home: the match was decided by a goal from Ordonez in the 95th minute with a nice right-footed shot from outside the area."
    },
    {
      "id": "820a7075f7a9",
      "title": "CaughtOffside: Chelsea ready to sell defender for €35m – ‘background interest’ from Milan",
      "url": "https://sempremilan.com/chelsea-badiashile-35m-milan-background-interest",
      "source": "sempremilan.com",
      "date": "2026-02-08T13:35:13+00:00",
      "summary": "Chelsea defender Benoit Badiashile is expected to leave in the summer window, and AC Milan are among the teams linked. As CaughtOffside report, Badiashile is not considered a part of Chelsea’s plans moving forward and so a destination is already being thought about. There has been ‘some background i"
    },
    {
      "id": "4a9821d4f595",
      "title": "Juventus, Yildiz signs renewal until 2030",
      "url": "https://www.milannews.it/news/juventus-yildiz-firma-il-rinnovo-fino-al-2030-606717",
      "source": "milannews.it",
      "date": "2026-02-08T13:24:57+00:00",
      "summary": "After the renewal of Maignan last week, Juventus are also locking up one of their big names with a contract renewal: this is the talent in shirt 10 Kenan Yildiz."
    },
    {
      "id": "0b7adb1c8a06",
      "title": "Serie D, Group B: the official lineups of Milan Futuro-Virtus Ciserano",
      "url": "https://www.milannews.it/milan-futuro/serie-d-girone-b-le-formazioni-ufficiali-di-milan-futuro-virtus-ciserano-606765",
      "source": "milannews.it",
      "date": "2026-02-08T13:12:19+00:00",
      "summary": "The official lineups of Milan Futuro-Ciserano Bergamo, match valid for the 23rd day of the Serie D championship, group B."
    },
    {
      "id": "8e024046b1c4",
      "title": "CM: Back with Abate, back to scoring – Zeroli hoping for spark with Milan ambition still there",
      "url": "https://sempremilan.com/zeroli-hoping-spark-milan-ambitions-abate",
      "source": "sempremilan.com",
      "date": "2026-02-08T13:10:00+00:00",
      "summary": "Kevin Zeroli was one of the most talked about talents in AC Milan’s youth sector, yet the past couple of years have been strange. As Calciomercato.com write, the hope is that Zeroli’s rebirth came in the 50th minute of the match against Padova last night. He scored his first goal for Juve Stabia, as"
    },
    {
      "id": "b7d391c4603b",
      "title": "Genoa, De Rossi on the penalty for Napoli: \"What is the clear mistake? Too much power at VAR\"",
      "url": "https://www.milannews.it/news/genoa-de-rossi-sul-rigore-per-il-napoli-qual-e-il-chiaro-errore-al-var-troppo-potere-606740",
      "source": "milannews.it",
      "date": "2026-02-08T13:00:04+00:00",
      "summary": "(ANSA) - GENOA, 07 FEB - As with Lazio last week, Genoa falls again in full injury time and on a penalty. Daniele De Rossi in this case attacks the regulation."
    },
    {
      "id": "9d79a5272da6",
      "title": "From Naples, Carratelli: \"Scudetto? The problem is Inter and Milan's, not ours\"",
      "url": "https://www.milannews.it/news/da-napoli-carratelli-scudetto-il-problema-e-dell-inter-e-del-milan-non-nostro-606661",
      "source": "milannews.it",
      "date": "2026-02-08T12:48:14+00:00",
      "summary": "Mimmo Carratelli, journalist and historic signature of the Napoli world, spoke on Radio Tutto Napoli to talk about the Scudetto fight."
    },
    {
      "id": "3e8188e5d275",
      "title": "Footy Headlines: Milan to release ‘glossy’ fourth kit with Slam Jam – the two versions",
      "url": "https://sempremilan.com/milan-slam-jam-glossy-two-versions",
      "source": "sempremilan.com",
      "date": "2026-02-08T12:45:00+00:00",
      "summary": "More information has emerged regarding the AC Milan fourth kit which will be released soon, in collaboration with PUMA and Slam Jam. According to Footy Headlines, the kits come in white and red versions with a shiny, metallic or glossy finish, which is ‘inspired by late 1990s/early 2000s design aest"
    },
    {
      "id": "baa0a21113d0",
      "title": "The new Pisa coach reveals that he will change his training methodologies in view of the match against Milan",
      "url": "https://www.milannews.it/l-avversario/il-neo-allenatore-del-pisa-rivela-che-cambiera-le-metodologie-di-allenamento-in-vista-della-sfida-al-milan-606660",
      "source": "milannews.it",
      "date": "2026-02-08T12:36:09+00:00",
      "summary": "Oscar Hiljemark, Pisa's new coach, interviewed by Sky Sport after the 0-0 draw in Verona, had this to say about his debut as a manager in Serie A on the Pisa bench: \"I missed Italy, even ..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "1502a974861b",
      "title": "Modric, the numbers of a master: the balance of his season at Milan",
      "url": "https://www.milannews.it/news/modric-i-numeri-di-un-maestro-il-bilancio-della-sua-stagione-al-milan-606643",
      "source": "milannews.it",
      "date": "2026-02-08T12:24:00+00:00",
      "summary": "So far it's a big yes. Luka Modric has managed to win over everyone at Milan, not only thanks to his name and status but above all to his performances on the pitch."
    },
    {
      "id": "ecec4c2b283e",
      "title": "Tuttosport: A three-way battle – Allegri still search for final midfield piece",
      "url": "https://sempremilan.com/allegri-searching-final-midfield-piece",
      "source": "sempremilan.com",
      "date": "2026-02-08T12:20:00+00:00",
      "summary": "The central midfield department is the deepest in AC Milan’s entire squad, and Massimiliano Allegri is still searching for the perfect trio. As Tuttosport (via MilanPress) report this morning, the right midfield position in the 3-5-2 the only spot in the starting line-up without a designated starter"
    },
    {
      "id": "604f193daaee",
      "title": "According to Alessandra Gozzini, the true basis for Milan's strength is their away performance",
      "url": "https://www.milannews.it/news/secondo-alessandra-gozzini-il-vero-presupposto-della-forza-del-milan-e-il-rendimento-in-trasferta-606655",
      "source": "milannews.it",
      "date": "2026-02-08T12:12:24+00:00",
      "summary": "Alessandra Gozzini, journalist, expressed herself in La Gazzetta dello Sport on Milan's away numbers: \"Together with Bayern Munich, Milan is one of the only two teams still unbeaten away from home in the five games ..."
    },
    {
      "id": "22ffb15efffe",
      "title": "Attack and action area: are we sure that Milan is only defensive? The data",
      "url": "https://www.milannews.it/news/attacco-e-zona-d-azione-siamo-sicuri-che-il-milan-e-solo-difensivo-il-dato-606719",
      "source": "milannews.it",
      "date": "2026-02-08T12:00:10+00:00",
      "summary": "By now we know, the criticisms that are most often posed to Milan and their coach concern the amount of time the team spends defending during the match, accusing Allegri of being too defensive."
    },
    {
      "id": "86c59425f8d9",
      "title": "CM: Gimenez counting down the days – the plan for his return and stance on future",
      "url": "https://sempremilan.com/gimenez-counting-down-days-return-future",
      "source": "sempremilan.com",
      "date": "2026-02-08T11:55:00+00:00",
      "summary": "Santiago Gimenez wants to play a key role in AC Milan’s season finale, and a plan has been drawn up for his return to action. Nearly two months after undergoing surgery on his right ankle in Amsterdam to resolve the issues that severely hampered him from August to the end of October, Gimenez said on"
    },
    {
      "id": "f816ec7a4548",
      "title": "Baresi: \"I want to thank Milan because from day one they made the best facilities available to me\"",
      "url": "https://www.milannews.it/news/baresi-voglio-ringraziare-il-milan-perche-dal-primo-giorno-mi-ha-messo-a-disposizione-le-migliori-strutture-606738",
      "source": "milannews.it",
      "date": "2026-02-08T11:49:26+00:00",
      "summary": "Franco Baresi, former AC Milan captain who underwent surgery to remove a lung nodulation in August, interviewed by Corriere della Sera, spoke of his condition as follows: \"In those moments you understand many things."
    },
    {
      "id": "18fd66eb3dac",
      "title": "English sirens for Vlahovic: Chelsea and Tottenham also on the Serbian. Milan always in the background",
      "url": "https://www.milannews.it/news/sirene-inglesi-per-vlahovic-anche-chelsea-e-tottenham-sul-serbo-milan-sempre-sullo-sfondo-606759",
      "source": "milannews.it",
      "date": "2026-02-08T11:37:38+00:00",
      "summary": "Currently his main thought is to return to the field as soon as possible given that he is currently in the pits due to an adductor injury, but, as his contract expires at the end of the season, the v ..."
    },
    {
      "id": "6bf08923df2f",
      "title": "Giornale: Juventus plot counter-move as Milan and rivals plot McKennie swoop",
      "url": "https://sempremilan.com/juventus-move-milan-rivals-mckennie-swoop",
      "source": "sempremilan.com",
      "date": "2026-02-08T11:30:00+00:00",
      "summary": "Dusan Vlahovic is not the only free transfer opportunity that AC Milan are looking at from Juventus, according to a report. Following Kenan Yildiz’s contract extension until 2030, this morning’s edition of Il Giornale (via MilanNews) reports that Juventus are working to secure other players whose de"
    },
    {
      "id": "987db6f60420",
      "title": "Pisa, Marius Marin will miss Milan due to suspension",
      "url": "https://www.milannews.it/l-avversario/pisa-marius-marin-saltera-il-milan-per-squalifica-606747",
      "source": "milannews.it",
      "date": "2026-02-08T11:25:45+00:00",
      "summary": "Pisa, Milan's next opponent in the championship (Friday at 8.45pm in Tuscany), drew 0-0 against Hellas Verona."
    },
    {
      "id": "fafdddf70700",
      "title": "MN - Milan Women, the update on the injured players",
      "url": "https://www.milannews.it/milan-femminile/mn-milan-femminile-il-punto-sulle-giocatrici-infortunate-606757",
      "source": "milannews.it",
      "date": "2026-02-08T11:13:05+00:00",
      "summary": "The point on the injured AC Milan Women's players ahead of today's championship match away to Roma: \n\nBabb: left knee meniscus surgery\n\nCernoia: left flexor muscle problem \n\nDonolato ..."
    },
    {
      "id": "24bcf10fa1cb",
      "title": "QS: Getting the max from little – how Allegri has utilised super subs the best in Serie A",
      "url": "https://sempremilan.com/how-allegri-utilised-super-subs",
      "source": "sempremilan.com",
      "date": "2026-02-08T11:05:00+00:00",
      "summary": "Massimiliano Allegri might use less substitutions than every other manager in Serie A, but he uses them the most effectively. As Quotidiano Sportivo write, Milan are second in the table, and their unbeaten streak (22 games: 14 wins, eight draws) is unmatched in Europe. All this is with an extra-smal"
    },
    {
      "id": "e6442caa6d1b",
      "title": "Rabiot, what numbers! The irreplaceable leader of Allegri's Milan",
      "url": "https://www.milannews.it/primo-piano/rabiot-che-numeri-il-leader-insostituibile-del-milan-di-allegri-606753",
      "source": "milannews.it",
      "date": "2026-02-08T11:00:47+00:00",
      "summary": "Is what we are seeing at Milan the best Rabiot ever? Adrien himself answered this question on Tuesday after the 3-0 defeat of the Devil at Bologna, confirming that he felt very good, but explained ..."
    },
    {
      "id": "0bf4796891e6",
      "title": "Serie A Women, the official lineups of Roma-Milan",
      "url": "https://www.milannews.it/milan-femminile/serie-a-femminile-le-formazioni-ufficiali-di-roma-milan-606756",
      "source": "milannews.it",
      "date": "2026-02-08T10:48:40+00:00",
      "summary": "These are the official lineups for Roma-Milan, a match valid for the 13th matchday of the Women's Serie A scheduled today at 12.30:\n\nROME: Bald, Heatley, Viens, Csiki, Giugliano, Dragoni, Oladipo, Greggi, Bergamaschi, Thogersen, Babajid."
    },
    {
      "id": "75c4dc105c21",
      "title": "GdS: Milan expected to have key duo back against Pisa – the latest from the treatment room",
      "url": "https://sempremilan.com/milan-saelemaekers-pulisic-pisa-treatment-room",
      "source": "sempremilan.com",
      "date": "2026-02-08T10:40:00+00:00",
      "summary": "AC Milan do not return to action until Friday night against Pisa, but information is emerging on the conditions of certain players. After Tuesday’s win against Bologna and a recovery session the next day, Massimiliano Allegri gave his players some rest. Milan will not play this weekend, as the match"
    },
    {
      "id": "85fa61a5e209",
      "title": "A month until the Milan derby: the Milan and Inter calendars compared",
      "url": "https://www.milannews.it/news/un-mese-al-derby-di-milano-i-calendari-di-milan-e-inter-a-confronto-606752",
      "source": "milannews.it",
      "date": "2026-02-08T10:36:59+00:00",
      "summary": "The Milan derby scheduled in a month will say a lot, but the previous weeks could also be very important in the championship fight between Milan and Inter, currently separated in the standings by five points."
    },
    {
      "id": "d52054d7ae01",
      "title": "Footmercato: Vlahovic aware crucial decision awaits as Milan pitch project – the competition",
      "url": "https://sempremilan.com/vlahovic-crucial-decision-milan-chelsea-barcelona",
      "source": "sempremilan.com",
      "date": "2026-02-08T10:15:00+00:00",
      "summary": "Dusan Vlahovic is heading towards a free transfer in the summer, but his destination remains a mystery at this point. Footmercato report that Vlahović was no longer certain about continuing his adventure with Juventus even last year.At the end of August, the striker’s situation had taken a ‘major tu"
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "ec05173dcf11",
      "title": "‘I want to thank Milan’ – Baresi reflects on recovery after proud Olympic moment",
      "url": "https://sempremilan.com/baresi-reflects-recovery-milan-olympic",
      "source": "sempremilan.com",
      "date": "2026-02-08T09:50:00+00:00",
      "summary": "There was an emotional moment for Franco Baresi as he was a torchbearer at San Siro for the Milan Cortina 2026 Winter Olympics. Back in August, an official statement was posted on the club’s website: “AC Milan announces that, following routine medical checks, our Honorary Vice President Franco Bares"
    },
    {
      "id": "4bfa5151bba5",
      "title": "Reports: Alex Jimenez’s permanent Bournemouth move sealed – the terms and figures",
      "url": "https://sempremilan.com/alex-jimenez-permanent-bournemouth-terms-figures",
      "source": "sempremilan.com",
      "date": "2026-02-08T09:25:00+00:00",
      "summary": "Alex Jimenez is by all intents and purposes now officially a Bournemouth player on a permanent basis, reports claim. Just when it looked like Jimenez would remain to be part of Massimiliano Allegri’s plans, Milan made the decision in the summer to allow him to join Bournemouth on an initial loan dea"
    },
    {
      "id": "0338895b77fd",
      "title": "GdS: ‘Max the magician’ – how a ‘new Milan’ has been created through acquisitions",
      "url": "https://sempremilan.com/max-magician-new-milan-created-acquisitions",
      "source": "sempremilan.com",
      "date": "2026-02-08T09:00:00+00:00",
      "summary": "AC Milan’s summer transfer window has divided opinion in the months that follow, but now there are obvious green shoots. As La Gazzetta dello Sport (seen below) report, the mercato often plays out in a league of its own as big signings fail while low-cost acquisitions that prove to be hugely impactf"
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "b7bcbeaf716f",
      "title": "Di Stefano explains difference with Allegri as Pioli also ‘wanted to win 1-0’",
      "url": "https://sempremilan.com/di-stefano-difference-allegri-pioli-win-1-0",
      "source": "sempremilan.com",
      "date": "2026-02-07T19:22:07+00:00",
      "summary": "Peppe Di Stefano has shared an interesting background on the difference between Stefano Pioli and Massimiliano Allegri, with the latter opting to do things fully his way.  Pioli achieved a lot of success during his five-year spell at the club, winning the Scudetto in 2021-22 and reaching the Champio"
    },
    {
      "id": "37d5a6207d9a",
      "title": "‘We are almost there’ – Gimenez fuels idea of early return with positive message",
      "url": "https://sempremilan.com/almost-gimenez-fuels-idea-early-return",
      "source": "sempremilan.com",
      "date": "2026-02-07T18:49:39+00:00",
      "summary": "Santiago Gimenez has sent a positive message to the AC Milan fans, stating that it’s not long before he will be back on the pitch.  The Mexican striker has been on the sidelines since the end of October, when it was decided that he would stop to try to recover from an ankle injury. In […]\nThe post ‘"
    },
    {
      "id": "58ea8db069af",
      "title": "Opinions, latest news, match results and more: Subscribe to our free weekly newsletter",
      "url": "https://sempremilan.com/opinion-news-subscribe-free-weekly-newsletter",
      "source": "sempremilan.com",
      "date": "2026-02-07T18:01:06+00:00",
      "summary": "Every week, Oliver and Isak of the SempreMilan team send out a newsletter to keep you posted on all things AC Milan, from the latest match results to news and interesting stories.  In this day and age, it can be incredibly difficult to keep up with everything that happens around a football team. We "
    },
    {
      "id": "2df72e7dae81",
      "title": "Road to the derby: A look at Milan and Inter’s fixtures before the big clash",
      "url": "https://sempremilan.com/road-derby-milan-inters-fixtures-before",
      "source": "sempremilan.com",
      "date": "2026-02-07T17:40:00+00:00",
      "summary": "Just four matchdays remain before the big Derby della Madonnina clash between AC Milan and Inter. With only five points separating the teams still, it’s possible that the game could decide a whole lot.  Considering that Milan have been able to keep up with Inter so far, sort of, the Scudetto race is"
    },
    {
      "id": "042089288980",
      "title": "GdS: Criticism partially put to bed after successful January for Milan’s signings",
      "url": "https://sempremilan.com/gds-criticism-partially-bed-january-milan",
      "source": "sempremilan.com",
      "date": "2026-02-07T17:05:56+00:00",
      "summary": "AC Milan are starting to benefit from their summer and winter signings, as highlighted by a report, after six months that were filled with hefty criticism.  As Gazzetta dello Sport points out, the comments from fans and pundits are much less harsh than they used to be, while the criticism is pretty "
    },
    {
      "id": "3f5d1fdc4a7b",
      "title": "How Cardinale and De Laurentiis want to rescue Serie A’s TV rights",
      "url": "https://sempremilan.com/how-cardinale-rescue-seriea-tv-rights",
      "source": "sempremilan.com",
      "date": "2026-02-07T16:30:04+00:00",
      "summary": "If you ask 100 people what the main problem with Serie A is, I think an overwhelming majority would say the TV rights revenue. While it risks becoming a scapegoat to explain all of the league’s problems (not a healthy mindset), it’s hard to argue against its importance. So, how do you fix it? Gerry "
    },
    {
      "id": "f258db7cc381",
      "title": "Baresi says ‘my legs were shaking’ during torch duties at Olympics inauguration",
      "url": "https://sempremilan.com/baresi-legs-shaking-torch-duties-olympics",
      "source": "sempremilan.com",
      "date": "2026-02-07T15:59:02+00:00",
      "summary": "Franco Baresi was one of the torchbearers at the inauguration of the Winter Olympics at San Siro yesterday. As he revealed afterwards, it was an experience that he will never forget.  The Winter Olympics are underway in Milano-Cortina and yesterday, the inauguration was held at San Siro. It is preci"
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    },
    {
      "id": "0bbe5dfeba4c",
      "title": "Milan vs. Como postponed for 2026 Winter Olympics opening ceremony: when will it be played?",
      "url": "https://football-italia.net/milan-vs-como-postponed-2026-olympics-when/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:59:54+00:00",
      "summary": "With the Stadio Meazza in San Siro unavailable for the 2026 Winter Olympics opening ceremony,..."
    },
    {
      "id": "7c148df4d4cd",
      "title": "Glasner opens up on Mateta’s failed Milan medical: ‘It wasn’t a big surprise’",
      "url": "https://football-italia.net/glasner-on-matetas-failed-milan-medical/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:55:13+00:00",
      "summary": "Crystal Palace head coach Oliver Glasner has admitted that ‘it wasn’t a big big surprise’..."
    },
    {
      "id": "c10c6a922ef6",
      "title": "San Siro’s last dance at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/san-siro-last-dance-winter-olympics-ceremony/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:23:58+00:00",
      "summary": "The opening ceremony of the 2026 Milan Cortina Winter Olympics will take place today at..."
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    },
    {
      "id": "b17892f94874",
      "title": "Hazard: ‘I was a Milan fan’, ‘special’ relationship with Sarri, but Mourinho the best",
      "url": "https://football-italia.net/hazard-milan-fan-sarri-special-mourinho-best/",
      "source": "football-italia.net",
      "date": "2026-02-05T10:54:34+00:00",
      "summary": "Former Belgian star Eden Hazard reveals he was a Milan fan as a kid and..."
    },
    {
      "id": "f86a3c2aa1e5",
      "title": "Del Piero: Juventus ‘must’ have title belief, but avoids Yildiz comparison",
      "url": "https://football-italia.net/del-piero-juventus-title-no-yildiz-comparison/",
      "source": "football-italia.net",
      "date": "2026-02-05T09:35:42+00:00",
      "summary": "Juventus legend Alessandro Del Piero feels the Bianconeri can still aim for the Serie A..."
    },
    {
      "id": "a5543b121859",
      "title": "Marotta: ‘Inter approve of rotation, Milan have an advantage for Scudetto’",
      "url": "https://football-italia.net/marotta-inter-approve-rotation-milan-advantage/",
      "source": "football-italia.net",
      "date": "2026-02-04T19:52:47+00:00",
      "summary": "Inter President Beppe Marotta backs the squad rotation for the Coppa Italia quarter-final with Torino..."
    },
    {
      "id": "9de86510452c",
      "title": "Why Inter vs. Torino Coppa Italia clash moved for 2026 Winter Olympics",
      "url": "https://football-italia.net/why-inter-vs-torino-coppa-italia-clash-moved/",
      "source": "football-italia.net",
      "date": "2026-02-04T17:23:22+00:00",
      "summary": "Tonight’s Coppa Italia quarter-final is technically Inter hosting Torino, but the 2026 Winter Olympics mean..."
    },
    {
      "id": "d1ee46184128",
      "title": "Milan eyeing Italy striker for summer transfer window but unwilling to spend €62m",
      "url": "https://football-italia.net/milan-eyeing-italy-striker-for-summer/",
      "source": "football-italia.net",
      "date": "2026-02-04T16:31:09+00:00",
      "summary": "Wednesday’s reports claim that Milan are eyeing a potential move for Italy international Moise Kean..."
    },
    {
      "id": "2b1e8827ad38",
      "title": "Capello analyses Milan’s 3-0 win over Bologna: ‘Foolish not to consider the Scudetto’",
      "url": "https://football-italia.net/capello-analyses-milans-3-0-win-over-bologna/",
      "source": "football-italia.net",
      "date": "2026-02-04T12:42:25+00:00",
      "summary": "Fabio Capello has had his say on Milan’s recent 3-0 victory over Bologna in Serie..."
    },
    {
      "id": "b268dce71cdf",
      "title": "Today’s Papers – Milan impress in Bologna, Yildiz extends with Juventus",
      "url": "https://football-italia.net/todays-papers-milan-impress-in-bologna-yildiz-extends-with-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-04T08:29:55+00:00",
      "summary": "La Gazzetta dello Sport “What the Devil!” Milan overwhelm Bologna (3-0) and remain five points..."
    },
    {
      "id": "a7d106533e6a",
      "title": "Allegri: ‘Important to reach 50 points, but Milan have to do better’",
      "url": "https://football-italia.net/allegri-important-for-milan-to-reach-50-points/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:52:34+00:00",
      "summary": "Massimiliano Allegri believes that there is still room for improvement for his Milan side, despite..."
    }
  ]
}