{
  "lastUpdated": "2026-02-18T10:42:39.173319+00:00",
  "articles": [
    {
      "id": "82b74bc659f8",
      "title": "GdS: Predicted XIs for AC Milan vs. Como – changes in each department",
      "url": "https://sempremilan.com/predicted-xis-milan-como-changes-department",
      "source": "sempremilan.com",
      "date": "2026-02-18T10:40:00+00:00",
      "summary": "AC Milan will play at San Siro for the first time in 31 days tonight as they welcome Lombardy neighbours Como. There is a lot of intrigue surrounding this game for a couple of reasons. Firstly, Milan’s 3-1 against Como last month sparked a debate about style of play versus getting results, with Cesc"
    },
    {
      "id": "233b69bbf5c5",
      "title": "Jimenez and Pobega redeemed: around 20 million euros in Milan's coffers",
      "url": "https://www.milannews.it/calciomercato-milan/riscatti-jimenez-e-pobega-nelle-casse-del-milan-circa-20-milioni-di-euro-607844",
      "source": "milannews.it",
      "date": "2026-02-18T10:30:52+00:00",
      "summary": "Today Bologna announced the redemption of Tommaso Pobega, while about ten days ago Bournemouth became obliged to buy Alex Jimenez."
    },
    {
      "id": "5d08f85dedac",
      "title": "Pellegatti harsh: \"Scaroni says he must learn from Marotta, but it has always been the AC Milan presidents who teach\"",
      "url": "https://www.milannews.it/news/pellegatti-duro-scaroni-dice-che-deve-imparare-da-marotta-ma-da-sempre-sono-i-presidenti-del-milan-che-insegnano-607779",
      "source": "milannews.it",
      "date": "2026-02-18T10:20:00+00:00",
      "summary": "In his YouTube channel, Carlo Pellegatti commented on an excerpt of president Paolo Scaroni's statements made at the Lega Serie A Assembly, specifically when he says \"I have to take football lessons from Marotta every day&q ..."
    },
    {
      "id": "7044dcedc704",
      "title": "Tuttosport: Ricci and Jashari in line for big chance vs. Como – why Allegri will pick them",
      "url": "https://sempremilan.com/ricci-jashari-big-chance-como-why",
      "source": "sempremilan.com",
      "date": "2026-02-18T10:15:00+00:00",
      "summary": "Massimiliano Allegri will be forced to make changes tonight against Como, and appears to have finally settled on his line-up. As Tuttosport (via MilanNews) report this morning, the most significant change will be in midfield, with a significant absence: Adrien Rabiot. The Frenchman was handed a one-"
    },
    {
      "id": "2b34422a43ee",
      "title": "Amoroso: \"I dreamed of playing for Milan. I grew up with Van Basten's goals and Savicevic's magic\"",
      "url": "https://www.milannews.it/gli-ex/amoroso-sognavo-di-giocare-nel-milan-sono-cresciuto-con-i-gol-di-van-basten-e-le-magie-di-savicevic-607830",
      "source": "milannews.it",
      "date": "2026-02-18T10:10:04+00:00",
      "summary": "Marcio Amoroso, former striker of, among others, Udinese and Milan, spoke to the Gazzetta dello Sport about his experience with the Rossoneri: \"It was the winter of 2006, before the World Cup in Germany."
    },
    {
      "id": "286b747409e0",
      "title": "Milan, De Winter returns to the starting lineup against Como: rest time for Gabbia",
      "url": "https://www.milannews.it/news/milan-de-winter-torna-titolare-contro-il-como-turno-di-riposo-per-gabbia-607822",
      "source": "milannews.it",
      "date": "2026-02-18T10:00:15+00:00",
      "summary": "Compared to Friday in Pisa, Massimiliano Allegri should also change something in defence, where, as today's edition of the Gazzetta dello Sport reports this morning, Koni De Winter should give Matteo Gabbia a bit of rest at coach ..."
    },
    {
      "id": "4a89cd0e7212",
      "title": "Official: Tommaso Pobega completes full AC Milan exit as Bologna confirm permanent deal",
      "url": "https://sempremilan.com/official-pobega-bologna-milan-permanent-deal",
      "source": "sempremilan.com",
      "date": "2026-02-18T09:50:00+00:00",
      "summary": "Tommaso Pobega’s loan spell at Bologna has been turned into a permanent one after various clauses were triggered, it has been confirmed. After the winter window closed, Alex Jimenez’s move to AFC Bournemouth from Milan was turned from a loan into a permanent deal, both clubs recently confirmed. The "
    },
    {
      "id": "9439d82488f7",
      "title": "Bologna redeemed Pobega: here's how much Milan collects",
      "url": "https://www.milannews.it/calciomercato-milan/il-bologna-ha-riscattato-pobega-ecco-quanto-incassa-il-milan-607843",
      "source": "milannews.it",
      "date": "2026-02-18T09:48:22+00:00",
      "summary": "Bologna have announced that they have bought out Tommaso Pobega from Milan who, as reported by Gianluca Di Marzio on his website, collects seven million euros, a figure established last summer for the redemption obligation which is added to the million ..."
    },
    {
      "id": "37a5a5d7148e",
      "title": "Milan returns to San Siro after a month: 75 thousand spectators expected",
      "url": "https://www.milannews.it/news/il-milan-torna-a-san-siro-dopo-un-mese-attesi-75-mila-spettatori-607823",
      "source": "milannews.it",
      "date": "2026-02-18T09:38:58+00:00",
      "summary": "Exactly a month after the last time, Milan will finally return to play at San Siro tonight in front of their fans who will be present again: for the recovery of the 24th matchday against Como, the Milanese stadium will ..."
    },
    {
      "id": "47a3a780ae92",
      "title": "Milan, no distractions. Repubblica: \"Allegri avoids the case: I have blinders on\"",
      "url": "https://www.milannews.it/news/milan-niente-distrazioni-repubblica-allegri-dribbla-il-caso-ho-i-paraocchi-607825",
      "source": "milannews.it",
      "date": "2026-02-18T09:28:01+00:00",
      "summary": "Repubblica on newsstands this morning with the following headline in view of this evening's Milan-Como: \"Allegri avoids the case: I have blinders on\"."
    },
    {
      "id": "090f0698a925",
      "title": "OFFICIAL: Bologna have redeemed Tommaso Pobega",
      "url": "https://www.milannews.it/calciomercato-milan/ufficiale-il-bologna-ha-riscattato-tommaso-pobega-607841",
      "source": "milannews.it",
      "date": "2026-02-18T09:25:35+00:00",
      "summary": "Tommaso Pobega is officially a player owned by Bologna who bought him from Milan."
    },
    {
      "id": "326b4faa031d",
      "title": "GdS: Milan playing for their Scudetto dream – Allegri’s plan to take Como down again",
      "url": "https://sempremilan.com/milan-playing-scudetto-dream-allegri-como",
      "source": "sempremilan.com",
      "date": "2026-02-18T09:25:00+00:00",
      "summary": "After doubts for months about when and even where the game would be played, AC Milan will finally host Como at San Siro tonight. As La Gazzetta dello Sport (seen below) write this morning, in other eras you might have thought it was a classic David versus Goliath showdown. In reality, Como are now c"
    },
    {
      "id": "a9849376556c",
      "title": "Towards Como: Saelemaekers is recovered, but Athekame is still on the right from 1'",
      "url": "https://www.milannews.it/news/verso-il-como-saelemaekers-e-recuperato-ma-a-destra-c-e-ancora-athekame-da-1-607821",
      "source": "milannews.it",
      "date": "2026-02-18T09:18:27+00:00",
      "summary": "Alexis Saelemaekers, absent in the last two matches against Bologna and Pisa due to an adductor problem, has recovered from his muscle injury and is back at Max Allegri's disposal."
    },
    {
      "id": "f5ba944f0536",
      "title": "Serie A: Milan vs. Como – Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-milan-vs-como-probable-line-ups/",
      "source": "football-italia.net",
      "date": "2026-02-18T09:16:33+00:00",
      "summary": "Milan will be without several of their key first team players when they take on..."
    },
    {
      "id": "c11d525e3cb6",
      "title": "Milan, Leao is back from the 1st minute: Rafa looking for a goal that he has been missing for a month and a half",
      "url": "https://www.milannews.it/primo-piano/milan-riecco-leao-dal-1-rafa-a-caccia-di-un-gol-che-gli-manca-da-un-mese-e-mezzo-607829",
      "source": "milannews.it",
      "date": "2026-02-18T09:08:14+00:00",
      "summary": "At the moment, the person who is certain of having a starting place in the Milan attack which will challenge Como at San Siro this evening in the second half of the 24th matchday of Serie A is Ruben Loftus-Cheek, who will be confirmed in that role by ..."
    },
    {
      "id": "b9340c59d91e",
      "title": "Correct score odds Milan Como",
      "url": "https://www.milannews.it/scommesse/pronostici/quote-risultato-esatto-milan-como-607747",
      "source": "milannews.it",
      "date": "2026-02-18T09:00:00+00:00",
      "summary": "Milan will play against Como for the second half of the 24th matchday of Serie A."
    },
    {
      "id": "0ec14d34c804",
      "title": "Gallery: ‘Scudetto dream on the line’, ‘Objective -5’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/front-pages-18-february-milan-como",
      "source": "sempremilan.com",
      "date": "2026-02-18T09:00:00+00:00",
      "summary": "It has been one month since AC Milan last played a home league game, but they are back under the San Siro lights tonight to face Como. Milan made it consecutive away wins on Friday night against Pisa, but they were forced to fight right until the final whistle in an eventual 2-1 victory. Inter then "
    },
    {
      "id": "b59308087210",
      "title": "Tuttosport and Allegri's choices: \"Ricci for Rabiot. Jashari warms up\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-e-le-scelte-di-allegri-ricci-per-rabiot-si-scalda-jashari-607811",
      "source": "milannews.it",
      "date": "2026-02-18T08:49:21+00:00",
      "summary": "\"Ricci for Rabiot. Jashari warms up\": this is the headline from Tuttosport this morning regarding Max Allegri's probable lineup choices for his Milan's match this evening against Como at San Siro."
    },
    {
      "id": "ed6019a079ac",
      "title": "Tonight Milan hosts Como. CorSport: \"Ricci is there with Jashari on pole\"",
      "url": "https://www.milannews.it/rassegna-stampa/stasera-il-milan-ospita-il-como-il-corsport-c-e-ricci-con-jashari-in-pole-607801",
      "source": "milannews.it",
      "date": "2026-02-18T08:40:00+00:00",
      "summary": "Everything is ready for the match between Milan and Como, scheduled for tonight at San Siro. But what will Massimiliano Allegri's training choices be? CorSport headlines about it: \"Ricci is there with Jashari on pole\"."
    },
    {
      "id": "88e05da709e9",
      "title": "Today’s Papers: An historic Juve blunder, Galagoal, Bastoni apology",
      "url": "https://football-italia.net/today-papers-historic-juve-blunder-galagoal/",
      "source": "football-italia.net",
      "date": "2026-02-18T08:37:44+00:00",
      "summary": "La Gazzetta dello Sport  Not like that  An historic gaffe in the Champions League Bremer..."
    },
    {
      "id": "2d4ae0f8aab6",
      "title": "Towards Milan-Como: the probable lineups of the two teams",
      "url": "https://www.milannews.it/rassegna-stampa/verso-milan-como-le-probabili-formazioni-delle-due-squadre-607809",
      "source": "milannews.it",
      "date": "2026-02-18T08:29:05+00:00",
      "summary": "These, according to La Gazzetta dello Sport, are the probable lineups of Milan and Como for this evening's match at San Siro: \n\nMILAN: (3-5-2) Maignan; Tomori, De Winter, Pavlovic; Athekame, Jashari, Modric, Ricci, Bartesaghi; Loftus-Cheek, Leao."
    },
    {
      "id": "e17db4e61dc6",
      "title": "Como arrives at San Siro. CorSera: \"Milan, win to stay in the wake\"",
      "url": "https://www.milannews.it/rassegna-stampa/a-san-siro-arriva-il-como-corsera-milan-vincere-per-restare-in-scia-607806",
      "source": "milannews.it",
      "date": "2026-02-18T08:19:35+00:00",
      "summary": "In view of tonight's recovery at San Siro against Como, today's edition of Corriere della Sera has the headline: \"Milan, win to stay in the lead\"."
    },
    {
      "id": "431d7362ab12",
      "title": "Milan, Leao returns to the starting lineup against Como? Loftus-Cheek will be with him",
      "url": "https://www.milannews.it/rassegna-stampa/milan-leao-torna-titolare-contro-il-como-con-lui-ci-sara-loftus-cheek-607808",
      "source": "milannews.it",
      "date": "2026-02-18T08:09:12+00:00",
      "summary": "For the third game in a row, Massimiliano Allegri seems intent on deploying Ruben Loftus-Cheek in attack."
    },
    {
      "id": "2c040080de55",
      "title": "Milan Como goalscorer odds",
      "url": "https://www.milannews.it/scommesse/pronostici/milan-como-quote-marcatore-607742",
      "source": "milannews.it",
      "date": "2026-02-18T08:00:42+00:00",
      "summary": "Milan will play against Como in the second half of the 24th matchday of Serie A. The Rossoneri won with difficulty in Pisa in the previous round, remaining in the wake of Inter."
    },
    {
      "id": "7ae648dc26ce",
      "title": "CorSport towards Milan-Como: \"Leao for -5\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-corsport-verso-milan-como-leao-per-il-5-607800",
      "source": "milannews.it",
      "date": "2026-02-18T07:50:00+00:00",
      "summary": "Tonight Milan returns to the field against Como in a match of vital importance. Today's edition of Corriere dello Sport talks about it extensively, with the headline: \"Leao for -5\"."
    },
    {
      "id": "ca7358adcf21",
      "title": "Gazzetta: \"Milan, you're risking your dream. The Scudetto race passed by Como\"",
      "url": "https://www.milannews.it/rassegna-stampa/gazzetta-milan-ti-giochi-il-sogno-la-corsa-scudetto-passata-dal-como-607802",
      "source": "milannews.it",
      "date": "2026-02-18T07:40:39+00:00",
      "summary": "The Gazzetta dello Sport on newsstands this morning has the headline: \"Milan, you're losing your dream. The Scudetto race passed by Como\"."
    },
    {
      "id": "e466b402f5d4",
      "title": "Tuttosport opens with Allegri's words towards Como: \"Poisons distract. Milan, just focus on us\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-apre-con-le-parole-di-allegri-verso-il-como-i-veleni-distraggono-milan-testa-solo-a-noi-607799",
      "source": "milannews.it",
      "date": "2026-02-18T07:30:09+00:00",
      "summary": "\"Poisons distract. Milan, focus only on us\": today's edition of Tuttosport opens with these words on the front page of Max Allegri."
    },
    {
      "id": "2be7c9561fb8",
      "title": "MN: Predicted Milan XI to face Como – Leao returns to starting XI as Allegri trials new midfield",
      "url": "https://sempremilan.com/predicted-milan-xi-face-como-leao-returns",
      "source": "sempremilan.com",
      "date": "2026-02-17T19:30:00+00:00",
      "summary": "AC Milan manager Massimiliano Allegri is expected to make a number of changes to his starting XI to face Como on Wednesday night.  With Adrien Rabiot out, it was impossible that Allegri would go unchanged for this game. However, most would not have expected the number of changes that the Italian is "
    },
    {
      "id": "abe57cceabd3",
      "title": "Fabregas discusses previous Milan links and revenge after reverse fixture: “Not ready to win the Scudetto”",
      "url": "https://sempremilan.com/fabregas-previous-milan-links-revenge-fixture",
      "source": "sempremilan.com",
      "date": "2026-02-17T19:00:00+00:00",
      "summary": "Cesc Fabregas will hope to get one back on AC Milan after his Como side were beaten 3-1 earlier in the season. He hopes things go differently at San Siro tomorrow.  It is understandable why Fabregas is considered to be one of the brightest new coaches in European football currently. He holds a lot o"
    },
    {
      "id": "64642d1e16e0",
      "title": "Moretto: Camarda’s future ‘remains to be seen’ – Milan could consider ‘permanent deal’",
      "url": "https://sempremilan.com/camarda-future-milan-could-consider-permanent-deal",
      "source": "sempremilan.com",
      "date": "2026-02-17T18:25:12+00:00",
      "summary": "It seemed that Francesco Camarda could have been the heir to AC Milan’s striker spot, but this may not be the case anymore.  There can be no denying that Camarda has had it tough in recent years. The youngster shot onto the scene after an impressive youth career, making his debut at just 15 years […"
    },
    {
      "id": "6a8e6e18e30b",
      "title": "Serie A preview: AC Milan vs. Como – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-ac-milan-como-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-17T18:00:00+00:00",
      "summary": "AC Milan have a rare midweek fixture to contest on Wednesday night, as they welcome Como to San Siro for a rescheduled game. The match was originally meant to be played the weekend before last, but was moved due to the Winter Olympic opening ceremony causing a clash at San Siro. Nonetheless, it is a"
    },
    {
      "id": "e7b3cce9b801",
      "title": "CM: Allegri could revert Milan to 4-3-3 when Leao and Pulisic return – the idea",
      "url": "https://sempremilan.com/allegri-revert-milan-433-leao-pulisic-return",
      "source": "sempremilan.com",
      "date": "2026-02-17T17:30:00+00:00",
      "summary": "With Christian Pulisic and Rafael Leao returning, AC Milan have a much healthier-looking front line. As a result, they could be used in their more natural positions again. The idea to play a 4-3-3 with Milan was there from the start for Massimiliano Allegri. In fact, he actually started with the for"
    },
    {
      "id": "9c6f67289b8c",
      "title": "Allegri addresses idea of Fabregas rivalry and dig from Como fans: “Results through performances”",
      "url": "https://sempremilan.com/allegri-addresses-idea-fabregas-rivalry-como-dig",
      "source": "sempremilan.com",
      "date": "2026-02-17T17:00:00+00:00",
      "summary": "There has been a bit of a spat between Como and AC Milan manager Massimiliano Allegri since their meeting earlier this season.  Before the first game between the sides, Cesc Fabregas and Allegri were quite complimentary to one another, appreciating the work of the other and celebrating their work th"
    },
    {
      "id": "dc689886e878",
      "title": "Sporting Judge: Rabiot’s suspension confirmed and Igli Tare fined €10,000",
      "url": "https://sempremilan.com/rabiot-suspension-confirmed-tare-fined-10k",
      "source": "sempremilan.com",
      "date": "2026-02-17T16:30:00+00:00",
      "summary": "After the conclusion of the latest round of Serie A action, the Sports Judge has reviewed the weekend and AC Milan have received another fine. It was certainly not the worst weekend for Milan, as they managed to beat Pisa 2-1 away from home. A first win of the season against one of the new […]\nThe p"
    },
    {
      "id": "10bb032e69e7",
      "title": "Opposition insight for Milan-Como: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-milan-como-form-predicted-xi",
      "source": "sempremilan.com",
      "date": "2026-02-17T16:00:00+00:00",
      "summary": "AC Milan face Como for the second time in less than five weeks at San Siro on Wednesday night, hoping to do another double over them. Originally the game was planned to be played in Australia because of the Winter Olympic opening ceremony causing a clash at San Siro. However, that plan was thankfull"
    },
    {
      "id": "bb5d6100ee66",
      "title": "SempreMilan Podcast: Episode 401 – Livin’ La Pisa Luka",
      "url": "https://sempremilan.com/sempremilan-podcast-episode-401-livin-la-pisa-luka",
      "source": "sempremilan.com",
      "date": "2026-02-17T15:30:00+00:00",
      "summary": "Join Oli, Anthony and ‪BdairBall as they recap the narrow victory against Pisa, and preview two huge home games against Como and Parma. This week’s topics include… ↳ Modric to the rescue ↳ Allegri vs. Fabregas: The rematch ↳ Parma come to San Siro ↳ Worried about Pulisic? Want more Milan content? Ch"
    },
    {
      "id": "6baf7ae5df59",
      "title": "Report: Milan ‘likely to snub’ offers for Pulisic this summer with Premier League interest expected to rise",
      "url": "https://sempremilan.com/milan-likely-snub-offers-for-pulisic",
      "source": "sempremilan.com",
      "date": "2026-02-17T15:00:00+00:00",
      "summary": "Premier League clubs like Manchester United, Liverpool and Arsenal have all taken an interest in Christian Pulisic, but AC Milan are likely to reject any approaches. In the past few months, the reports regarding Pulisic’s future have mainly consisted of updates on a renewal at Milan. However, consid"
    },
    {
      "id": "8c4090acdbf6",
      "title": "GdS: 4000km and 30° – why Inter’s trip to Norway could influence the title race",
      "url": "https://sempremilan.com/why-inter-trip-to-norway-influence-title-race",
      "source": "sempremilan.com",
      "date": "2026-02-17T14:30:00+00:00",
      "summary": "This season, AC Milan have held hope for the Scudetto thanks to their scheduling, mainly. Now, that could come into play.  So far, Milan have not really had an advantage from a lack of Europe, or the regular cups. However, we are now in the infamous business end of the season, and this is where […]\n"
    },
    {
      "id": "6f0a372ca4ee",
      "title": "How much Milan will earn as Pobega completes permanent Bologna move",
      "url": "https://football-italia.net/milan-earn-pobega-permanent-bologna-move/",
      "source": "football-italia.net",
      "date": "2026-02-17T14:16:49+00:00",
      "summary": "Reports in Italy claim that Tommaso Pobega has formally joined Bologna on a permanent deal..."
    },
    {
      "id": "9e811f816382",
      "title": "Tuttosport: ‘Practically opposite’ – Allegri and Fabregas clash causes intrigue ahead of Milan-Como",
      "url": "https://sempremilan.com/allegri-fabregas-clash-intrigues-milan-como",
      "source": "sempremilan.com",
      "date": "2026-02-17T14:00:00+00:00",
      "summary": "AC Milan facing Como should be an interesting game, solely in terms of the table. However, it looks likely to be a decent clash tactically, too. As coaches go, it is difficult to find coaches further apart than Cesc Fabregas and Massimiliano Allegri. Even after the reverse fixture, the Spaniard was "
    },
    {
      "id": "185e6c8ca2a4",
      "title": "Allegri: Pulisic doubt for Milan, Inter ‘clear title favourites’",
      "url": "https://football-italia.net/allegri-pulisic-doubt-milan-inter-favourite/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:44:56+00:00",
      "summary": "Milan coach Massimiliano Allegri says Christian Pulisic is in doubt for tomorrow’s Serie A match..."
    },
    {
      "id": "9c881dea8c96",
      "title": "Kirovski explains why talented trio Dutu, Sia and Ibrahimovic Jr. left Milan: “The number one objective”",
      "url": "https://sempremilan.com/kirovski-explains-why-talented-trio-left-milan",
      "source": "sempremilan.com",
      "date": "2026-02-17T13:35:00+00:00",
      "summary": "In January, AC Milan parted with a number of young talents, including Maximilian Ibrahimovic, who has been around the first team for a few years.  It is nothing new for young players to be sold. After all, the academy cannot always produce first-team-level players, and when opportunities arise, it m"
    },
    {
      "id": "28770c59c3ab",
      "title": "Allegri weighs in on diving debate and asks for offside rule change",
      "url": "https://football-italia.net/allegri-weighs-in-on-diving-debate/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:28:16+00:00",
      "summary": "Massimiliano Allegri has had his say on the diving debate that has cropped up in..."
    },
    {
      "id": "04fdb1372c8f",
      "title": "Why Milan director Tare was fined after win over Pisa",
      "url": "https://football-italia.net/why-milan-director-tare-fined-after-win-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:12:36+00:00",
      "summary": "Milan director Igli Tare was fined €10,000 after the Rossoneri’s 2-1 win over Pisa on..."
    },
    {
      "id": "2773473df824",
      "title": "Report: Arsenal ready to trigger €50m clause to beat Milan to Real Madrid talent",
      "url": "https://sempremilan.com/arsenal-50m-milan-valdepenas-real-madrid",
      "source": "sempremilan.com",
      "date": "2026-02-17T13:10:00+00:00",
      "summary": "AC Milan face competition from Arsenal to land Real Madrid talent Victor Valdepenas, and they are apparently readying a big offer. Milan are always keeping an eye out on young talent around Europe, and Valdepeñas is the latest name from Real Madrid to enter their radar, after having previous signed "
    },
    {
      "id": "068c9b768450",
      "title": "Official: Juventus directors Comolli and Chiellini given lengthy bans after Derby d’Italia",
      "url": "https://football-italia.net/official-juventus-comolli-and-chiellini-banned/",
      "source": "football-italia.net",
      "date": "2026-02-17T12:58:31+00:00",
      "summary": "Juventus directors Damien Comolli and Giorgio Cheillini, plus players Pierre Kalulu, Nicolo Barella and Hakan..."
    },
    {
      "id": "bf894e517688",
      "title": "Marotta insists Milan and Inter have ‘excellent relationship’ and stresses importance of stadium",
      "url": "https://sempremilan.com/marotta-milan-inter-excellent-relationship-stadium",
      "source": "sempremilan.com",
      "date": "2026-02-17T12:45:00+00:00",
      "summary": "Inter president Giuseppe Marotta has reiterated that he and the club have a great relationship with AC Milan, and commented on the stadium project. The Nerazzurri have been at the centre of a storm since Saturday night’s game against Juventus at San Siro, which they won 3-2 in controversial circumst"
    },
    {
      "id": "825c7f4cae9c",
      "title": "Inter vs. Juventus refereeing upset Milan too – report",
      "url": "https://football-italia.net/inter-vs-juventus-refereeing-upset-milan-too/",
      "source": "football-italia.net",
      "date": "2026-02-16T14:46:52+00:00",
      "summary": "Corriere dello Sport reports that the officiating in Inter-Juventus did not infuriate the Bianconeri only,..."
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    }
  ]
}