{
  "lastUpdated": "2026-02-18T02:02:52.744849+00:00",
  "articles": [
    {
      "id": "ca02cb450db6",
      "title": "Pellegatti returns to Muntari: \"I don't agree with Max, if we beat Juve we would have won\"",
      "url": "https://www.milannews.it/news/pellegatti-ritorna-su-muntari-non-sono-d-accordo-con-max-battendo-la-juve-avremmo-vinto-noi-607773",
      "source": "milannews.it",
      "date": "2026-02-17T23:50:25+00:00",
      "summary": "In his YouTube channel, Carlo Pellegatti commented on Max Allegri's words released in the pre-match press conference of Milan-Como on Muntari's goal from way back in 2012."
    },
    {
      "id": "746888feab6a",
      "title": "MN - Cuomo: \"Inter-Juve? Allegri's communication strategy is right, also because at this moment it's better to stay \"buttoned up\"\"",
      "url": "https://www.milannews.it/news/mn-cuomo-inter-juve-la-strategia-comunicativa-di-allegri-e-giusta-anche-perche-in-questo-momento-meglio-stare-abbottonati-607754",
      "source": "milannews.it",
      "date": "2026-02-17T23:40:18+00:00",
      "summary": "Michael Cuomo of TeleLombardia spoke exclusively to the microphones of the MilanNews YouTube channel."
    },
    {
      "id": "d266a1ab56aa",
      "title": "Sabatini: \"I saw Leao really ill in person\" and Viviano relaunches: \"He's ill, it's obvious\"",
      "url": "https://www.milannews.it/news/sabatini-leao-l-ho-visto-veramente-male-dal-vivo-e-viviano-rilancia-sta-male-e-evidente-607772",
      "source": "milannews.it",
      "date": "2026-02-17T23:30:04+00:00",
      "summary": "During the last episode of the Cose Scomode podcast, there was an exchange of opinions between Sandro Sabatini and Viviano on Rafa Leao, a player who always causes discussion but who we all know has a muscular problem that does not allow him to ..."
    },
    {
      "id": "5f5f0bc30707",
      "title": "Among the objectives with Como is to beat a Milan record that has stood for more than 70 years",
      "url": "https://www.milannews.it/news/tra-gli-obiettivi-col-como-c-e-quello-di-battere-un-record-del-milan-che-dura-da-piu-di-70-anni-607677",
      "source": "milannews.it",
      "date": "2026-02-17T23:20:25+00:00",
      "summary": "Milan are unbeaten in 23 consecutive league matches (W15, D8) and in their history in Serie A they have only twice recorded a longer unbeaten streak in a single season: 24 matches between December 1950 and May 1951 and the ..."
    },
    {
      "id": "573a59e354ac",
      "title": "Viviano: \"I'm a gamer, but if I had to make Allegri look like an idiot, I would be the idiot\"",
      "url": "https://www.milannews.it/news/viviano-io-sono-giochista-ma-se-dovessi-fare-passare-allegri-per-un-coglione-il-coglione-sarei-io-607771",
      "source": "milannews.it",
      "date": "2026-02-17T23:10:25+00:00",
      "summary": "During the last episode of the Cose Scomode podcast, former goalkeeper Emiliano Viviano spoke like this about Allegri, Milan and the latest results:\n\n\"Milan has been surprising me a lot lately."
    },
    {
      "id": "c426b5fc06d2",
      "title": "Doctor Allegri and Mahanarayana Thailam oil. Gerry Cardinale's most effective showgirls. The President of Milan and football lessons. Happy Birthday, Milan!",
      "url": "https://www.milannews.it/editoriale/il-dottor-allegri-e-l-olio-mahanarayana-thailam-le-veline-piu-efficaci-di-gerry-cardinale-il-presidente-del-milan-e-le-lezioni-di-calcio-buon-complean-607769",
      "source": "milannews.it",
      "date": "2026-02-17T23:00:33+00:00",
      "summary": "A thousand thanks to Massimiliano Allegri. Well done to Igli Tare who chose him."
    },
    {
      "id": "158e2d4532b2",
      "title": "MN - Cuomo warns everyone: \"Milan-Como match was exasperated due to what the first leg was and what was created in Como...\"",
      "url": "https://www.milannews.it/news/mn-cuomo-mette-in-guardia-tutti-milan-como-partita-esasperata-per-quella-che-e-stata-l-andata-e-da-quello-che-si-e-creato-a-como-607759",
      "source": "milannews.it",
      "date": "2026-02-17T22:50:56+00:00",
      "summary": "Michael Cuomo of TeleLombardia spoke exclusively to the microphones of the MilanNews YouTube channel."
    },
    {
      "id": "6927fa315396",
      "title": "Bad scene in Benfica-Real: Vinicius leaves the pitch for 10 minutes due to alleged racist insults from Prestianni",
      "url": "https://www.milannews.it/news/brutta-scena-in-benfica-real-vinicius-abbandona-il-campo-10-minuti-per-presunti-insulti-razzisti-da-parte-di-prestianni-607782",
      "source": "milannews.it",
      "date": "2026-02-17T22:40:09+00:00",
      "summary": "Bad episode to report happened during the first leg of the play-offs played this evening between Benfica and Real Madrid."
    },
    {
      "id": "c602b2484699",
      "title": "Milan, another big match coming up. The Rossoneri, so far, are the best in terms of results and goals conceded against the big teams",
      "url": "https://www.milannews.it/news/milan-altro-big-match-in-arrivo-i-rossoneri-fino-ad-ora-sono-i-migliori-per-risultati-e-gol-subiti-contro-le-grandi-607684",
      "source": "milannews.it",
      "date": "2026-02-17T22:30:38+00:00",
      "summary": "No team has gained more points than Milan against teams currently in the top half of the Serie A table (25 in 11 matches, equal to Inter but in 12 matches), as well as being the best defense in these matches (six goals out of ..."
    },
    {
      "id": "3c72265203c1",
      "title": "Champions League, play-off first leg: all the results of the evening",
      "url": "https://www.milannews.it/news/champions-league-andata-play-off-tutti-i-risultati-della-serata-607768",
      "source": "milannews.it",
      "date": "2026-02-17T22:20:02+00:00",
      "summary": "After the first leg of the Champions League play-offs ended on Tuesday, the results of the evening are reported below."
    },
    {
      "id": "e92719ab2eb1",
      "title": "Champions League, Borussia Dortmund-Atalanta 2-0: Nerazzurri never in the match",
      "url": "https://www.milannews.it/news/champions-league-borussia-dortmund-atalanta-2-0-nerazzurri-mai-in-partita-607767",
      "source": "milannews.it",
      "date": "2026-02-17T22:10:06+00:00",
      "summary": "The first leg of the Champions League play-offs between Dortmund and Atalanta ends 2-0. Match postponed for 15 minutes due to the delay of the German bus in reaching the stadium."
    },
    {
      "id": "83e844221e3a",
      "title": "Como, Fabregas: \"We are young and not ready for the scudetto\"",
      "url": "https://www.milannews.it/l-avversario/como-fabregas-siamo-giovani-e-non-pronti-per-lo-scudetto-607764",
      "source": "milannews.it",
      "date": "2026-02-17T22:00:41+00:00",
      "summary": "(ANSA) - MILAN, FEBRUARY 17 - Cesc Fabregas is not making any dramas after the home defeat by Fiorentina and is already focused on tomorrow's match, against Massimiliano Allegri's Milan, a difficult match against a club that has ..."
    },
    {
      "id": "c03f65e43164",
      "title": "MN - Cuomo: \"Simulations? Footballers must not do like Parisi, Bastoni. They must not be complicit in mistakes\"",
      "url": "https://www.milannews.it/news/mn-cuomo-simulazioni-i-calciatori-non-devono-fare-come-parisi-bastoni-non-devono-essere-complici-di-errori-607758",
      "source": "milannews.it",
      "date": "2026-02-17T21:50:50+00:00",
      "summary": "Michael Cuomo of TeleLombardia spoke exclusively to the microphones of the MilanNews YouTube channel."
    },
    {
      "id": "ee32333334b0",
      "title": "Towards Milan-Como, Allegri: \"We will have to play an orderly match, with them you risk making a bad impression\"",
      "url": "https://www.milannews.it/news/verso-milan-como-allegri-dovremo-giocare-una-partita-ordinata-con-loro-rischi-di-fare-brutta-figura-607728",
      "source": "milannews.it",
      "date": "2026-02-17T21:40:00+00:00",
      "summary": "In view of the next championship match, Wednesday at San Siro against Como, Milan coach Massimiliano Allegri spoke like this in the press conference\n\nBelow is an excerpt of Massimiliano Alle's words..."
    },
    {
      "id": "687ab36e8793",
      "title": "Modric decisive in Pisa. What if he scored in two consecutive matches? It hasn't happened to him for six years",
      "url": "https://www.milannews.it/news/modric-decisivo-a-pisa-e-se-segnasse-in-due-match-consecutivi-non-gli-succede-da-sei-anni-607680",
      "source": "milannews.it",
      "date": "2026-02-17T21:30:13+00:00",
      "summary": "After the goal against Pisa in the most recent match, Luka Modric could score in two appearances in a row for only the third time in his career in the top five European leagues, after January 2019 and December 2020 (in both cases with ..."
    },
    {
      "id": "8433befd5dd8",
      "title": "Only Roma have gained fewer points than Como against the top 7 in the table. And it is the one that has scored the fewest goals",
      "url": "https://www.milannews.it/news/solo-la-roma-ha-guadagnato-meno-punti-del-como-contro-le-prime-7-della-classifica-ed-e-quella-che-ha-segnato-meno-gol-607683",
      "source": "milannews.it",
      "date": "2026-02-17T21:22:31+00:00",
      "summary": "Considering the direct clashes between the top seven teams currently in the Serie A standings, only Roma (five) have gained fewer points than Como (six in seven matches); the Larians are also the club to have scored the fewest goals (four) in these ..."
    },
    {
      "id": "1fbcaf5f3d9c",
      "title": "Former referee Tagliavento: \"This time it was Bastoni, Inter, other times the other teams. It's cunning behavior that all clubs use\"",
      "url": "https://www.milannews.it/news/l-ex-arbitro-tagliavento-questa-volta-e-stato-bastoni-l-inter-altre-volte-le-altre-squadre-e-un-comportamento-furbesco-che-utilizzano-tutte-le-societa-607693",
      "source": "milannews.it",
      "date": "2026-02-17T21:11:42+00:00",
      "summary": "Paolo Tagliavento, former referee, expressed himself to MilanVibes on the latest refereeing episodes."
    },
    {
      "id": "3413fa96845f",
      "title": "Milan, Allegri's assessment in March: \"The points we have today are the ones we deserve, in a month we will be able to have another discussion..\"",
      "url": "https://www.milannews.it/news/milan-il-bilancio-di-allegri-a-marzo-i-punti-che-abbiamo-oggi-sono-quelli-che-meritiamo-tra-un-mese-potremo-fare-un-altro-discorso-607727",
      "source": "milannews.it",
      "date": "2026-02-17T21:00:00+00:00",
      "summary": "In view of the next championship match, Wednesday at San Siro against Como, Milan coach Massimiliano Allegri spoke like this at the press conference."
    },
    {
      "id": "b5b5da09ed53",
      "title": "MN - Does Cuomo still believe in the championship? \"Tomorrow is an important crossroads, but I believe in the tricolor as much as before\"",
      "url": "https://www.milannews.it/news/mn-cuomo-crede-ancora-nello-scudetto-domani-crocevia-importante-ma-al-tricolore-ci-credo-tanto-quanto-prima-607757",
      "source": "milannews.it",
      "date": "2026-02-17T20:50:32+00:00",
      "summary": "Michael Cuomo of TeleLombardia spoke exclusively to the microphones of the MilanNews YouTube channel."
    },
    {
      "id": "108dedf8e28e",
      "title": "Milan are unbeaten in 14 consecutive matches against Como in Serie A",
      "url": "https://www.milannews.it/news/il-milan-e-imbattuto-da-14-sfide-consecutive-contro-il-como-in-serie-a-607675",
      "source": "milannews.it",
      "date": "2026-02-17T20:40:27+00:00",
      "summary": "Milan are unbeaten in 14 consecutive matches against Como in Serie A (W9, D5), winning all of their last five matches against the Como side with an aggregate score of 11-4. Opta reports it."
    },
    {
      "id": "2be7c9561fb8",
      "title": "MN: Predicted Milan XI to face Como – Leao returns to starting XI as Allegri trials new midfield",
      "url": "https://sempremilan.com/predicted-milan-xi-face-como-leao-returns",
      "source": "sempremilan.com",
      "date": "2026-02-17T19:30:00+00:00",
      "summary": "AC Milan manager Massimiliano Allegri is expected to make a number of changes to his starting XI to face Como on Wednesday night.  With Adrien Rabiot out, it was impossible that Allegri would go unchanged for this game. However, most would not have expected the number of changes that the Italian is "
    },
    {
      "id": "abe57cceabd3",
      "title": "Fabregas discusses previous Milan links and revenge after reverse fixture: “Not ready to win the Scudetto”",
      "url": "https://sempremilan.com/fabregas-previous-milan-links-revenge-fixture",
      "source": "sempremilan.com",
      "date": "2026-02-17T19:00:00+00:00",
      "summary": "Cesc Fabregas will hope to get one back on AC Milan after his Como side were beaten 3-1 earlier in the season. He hopes things go differently at San Siro tomorrow.  It is understandable why Fabregas is considered to be one of the brightest new coaches in European football currently. He holds a lot o"
    },
    {
      "id": "64642d1e16e0",
      "title": "Moretto: Camarda’s future ‘remains to be seen’ – Milan could consider ‘permanent deal’",
      "url": "https://sempremilan.com/camarda-future-milan-could-consider-permanent-deal",
      "source": "sempremilan.com",
      "date": "2026-02-17T18:25:12+00:00",
      "summary": "It seemed that Francesco Camarda could have been the heir to AC Milan’s striker spot, but this may not be the case anymore.  There can be no denying that Camarda has had it tough in recent years. The youngster shot onto the scene after an impressive youth career, making his debut at just 15 years […"
    },
    {
      "id": "6a8e6e18e30b",
      "title": "Serie A preview: AC Milan vs. Como – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-ac-milan-como-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-17T18:00:00+00:00",
      "summary": "AC Milan have a rare midweek fixture to contest on Wednesday night, as they welcome Como to San Siro for a rescheduled game. The match was originally meant to be played the weekend before last, but was moved due to the Winter Olympic opening ceremony causing a clash at San Siro. Nonetheless, it is a"
    },
    {
      "id": "e7b3cce9b801",
      "title": "CM: Allegri could revert Milan to 4-3-3 when Leao and Pulisic return – the idea",
      "url": "https://sempremilan.com/allegri-revert-milan-433-leao-pulisic-return",
      "source": "sempremilan.com",
      "date": "2026-02-17T17:30:00+00:00",
      "summary": "With Christian Pulisic and Rafael Leao returning, AC Milan have a much healthier-looking front line. As a result, they could be used in their more natural positions again. The idea to play a 4-3-3 with Milan was there from the start for Massimiliano Allegri. In fact, he actually started with the for"
    },
    {
      "id": "9c6f67289b8c",
      "title": "Allegri addresses idea of Fabregas rivalry and dig from Como fans: “Results through performances”",
      "url": "https://sempremilan.com/allegri-addresses-idea-fabregas-rivalry-como-dig",
      "source": "sempremilan.com",
      "date": "2026-02-17T17:00:00+00:00",
      "summary": "There has been a bit of a spat between Como and AC Milan manager Massimiliano Allegri since their meeting earlier this season.  Before the first game between the sides, Cesc Fabregas and Allegri were quite complimentary to one another, appreciating the work of the other and celebrating their work th"
    },
    {
      "id": "dc689886e878",
      "title": "Sporting Judge: Rabiot’s suspension confirmed and Igli Tare fined €10,000",
      "url": "https://sempremilan.com/rabiot-suspension-confirmed-tare-fined-10k",
      "source": "sempremilan.com",
      "date": "2026-02-17T16:30:00+00:00",
      "summary": "After the conclusion of the latest round of Serie A action, the Sports Judge has reviewed the weekend and AC Milan have received another fine. It was certainly not the worst weekend for Milan, as they managed to beat Pisa 2-1 away from home. A first win of the season against one of the new […]\nThe p"
    },
    {
      "id": "10bb032e69e7",
      "title": "Opposition insight for Milan-Como: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-milan-como-form-predicted-xi",
      "source": "sempremilan.com",
      "date": "2026-02-17T16:00:00+00:00",
      "summary": "AC Milan face Como for the second time in less than five weeks at San Siro on Wednesday night, hoping to do another double over them. Originally the game was planned to be played in Australia because of the Winter Olympic opening ceremony causing a clash at San Siro. However, that plan was thankfull"
    },
    {
      "id": "bb5d6100ee66",
      "title": "SempreMilan Podcast: Episode 401 – Livin’ La Pisa Luka",
      "url": "https://sempremilan.com/sempremilan-podcast-episode-401-livin-la-pisa-luka",
      "source": "sempremilan.com",
      "date": "2026-02-17T15:30:00+00:00",
      "summary": "Join Oli, Anthony and ‪BdairBall as they recap the narrow victory against Pisa, and preview two huge home games against Como and Parma. This week’s topics include… ↳ Modric to the rescue ↳ Allegri vs. Fabregas: The rematch ↳ Parma come to San Siro ↳ Worried about Pulisic? Want more Milan content? Ch"
    },
    {
      "id": "6baf7ae5df59",
      "title": "Report: Milan ‘likely to snub’ offers for Pulisic this summer with Premier League interest expected to rise",
      "url": "https://sempremilan.com/milan-likely-snub-offers-for-pulisic",
      "source": "sempremilan.com",
      "date": "2026-02-17T15:00:00+00:00",
      "summary": "Premier League clubs like Manchester United, Liverpool and Arsenal have all taken an interest in Christian Pulisic, but AC Milan are likely to reject any approaches. In the past few months, the reports regarding Pulisic’s future have mainly consisted of updates on a renewal at Milan. However, consid"
    },
    {
      "id": "8c4090acdbf6",
      "title": "GdS: 4000km and 30° – why Inter’s trip to Norway could influence the title race",
      "url": "https://sempremilan.com/why-inter-trip-to-norway-influence-title-race",
      "source": "sempremilan.com",
      "date": "2026-02-17T14:30:00+00:00",
      "summary": "This season, AC Milan have held hope for the Scudetto thanks to their scheduling, mainly. Now, that could come into play.  So far, Milan have not really had an advantage from a lack of Europe, or the regular cups. However, we are now in the infamous business end of the season, and this is where […]\n"
    },
    {
      "id": "6f0a372ca4ee",
      "title": "How much Milan will earn as Pobega completes permanent Bologna move",
      "url": "https://football-italia.net/milan-earn-pobega-permanent-bologna-move/",
      "source": "football-italia.net",
      "date": "2026-02-17T14:16:49+00:00",
      "summary": "Reports in Italy claim that Tommaso Pobega has formally joined Bologna on a permanent deal..."
    },
    {
      "id": "9e811f816382",
      "title": "Tuttosport: ‘Practically opposite’ – Allegri and Fabregas clash causes intrigue ahead of Milan-Como",
      "url": "https://sempremilan.com/allegri-fabregas-clash-intrigues-milan-como",
      "source": "sempremilan.com",
      "date": "2026-02-17T14:00:00+00:00",
      "summary": "AC Milan facing Como should be an interesting game, solely in terms of the table. However, it looks likely to be a decent clash tactically, too. As coaches go, it is difficult to find coaches further apart than Cesc Fabregas and Massimiliano Allegri. Even after the reverse fixture, the Spaniard was "
    },
    {
      "id": "185e6c8ca2a4",
      "title": "Allegri: Pulisic doubt for Milan, Inter ‘clear title favourites’",
      "url": "https://football-italia.net/allegri-pulisic-doubt-milan-inter-favourite/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:44:56+00:00",
      "summary": "Milan coach Massimiliano Allegri says Christian Pulisic is in doubt for tomorrow’s Serie A match..."
    },
    {
      "id": "9c881dea8c96",
      "title": "Kirovski explains why talented trio Dutu, Sia and Ibrahimovic Jr. left Milan: “The number one objective”",
      "url": "https://sempremilan.com/kirovski-explains-why-talented-trio-left-milan",
      "source": "sempremilan.com",
      "date": "2026-02-17T13:35:00+00:00",
      "summary": "In January, AC Milan parted with a number of young talents, including Maximilian Ibrahimovic, who has been around the first team for a few years.  It is nothing new for young players to be sold. After all, the academy cannot always produce first-team-level players, and when opportunities arise, it m"
    },
    {
      "id": "28770c59c3ab",
      "title": "Allegri weighs in on diving debate and asks for offside rule change",
      "url": "https://football-italia.net/allegri-weighs-in-on-diving-debate/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:28:16+00:00",
      "summary": "Massimiliano Allegri has had his say on the diving debate that has cropped up in..."
    },
    {
      "id": "04fdb1372c8f",
      "title": "Why Milan director Tare was fined after win over Pisa",
      "url": "https://football-italia.net/why-milan-director-tare-fined-after-win-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:12:36+00:00",
      "summary": "Milan director Igli Tare was fined €10,000 after the Rossoneri’s 2-1 win over Pisa on..."
    },
    {
      "id": "2773473df824",
      "title": "Report: Arsenal ready to trigger €50m clause to beat Milan to Real Madrid talent",
      "url": "https://sempremilan.com/arsenal-50m-milan-valdepenas-real-madrid",
      "source": "sempremilan.com",
      "date": "2026-02-17T13:10:00+00:00",
      "summary": "AC Milan face competition from Arsenal to land Real Madrid talent Victor Valdepenas, and they are apparently readying a big offer. Milan are always keeping an eye out on young talent around Europe, and Valdepeñas is the latest name from Real Madrid to enter their radar, after having previous signed "
    },
    {
      "id": "068c9b768450",
      "title": "Official: Juventus directors Comolli and Chiellini given lengthy bans after Derby d’Italia",
      "url": "https://football-italia.net/official-juventus-comolli-and-chiellini-banned/",
      "source": "football-italia.net",
      "date": "2026-02-17T12:58:31+00:00",
      "summary": "Juventus directors Damien Comolli and Giorgio Cheillini, plus players Pierre Kalulu, Nicolo Barella and Hakan..."
    },
    {
      "id": "bf894e517688",
      "title": "Marotta insists Milan and Inter have ‘excellent relationship’ and stresses importance of stadium",
      "url": "https://sempremilan.com/marotta-milan-inter-excellent-relationship-stadium",
      "source": "sempremilan.com",
      "date": "2026-02-17T12:45:00+00:00",
      "summary": "Inter president Giuseppe Marotta has reiterated that he and the club have a great relationship with AC Milan, and commented on the stadium project. The Nerazzurri have been at the centre of a storm since Saturday night’s game against Juventus at San Siro, which they won 3-2 in controversial circumst"
    },
    {
      "id": "d2e7b1ed04b6",
      "title": "‘No one like him in football’ – Real Madrid star Vinicius Jr. reveals why he ‘really misses’ Modric",
      "url": "https://sempremilan.com/no-one-like-modric-vinicius-jr",
      "source": "sempremilan.com",
      "date": "2026-02-17T12:20:00+00:00",
      "summary": "Vinicius Jr. has become the latest to wax lyrical about AC Milan star and Real Madrid legend Luka Modric, revealing an anecdote that proves his point. Modric arrived at Milan in the summer window on a free transfer, ticking off something that was no doubt on his career bucket list as a boyhood fan o"
    },
    {
      "id": "8009a35c8808",
      "title": "Tuttosport: Fabregas also facing dilemmas ahead of Milan revenge mission – the latest",
      "url": "https://sempremilan.com/fabregas-dilemmas-milan-revenge-mission",
      "source": "sempremilan.com",
      "date": "2026-02-17T11:55:00+00:00",
      "summary": "The eyes of Serie A will be on San Siro for the midweek game between AC Milan and Como, but both coaches have selection doubts. Massimiliano Allegri has some questions marks to resolve in each department due to a combination of suspensions and the conditions of some players. However, Cesc Fabregas –"
    },
    {
      "id": "47e1301c9a71",
      "title": "Allegri discusses selection doubts, Inter-Juventus drama, injuries and Fabregas battle",
      "url": "https://sempremilan.com/allegri-doubts-inter-juventus-injuries-fabregas",
      "source": "sempremilan.com",
      "date": "2026-02-17T11:30:00+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri has responded to questions on the title race, the Inter-Juventus drama, and the selection doubts he faces. This is the second time in just over a month that Milan and Como will face each other. The Rossoneri beat their Lombardy neighbours by the lake with an "
    },
    {
      "id": "e477fe2afb25",
      "title": "Vitiello: Modric ‘truly happy’ at Milan – what could become the ‘added incentive to stay’",
      "url": "https://sempremilan.com/modric-happy-milan-added-incentive-stay",
      "source": "sempremilan.com",
      "date": "2026-02-17T11:05:00+00:00",
      "summary": "Luka Modric will have the final say regarding his future, but AC Milan hope that a Champions League fairytale could tempt him. Modric signed a one-year deal when he arrived from Real Madrid on a free transfer in the summer mercato, but with the option for an extra 12 months. At the time of his […]\nT"
    },
    {
      "id": "3096501bf856",
      "title": "TMW: Milan could rekindle interest with Dortmund expected to drop price for striker",
      "url": "https://sempremilan.com/milan-dortmund-guirassy-drop-asking-price",
      "source": "sempremilan.com",
      "date": "2026-02-17T10:40:00+00:00",
      "summary": "Borussia Dortmund’s asking price for Serhou Guirassy is expected to drop, and AC Milan could reignite their interest in him. Over the weekend, Guirassy netted two goals in Dortmund’s most recent Bundesliga match against Mainz to keep their league hopes alive. Now they are six points behind league le"
    },
    {
      "id": "825c7f4cae9c",
      "title": "Inter vs. Juventus refereeing upset Milan too – report",
      "url": "https://football-italia.net/inter-vs-juventus-refereeing-upset-milan-too/",
      "source": "football-italia.net",
      "date": "2026-02-16T14:46:52+00:00",
      "summary": "Corriere dello Sport reports that the officiating in Inter-Juventus did not infuriate the Bianconeri only,..."
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    },
    {
      "id": "9c729c8148a4",
      "title": "Pisa forced to field third-choice goalkeeper in Serie A match against Milan",
      "url": "https://football-italia.net/pisa-forced-3rd-choice-goalkeeper-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T13:04:11+00:00",
      "summary": "Second-choice Pisa goalkeeper Simone Scuffet has been ruled out of tonight’s Serie A match against..."
    },
    {
      "id": "e6e4778300f1",
      "title": "Report Milan call McKennie for possible USMNT reunion with Pulisic",
      "url": "https://football-italia.net/milan-call-mckennie-usmnt-reunion-pulisic/",
      "source": "football-italia.net",
      "date": "2026-02-13T12:43:07+00:00",
      "summary": "Milan have reportedly begun preliminary talks with Weston McKennie’s entourage as the Juventus midfielder is..."
    }
  ]
}