{
  "lastUpdated": "2026-02-21T18:32:54.752981+00:00",
  "articles": [
    {
      "id": "e3fa1fdfa286",
      "title": "Di Stefano explains why Cissè signing is reminiscent of ‘the old Milan’",
      "url": "https://sempremilan.com/di-stefano-cisse-signing-reminiscent-milan",
      "source": "sempremilan.com",
      "date": "2026-02-21T18:30:00+00:00",
      "summary": "In the final days of the January window, AC Milan secured the promising Serie B talent Alphadjo Cissè, a signing that Peppe Di Stefano believes is reminiscent of the old Milan.  The transfer was announced on the final day of the window and in the statement, it was confirmed that the attacking midfie"
    },
    {
      "id": "3e6d8de03e39",
      "title": "Here Parma, the list of players called up for the match against Milan",
      "url": "https://www.milannews.it/l-avversario/qui-parma-la-lista-dei-convocati-per-la-partita-contro-il-milan-608248",
      "source": "milannews.it",
      "date": "2026-02-21T18:24:07+00:00",
      "summary": "Below is the note with which Parma, on its website, communicated the list of players called up for tomorrow afternoon's match at San Siro against Milan. The suspended Circati and Mikolajewski are absent."
    },
    {
      "id": "b86633202014",
      "title": "Order: \"It is Leao and Pulisic who must improve their condition so that a double step forward can be made between Parma and Cremona\"",
      "url": "https://www.milannews.it/news/ordine-sono-leao-e-pulisic-che-devono-salire-di-condizione-perche-si-possa-fare-un-doppio-passo-avanti-tra-parma-e-cremona-608204",
      "source": "milannews.it",
      "date": "2026-02-21T18:13:38+00:00",
      "summary": "During his editorial for MilanNews.it, the journalist Franco Ordine expressed himself as follows on Leao and Pulisic: \"They are the two who shift the balance of this Milan in attack."
    },
    {
      "id": "729dc7aeeea6",
      "title": "Giannini: \"In the end, I think that Inter, Milan and Napoli are the most advantaged and will compete for the top three positions\"",
      "url": "https://www.milannews.it/news/giannini-alla-fine-io-penso-che-inter-milan-e-napoli-siano-quelle-piu-avvantaggiate-che-si-giocheranno-le-prime-tre-posizioni-608200",
      "source": "milannews.it",
      "date": "2026-02-21T18:00:30+00:00",
      "summary": "Giuseppe Giannini, former Roma footballer, expressed himself to TeleVomero on the Champions League race: “Returning to Naples is always nice, I've only been there for a short time, but I've lived it intensely."
    },
    {
      "id": "9c459d1b6691",
      "title": "Mr 100% returns: Landucci ready to take Allegri’s duties for Milan-Parma",
      "url": "https://sempremilan.com/mr-100-returns-landucci-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-21T18:00:13+00:00",
      "summary": "Marco Landucci will be the head coach in Milan’s dugout tomorrow as Massimiliano Allegri will be serving a one-game suspension. In short, Mr 100% is back.  When Allegri signed his contract with Milan, thus confirming his return to the club, we all knew that he would wear his heart on his sleeve. In "
    },
    {
      "id": "a08051769a50",
      "title": "MN - Sold out expected tomorrow at San Siro for Milan-Parma",
      "url": "https://www.milannews.it/news/mn-previsto-sold-out-domani-a-san-siro-per-milan-parma-608247",
      "source": "milannews.it",
      "date": "2026-02-21T17:48:00+00:00",
      "summary": "Milan is enjoying a very positive season in the league and the enthusiasm is now contagious, despite Inter having increased their lead after recovering against Como."
    },
    {
      "id": "916b0fa32f5e",
      "title": "Leao, when he sees Parma, lights up: three goal participations in the last four matches",
      "url": "https://www.milannews.it/news/leao-quando-vede-parma-si-accende-tre-partecipazioni-a-gol-nelle-ultime-quattro-sfide-608180",
      "source": "milannews.it",
      "date": "2026-02-21T17:36:51+00:00",
      "summary": "Rafael Leao has been involved in three goals (two goals, one assist) in the last four matches against Parma in the league, including the goal in the first leg, his second penalty in the top flight (after the one against Fiorentina..."
    },
    {
      "id": "4937576dcc2d",
      "title": "Allegri admits Scudetto is highly unlikely as things stand: “12 wins and one defeat”",
      "url": "https://sempremilan.com/allegri-admits-scudetto-highly-unlikely-milan",
      "source": "sempremilan.com",
      "date": "2026-02-21T17:30:19+00:00",
      "summary": "Massimiliano Allegri has admitted that it will be very difficult for AC Milan to compete for the Scudetto, with just 13 games remaining of the season.  Due to the 1-1 draw against Como earlier in the week, Milan are now seven points behind their city rivals Inter (before this weekend’s matchday, any"
    },
    {
      "id": "01e770881814",
      "title": "The editor-in-chief of Marca says: \"Madrid is nostalgic for Modric. They wonder why he couldn't stay another year\"",
      "url": "https://www.milannews.it/news/il-caporedattore-di-marca-racconta-a-madrid-nostalgia-di-modric-si-chiedono-perche-non-potesse-restare-un-altro-anno-608191",
      "source": "milannews.it",
      "date": "2026-02-21T17:24:38+00:00",
      "summary": "Alberto Rubio, editor in chief of the section dedicated to international football on MARCA, expressed himself to MilanVibes on Luka Modric and the perception that there is of the Croatian in Madrid today: “My feeling, in general, is ..."
    },
    {
      "id": "7faa58ffdd8d",
      "title": "Sticks bombarded by whistles at the Via del Mare stadium in Lecce",
      "url": "https://www.milannews.it/news/bastoni-bersagliato-dai-fischi-dello-stadio-via-del-mare-di-lecce-608246",
      "source": "milannews.it",
      "date": "2026-02-21T17:12:41+00:00",
      "summary": "Just over 10 minutes ago the match began at the Via del Mare stadium between Lecce and Inter, a match valid for the 26th matchday of the Serie A Enilive championship."
    },
    {
      "id": "c6990bcca5f6",
      "title": "MN EXCLUSIVE - Mancini (DAZN): \"Scudetto? It's right that Milan try. Allegri? You can complain about one thing. And about Leao...\"",
      "url": "https://www.milannews.it/esclusive-mn/esclusiva-mn-mancini-dazn-scudetto-giusto-che-il-milan-ci-provi-allegri-gli-si-puo-recriminare-una-cosa-e-su-leao-608216",
      "source": "milannews.it",
      "date": "2026-02-21T17:00:00+00:00",
      "summary": "Decisive weeks for Milan. After the draw against Como, tomorrow the Rossoneri will challenge Parma to remain in first place in the standings, occupied by Inter."
    },
    {
      "id": "50f77c68e827",
      "title": "Milan-Parma prediction, Crociati always scoring at San Siro since 2011",
      "url": "https://www.milannews.it/scommesse/pronostici/pronostico-milan-parma-crociati-sempre-in-rete-a-san-siro-dal-2011-608140",
      "source": "milannews.it",
      "date": "2026-02-21T17:00:00+00:00",
      "summary": "The draw against Como left a bad taste in the mouth, but Milan still achieved their 24th consecutive useful result."
    },
    {
      "id": "f87a7cdd1651",
      "title": "Opposition insight for Milan-Parma: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-milan-parma-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-21T17:00:00+00:00",
      "summary": "Parma will be hoping to snatch more points from AC Milan tomorrow evening, having frustrated the Rossoneri in the reverse fixture.  After a rough run of results, the Gialloblu have seemingly found a bit of a stride with two consecutive wins, beating Bologna and Hellas Verona. There is some breathing"
    },
    {
      "id": "753d47e38ca5",
      "title": "Marotta: \"Lautaro with tenacity will be able to anticipate the times\"",
      "url": "https://www.milannews.it/l-avversario/marotta-lautaro-con-tenacia-riuscira-ad-anticipare-i-tempi-608244",
      "source": "milannews.it",
      "date": "2026-02-21T16:48:00+00:00",
      "summary": "In the pre-match of Lecce-Inter, a match that will be played at 6pm this Saturday of the 26th matchday of the Serie A Enilive championship, the Nerazzurri president and CEO Giuseppe Marotta spoke about the state of health of&n ..."
    },
    {
      "id": "8972bf0013e3",
      "title": "Milan have scored against Parma for 19 consecutive games: it is the longest streak in Serie A",
      "url": "https://www.milannews.it/news/il-milan-va-in-gol-contro-il-parma-da-19-partite-consecutive-e-la-striscia-piu-lunga-in-serie-a-608179",
      "source": "milannews.it",
      "date": "2026-02-21T16:37:43+00:00",
      "summary": "Parma is the team against which Milan boasts the longest ongoing scoring streak in Serie A: 19 consecutive goals scored; the gialloblù could become the fourth team, after Cagliari, Genoa and Sampdoria, against which ..."
    },
    {
      "id": "dadf35171854",
      "title": "Not only Rabiot as Athekame and Fofana could also miss derby against Inter",
      "url": "https://sempremilan.com/not-only-rabiot-athekame-fofana-derby",
      "source": "sempremilan.com",
      "date": "2026-02-21T16:30:00+00:00",
      "summary": "Adrien Rabiot is one yellow card away from suspension, which inevitably has become a big talking point as the derby is around the corner, but the same goes for two more players.  Rabiot missed Milan-Como due to suspension, having received a double yellow against Pisa in the round before. Had he not "
    },
    {
      "id": "787925acb692",
      "title": "Serie A, the updated ranking: Como -2 from fourth place",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-como-a-2-dal-quarto-posto-608242",
      "source": "milannews.it",
      "date": "2026-02-21T16:24:04+00:00",
      "summary": "Below is the updated Serie A ranking after Juventus' defeat at home against Cesc Fabregas' Como, who with these 3 points temporarily moves to -2 from fourth place, currently occupied by Roma: \n\nInter 61\nMILAN ..."
    },
    {
      "id": "67e2df0cf65d",
      "title": "Juve loses again: Fabregas' Como wins in Turin",
      "url": "https://www.milannews.it/news/la-juve-perde-ancora-a-torino-vince-il-como-di-fabregas-608193",
      "source": "milannews.it",
      "date": "2026-02-21T16:12:12+00:00",
      "summary": "Juve loses again: second defeat in the championship after the one suffered at San Siro last week against Inter, complete with controversy; third in a row if you also count the mid-week one in Türkiye 5-2 at Galat..."
    },
    {
      "id": "e7a74f8e8af7",
      "title": "Lazio 2-2 AC Milan Women: Comeback win squandered by the Rossonere",
      "url": "https://sempremilan.com/lazio-2-2-ac-milan-women-comeback-squandered",
      "source": "sempremilan.com",
      "date": "2026-02-21T16:07:20+00:00",
      "summary": "Milan Women thought they had completed a crucial comeback in the capital, but then Lazio found a way back to snatch a point.  After the defeats against Roma and Fiorentina, the Rossonere have received a fair amount of criticism as the Champions League places now seem like an impossible task. As such"
    },
    {
      "id": "eb2d206b144d",
      "title": "PROBABLE LINEUP - Bartesaghi ahead of De Winter, Leao and Pulisic up front",
      "url": "https://www.milannews.it/news/probabile-formazione-bartesaghi-in-vantaggio-su-de-winter-in-avanti-leao-e-pulisic-608240",
      "source": "milannews.it",
      "date": "2026-02-21T16:00:56+00:00",
      "summary": "After the draw against Como, Massimiliano Allegri's Milan immediately returned to the field against Parma on the 26th matchday of the Serie A Enilive championship."
    },
    {
      "id": "fce1dbe8510f",
      "title": "Sky reveals: Bartesaghi third in defence, Estupinan can be seen again on the left. Pulisic-Leao is back",
      "url": "https://www.milannews.it/news/sky-svela-bartesaghi-terzo-di-difesa-si-rivede-estupinan-a-sinistra-riecco-pulisic-leao-608241",
      "source": "milannews.it",
      "date": "2026-02-21T15:54:30+00:00",
      "summary": "The eve of Milan-Parma, a match that will be played at San Siro tomorrow at 6pm for the 26th round of the Enilive Serie A championship."
    },
    {
      "id": "f562778785fc",
      "title": "Sensational 2-2 in the first leg: Milan and Parma could also draw in the second leg for the third time in history",
      "url": "https://www.milannews.it/news/2-2-clamoroso-all-andata-milan-e-parma-potrebbero-pareggiare-anche-al-ritorno-per-la-terza-volta-nella-storia-608178",
      "source": "milannews.it",
      "date": "2026-02-21T15:36:51+00:00",
      "summary": "After the 2-2 draw in the first leg, Milan and Parma could draw both seasonal matches in Serie A for the third time, after 1993/94 and 2007/08. Opta reports it."
    },
    {
      "id": "845ee13a6255",
      "title": "Watch: Scotti scores brace for Milan Primavera including lovely free-kick",
      "url": "https://sempremilan.com/watch-scotti-brace-milan-primavera-lovely",
      "source": "sempremilan.com",
      "date": "2026-02-21T15:30:00+00:00",
      "summary": "Filippo Scotti, the captain of Milan Primavera, got on the scoresheet twice in the game against Napoli earlier today, helping his side secure an important 2-1 win.  After the 2-1 win against Genoa, which got them back to winning ways, the Rossoneri followed that up with the same scoreline today. Whi"
    },
    {
      "id": "b13dcb0af469",
      "title": "Fabregas returns to the San Siro case: \"I would accept the TV proof, I know I was wrong. But now we have to move on\"",
      "url": "https://www.milannews.it/news/fabregas-torna-sul-caso-di-san-siro-accetterei-la-prova-tv-so-di-aver-sbagliato-pero-adesso-si-deve-voltare-pagina-608239",
      "source": "milannews.it",
      "date": "2026-02-21T15:24:21+00:00",
      "summary": "In the pre-match of Juventus-Como, a match that opened on Saturday of the 26th round of Serie A, the Como coach Cesc Fabregas returned to the unpleasant episode that saw him as a negative protagonist at San Siro against Milan last month ..."
    },
    {
      "id": "ca1032c87694",
      "title": "Pasotto: \"Jashari underlined the satisfaction of starting a match with Modric because in Allegri's ideas he is the Croatian's deputy\"",
      "url": "https://www.milannews.it/news/pasotto-jashari-ha-sottolineato-la-soddisfazione-di-iniziare-una-partita-con-modric-perche-nelle-idee-di-allegri-e-il-vice-del-croato-608189",
      "source": "milannews.it",
      "date": "2026-02-21T15:12:53+00:00",
      "summary": "Marco Pasotto, journalist, expressed himself as follows in La Gazzetta dello Sport on Ardon Jashari, Milan's Swiss midfielder: \"Of a throw like that - forty meters of rainbow that touched the ground on Leao's feet & n ..."
    },
    {
      "id": "795d6817169a",
      "title": "Allegri explains why Pavlovic makes him ‘angry’ despite giving ‘everything’",
      "url": "https://sempremilan.com/allegri-explains-why-pavlovic-angry",
      "source": "sempremilan.com",
      "date": "2026-02-21T15:08:47+00:00",
      "summary": "Strahinja Pavlovic will be at Massimiliano Allegri’s disposal for tomorrow’s clash between Milan and Parma, and there is one thing the Serbian can improve upon.  Pavlovic received a nasty knock against Como and Milan initially feared a broken fibula. Thankfully, it was just a case of heavy bleeding,"
    },
    {
      "id": "0ce5a9e9364d",
      "title": "Milan, Allegri: Leao and Pulisic ‘improving’, I ‘get emotional’ when I talk to Modric",
      "url": "https://football-italia.net/milan-allegri-leao-pulisic-improve-talk-modric/",
      "source": "football-italia.net",
      "date": "2026-02-21T15:04:00+00:00",
      "summary": "Milan coach Massimiliano Allegri says Rafael Leao and Christian Pulisic are ‘improving’ and admits he..."
    },
    {
      "id": "373ca1744f9d",
      "title": "Allegri responds to criticism: \"We know our limits and we work on them, but we look at the positive sides\"",
      "url": "https://www.milannews.it/news/allegri-risponde-alle-critiche-sappiamo-i-nostri-limiti-e-ci-lavoriamo-ma-guardiamo-i-lati-positivi-608237",
      "source": "milannews.it",
      "date": "2026-02-21T15:00:24+00:00",
      "summary": "Massimiliano Allegri has just finished the press conference on the eve of Milan-Parma."
    },
    {
      "id": "504397678a81",
      "title": "Allegri: \"Pavlovic always gives everything he has. Extraordinary fans from the start\"",
      "url": "https://www.milannews.it/news/allegri-pavlovic-mette-sempre-tutto-quello-che-ha-tifosi-straordinari-dall-inizio-608236",
      "source": "milannews.it",
      "date": "2026-02-21T14:48:20+00:00",
      "summary": "Massimiliano Allegri has just finished the press conference on the eve of Milan-Parma. Below are some excerpts\n\nHow can you manage the pressure?\n\"Thinking about how to do it.\""
    },
    {
      "id": "08a62b21fcd3",
      "title": "Longo: Estupinan and Pulisic could start against Parma – latest from Milanello",
      "url": "https://sempremilan.com/longo-estupinan-pulisic-start-parma-latest",
      "source": "sempremilan.com",
      "date": "2026-02-21T14:24:04+00:00",
      "summary": "AC Milan will be up against Parma tomorrow and after an unusually quiet morning, indications have now arrived on the predicted starting eleven, with a duo potentially getting the chance.  After the draw against Como, Milan have a point to prove (pun intended) as they cannot afford to increase the ga"
    },
    {
      "id": "567090fe47bd",
      "title": "Renna and Scotti react to Milan Primavera 2-1 Napoli: “A truly excellent performance”",
      "url": "https://sempremilan.com/renna-scotti-react-milan-primavera-2-0-napoli",
      "source": "sempremilan.com",
      "date": "2026-02-21T14:00:00+00:00",
      "summary": "After Milan Primavera’s 2-1 win against Napoli earlier today, head coach Giovanni Renna and captain Filippo Scotti spoke to the media.  It was the Primavera’s second win in a row, having beaten Genoa last week, and they are thus picking up some form after a tough run of results. Scotti played a huge"
    },
    {
      "id": "39bd700d0d30",
      "title": "Fabregas: ‘I made a mistake, but some are seeking excuses’ with Como",
      "url": "https://football-italia.net/fabregas-made-mistake-some-seek-excuses-como/",
      "source": "football-italia.net",
      "date": "2026-02-21T13:59:43+00:00",
      "summary": "Cesc Fabregas again takes responsibility for his mistake against Milan, but also hints they are..."
    },
    {
      "id": "d76681767343",
      "title": "Allegri previews Milan-Parma, provides injury update and reflects on season finale",
      "url": "https://sempremilan.com/allegri-previews-milan-parma-injury-presser",
      "source": "sempremilan.com",
      "date": "2026-02-21T13:31:03+00:00",
      "summary": "On the eve of the game between AC Milan and Parma, Massimiliano Allegri spoke to the media at his usual pre-game press conference.  Milan only clinched a point in their mid-week clash against Como and as a result, Inter are now seven points ahead. As such, tomorrow’s game against Parma is even more "
    },
    {
      "id": "4eda19192303",
      "title": "Bonus Podcast with Oliver and Anthony: Future of Milan’s midfield",
      "url": "https://sempremilan.com/bonus-podcast-future-of-milans-midfield",
      "source": "sempremilan.com",
      "date": "2026-02-21T12:50:00+00:00",
      "summary": "Join Oli and Anthony as they go through each of Milan’s current midfielders to discuss their future, and address which targets could complete the department. Milan’s midfield has been a hot talking point this season amid the success of Luka Modric and Adrien Rabiot, but also the injury of Ardon Jash"
    },
    {
      "id": "7f9194dab63d",
      "title": "Milan Primavera 2-1 Napoli: Captain Scotti shines with brace and lovely free-kick",
      "url": "https://sempremilan.com/milan-primavera-2-0-napoli-captain-scotti",
      "source": "sempremilan.com",
      "date": "2026-02-21T12:20:03+00:00",
      "summary": "Milan Primavera managed to build on their win last weekend with another one today, beating a struggling Napoli side thanks to Filippo Scotti’s brace.  Last weekend, Giovanni Renna’s men bounced back after a tough run of results. Two goals were enough to beat a ten-man Genoa side, and the Rossoneri w"
    },
    {
      "id": "7aa3ce96e411",
      "title": "Tresoldi thinks about Milan move ‘every morning’, but expected Italy call",
      "url": "https://football-italia.net/tresoldi-thinks-milan-move-morning-italy-call/",
      "source": "football-italia.net",
      "date": "2026-02-21T12:13:57+00:00",
      "summary": "Nicolò Tresoldi admits he thinks about joining Milan ‘every morning when I wake up’, but..."
    },
    {
      "id": "4e17c42c4d47",
      "title": "Tresoldi doubles down on Milan dream: “I think about it every morning”",
      "url": "https://sempremilan.com/tresoldi-doubles-down-milan-dream-every-morning",
      "source": "sempremilan.com",
      "date": "2026-02-21T11:56:09+00:00",
      "summary": "Nicolo Tresoldi has, once again, opened up about his desire to play for AC Milan one day, though admitting that he’s not exactly close at the moment.  Given the history of Milan, it’s not exactly strange that some players – especially Italian ones – would like to wear the red and black shirt. It doe"
    },
    {
      "id": "d9a98da7185e",
      "title": "Fonseca: ‘I deserved more time’ at Milan",
      "url": "https://football-italia.net/fonseca-deserved-more-time-milan/",
      "source": "football-italia.net",
      "date": "2026-02-21T11:31:16+00:00",
      "summary": "Paulo Fonseca says he ‘enjoyed’ his short spell at Milan, but feels he ‘deserved more..."
    },
    {
      "id": "90d6966a1a1d",
      "title": "Fonseca says he ‘deserved more time’ at Milan after ‘amazing games’ and Lyon success",
      "url": "https://sempremilan.com/fonseca-more-time-milan-amazing-games",
      "source": "sempremilan.com",
      "date": "2026-02-21T11:30:00+00:00",
      "summary": "Paulo Fonseca has opened up about his short stint at Milan, saying that he would have liked more time, having now proved what he’s capable of with Lyon.  Milan appointed Fonseca as their new manager in the summer of 2024 after saying goodbye to Stefano Pioli at the end of the season. Before the end "
    },
    {
      "id": "c11e9f08c1d4",
      "title": "Official: Piccinini will officiate Milan vs. Parma – no controversy despite two reds",
      "url": "https://sempremilan.com/piccinini-officiate-milan-parma-two-reds",
      "source": "sempremilan.com",
      "date": "2026-02-21T11:05:00+00:00",
      "summary": "Marco Piccinini has been named the referee for AC Milan’s clash against Parma tomorrow, and after recent controversy, he will surely be under the spotlight.  The refereeing situation in Italy appears to be at a breaking point, with multiple teams getting obvious wrong calls made against them. For Mi"
    },
    {
      "id": "3b07fdff22d5",
      "title": "Di Stefano says Milan ‘must improve’ with signings ‘like Goretzka’ next season",
      "url": "https://sempremilan.com/di-stefano-milan-improve-signings-goretzka",
      "source": "sempremilan.com",
      "date": "2026-02-21T10:40:00+00:00",
      "summary": "Peppe Di Stefano has shared his take on what AC Milan will need to do in the event of Champions League qualification. Spoiler alert: the Rossoneri have a lot of work to do.  With 54 points collected after 25 games, Milan are sitting in second place in the league, seven points behind leaders Inter an"
    },
    {
      "id": "47863fa5f394",
      "title": "GdS: Allegri needs underperforming Milan leaders now more than ever",
      "url": "https://sempremilan.com/gds-allegri-needs-underperforming-milan-leaders",
      "source": "sempremilan.com",
      "date": "2026-02-21T10:16:18+00:00",
      "summary": "As Milan are entering a crucial phase of the season, also known as the season finale, Massimiliano Allegri has called upon the leaders to make a bigger difference.  The 1-1 draw against Como was a blow to Milan’s Scudetto hopes, now seven points behind their city rivals Inter. However, if there’s on"
    },
    {
      "id": "58ff92d9ddde",
      "title": "CorSport: Second-best in the club’s history – Milan eyeing key milestone tomorrow",
      "url": "https://sempremilan.com/corsport-second-best-milan-milestone-tomorrow",
      "source": "sempremilan.com",
      "date": "2026-02-21T09:50:00+00:00",
      "summary": "AC Milan could reach a very important milestone in their game against Parma tomorrow, making this side the second-best in the club’s history in one aspect.  The 2025-26 season has been a huge success so far, at least when you compare it to the disaster that was 2024-25, and Massimiliano Allegri dese"
    },
    {
      "id": "e43c8c4ebbeb",
      "title": "GdS: ‘The yellow of Rabiot’ – Milan happy and worried about key player’s return",
      "url": "https://sempremilan.com/gds-yellow-rabiot-milan-happy-worried",
      "source": "sempremilan.com",
      "date": "2026-02-21T09:25:13+00:00",
      "summary": "Adrien Rabiot is back after serving a one-game suspension, but another game of rest could be on the cards for the Frenchman, which worries AC Milan and Massimiliano Allegri.  As highlighted by today’s edition of Gazzetta dello Sport (see photo below), the good news for Milan is that Rabiot will be b"
    },
    {
      "id": "253ce718c287",
      "title": "Bonucci hails Milan coach Allegri: ‘A master, a phenomenon’",
      "url": "https://football-italia.net/italy-gattuso-bonucci-allegri-master-milan/",
      "source": "football-italia.net",
      "date": "2026-02-20T21:08:08+00:00",
      "summary": "Leonardo Bonucci has paid a glowing tribute to AC Milan head coach Massimiliano Allegri, describing..."
    },
    {
      "id": "d57652257213",
      "title": "Former Milan & Juventus defender De Sciglio clarifies collapsed Hradec Kralove move",
      "url": "https://football-italia.net/milan-juventus-defender-de-sciglio-hradec/",
      "source": "football-italia.net",
      "date": "2026-02-20T20:28:03+00:00",
      "summary": "Mattia De Sciglio has broken his silence over his failed transfer to Czech side Hradec..."
    },
    {
      "id": "16dbbff87a34",
      "title": "Milan interested in Club Brugge forward Tresoldi: the situation",
      "url": "https://football-italia.net/milan-interested-club-brugge-forward-tresoldi/",
      "source": "football-italia.net",
      "date": "2026-02-20T18:06:59+00:00",
      "summary": "AC Milan are quietly but decisively building their plans for the summer transfer window, and..."
    },
    {
      "id": "fe2664d29bdc",
      "title": "Extra Champions League spot: Where Italy stands after Inter loss and Bologna win",
      "url": "https://football-italia.net/extra-champions-league-spot-where-italy-stands/",
      "source": "football-italia.net",
      "date": "2026-02-20T16:25:31+00:00",
      "summary": "Italy’s chances of attaining an additional spot in next year’s Champions League remain slim despite..."
    },
    {
      "id": "603a8d098889",
      "title": "Pulisic impresses Milan star: ‘He speaks Italian almost perfectly’",
      "url": "https://football-italia.net/pulisic-impresses-milan-star-italian-perfectly/",
      "source": "football-italia.net",
      "date": "2026-02-20T14:20:48+00:00",
      "summary": "Milan star Rafael Leao is full of praise for USMNT star Christian Pulisic, on and..."
    },
    {
      "id": "14c9f595a9b3",
      "title": "Leao shares Diogo Jota story, promises to ‘make him proud’ at World Cup",
      "url": "https://football-italia.net/leao-diogo-jota-story-make-him-proud-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-20T14:13:03+00:00",
      "summary": "A ‘devastated’ Rafael Leao reveals Diogo Jota wanted to watch a Milan game at San..."
    },
    {
      "id": "5a8780cd73bf",
      "title": "Rafael Leao: Ibrahimovic ‘too demanding’, I ‘don’t go out’ before Milan derby",
      "url": "https://football-italia.net/leao-don-t-go-out-milan-derby-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-20T13:47:07+00:00",
      "summary": "Milan star Rafael Leao admits he avoids going out the week before the derby against..."
    },
    {
      "id": "c765c1d746d1",
      "title": "Frustrated Milan call AIA after controversial refereeing decisions in 1-1 Como draw",
      "url": "https://football-italia.net/frustrated-milan-call-aia-after-como-draw/",
      "source": "football-italia.net",
      "date": "2026-02-20T13:18:03+00:00",
      "summary": "Milan have reportedly been in contact with the Italian referees’ association (AIA) after a series..."
    },
    {
      "id": "18a4afe5a487",
      "title": "Roma the have best defensive record in Europe as Milan, Arsenal and Real Madrid follow",
      "url": "https://football-italia.net/roma-best-defensive-record-milan-arsenal-real/",
      "source": "football-italia.net",
      "date": "2026-02-20T12:36:59+00:00",
      "summary": "Roma are the least beaten defence in the top five European leagues, but Milan and..."
    },
    {
      "id": "46350e123f0a",
      "title": "Today’s Papers – Furious Milan, McTominay’s ‘soft football’",
      "url": "https://football-italia.net/todays-papers-furious-milan-mctominay-soft/",
      "source": "football-italia.net",
      "date": "2026-02-20T08:34:08+00:00",
      "summary": "La Gazzetta dello Sport Furious Milan The club is irritated with the referees, call to..."
    },
    {
      "id": "2e2b8b55e6a6",
      "title": "Why Fabregas cannot be punished with video evidence after Milan 1-1 Como",
      "url": "https://football-italia.net/why-fabregas-cannot-be-punished-video-evidence/",
      "source": "football-italia.net",
      "date": "2026-02-19T18:02:36+00:00",
      "summary": "Many were calling for video evidence to be used in punishing Como coach Cesc Fabregas..."
    },
    {
      "id": "88f321aefd9b",
      "title": "Milan team news: Boost as Pavlovic tests reveal no fracture",
      "url": "https://football-italia.net/milan-team-news-boost-as-pavlovic-tests/",
      "source": "football-italia.net",
      "date": "2026-02-19T15:39:58+00:00",
      "summary": "Milan will breathe a sigh of relief this morning, after medical examinations revealed that Strahinja..."
    },
    {
      "id": "d1035a3b77cf",
      "title": "Video: Fabregas’ shirt tug and touchline confrontation with Allegri",
      "url": "https://football-italia.net/fabregas-shirt-tug-touchline-clash-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-19T12:02:33+00:00",
      "summary": "Watch how Cesc Fabregas pulled the shirt of Alexis Saelemaekers and how Milan coach Massimiliano..."
    },
    {
      "id": "8e22ac8839a0",
      "title": "What Allegri told Fabregas in heated post-match clash: ‘You are a kid’",
      "url": "https://football-italia.net/what-allegri-told-fabregas-kid-milan-como/",
      "source": "football-italia.net",
      "date": "2026-02-19T09:09:48+00:00",
      "summary": "More details emerge about the confrontation between Milan coach Massimiliano Allegri and Como’s Cesc Fabregas..."
    },
    {
      "id": "d3f0ece0dd15",
      "title": "Today’s Papers – Bodo shaming, Italy cry, Leao saves Milan",
      "url": "https://football-italia.net/today-papers-bodo-shaming-italy-cry-leao-milan/",
      "source": "football-italia.net",
      "date": "2026-02-19T08:42:54+00:00",
      "summary": "La Gazzetta dello Sport Inter, three slaps But they are still +7 in Serie A...."
    },
    {
      "id": "f24c9ac03bd7",
      "title": "Allegri and Fabregas bad blood after Como coach ‘unsporting behaviour’",
      "url": "https://football-italia.net/allegri-fabregas-bad-blood-como-unsporting/",
      "source": "football-italia.net",
      "date": "2026-02-18T23:07:22+00:00",
      "summary": "There is bad blood between Max Allegri and Cesc Fabregas, as they had another row..."
    }
  ]
}