{
  "lastUpdated": "2026-02-06T08:39:41.714120+00:00",
  "articles": [
    {
      "id": "51f4291b8a9f",
      "title": "Bologna, Pobega's redemption obligation is about to be triggered: here's what's missing",
      "url": "https://www.milannews.it/rassegna-stampa/bologna-sta-per-scattare-l-obbligo-di-riscatto-di-pobega-ecco-cosa-manca-606547",
      "source": "milannews.it",
      "date": "2026-02-06T08:29:52+00:00",
      "summary": "Tommaso Pobega is one step away from officially becoming a player owned by Bologna: as today's edition of Tuttosport reports this morning, in fact, at the next point that the Italian team will score ..."
    },
    {
      "id": "cebb19857a62",
      "title": "Gazzetta: \"The Devil's man. Leader and goalscorer: now Rabiot is the soul of AC Milan\"",
      "url": "https://www.milannews.it/rassegna-stampa/gazzetta-l-uomo-del-diavolo-leader-e-goleador-ora-rabiot-e-l-anima-del-milan-da-corsa-606544",
      "source": "milannews.it",
      "date": "2026-02-06T08:19:42+00:00",
      "summary": "The Gazzetta dello Sport headline this morning: \"The Devil's man. Leader and goalscorer: now Rabiot is the soul of AC Milan\"."
    },
    {
      "id": "ab633bd5aefe",
      "title": "Milan, next week Bournemouth will exercise the right to buy Jimenez",
      "url": "https://www.milannews.it/rassegna-stampa/milan-settimana-prossima-il-bournemouth-esercitera-il-diritto-di-riscatto-per-jimenez-606545",
      "source": "milannews.it",
      "date": "2026-02-06T08:09:05+00:00",
      "summary": "In the next few days, most likely next week, Bournemouth will exercise the right of redemption in their favor to permanently acquire the full-back born in 2005 Alex Jimenez, a full-back currently on loan to the English club ..."
    },
    {
      "id": "d979180ed26d",
      "title": "Camarda's agent admits: \"He was returning to Milan. Then he had the shoulder problem and...\"",
      "url": "https://www.milannews.it/rassegna-stampa/l-agente-di-camarda-ammette-stava-tornado-al-milan-poi-ha-avuto-il-problema-alla-spalla-e-606542",
      "source": "milannews.it",
      "date": "2026-02-06T07:59:58+00:00",
      "summary": "Giuseppe Riso, agent of several footballers including Francesco Camarda, gave an interview to Tuttosport in which he admitted that in January the young striker was close to returning to Milan from his loan at Lecce: &qu ..."
    },
    {
      "id": "082a930e65e1",
      "title": "QS: \"Grafts and nursery. Derby in the future between Milan and Inter\"",
      "url": "https://www.milannews.it/rassegna-stampa/qs-innesti-e-vivaio-derby-nel-futuro-tra-milan-e-inter-606541",
      "source": "milannews.it",
      "date": "2026-02-06T07:50:24+00:00",
      "summary": "\"Grafts and nursery."
    },
    {
      "id": "181be238fca4",
      "title": "Tuttosport: \"Milan, 60 million coming from redemptions. Champions treasure\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-milan-dai-riscatti-in-arrivo-60-milioni-tesoro-champions-606540",
      "source": "milannews.it",
      "date": "2026-02-06T07:40:00+00:00",
      "summary": "Tuttosport on newsstands this morning has the headline: \"Milan, 60 million coming from redemptions. Champions Treasure\"."
    },
    {
      "id": "8ba4ea7bb98d",
      "title": "Will Pulisic and Leao be in Pisa? This is how the American and the Portuguese are doing",
      "url": "https://www.milannews.it/rassegna-stampa/pulisic-e-leao-ci-saranno-a-pisa-ecco-come-stanno-l-americano-e-il-portoghese-606539",
      "source": "milannews.it",
      "date": "2026-02-06T07:30:57+00:00",
      "summary": "How are Christian Pulisic and Rafael Leao? Will they both be regularly available to Max Allegri for the next match scheduled for February 13th at Pisa? According to the newspaper."
    },
    {
      "id": "ad3e3384ece2",
      "title": "Milan renewals, Tuttosport headlines: \"Bartesaghi and Tomori to be armored\"",
      "url": "https://www.milannews.it/rassegna-stampa/rinnovi-milan-tuttosport-titola-bartesaghi-e-tomori-da-blindare-606538",
      "source": "milannews.it",
      "date": "2026-02-06T07:20:37+00:00",
      "summary": "Today's edition of Tuttosport headlines this morning on Milan which is struggling with some renewals after having made official the very important one of Mike Maignan in recent days: \"Bartesaghi and Tomori to be locked down\"..."
    },
    {
      "id": "3aa3145c31a9",
      "title": "Ten years ago he won the Premier League: now Leicester risks the third division",
      "url": "https://www.milannews.it/news/dieci-anni-fa-vinse-la-premier-ora-il-leicester-rischia-la-terza-divisione-606537",
      "source": "milannews.it",
      "date": "2026-02-06T07:10:31+00:00",
      "summary": "(ANSA) - ROME, 05 FEB - Ten years ago they surprisingly won the Premier League under the guidance of Claudio Ranieri, today Leicester risks relegation to the English third division after receiving a six-point penalty for violating rules ..."
    },
    {
      "id": "e6e16047f22a",
      "title": "From Pobega and Jimenez to Colombo and Chukwueze: Milan, 60 million coming from redemptions",
      "url": "https://www.milannews.it/primo-piano/da-pobega-e-jimenez-a-colombo-e-chukwueze-milan-in-arrivo-60-milioni-dai-riscatti-606536",
      "source": "milannews.it",
      "date": "2026-02-06T07:00:25+00:00",
      "summary": "The next summer transfer window is still a little away, but in via Aldo Rossi they are starting to savor the arrival of several million euros into the AC Milan coffers: we're talking about a figure around 60 million, a sum that AC Milan should collect..."
    },
    {
      "id": "7a77d3545ddc",
      "title": "Milan, Oettle: \"The beauty of our club is that historically it has always been innovative\"",
      "url": "https://www.milannews.it/news/milan-oettle-il-bello-del-nostro-club-e-che-storicamente-e-sempre-stato-innovativo-606526",
      "source": "milannews.it",
      "date": "2026-02-06T06:50:28+00:00",
      "summary": "Maikel Oettle, Chief Commercial Officer of AC Milan participated in the SPOBIS Conference in Hamburg, one of the main European events dedicated to the sports industry and innovation in the sector."
    },
    {
      "id": "1ae50b6dd108",
      "title": "Milan unbeaten in all of their first 12 away matches of the season in the league for the first time since Serie A returned to 20 teams",
      "url": "https://www.milannews.it/news/milan-imbattuto-in-tutte-le-prime-12-trasferte-stagionali-in-campionato-per-la-prima-volta-da-quando-la-serie-a-e-tornata-a-20-squadre-606535",
      "source": "milannews.it",
      "date": "2026-02-06T06:40:46+00:00",
      "summary": "Milan (W7, D5 in 2025/26) remained unbeaten in all of their first 12 away games of the season in the league for the first time since Serie A returned to 20 teams (from 2004/05); the last time was in 2003/04 (9V ..."
    },
    {
      "id": "0d3ddb4e32c1",
      "title": "Milan Futuro back on the pitch on Sunday: info on the match and updated rankings",
      "url": "https://www.milannews.it/milan-futuro/milan-futuro-domenica-di-nuovo-in-campo-info-sul-match-e-classifica-aggiornata-606531",
      "source": "milannews.it",
      "date": "2026-02-06T06:30:50+00:00",
      "summary": "On Sunday, Milan Futuro returns to the pitch at the Felice Chinetti to challenge Virtus Ciserano Bergamo. Kick-off at 2.30pm, with the match which can be followed on the official channels of the Rossoneri club."
    },
    {
      "id": "3d29d6d35fb3",
      "title": "Seven days in Pisa-Milan: the Rossoneri's program in view of the away match",
      "url": "https://www.milannews.it/news/sette-giorni-a-pisa-milan-il-programma-dei-rossoneri-in-vista-della-trasferta-606530",
      "source": "milannews.it",
      "date": "2026-02-06T06:20:03+00:00",
      "summary": "On Wednesday morning, after Bologna, the Rossoneri carried out an unloading job at Milanello."
    },
    {
      "id": "879a77ec07d7",
      "title": "Serie A, the ranking before the 24th matchday: Milan +7 from Roma, but on Saturday it will be an asterisk",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-prima-della-24esima-giornata-milan-a-7-dalla-roma-ma-sabato-sara-asterisco-606529",
      "source": "milannews.it",
      "date": "2026-02-06T06:10:17+00:00",
      "summary": "Tomorrow the 24th matchday of Serie A will start, with some very delicate matches both in the safety zone and in the Europe zone. This is the standings before kick-off:\n\n1."
    },
    {
      "id": "85e960279150",
      "title": "The Serie A weekend without Milan: dates and times of the 24th matchday",
      "url": "https://www.milannews.it/news/il-weekend-di-serie-a-senza-il-milan-date-e-orari-della-24esima-giornata-606528",
      "source": "milannews.it",
      "date": "2026-02-06T06:00:40+00:00",
      "summary": "Today, Friday 6 February, the day of the inauguration of the Olympics, the 24th matchday of Serie A will begin, a day which will see Milan and Como rest given the impossibility of playing the match at San Siro pro ..."
    },
    {
      "id": "d6c9631832d0",
      "title": "Bacconi: \"Milan kick everyone's ass in the last half hour\"",
      "url": "https://www.milannews.it/news/bacconi-il-milan-nell-ultima-mezz-ora-fa-il-culo-a-tutti-606522",
      "source": "milannews.it",
      "date": "2026-02-06T00:00:00+00:00",
      "summary": "It happened several times during the season that Allegri's Milan transformed themselves in the second half, managing to drastically change the fate of the matches."
    },
    {
      "id": "654e0837d0aa",
      "title": "Moretto: \"There are already several clubs that are asking for information on Tonali. Newcastle are asking for a very high sum for him, more than 90 million\"",
      "url": "https://www.milannews.it/news/moretto-ci-sono-gia-diversi-club-che-stanno-chiedendo-informazioni-su-tonali-il-newcastle-chiede-una-cifra-altissima-per-lui-superiore-ai-90-milioni-606523",
      "source": "milannews.it",
      "date": "2026-02-05T23:50:08+00:00",
      "summary": "On the last day of the transfer window there was talk of Arsenal's strong interest in Sandro Tonali, who however remained at Newcastle."
    },
    {
      "id": "5c6a67c002b9",
      "title": "Triestina Calcio, new debt positions emerge",
      "url": "https://www.milannews.it/news/triestina-calcio-emergono-nuove-posizioni-debitorie-606521",
      "source": "milannews.it",
      "date": "2026-02-05T23:40:50+00:00",
      "summary": "(ANSA) - TRIESTE, 05 FEB - The day after the searches by the Guardia di Finanza at the Triestina football headquarters, and in the homes of the 15 managers under investigation, the most immediately worrying fact appears to be the liquidity crisis ..."
    },
    {
      "id": "ce1a599ecc1b",
      "title": "Pellegatti apologizes: \"I had prepared a nice shot on the market, but the victory in Bologna convinced me to cancel it\"",
      "url": "https://www.milannews.it/news/pellegatti-si-scusa-avevo-preparato-un-bel-pistolotto-sul-mercato-ma-la-vittoria-di-bologna-mi-ha-convinto-di-cancellarlo-606482",
      "source": "milannews.it",
      "date": "2026-02-05T23:31:52+00:00",
      "summary": "During his editorial for MilanNews."
    },
    {
      "id": "a1ea4a69c8a8",
      "title": "‘Served Milan like bread’ – Füllkrug’s permanent transfer cannot be ruled out",
      "url": "https://sempremilan.com/fullkrug-permanent-transfer-milan-not-ruled-out",
      "source": "sempremilan.com",
      "date": "2026-02-05T19:30:00+00:00",
      "summary": "When Niclas Füllkrug first arrived at AC Milan, many turned their noses up at the German. However, he is playing his role perfectly so far.  It was clear from the off that Milan were not signing Füllkrug to be the first choice striker for Massimiliano Allegri. But, with no physical option in his tea"
    },
    {
      "id": "439cbcb3f47e",
      "title": "Pedulla explains why Cremonese defeat was a ‘footballing blessing’ for Milan",
      "url": "https://sempremilan.com/pedulla-why-cremonese-was-blessing-for-milan",
      "source": "sempremilan.com",
      "date": "2026-02-05T19:00:00+00:00",
      "summary": "When AC Milan started the season with a defeat to Cremonese, many will have thought the worst about the season. However, it may have been a blessing.  It seemed Milan were in for another of those seasons when they restarted their Serie A action with an opening day defeat at San Siro. For many, it […"
    },
    {
      "id": "315e9ffa9445",
      "title": "Galliani recalls Ibrahimovic pursuit to ‘please’ Allegri in Scudetto season: “With Berlusconi’s money”",
      "url": "https://sempremilan.com/galliani-recalls-ibrahimovic-story-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-05T18:30:00+00:00",
      "summary": "Zlatan Ibrahimovic first joined AC Milan in 2010, but things could have been much different had it not been for Adriano Galliani.  Ibrahimovic is one of the most recognisable names in European football, and his relationship with Milan makes his name more popular in this sphere than elsewhere, perhap"
    },
    {
      "id": "03fcdf3e34d5",
      "title": "CM: ‘More remote than ever’ – Vlahovic renewal looks impossible currently",
      "url": "https://sempremilan.com/vlahovic-renewal-looks-impossible-currently",
      "source": "sempremilan.com",
      "date": "2026-02-05T18:00:00+00:00",
      "summary": "AC Milan have been given more good news at this moment, as it seems their chances of landing Dusan Vlahovic have increased. The pursuit of Vlahovic has been ongoing for some time now, and Milan are not leaving it. In fact, Igli Tare and Massimiliano Allegri share a belief that he should join in the "
    },
    {
      "id": "44690074d648",
      "title": "Adjustments unlock battle of space manipulation: Tactical analysis of Bologna 0-3 AC Milan",
      "url": "https://sempremilan.com/tactical-analysis-of-bologna-0-3-ac-milan",
      "source": "sempremilan.com",
      "date": "2026-02-05T17:30:00+00:00",
      "summary": "AC Milan walked away from the Stadio Renato dall’Ara on Tuesday night with three goals and three precious points against Bologna. The majority of the work in the eventual 3-0 win was done in an impressive first half by Milan. Ruben Loftus-Cheek fired in the first goal from Adrien Rabiot’s cut-back a"
    },
    {
      "id": "e7929d8a047a",
      "title": "CM: Leao, Pulisic, Gimenez and Saelemaekers train during Milanello off days",
      "url": "https://sempremilan.com/leao-pulisic-gimenez-saelemaekers-train-day-off",
      "source": "sempremilan.com",
      "date": "2026-02-05T17:00:00+00:00",
      "summary": "Currently, Milanello is considered closed, given most of the AC Milan squad are enjoying some deserved time off, after their 3-0 win against Bologna. However, it is not the case for everyone.  Shortly after the win this week, it was reported that Milanello would be vacant for a few days, with Massim"
    },
    {
      "id": "8032cb9d385f",
      "title": "Repubblica: Tare and Allegri closer than ever – how the relationship is helping Milan",
      "url": "https://sempremilan.com/tare-allegri-closer-than-ever-helping-milan",
      "source": "sempremilan.com",
      "date": "2026-02-05T16:30:00+00:00",
      "summary": "Igli Tare and Massimiliano Allegri arrived at AC Milan in the same summer, yet it feels like the pair have been working together for much longer.  Hiring a new manager and sporting director in the same period can be a risk. After all, the two need to align quickly and ensure that they have the […]\nT"
    },
    {
      "id": "1a19dde8a679",
      "title": "Moretto: Mateta ‘would struggle’ to play multiple games a week – why Milan said no",
      "url": "https://sempremilan.com/mateta-would-struggle-play-multiple-games-week",
      "source": "sempremilan.com",
      "date": "2026-02-05T16:00:00+00:00",
      "summary": "Jean-Philippe Mateta’s move to AC Milan was cancelled in the final hours of the mercato, due to an injury issue which was flagged up.  It seemed that Milan had timed their run for Mateta perfectly. Arriving in the final days of the window, the Rossoneri turned up at the right moment and moved things"
    },
    {
      "id": "6fabb182443e",
      "title": "Journalist claims Milan management were split over Nkunku: “Allegri and Tare said no”",
      "url": "https://sempremilan.com/milan-management-split-over-nkunku",
      "source": "sempremilan.com",
      "date": "2026-02-05T15:30:00+00:00",
      "summary": "Last month, it seemed that Christopher Nkunku could have left AC Milan. However, the Frenchman remained, and at the first opportunity, he showed that it was the right choice.  Throughout January, there were several suggestions that Milan could part ways with Nkunku. Put simply, the Frenchman had not"
    },
    {
      "id": "549445b358a3",
      "title": "GdS: Milan procure talent from Chelsea and Bayern Munich – Allegri’s plans",
      "url": "https://sempremilan.com/milan-procure-talent-chelsea-bayern",
      "source": "sempremilan.com",
      "date": "2026-02-05T15:00:00+00:00",
      "summary": "Whilst the senior window was quiet for AC Milan, the same cannot be said for the Futuro project, who have received a few new talents to develop.  It always seemed like the first team mercato would be rather quiet, and last month was for the most part. Of course, there were rumours throughout, and ev"
    },
    {
      "id": "97d9254b89c5",
      "title": "‘Milan do not have the urgency’ – Ambrosini states Inter have Scudetto mentality",
      "url": "https://sempremilan.com/ambrosini-states-inter-have-scudetto-mentality",
      "source": "sempremilan.com",
      "date": "2026-02-05T14:30:00+00:00",
      "summary": "AC Milan are still very much in the Scudetto fight, even if they are at a five-point disadvantage. However, this might be too much, as Massimo Ambrosini suggests.  The win against Bologna in midweek was certainly one fit for champions, but Milan have often fallen below that standard in games where t"
    },
    {
      "id": "57a12f7418c8",
      "title": "Repubblica: Milan hoping Allegri factor will have impact in ‘expensive’ Vlahovic pursuit",
      "url": "https://sempremilan.com/repubblica-milan-allegri-factor-expensive-vlahovic",
      "source": "sempremilan.com",
      "date": "2026-02-05T14:00:49+00:00",
      "summary": "Even though the window has just closed, speculation regarding AC Milan and the striker position never seems to stop. Dusan Vlahovic is one of the top players who will depart his club on a free transfer this summer and Milan have been extensively linked with a swoop over the past few months, even dat"
    },
    {
      "id": "2221b2bfa2d6",
      "title": "GdS: Saelemaekers, Pulisic, Leao and Gimenez at Milanello despite break – the latest on each",
      "url": "https://sempremilan.com/saelemaekers-pulisic-leao-gimenez-latest",
      "source": "sempremilan.com",
      "date": "2026-02-05T13:35:00+00:00",
      "summary": "AC Milan will have a bit of a break after the win over Bologna, which should allow some injured players to recover too. Taking advantage of the schedule, which will see Milan not play again until Friday 13 February away against Pisa, Massimiliano Allegri has decided to grant his players three days o"
    },
    {
      "id": "dcced63c14ab",
      "title": "Tuttosport: Why Milan are in the Scudetto race regardless of Allegri’s media tactics",
      "url": "https://sempremilan.com/why-milan-scudetto-race-regardless-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-05T13:10:00+00:00",
      "summary": "Massimiliano Allegri keeps pointing at the top four, but AC Milan are Inter’s main title challengers whether he likes it or not. Tuttosport (via MilanNews) recalls how Allegri once again kept everyones’ feet on the ground after the win in Bologna: “We need to focus on the +7 lead over fifth place, b"
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    },
    {
      "id": "2455a94ed8d3",
      "title": "Watch: Cassano confronted by child over anti-Leao agenda – “Make up your mind!”",
      "url": "https://sempremilan.com/cassano-confronted-child-anti-leao-agenda",
      "source": "sempremilan.com",
      "date": "2026-02-05T12:45:00+00:00",
      "summary": "Antonio Cassano was confronted on stage for the perceived inconsistency in his opinions regarding Rafael Leao, by a child. A curious interlude took place at the Bari theatre during the tour organised by Lele Adani, Antonio Cassano, and Nicola Ventola for their show ‘Viva el Futbol’, which is usually"
    },
    {
      "id": "01a02bd4871e",
      "title": "CM: Allegri believes Fiorentina star is ‘perfect’ for Milan – summer plot already hatched",
      "url": "https://sempremilan.com/allegri-kean-perfect-milan-summer-plot",
      "source": "sempremilan.com",
      "date": "2026-02-05T12:20:00+00:00",
      "summary": "AC Milan were a failed Jean-Philippe Mateta medical away from having a new No.9, but now they are considering new names for the summer. As Calciomercato.com report, the real objective for Milan this season is to secure qualification for next season’s Champions League, which will bring in a much-need"
    },
    {
      "id": "a315cea55236",
      "title": "GdS: An ‘extra starter’ for Allegri – why Athekame is being trusted more",
      "url": "https://sempremilan.com/why-athekame-trusted-more-milan",
      "source": "sempremilan.com",
      "date": "2026-02-05T11:55:00+00:00",
      "summary": "As of a few weeks ago Zachary Athekame remained an unknown quantity, but in recent games he has begun to blossom. As La Gazzetta dello Sport write, Athekame is starting to show that he is useful to the cause after arriving at Milan under the radar. Before being snapped up by the Rossoneri in the sum"
    },
    {
      "id": "8ff14997a502",
      "title": "MN: A mercato for the future – Milan restock youth sector with six promising signings",
      "url": "https://sempremilan.com/milan-restock-youth-six-promising-signings",
      "source": "sempremilan.com",
      "date": "2026-02-05T11:30:00+00:00",
      "summary": "There was some frustration about AC Milan’s perceived lack of movement in the January window, but in fact they made several moves for the future. As MilanNews write, given that Milan are second place in the league and have a squad with obvious gaps in some areas of the pitch, fans had high expectati"
    },
    {
      "id": "4e4bb81f2ebd",
      "title": "CM: €65m out of €94m almost guaranteed – how the buy-outs for Milan’s loanees look",
      "url": "https://sempremilan.com/how-buy-outs-milan-loanees-looks-65m",
      "source": "sempremilan.com",
      "date": "2026-02-05T11:05:00+00:00",
      "summary": "One thing for the AC Milan management to keep an eye on in the final months of the season is how loanees are getting on, and how their future looks subsequently. As Calciomercato.com recall, the current squad has been overhauled by 55% compared to last season. As part of this, several players packed"
    },
    {
      "id": "b17892f94874",
      "title": "Hazard: ‘I was a Milan fan’, ‘special’ relationship with Sarri, but Mourinho the best",
      "url": "https://football-italia.net/hazard-milan-fan-sarri-special-mourinho-best/",
      "source": "football-italia.net",
      "date": "2026-02-05T10:54:34+00:00",
      "summary": "Former Belgian star Eden Hazard reveals he was a Milan fan as a kid and..."
    },
    {
      "id": "d44b03ec3f99",
      "title": "Reports: Milan not giving up on Kostic despite failed winter swoop – the situation",
      "url": "https://sempremilan.com/milan-not-giving-up-kostic-strategy",
      "source": "sempremilan.com",
      "date": "2026-02-05T10:40:00+00:00",
      "summary": "AC Milan didn’t manage to sign Andrej Kostic in the winter window, but they are ready to make another attempt for him. Milan were heavily linked with a move for Kostic during the weeks leading up to the mid-season mercato, and there was even talk of the player pushing for the move. However, he did ["
    },
    {
      "id": "f86a3c2aa1e5",
      "title": "Del Piero: Juventus ‘must’ have title belief, but avoids Yildiz comparison",
      "url": "https://football-italia.net/del-piero-juventus-title-no-yildiz-comparison/",
      "source": "football-italia.net",
      "date": "2026-02-05T09:35:42+00:00",
      "summary": "Juventus legend Alessandro Del Piero feels the Bianconeri can still aim for the Serie A..."
    },
    {
      "id": "a5543b121859",
      "title": "Marotta: ‘Inter approve of rotation, Milan have an advantage for Scudetto’",
      "url": "https://football-italia.net/marotta-inter-approve-rotation-milan-advantage/",
      "source": "football-italia.net",
      "date": "2026-02-04T19:52:47+00:00",
      "summary": "Inter President Beppe Marotta backs the squad rotation for the Coppa Italia quarter-final with Torino..."
    },
    {
      "id": "9de86510452c",
      "title": "Why Inter vs. Torino Coppa Italia clash moved for 2026 Winter Olympics",
      "url": "https://football-italia.net/why-inter-vs-torino-coppa-italia-clash-moved/",
      "source": "football-italia.net",
      "date": "2026-02-04T17:23:22+00:00",
      "summary": "Tonight’s Coppa Italia quarter-final is technically Inter hosting Torino, but the 2026 Winter Olympics mean..."
    },
    {
      "id": "d1ee46184128",
      "title": "Milan eyeing Italy striker for summer transfer window but unwilling to spend €62m",
      "url": "https://football-italia.net/milan-eyeing-italy-striker-for-summer/",
      "source": "football-italia.net",
      "date": "2026-02-04T16:31:09+00:00",
      "summary": "Wednesday’s reports claim that Milan are eyeing a potential move for Italy international Moise Kean..."
    },
    {
      "id": "2b1e8827ad38",
      "title": "Capello analyses Milan’s 3-0 win over Bologna: ‘Foolish not to consider the Scudetto’",
      "url": "https://football-italia.net/capello-analyses-milans-3-0-win-over-bologna/",
      "source": "football-italia.net",
      "date": "2026-02-04T12:42:25+00:00",
      "summary": "Fabio Capello has had his say on Milan’s recent 3-0 victory over Bologna in Serie..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-04T11:21:04+00:00",
      "summary": "Recent reports claim that Alex Jimenez’s loan move to AFC Bournemouth is set to be..."
    },
    {
      "id": "b268dce71cdf",
      "title": "Today’s Papers – Milan impress in Bologna, Yildiz extends with Juventus",
      "url": "https://football-italia.net/todays-papers-milan-impress-in-bologna-yildiz-extends-with-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-04T08:29:55+00:00",
      "summary": "La Gazzetta dello Sport “What the Devil!” Milan overwhelm Bologna (3-0) and remain five points..."
    },
    {
      "id": "a7d106533e6a",
      "title": "Allegri: ‘Important to reach 50 points, but Milan have to do better’",
      "url": "https://football-italia.net/allegri-important-for-milan-to-reach-50-points/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:52:34+00:00",
      "summary": "Massimiliano Allegri believes that there is still room for improvement for his Milan side, despite..."
    },
    {
      "id": "6b625068a1fd",
      "title": "Italiano: ‘Bologna can’t put in two consecutive top-level performances’",
      "url": "https://football-italia.net/italiano-bologna-two-consecutive-performances/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:42:19+00:00",
      "summary": "Vincenzo Italiano was left bemused and questioning why his Bologna side do not seem able..."
    },
    {
      "id": "258cd38cc2c7",
      "title": "Player ratings: Bologna 0-3 Milan – French connection (and some UK)",
      "url": "https://football-italia.net/ratings-bologna-0-3-milan-french-connection/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:12:07+00:00",
      "summary": "A combination of Milan’s French stars and Englishman Ruben Loftus-Cheek were among the best players..."
    },
    {
      "id": "a85b54e36767",
      "title": "Serie A | Bologna 0-3 Milan: Who needs Mateta?",
      "url": "https://football-italia.net/serie-a-bologna-0-3-milan-who-needs-mateta/",
      "source": "football-italia.net",
      "date": "2026-02-03T21:40:19+00:00",
      "summary": "Milan were unable to seal a deadline day transfer for Crystal Palace striker Jean-Philippe Mateta,..."
    },
    {
      "id": "ce1a398b6a46",
      "title": "Serie A Liveblog: Bologna vs. Milan",
      "url": "https://football-italia.net/serie-a-liveblog-bologna-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-03T19:45:46+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "14b7ffb82d41",
      "title": "Three different experts warned Milan against Mateta signing",
      "url": "https://football-italia.net/three-experts-warned-milan-off-mateta/",
      "source": "football-italia.net",
      "date": "2026-02-03T19:17:56+00:00",
      "summary": "Reports in Italy claim that three different medical experts advised Milan against signing Crystal Palace..."
    },
    {
      "id": "f9e41c5bf4af",
      "title": "Serie A: Bologna vs. Milan – Confirmed line-ups",
      "url": "https://football-italia.net/serie-a-bologna-milan-confirmed-line-ups/",
      "source": "football-italia.net",
      "date": "2026-02-03T18:50:01+00:00",
      "summary": "Milan will have to do without Rafael Leao, Christian Pulisic and Alexis Saelemaekers in their..."
    },
    {
      "id": "7ae165f6b5f2",
      "title": "Most expensive Serie A sales of 2026 January transfer window",
      "url": "https://football-italia.net/most-expensive-serie-a-sales-of-january-2026/",
      "source": "football-italia.net",
      "date": "2026-02-03T18:15:08+00:00",
      "summary": "Ademola Lookman was the most expensive Serie A sale of the 2026 January transfer window,..."
    },
    {
      "id": "184ff5860f45",
      "title": "Top 10 most expensive Serie A signings of January transfer window",
      "url": "https://football-italia.net/top-10-most-expensive-serie-a-signings-jan-26/",
      "source": "football-italia.net",
      "date": "2026-02-03T17:30:20+00:00",
      "summary": "Lorenzo Lucca, Giacomo Raspadori and Robinio Vaz were among the most expensive Serie A signings..."
    },
    {
      "id": "db2741388765",
      "title": "Retired Italy Euro winner regrets not playing at World Cup: ‘I failed’",
      "url": "https://football-italia.net/florenzi-italy-euro-winner-regret-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-03T14:56:23+00:00",
      "summary": "Former Italy international Alessandro Florenzi regrets not playing in the World Cup despite winning the..."
    },
    {
      "id": "561bdde23329",
      "title": "Vlahovic returns to Juventus to finish recovery as Chelsea, Newcastle and Milan eye free transfer",
      "url": "https://football-italia.net/vlahovic-juventus-recovery-chelsea-milan-free/",
      "source": "football-italia.net",
      "date": "2026-02-03T14:42:39+00:00",
      "summary": "Dusan Vlahovic has reportedly returned to the Juventus training centre to complete his injury recovery,..."
    }
  ]
}