{
  "lastUpdated": "2026-02-06T14:02:45.726921+00:00",
  "articles": [
    {
      "id": "f8ff85e81010",
      "title": "MN: ‘Exam passed’ – Athekame shows promise against Bologna as confidence emerges",
      "url": "https://sempremilan.com/athekame-shows-promise-bologna-exam-passed",
      "source": "sempremilan.com",
      "date": "2026-02-06T14:00:00+00:00",
      "summary": "When Zachary Athekame joined AC Milan, there were questions about what role he would play in the squad. Those still remain, but he is fighting back. There have been several questions this year about the recruitment from the summer, and Athekame has been subject to them. Not naturally a wing-back, hi"
    },
    {
      "id": "b36a47fb7dba",
      "title": "The managing director of Juve: \"Milan and Inter were once our competitors: today Netflix, Amazon, Disney and TikTok\"",
      "url": "https://www.milannews.it/news/il-managing-director-della-juve-una-volta-milan-e-inter-i-nostri-competitor-oggi-netflix-amazon-disney-e-tiktok-606589",
      "source": "milannews.it",
      "date": "2026-02-06T13:50:12+00:00",
      "summary": "Marco Castellaneta, managing director of Juventus, was a guest during the Sbobis Conference in Hamburg and discussed the Juventus model and the path taken a few years ago by the Turin-based team."
    },
    {
      "id": "3f546c767a6e",
      "title": "Milan's next opponent on the pitch today, with a new coach",
      "url": "https://www.milannews.it/news/oggi-in-campo-la-prossima-avversaria-del-milan-con-un-nuovo-tecnico-606575",
      "source": "milannews.it",
      "date": "2026-02-06T13:40:37+00:00",
      "summary": "This evening at 8pm."
    },
    {
      "id": "a8297bee82be",
      "title": "CorSport: Nkunku’s ‘resurgence through goals’ – goal tally matched after Milan’s push",
      "url": "https://sempremilan.com/nkunku-resurgence-goal-tally-matched-milan-push",
      "source": "sempremilan.com",
      "date": "2026-02-06T13:35:00+00:00",
      "summary": "Christopher Nkunku was pushed towards the door by AC Milan in January, but now, he could be the one doing the pushing.  It seemed for most of the month that Nkunku would go. After all, he was under a lot of pressure to leave Milan just six months after arriving from the Premier League. It […]\nThe po"
    },
    {
      "id": "3f9e3e0bfdc5",
      "title": "Guidi: \"Rabiot is literally dragging his team in every aspect\"",
      "url": "https://www.milannews.it/news/guidi-rabiot-sta-letteralmente-trascinando-i-suoi-in-ogni-aspetto-606573",
      "source": "milannews.it",
      "date": "2026-02-06T13:30:18+00:00",
      "summary": "The great season of Adrien Rabiot continues and he seems to have arrived at Milan at the height of his footballing maturity: the partnership with his mentor Massimiliano Allegri is working better than ever and the results ..."
    },
    {
      "id": "9d968dea2d17",
      "title": "Towards the derby: a few days before Inter will have the first leg of the Coppa Italia semi-final",
      "url": "https://www.milannews.it/news/verso-il-derby-pochi-giorni-prima-l-inter-avra-la-semifinale-di-andata-di-coppa-italia-606564",
      "source": "milannews.it",
      "date": "2026-02-06T13:20:41+00:00",
      "summary": "There is still a month to go, but there is already great anticipation for the Milan derby scheduled for 7 or 8 March (date and time have yet to be established)."
    },
    {
      "id": "43284599910b",
      "title": "Ibra on Milan channels: \"The Olympics have been Zlatanized. Infinite emotion\"",
      "url": "https://www.milannews.it/news/ibra-ai-canali-del-milan-le-olimpiadi-sono-state-zlatanizzate-emozione-infinita-606588",
      "source": "milannews.it",
      "date": "2026-02-06T13:10:38+00:00",
      "summary": "Zlatan Ibrahimovic this morning had the honor and pleasure of carrying the Olympic torch through the streets of central Milan."
    },
    {
      "id": "277dd6de88ef",
      "title": "‘Milan is like a second home’ – Ibrahimovic thanks Italy after Olympic torchbearer duties",
      "url": "https://sempremilan.com/ibrahimovic-thanks-italy-olympic-torch",
      "source": "sempremilan.com",
      "date": "2026-02-06T13:10:00+00:00",
      "summary": "Zlatan Ibrahimovic carried the Olympic Torch around the streets of Milano earlier today, and the AC Milan legend has spoken after. There are few faces more identifiable than Ibrahimovic’s across Europe, and especially in Milano, given he represented both sides of the city. Now, his work is with Mila"
    },
    {
      "id": "e90b80f2244e",
      "title": "Milan on loan: Jimenez and Pobega close to redemption, new entry Cissè",
      "url": "https://www.milannews.it/primo-piano/il-milan-in-prestito-jimenez-e-pobega-vicini-al-riscatto-new-entry-cisse-606586",
      "source": "milannews.it",
      "date": "2026-02-06T13:00:00+00:00",
      "summary": "Between the summer and winter sessions, Milan sent several players on loan, not just youngsters from the Rossoneri academy."
    },
    {
      "id": "6ed3978d07c0",
      "title": "Peter Schmeichel reveals: \"Do I have a favorite team in Italy? Yes, Milan always\"",
      "url": "https://www.milannews.it/news/peter-schmeichel-rivela-se-ho-una-squadra-preferita-in-italia-si-il-milan-da-sempre-606587",
      "source": "milannews.it",
      "date": "2026-02-06T12:50:44+00:00",
      "summary": "Milan's greatness never fades, especially abroad. The Rossoneri are the most successful Italian team in the Champions League and this has led many players to sympathize with the Devil."
    },
    {
      "id": "0091aa3c6dbe",
      "title": "Falk: Arsenal made late move for Goretzka as Premier League appeal grows – Milan still at the door",
      "url": "https://sempremilan.com/arsenal-late-move-goretzka-premier-league-appeal",
      "source": "sempremilan.com",
      "date": "2026-02-06T12:45:00+00:00",
      "summary": "Leon Goretzka was a long-term interest for AC Milan, and it seems that over the next few months, they will continue to pursue the midfielder. However, their mission is more difficult. Given the situation with Goretzka, it is nothing new that bringing him to San Siro in the summer will be a challenge"
    },
    {
      "id": "82b4597193a8",
      "title": "Former AC Milan goalkeeper Vasquez sought by Besiktas for the last day of the Turkish transfer market",
      "url": "https://www.milannews.it/gli-ex/ex-milan-il-portiere-vasquez-cercato-dal-besiktas-per-l-ultimo-giorno-di-mercato-turco-606566",
      "source": "milannews.it",
      "date": "2026-02-06T12:40:49+00:00",
      "summary": "There are countries that still have the transfer market active: Turkey is one of these with the window that will close this evening at 11.59pm Italian time."
    },
    {
      "id": "3aa565db2ba3",
      "title": "Oettle: \"Last year we achieved record results in merchandising and sponsorships despite a negative sporting season\"",
      "url": "https://www.milannews.it/news/oettle-l-anno-scorso-abbiamo-ottenuto-risultati-record-nel-merchandising-e-nelle-sponsorship-nonostante-una-stagione-sportiva-negativa-606568",
      "source": "milannews.it",
      "date": "2026-02-06T12:30:01+00:00",
      "summary": "Maikel Oettle, Chief Commercial Officer of AC Milan, speaking at the SPOBIS Conference in Hamburg, one of the main European events dedicated to the sports industry and innovation in the sector, declared as reported by Calc ..."
    },
    {
      "id": "12ce3ba094a5",
      "title": "Hellas Verona, the ultras buy a newspaper page against Zanzi",
      "url": "https://www.milannews.it/news/hellas-verona-gli-ultras-acquistano-una-pagina-di-giornale-contro-zanzi-606565",
      "source": "milannews.it",
      "date": "2026-02-06T12:20:53+00:00",
      "summary": "(ANSA) - VERONA, 06 FEB - Sensational protest by a group of Hellas Verona fans against the executive president, Italo Zanzi."
    },
    {
      "id": "3ba5bd8352eb",
      "title": "Tuttosport: Milan sitting on €60m war chest to bolster Allegri’s squad – the situation",
      "url": "https://sempremilan.com/milan-sitting-60m-war-chest-boost-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-06T12:20:00+00:00",
      "summary": "It seems increasingly likely that AC Milan will return to the Champions League next season, which will be a financial boost. But it will not be the only boost they receive. At present, it seems difficult to imagine a season finale where Milan are not in the premier European competition next season. "
    },
    {
      "id": "5c0e31305da0",
      "title": "Lazio, D.Maldini: \"I've always had the weight of the surname, I'm used to it and calm\"",
      "url": "https://www.milannews.it/gli-ex/lazio-d-maldini-il-peso-del-cognome-l-ho-sempre-avuto-sono-abituato-e-sereno-606582",
      "source": "milannews.it",
      "date": "2026-02-06T12:10:45+00:00",
      "summary": "Daniel Maldini, former AC Milan striker, was presented today as Lazio's new player: \"The first thought is very positive, I immediately felt at home and the group made me feel like part of the family."
    },
    {
      "id": "cadf37d5523c",
      "title": "Palladino enjoys the Cup semi-final: \"This is the Atalanta I always want\"",
      "url": "https://www.milannews.it/news/palladino-si-gode-la-semifinale-di-coppa-questa-e-l-atalanta-che-vorrei-sempre-606554",
      "source": "milannews.it",
      "date": "2026-02-06T12:00:37+00:00",
      "summary": "(ANSA) - BERGAMO, 06 FEB - \"The Atalanta I would always like is this. Spirit, union, mentality and aggressiveness: I saw a tough Atalanta, we no longer have to accept the ups and downs."
    },
    {
      "id": "ff24cf09068f",
      "title": "Watch: Ibrahimovic carries Olympic Torch through Milano before opening ceremony",
      "url": "https://sempremilan.com/ibrahimovic-carries-olympic-torch-milano",
      "source": "sempremilan.com",
      "date": "2026-02-06T11:55:00+00:00",
      "summary": "This morning, Zlatan Ibrahimovic enjoyed the chance to be an official torchbearer for the Milan-Cortina 2026 Winter Olympics. Today, the Winter Olympics begin, so the final few torch bearers are taking their chance to carry the flame through Milan, ahead of the opening ceremony at San Siro. Of cours"
    },
    {
      "id": "8cbb249d27d4",
      "title": "Catanzaro, the sporting director: \"Cissè in an important club but he decided to stay out of respect for the group\"",
      "url": "https://www.milannews.it/news/catanzaro-il-ds-cisse-in-un-club-importante-ma-ha-deciso-di-restare-per-rispetto-del-gruppo-606558",
      "source": "milannews.it",
      "date": "2026-02-06T11:50:01+00:00",
      "summary": "Alphadjo Cissè, Italian striker born in 2006, one of the most crystalline talents in our football, was Milan's real second signing of the January winter campaign."
    },
    {
      "id": "4d7f30c0b6f4",
      "title": "PHOTOGALLERY MN - Zlatan Ibrahimovic with the Olympic Flame",
      "url": "https://www.milannews.it/news/photogallery-mn-zlatan-ibrahimovic-con-la-fiamma-olimpica-606579",
      "source": "milannews.it",
      "date": "2026-02-06T11:41:06+00:00",
      "summary": "Great enthusiasm today in the streets of Milan for the passing of the Olympic Torch. Among the torchbearers also Zlatan Ibrahimovic who commented: \"I am very proud."
    },
    {
      "id": "c7d328f4ad0a",
      "title": "DS Independiente Medellin: \"Arizala? AC Milan were there first, we didn't reach an agreement\"",
      "url": "https://www.milannews.it/news/ds-independiente-medellin-arizala-c-era-prima-il-milan-non-abbiamo-raggiunto-l-accordo-606563",
      "source": "milannews.it",
      "date": "2026-02-06T11:30:36+00:00",
      "summary": "One of the new faces of the Serie A after the January transfer window is the Colombian full-back born in 2005 Juan David Arizala, who arrived from Independiente de Medellin."
    },
    {
      "id": "644c8d0ca56c",
      "title": "Glasner speaks on Mateta’s failed Milan move and confirms knee issue: “Since November”",
      "url": "https://sempremilan.com/glasner-speaks-mateta-failed-milan-move-knee-issue",
      "source": "sempremilan.com",
      "date": "2026-02-06T11:30:00+00:00",
      "summary": "There were rumours that Jean-Philippe Mateta had a knee issue before AC Milan found it, and those suggestions were confirmed by Oliver Glasner. The move for Mateta seemed to be happening at the last minute, with Milan looking to get a deal done quickly, having swooped in late. Things seemed to be pr"
    },
    {
      "id": "ab42a2255457",
      "title": "VIDEO MN - Ibrahimovic carries the Olympic Flame through the streets of Milan",
      "url": "https://www.milannews.it/news/video-mn-ibrahimovic-porta-la-fiamma-olimpica-per-le-strade-di-milano-606577",
      "source": "milannews.it",
      "date": "2026-02-06T11:21:41+00:00",
      "summary": "Zlatan Ibrahimovic carried the Olympic Flame through the streets of Milan this morning in view of the Milan-Cortina 2026 Winter Olympics which will be inaugurated this evening at San Siro."
    },
    {
      "id": "b2d3232f6904",
      "title": "Marinozzi: \"Milan is experiencing an excellent moment and is recovering fundamental players\"",
      "url": "https://www.milannews.it/news/marinozzi-milan-sta-vivendo-un-ottimo-momento-e-sta-recuperando-giocatori-fondamentali-606570",
      "source": "milannews.it",
      "date": "2026-02-06T11:10:00+00:00",
      "summary": "Milan won clearly in Bologna last Tuesday, taking home three very important points which allowed them to extend their lead over Roma, who occupy fifth place, to 7 points."
    },
    {
      "id": "4f475c13c3a3",
      "title": "CorSport: Differences noticeable in defence as Milan are significantly better than last year",
      "url": "https://sempremilan.com/differences-noticeable-milan-significantly-better",
      "source": "sempremilan.com",
      "date": "2026-02-06T11:05:00+00:00",
      "summary": "Last season, AC Milan had several issues across the pitch and, in fairness, off of it as well. Now, those problems are fading. Looking back at the situation 12 months ago, Milan had just spent a fortune in the January mercato in an attempt to settle the club. Throughout the season, protests had been"
    },
    {
      "id": "f6d565d186e1",
      "title": "Modric and a bright present: his future linked to results and beliefs",
      "url": "https://www.milannews.it/primo-piano/modric-e-un-presente-luminoso-il-suo-futuro-legato-a-risultati-e-convinzioni-606504",
      "source": "milannews.it",
      "date": "2026-02-06T11:00:00+00:00",
      "summary": "Luka Modric is currently a super yes. Today his performance seems obvious to us, but not everyone had high expectations of the Croatian when he arrived in Milan last summer."
    },
    {
      "id": "f4de53b54961",
      "title": "New stadium, Oettle: \"We would like to go faster. The ambition is to build one of the best stadiums in Europe\"",
      "url": "https://www.milannews.it/news/nuovo-stadio-oettle-vorremmo-andare-piu-veloci-l-ambizione-e-costruire-uno-dei-migliori-impianti-in-europa-606567",
      "source": "milannews.it",
      "date": "2026-02-06T10:50:51+00:00",
      "summary": "Maikel Oettle, Chief Commercial Officer of AC Milan, speaking at the SPOBIS Conference in Hamburg, one of the main European events dedicated to the sports industry and innovation in the sector, declared as reported by Calc ..."
    },
    {
      "id": "315a62229379",
      "title": "Moretto: Modric’s renewal ‘needs time’ – why his Milan future is uncertain currently",
      "url": "https://sempremilan.com/modric-renewal-needs-time-milan-future-uncertain",
      "source": "sempremilan.com",
      "date": "2026-02-06T10:40:00+00:00",
      "summary": "In an ideal world, AC Milan will extend Luka Modric’s contract next season, given they have the option to do so in his deal already, but it is not that simple.  When Modric joined Milan, an insurance clause was inserted, where the Rossoneri would have the option of an extra year if all parties wante"
    },
    {
      "id": "cbaa7672e2af",
      "title": "VIDEO MN - Ibra: \"Proud to have brought the Olympic Flame to Milan which is my second home\"",
      "url": "https://www.milannews.it/news/video-mn-ibra-orgoglioso-di-aver-portato-la-fiamma-olimpica-a-milano-che-e-la-mia-seconda-casa-606574",
      "source": "milannews.it",
      "date": "2026-02-06T10:38:19+00:00",
      "summary": "This morning Zlatan Ibrahimovic carried the Olympic Flame through the streets of Milan. On the sidelines, the Swede made these statements to the Milannews correspondent."
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    },
    {
      "id": "298505ae70cd",
      "title": "Oettle explains how Milan had to rebuild after ‘badly managed’ post-Berlusconi period",
      "url": "https://sempremilan.com/oettle-explains-milan-rebuild-post-berlusconi",
      "source": "sempremilan.com",
      "date": "2026-02-06T10:15:00+00:00",
      "summary": "Until 2017, AC Milan were owned by Silvio Berlusconi, and between then and when RedBird took over the club, there was certainly a bit of mismanagement.  The Berlusconi era of Milan is potentially one of the most successful spells in European football. Under him, the Rossoneri won everything that the"
    },
    {
      "id": "caa29ed12fac",
      "title": "Tuttosport: Bartesaghi, Tomori and the rest – Milan planning several renewals in the near future",
      "url": "https://sempremilan.com/bartesaghi-tomori-rest-milan-planning-renewals",
      "source": "sempremilan.com",
      "date": "2026-02-06T09:50:00+00:00",
      "summary": "Whilst the AC Milan squad cannot be strengthened with new talent currently, it can be secured and this is the plan.  The closing of the mercato means Milan now have a few months to plan for the summer, and in turn, the squad. Of course, there may be conversations in the background too, for players ["
    },
    {
      "id": "3929286e1891",
      "title": "GdS: ‘The best Rabiot’ – Allegri’s praise difficult to deny after Bologna performance",
      "url": "https://sempremilan.com/allegri-praise-difficult-deny-rabiot-bologna",
      "source": "sempremilan.com",
      "date": "2026-02-06T09:25:00+00:00",
      "summary": "On Tuesday night, AC Milan were treated to one of the performances of the season by Adrien Rabiot. The Frenchman was sublime, and the Rossoneri were left in awe. When he arrived in the summer, there was a lot of talk about why Rabiot was a good signing. A fantastic player, he also showed that […]\nTh"
    },
    {
      "id": "49f396b26236",
      "title": "Riso discusses original January Camarda plan and Tonali’s future: “He was returning to Milan”",
      "url": "https://sempremilan.com/riso-discusses-camarda-plan-tonali-future",
      "source": "sempremilan.com",
      "date": "2026-02-06T09:00:00+00:00",
      "summary": "The January mercato has just closed, and for now, the rumours of the future will become slightly quieter. However, now is a time to look at different situations for AC Milan. It was a rather quiet month for Milan anyway, with January only seeing a few new faces, as opposed to the churn of last […]\nT"
    },
    {
      "id": "a1ea4a69c8a8",
      "title": "‘Served Milan like bread’ – Füllkrug’s permanent transfer cannot be ruled out",
      "url": "https://sempremilan.com/fullkrug-permanent-transfer-milan-not-ruled-out",
      "source": "sempremilan.com",
      "date": "2026-02-05T19:30:00+00:00",
      "summary": "When Niclas Füllkrug first arrived at AC Milan, many turned their noses up at the German. However, he is playing his role perfectly so far.  It was clear from the off that Milan were not signing Füllkrug to be the first choice striker for Massimiliano Allegri. But, with no physical option in his tea"
    },
    {
      "id": "439cbcb3f47e",
      "title": "Pedulla explains why Cremonese defeat was a ‘footballing blessing’ for Milan",
      "url": "https://sempremilan.com/pedulla-why-cremonese-was-blessing-for-milan",
      "source": "sempremilan.com",
      "date": "2026-02-05T19:00:00+00:00",
      "summary": "When AC Milan started the season with a defeat to Cremonese, many will have thought the worst about the season. However, it may have been a blessing.  It seemed Milan were in for another of those seasons when they restarted their Serie A action with an opening day defeat at San Siro. For many, it […"
    },
    {
      "id": "315e9ffa9445",
      "title": "Galliani recalls Ibrahimovic pursuit to ‘please’ Allegri in Scudetto season: “With Berlusconi’s money”",
      "url": "https://sempremilan.com/galliani-recalls-ibrahimovic-story-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-05T18:30:00+00:00",
      "summary": "Zlatan Ibrahimovic first joined AC Milan in 2010, but things could have been much different had it not been for Adriano Galliani.  Ibrahimovic is one of the most recognisable names in European football, and his relationship with Milan makes his name more popular in this sphere than elsewhere, perhap"
    },
    {
      "id": "03fcdf3e34d5",
      "title": "CM: ‘More remote than ever’ – Vlahovic renewal looks impossible currently",
      "url": "https://sempremilan.com/vlahovic-renewal-looks-impossible-currently",
      "source": "sempremilan.com",
      "date": "2026-02-05T18:00:00+00:00",
      "summary": "AC Milan have been given more good news at this moment, as it seems their chances of landing Dusan Vlahovic have increased. The pursuit of Vlahovic has been ongoing for some time now, and Milan are not leaving it. In fact, Igli Tare and Massimiliano Allegri share a belief that he should join in the "
    },
    {
      "id": "44690074d648",
      "title": "Adjustments unlock battle of space manipulation: Tactical analysis of Bologna 0-3 AC Milan",
      "url": "https://sempremilan.com/tactical-analysis-of-bologna-0-3-ac-milan",
      "source": "sempremilan.com",
      "date": "2026-02-05T17:30:00+00:00",
      "summary": "AC Milan walked away from the Stadio Renato dall’Ara on Tuesday night with three goals and three precious points against Bologna. The majority of the work in the eventual 3-0 win was done in an impressive first half by Milan. Ruben Loftus-Cheek fired in the first goal from Adrien Rabiot’s cut-back a"
    },
    {
      "id": "e7929d8a047a",
      "title": "CM: Leao, Pulisic, Gimenez and Saelemaekers train during Milanello off days",
      "url": "https://sempremilan.com/leao-pulisic-gimenez-saelemaekers-train-day-off",
      "source": "sempremilan.com",
      "date": "2026-02-05T17:00:00+00:00",
      "summary": "Currently, Milanello is considered closed, given most of the AC Milan squad are enjoying some deserved time off, after their 3-0 win against Bologna. However, it is not the case for everyone.  Shortly after the win this week, it was reported that Milanello would be vacant for a few days, with Massim"
    },
    {
      "id": "8032cb9d385f",
      "title": "Repubblica: Tare and Allegri closer than ever – how the relationship is helping Milan",
      "url": "https://sempremilan.com/tare-allegri-closer-than-ever-helping-milan",
      "source": "sempremilan.com",
      "date": "2026-02-05T16:30:00+00:00",
      "summary": "Igli Tare and Massimiliano Allegri arrived at AC Milan in the same summer, yet it feels like the pair have been working together for much longer.  Hiring a new manager and sporting director in the same period can be a risk. After all, the two need to align quickly and ensure that they have the […]\nT"
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    },
    {
      "id": "b17892f94874",
      "title": "Hazard: ‘I was a Milan fan’, ‘special’ relationship with Sarri, but Mourinho the best",
      "url": "https://football-italia.net/hazard-milan-fan-sarri-special-mourinho-best/",
      "source": "football-italia.net",
      "date": "2026-02-05T10:54:34+00:00",
      "summary": "Former Belgian star Eden Hazard reveals he was a Milan fan as a kid and..."
    },
    {
      "id": "f86a3c2aa1e5",
      "title": "Del Piero: Juventus ‘must’ have title belief, but avoids Yildiz comparison",
      "url": "https://football-italia.net/del-piero-juventus-title-no-yildiz-comparison/",
      "source": "football-italia.net",
      "date": "2026-02-05T09:35:42+00:00",
      "summary": "Juventus legend Alessandro Del Piero feels the Bianconeri can still aim for the Serie A..."
    },
    {
      "id": "a5543b121859",
      "title": "Marotta: ‘Inter approve of rotation, Milan have an advantage for Scudetto’",
      "url": "https://football-italia.net/marotta-inter-approve-rotation-milan-advantage/",
      "source": "football-italia.net",
      "date": "2026-02-04T19:52:47+00:00",
      "summary": "Inter President Beppe Marotta backs the squad rotation for the Coppa Italia quarter-final with Torino..."
    },
    {
      "id": "9de86510452c",
      "title": "Why Inter vs. Torino Coppa Italia clash moved for 2026 Winter Olympics",
      "url": "https://football-italia.net/why-inter-vs-torino-coppa-italia-clash-moved/",
      "source": "football-italia.net",
      "date": "2026-02-04T17:23:22+00:00",
      "summary": "Tonight’s Coppa Italia quarter-final is technically Inter hosting Torino, but the 2026 Winter Olympics mean..."
    },
    {
      "id": "d1ee46184128",
      "title": "Milan eyeing Italy striker for summer transfer window but unwilling to spend €62m",
      "url": "https://football-italia.net/milan-eyeing-italy-striker-for-summer/",
      "source": "football-italia.net",
      "date": "2026-02-04T16:31:09+00:00",
      "summary": "Wednesday’s reports claim that Milan are eyeing a potential move for Italy international Moise Kean..."
    },
    {
      "id": "2b1e8827ad38",
      "title": "Capello analyses Milan’s 3-0 win over Bologna: ‘Foolish not to consider the Scudetto’",
      "url": "https://football-italia.net/capello-analyses-milans-3-0-win-over-bologna/",
      "source": "football-italia.net",
      "date": "2026-02-04T12:42:25+00:00",
      "summary": "Fabio Capello has had his say on Milan’s recent 3-0 victory over Bologna in Serie..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-04T11:21:04+00:00",
      "summary": "Recent reports claim that Alex Jimenez’s loan move to AFC Bournemouth is set to be..."
    },
    {
      "id": "b268dce71cdf",
      "title": "Today’s Papers – Milan impress in Bologna, Yildiz extends with Juventus",
      "url": "https://football-italia.net/todays-papers-milan-impress-in-bologna-yildiz-extends-with-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-04T08:29:55+00:00",
      "summary": "La Gazzetta dello Sport “What the Devil!” Milan overwhelm Bologna (3-0) and remain five points..."
    },
    {
      "id": "a7d106533e6a",
      "title": "Allegri: ‘Important to reach 50 points, but Milan have to do better’",
      "url": "https://football-italia.net/allegri-important-for-milan-to-reach-50-points/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:52:34+00:00",
      "summary": "Massimiliano Allegri believes that there is still room for improvement for his Milan side, despite..."
    },
    {
      "id": "6b625068a1fd",
      "title": "Italiano: ‘Bologna can’t put in two consecutive top-level performances’",
      "url": "https://football-italia.net/italiano-bologna-two-consecutive-performances/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:42:19+00:00",
      "summary": "Vincenzo Italiano was left bemused and questioning why his Bologna side do not seem able..."
    },
    {
      "id": "258cd38cc2c7",
      "title": "Player ratings: Bologna 0-3 Milan – French connection (and some UK)",
      "url": "https://football-italia.net/ratings-bologna-0-3-milan-french-connection/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:12:07+00:00",
      "summary": "A combination of Milan’s French stars and Englishman Ruben Loftus-Cheek were among the best players..."
    },
    {
      "id": "a85b54e36767",
      "title": "Serie A | Bologna 0-3 Milan: Who needs Mateta?",
      "url": "https://football-italia.net/serie-a-bologna-0-3-milan-who-needs-mateta/",
      "source": "football-italia.net",
      "date": "2026-02-03T21:40:19+00:00",
      "summary": "Milan were unable to seal a deadline day transfer for Crystal Palace striker Jean-Philippe Mateta,..."
    },
    {
      "id": "ce1a398b6a46",
      "title": "Serie A Liveblog: Bologna vs. Milan",
      "url": "https://football-italia.net/serie-a-liveblog-bologna-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-03T19:45:46+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "14b7ffb82d41",
      "title": "Three different experts warned Milan against Mateta signing",
      "url": "https://football-italia.net/three-experts-warned-milan-off-mateta/",
      "source": "football-italia.net",
      "date": "2026-02-03T19:17:56+00:00",
      "summary": "Reports in Italy claim that three different medical experts advised Milan against signing Crystal Palace..."
    },
    {
      "id": "f9e41c5bf4af",
      "title": "Serie A: Bologna vs. Milan – Confirmed line-ups",
      "url": "https://football-italia.net/serie-a-bologna-milan-confirmed-line-ups/",
      "source": "football-italia.net",
      "date": "2026-02-03T18:50:01+00:00",
      "summary": "Milan will have to do without Rafael Leao, Christian Pulisic and Alexis Saelemaekers in their..."
    },
    {
      "id": "7ae165f6b5f2",
      "title": "Most expensive Serie A sales of 2026 January transfer window",
      "url": "https://football-italia.net/most-expensive-serie-a-sales-of-january-2026/",
      "source": "football-italia.net",
      "date": "2026-02-03T18:15:08+00:00",
      "summary": "Ademola Lookman was the most expensive Serie A sale of the 2026 January transfer window,..."
    },
    {
      "id": "184ff5860f45",
      "title": "Top 10 most expensive Serie A signings of January transfer window",
      "url": "https://football-italia.net/top-10-most-expensive-serie-a-signings-jan-26/",
      "source": "football-italia.net",
      "date": "2026-02-03T17:30:20+00:00",
      "summary": "Lorenzo Lucca, Giacomo Raspadori and Robinio Vaz were among the most expensive Serie A signings..."
    },
    {
      "id": "db2741388765",
      "title": "Retired Italy Euro winner regrets not playing at World Cup: ‘I failed’",
      "url": "https://football-italia.net/florenzi-italy-euro-winner-regret-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-03T14:56:23+00:00",
      "summary": "Former Italy international Alessandro Florenzi regrets not playing in the World Cup despite winning the..."
    }
  ]
}