{
  "lastUpdated": "2026-02-25T06:00:22.386860+00:00",
  "articles": [
    {
      "id": "1f5585085130",
      "title": "Ronaldinho against modern football: \"I only watch the highlights, 90 minutes are too long\"",
      "url": "https://www.milannews.it/news/ronaldinho-contro-il-calcio-moderno-guardo-solo-gli-highlights-90-minuti-sono-troppi-608599",
      "source": "milannews.it",
      "date": "2026-02-24T23:50:15+00:00",
      "summary": "In a long interview given to the Spanish sports newspaper MARCA, Ronaldinho spoke about modern football. These are his words:\n\n\"I don't like watching football matches."
    },
    {
      "id": "41f209e14b93",
      "title": "Calvarese is not convinced of the VAR-Piccinini dialogue: “Confusing review”",
      "url": "https://www.milannews.it/news/calvarese-non-e-convinto-del-dialogo-var-piccinini-revisione-confusionaria-608597",
      "source": "milannews.it",
      "date": "2026-02-24T23:40:12+00:00",
      "summary": "In his Instagram profile, former referee Gianpaolo Calvarese reported the dialogue between VAR and Piccinini during the review of Parma's goal for a possible foul on Maignan."
    },
    {
      "id": "3501b4d569dc",
      "title": "Borghi has no doubts: \"Yet another refereeing error, VAR could not and should not have intervened\"",
      "url": "https://www.milannews.it/news/borghi-non-ha-dubbi-ennesimo-errore-arbitrale-il-var-non-poteva-e-non-doveva-intervenire-608593",
      "source": "milannews.it",
      "date": "2026-02-24T23:30:30+00:00",
      "summary": "On his YouTube channel, Stefano Borghi commented on Milan-Parma as follows, in particular the final episode of Troilo's goal which according to the Sky journalist should have been cancelled:\n\n“The final episode brings us back to the q..."
    },
    {
      "id": "e0c3691cbd38",
      "title": "Tommasi: \"There was a fielding error regarding the goal disallowed against Napoli\"",
      "url": "https://www.milannews.it/news/tommasi-sul-gol-annullato-al-napoli-c-e-un-errore-di-campo-608588",
      "source": "milannews.it",
      "date": "2026-02-24T23:20:45+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 24 - \"Hojlund steals time from Hien, it's not enough to consider him a foul.\""
    },
    {
      "id": "93c7cdcba878",
      "title": "Milan, new player on warning: the response of the Sports Judge",
      "url": "https://www.milannews.it/news/milan-nuovo-giocatore-in-diffida-il-responso-del-giudice-sportivo-608581",
      "source": "milannews.it",
      "date": "2026-02-24T23:10:00+00:00",
      "summary": "The decisions of the Sports Judge regarding the matches valid for the 26th matchday of Serie A which ended yesterday have been made known."
    },
    {
      "id": "641ba1ddd894",
      "title": "The eggs on the bus. Cheerful and limited visions. 54 points, great result. Lissone, capital of referees",
      "url": "https://www.milannews.it/editoriale/le-uova-sul-pullman-allegri-e-le-visioni-limitate-54-punti-grande-risultato-lissone-capitale-degli-arbitri-608603",
      "source": "milannews.it",
      "date": "2026-02-24T23:00:01+00:00",
      "summary": "It happened 30 years ago, more or less these days. It was in fact March 24, 1996."
    },
    {
      "id": "a9d4709b4499",
      "title": "Viviano forte: “Leao aims for one of the biggest follies of the last 10 years”",
      "url": "https://www.milannews.it/news/viviano-forte-leao-punta-una-delle-piu-grandi-follie-degli-ultimi-10-anni-608592",
      "source": "milannews.it",
      "date": "2026-02-24T22:50:07+00:00",
      "summary": "During the last episode of the Aura Sport podcast, Viviano expressed himself like this about Milan after the match against Parma:\n\n“For me it is one of the greatest craziness I have seen in the last 10 years to see Leao punt ..."
    },
    {
      "id": "3f1f9e76d9ea",
      "title": "Muriel: \"Every time I played against Milan, Maldini told me: 'You didn't want to come to me!'\"",
      "url": "https://www.milannews.it/calciomercato-milan/muriel-ogni-volta-che-giocavo-contro-il-milan-maldini-mi-diceva-non-sei-voluto-venire-da-me-608493",
      "source": "milannews.it",
      "date": "2026-02-24T22:40:18+00:00",
      "summary": "Luis Muriel, in the WSA Confidential podcast of the World Soccer Agency, spoke together with his agent Alessandro Lucci about when he was close to Milan before moving to Fiorentina instead."
    },
    {
      "id": "d1745f59c4e1",
      "title": "De Paola on Troilo's goal: \"If Bartesaghi had simulated, a foul would probably have been called\"",
      "url": "https://www.milannews.it/news/de-paola-sul-gol-di-troilo-se-bartesaghi-avesse-simulato-probabilmente-sarebbe-stato-fischiato-fallo-608544",
      "source": "milannews.it",
      "date": "2026-02-24T22:30:00+00:00",
      "summary": "Paolo De Paola, on TMW Radio, commented on the controversial refereeing episodes of the weekend: \"With the controversy raging, some things need to be clarified."
    },
    {
      "id": "39806c5970a7",
      "title": "Criscitiello critical: \"Milan made a mistake in building the team in some areas of the pitch\"",
      "url": "https://www.milannews.it/news/criscitiello-critico-il-milan-ha-sbagliato-la-costruzione-della-squadra-in-alcune-zone-del-campo-608590",
      "source": "milannews.it",
      "date": "2026-02-24T22:20:05+00:00",
      "summary": "During the last episode of the Aura Sport podcast, the director of Sportitalia Criscitiello expressed himself as follows on Milan after the match against Parma:\n\n“Playing without attack in a team like Milan, you struggle to ..."
    },
    {
      "id": "eeb5032c496d",
      "title": "Champions League, the results of the evening: Inter eliminated by Bodo Glimt",
      "url": "https://www.milannews.it/news/champions-league-i-risultati-della-serata-inter-eliminata-dal-bodo-glimt-608596",
      "source": "milannews.it",
      "date": "2026-02-24T22:10:53+00:00",
      "summary": "The first evening of the Champions League play-off returns ended and the first four verdicts were issued: Bodo Glimt, Bayer Leverkusen, Newcastle and Atletico Madrid progress to the round of 16. These are all the results of the evening."
    },
    {
      "id": "baf1543d8885",
      "title": "Hauge sends Inter home: sensational elimination from the Champions League for the Nerazzurri",
      "url": "https://www.milannews.it/news/hauge-manda-a-casa-l-inter-clamorosa-eliminazione-dalla-champions-per-i-nerazzurri-608595",
      "source": "milannews.it",
      "date": "2026-02-24T22:00:35+00:00",
      "summary": "Against all odds, Bodo Glimt also beat Inter at San Siro in the return match and eliminated the Nerazzurri from the Champions League."
    },
    {
      "id": "5f61808ee82b",
      "title": "Against Parma, Milan kicked 25 shots towards goal without finding the goal",
      "url": "https://www.milannews.it/news/contro-il-parma-il-milan-ha-calciato-25-tiri-verso-la-porta-senza-trovare-il-gol-608535",
      "source": "milannews.it",
      "date": "2026-02-24T21:50:19+00:00",
      "summary": "The second defeat in the championship for the Rossoneri arrived on Sunday evening after the home defeat on the first day against Cremonese, dated 23 August and which had augured another season."
    },
    {
      "id": "4fa7b2ffdd36",
      "title": "Milan-Parma, Capuano: \"Audio between the referee and the VAR room on the occasion of Parma's goal is a concentration of confusion and communication errors\"",
      "url": "https://www.milannews.it/news/milan-parma-capuano-audio-tra-arbitro-e-sala-var-in-occasione-del-gol-del-parma-e-un-concentrato-di-confusione-ed-errori-di-comunicazione-608585",
      "source": "milannews.it",
      "date": "2026-02-24T21:40:00+00:00",
      "summary": "Giovanni Capuano, a well-known journalist and sports commentator, spoke on his X account regarding the serious errors that occurred in Milan-Parma and all the confusion caused by the use of VAR."
    },
    {
      "id": "e13505370150",
      "title": "Borghi underlines: “Milan had two problems: bad luck and wasted opportunities”",
      "url": "https://www.milannews.it/news/borghi-sottolinea-il-milan-ha-avuto-due-problemi-sfortuna-e-occasioni-sprecate-608591",
      "source": "milannews.it",
      "date": "2026-02-24T21:30:31+00:00",
      "summary": "On his YouTube channel, Stefano Borghi commented on Milan-Parma as follows:\n\n“The offensive issue should be reported."
    },
    {
      "id": "a31349e84380",
      "title": "Cattaneo: \"The fact that Milan has come to think of competing with Inter, with the very obvious limitations of the squad, is a result superior to the team's values\"",
      "url": "https://www.milannews.it/news/cattaneo-che-il-milan-sia-arrivato-a-pensare-di-competere-con-l-inter-con-gli-evidentissimi-limiti-della-rosa-e-un-risultato-superiore-ai-valori-della-608459",
      "source": "milannews.it",
      "date": "2026-02-24T21:20:34+00:00",
      "summary": "In the Tik Tok profile of La Repubblica, Marco Cattaneo expressed himself like this after Milan-Parma\n\n\"If Inter gets their hands on their 21st scudetto it is certainly due to their strength but also due to their thousand imperfections..."
    },
    {
      "id": "0f0149e8ab59",
      "title": "Borghi and the offensive problems: \"Milan played the game, many opportunities didn't materialize\"",
      "url": "https://www.milannews.it/news/borghi-e-i-problemi-offensivi-il-milan-ha-fatto-la-partita-tante-occasioni-non-concretizzate-608589",
      "source": "milannews.it",
      "date": "2026-02-24T21:10:20+00:00",
      "summary": "On his YouTube channel, Stefano Borghi commented on Milan-Parma as follows:\n\n“Milan came to the match with 24 consecutive days without defeat, 19 consecutive matches scoring, Parma arrived and all these things..."
    },
    {
      "id": "bfdf3d27cf47",
      "title": "Paulo Fonseca attacks Trump and Infantino: \"People who only think about money\"",
      "url": "https://www.milannews.it/gli-ex/paulo-fonseca-attacca-trump-e-infantino-gente-che-pensa-solo-ai-soldi-608578",
      "source": "milannews.it",
      "date": "2026-02-24T21:00:00+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 24 - In an interview with l'Equipe granted on the occasion of the four years since the start of the war in Ukraine, the coach of Lyon, Paulo Fonseca, whose wife is originally from Donetsk, spoke about the conflict ..."
    },
    {
      "id": "4d6cc0fc139b",
      "title": "MN - Collovati scales back Milan's ambitions: \"Scudetto? I've never deluded myself. The Devil's big goal is the Champions League\"",
      "url": "https://www.milannews.it/news/mn-collovati-ridimensiona-le-ambizioni-del-milan-scudetto-non-mi-sono-mai-illuso-il-grande-obiettivo-del-diavolo-e-la-champions-608568",
      "source": "milannews.it",
      "date": "2026-02-24T20:50:00+00:00",
      "summary": "Complicated days for Milan: from the home defeat against Parma to the consequent -10 from Inter. Not to mention yet another refereeing mistake."
    },
    {
      "id": "211a162a3fbd",
      "title": "Four months before the World Cup, Advocaat, coach of Cinderella Curaçao, resigns",
      "url": "https://www.milannews.it/news/a-quattro-mesi-dal-mondiale-si-dimette-advocaat-ct-della-cenerentola-curacao-608523",
      "source": "milannews.it",
      "date": "2026-02-24T20:40:28+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 23 - The nation of Curaçao, the smallest to qualify for the 2026 World Cup, will have to do without its coach, the Dutch Dick Advocaat, who resigned for family reasons."
    },
    {
      "id": "c09bbcf4c99d",
      "title": "GdS: Why there are still doubts about Milan-Inter derby will be played",
      "url": "https://sempremilan.com/why-doubts-milan-inter-derby-played",
      "source": "sempremilan.com",
      "date": "2026-02-24T20:11:45+00:00",
      "summary": "The Milan derby is one of those occasions that almost every Italian football fan stops to watch, but there are doubts about when it will be played. According to La Gazzetta dello Sport, the Derby della Madonnina is scheduled to be played on Sunday, March 8th at 20:45 CEST. The match is one of the […"
    },
    {
      "id": "ba735388b4ef",
      "title": "Video exposes the 10 refereeing errors that have gone against AC Milan this season",
      "url": "https://sempremilan.com/10-refereeing-errors-against-milan-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-24T19:00:00+00:00",
      "summary": "A video that has gone viral on social media has explained the 10 major errors that AC Milan have been on the wrong end of this season. After the Como draw, Milan left San Siro bitter about Van der Brempt’s nasty foul on Pavlovic and the failure to send off Cesc Fabregas for holding Alexis […]\nThe po"
    },
    {
      "id": "37828f3229f1",
      "title": "Sky: Nkunku in line to return vs. Cremonese as Leao battles inflammation again",
      "url": "https://sempremilan.com/nkunku-return-cremonese-leao-inflammation",
      "source": "sempremilan.com",
      "date": "2026-02-24T18:36:36+00:00",
      "summary": "AC Milan resumed training at Milanello on Tuesday, beginning preparations for Sunday’s match against Cremonese. The defeat against Parma on Sunday has pretty much put an end to the Scudetto pursuit, barring a miraculous run of form that would also have to coincide with Inter having a drop-off that t"
    },
    {
      "id": "eda27f8559d0",
      "title": "Late changes, in-game tweaks and set-piece woes: Tactical analysis of AC Milan 0-1 Parma",
      "url": "https://sempremilan.com/tactical-analysis-of-ac-milan-0-1-parma",
      "source": "sempremilan.com",
      "date": "2026-02-24T18:00:00+00:00",
      "summary": "AC Milan suffered their second defeat and most damaging result of the league season on Sunday night, losing to Parma at San Siro. There should have been a desire for revenge in the air after the 2-2 draw in the reverse fixture and the perceived injustices of the 1-1 tie with Como four nights prior, "
    },
    {
      "id": "aa70d59b9006",
      "title": "CM: Why Milan face a tough battle to sign Goretzka despite contacts and Allegri’s push",
      "url": "https://sempremilan.com/why-milan-battle-goretzka-contacts-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-24T17:30:00+00:00",
      "summary": "Leon Goretzka remains a name that AC Milan are exploring, but signing him on a free transfer will be a difficult mission. According to Calciomercato.com, Goretzka has chosen not to renew his contract with Bayern Munich which means that he is available to agree a pre-contract with another club now. T"
    },
    {
      "id": "efda16e14f03",
      "title": "Sportitalia: Allegri considering Milan future – why he is ‘unhappy with many things’",
      "url": "https://sempremilan.com/allegri-considering-milan-future-unhappy",
      "source": "sempremilan.com",
      "date": "2026-02-24T17:00:00+00:00",
      "summary": "Massimiliano Allegri is not guaranteed to stay at AC Milan beyond the end of the current season, according to a shock report. Allegri’s return to Milan was made official before the start of the new campaign, with the coach returning after a previous four year spell from 2010 to 2014 which culminated"
    },
    {
      "id": "7367715a2cf2",
      "title": "Former Serie A referee plays down controversial decisions in Milan defeat to Parma",
      "url": "https://football-italia.net/tommasi-milan-parma-open-var/",
      "source": "football-italia.net",
      "date": "2026-02-24T16:51:37+00:00",
      "summary": "Parma’s late 1-0 victory against Milan at San Siro has continued to generate significant debate..."
    },
    {
      "id": "9c6bd17e5300",
      "title": "GdS: Four obvious areas to address – Milan’s summer squad improvement strategy",
      "url": "https://sempremilan.com/milan-summer-squad-improvement-strategy",
      "source": "sempremilan.com",
      "date": "2026-02-24T16:40:04+00:00",
      "summary": "AC Milan’s squad has shown itself to be not up to task in the Scudetto battle, so some changes are needed in the summer. As La Gazzetta dello Sport report, when a season takes a turn for the worse and snatches away dreams of glory, it becomes almost automatic to put the team under the […]\nThe post G"
    },
    {
      "id": "db235266865b",
      "title": "Open VAR reveals confusion between officials over Parma’s goal vs. Milan",
      "url": "https://sempremilan.com/open-var-confusion-officials-parma-milan",
      "source": "sempremilan.com",
      "date": "2026-02-24T16:00:00+00:00",
      "summary": "The highly anticipated episode of Open VAR has been released, which reveals the conversations between officials for controversial incidents. There has been a lot of debate surrounding a couple of key incidents that happened during Sunday’s match against Parma at San Siro, above all the winning goal "
    },
    {
      "id": "58a90e871e18",
      "title": "SempreMilan Podcast: Episode 402 – The Week The Dream Died",
      "url": "https://sempremilan.com/sempremilan-podcast-episode-402-the-week-the-dream-died",
      "source": "sempremilan.com",
      "date": "2026-02-24T15:30:00+00:00",
      "summary": "Join Oli, Anthony and ‪Bdair as they discuss the feisty draw with Como, the controversial loss to Parma and where this leaves the title race. This week’s topics include… ↳ Fabregas a disgrace in Como draw ↳ More VAR drama in Parma loss ↳ Revenge needed on Cremonese ↳ Concerns about Allegri and the 3"
    },
    {
      "id": "dcae094c9ff5",
      "title": "Alphadjo Cissè undergoes surgery on tendon in Finland – four-month absence expected",
      "url": "https://sempremilan.com/alphadjo-cisse-surgery-four-months-out",
      "source": "sempremilan.com",
      "date": "2026-02-24T15:00:00+00:00",
      "summary": "An update has arrived regarding Alphadjo Cissè, and it has been confirmed that the season has come to an early end for the young midfielder. The signing of Cissè from Hellas Verona was announced on the final day of the window. In the statement, it was confirmed that the attacking midfielder would re"
    },
    {
      "id": "2b340034eaf2",
      "title": "Tuttosport: Juventus to discuss renewal with star – Milan remain at the window",
      "url": "https://sempremilan.com/juventus-renewal-vlahovic-milan-remain-window",
      "source": "sempremilan.com",
      "date": "2026-02-24T14:27:30+00:00",
      "summary": "For several months now, AC Milan have been among the teams most interested in Dusan Vlahovic, whose contract expires in June. According to today’s edition of Tuttosport (via MilanPress) however, Vlahovic has always kept the door open for Juventus and the idea of extending. Given the difficulties for"
    },
    {
      "id": "b5674eb1f598",
      "title": "‘End of discussion’ – Ex-Milan and Parma goalkeeper Galli explains why Maignan was fouled",
      "url": "https://sempremilan.com/galli-why-maignan-failed-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-24T13:35:00+00:00",
      "summary": "Former AC Milan goalkeeper Giovanni Galli has explained why the winning goal for Parma on Sunday should have been disallowed. Inside the final 10 minutes of Milan’s streak-ending defeat to Parma, there was a hugely divisive incident from which the away side took the lead and ultimately snatched all "
    },
    {
      "id": "edfac022e6f4",
      "title": "MN: Milan silent, rivals make noise – calm approach over refereeing errors not working",
      "url": "https://sempremilan.com/milan-silent-rivals-noise-refereeing-errors",
      "source": "sempremilan.com",
      "date": "2026-02-24T13:10:00+00:00",
      "summary": "AC Milan have chosen an approach different to that of their rivals when it comes to disagreeing with refereeing decisions. As MilanNews write, Sunday’s defeat against Parma was just the latest in a series of matches that saw Milan harmed in some way by rather dubious officiating decisions. The list "
    },
    {
      "id": "4a28fd45a8e1",
      "title": "Moretto: Contract talks with Milan director ‘progressing’ after situation ‘seemed thorny’",
      "url": "https://sempremilan.com/contract-talks-kirovski-progressing-positively",
      "source": "sempremilan.com",
      "date": "2026-02-24T12:45:00+00:00",
      "summary": "AC Milan and Jovan Kirovski have had positive contacts regarding the extension of his contract, according to Matteo Moretto. As a reminder, Kirosvki was brought in to oversee the Milan Futuro project in the summer of 2024, and it seemed Zlatan Ibrahimovic had a hand in things given the pair first be"
    },
    {
      "id": "bee39b380985",
      "title": "CorSport: Pulisic to ‘evaluate’ Milan future amid renewal talk and form issue – the situation",
      "url": "https://sempremilan.com/pulisic-evaluate-milan-future-renewal-form",
      "source": "sempremilan.com",
      "date": "2026-02-24T12:20:00+00:00",
      "summary": "Christian Pulisic is not in the best form at the moment, both in terms of his condition and his attacking output. His AC Milan future is not certain, either. The future of Pulisic has suddenly become a hot topic at Milan, with his contract set to expire in less than 18 months. According to Corriere "
    },
    {
      "id": "5c271175136f",
      "title": "GdS: Depth, home form and bad runs – how Milan sunk to 10 points behind Inter",
      "url": "https://sempremilan.com/how-milan-sunk-10-points-behind-inter",
      "source": "sempremilan.com",
      "date": "2026-02-24T11:55:00+00:00",
      "summary": "When AC Milan review why their title bid faltered, it is hard to look beyond their record against bottom-half teams, especially at home. As La Gazzetta dello Sport report, Milan tried to cling on as long as they could while Inter won game after game. However, with the gap now 10 points, it seems as "
    },
    {
      "id": "1eaf0cf69210",
      "title": "Tunnel change and talks with old Milan team-mates: Hauge at home ahead of San Siro return",
      "url": "https://sempremilan.com/hauge-at-home-milan-inter-bodo-glimt",
      "source": "sempremilan.com",
      "date": "2026-02-24T11:30:00+00:00",
      "summary": "Jens Petter Hauge has admitted that Bodo/Glimt’s Champions League play-off second leg against Inter will have a bit of extra meaning. Hauge’s story is somewhat of a fairytale given that he first played at San Siro for Bodo against Milan in a Europa League play-off, impressing with a wonderful goal a"
    },
    {
      "id": "bfe010df21ac",
      "title": "Reports: Gabbia’s scan provides positive news – return vs. Cremonese a possibility",
      "url": "https://sempremilan.com/gabbia-return-vs-cremonese-a-possibility",
      "source": "sempremilan.com",
      "date": "2026-02-24T11:05:00+00:00",
      "summary": "Sunday’s match against Parma brought bad news, not only for AC Milan’s title pursuit but also on the injury front too. In the space of a few minutes, Massimiliano Allegri lost two players. The first was Matteo Gabbia, who was warming up as normal getting ready for a start in the middle of the three-"
    },
    {
      "id": "444653021d6b",
      "title": "Seven home wins in 13 games: Lorenzo and Stefano analyse Milan’s San Siro struggles",
      "url": "https://sempremilan.com/milan-san-siro-struggles-7-wins-13-games",
      "source": "sempremilan.com",
      "date": "2026-02-24T10:40:00+00:00",
      "summary": "AC Milan played two home games last week, and they failed to win either of them. As a result, the Scudetto dream has ended before March.  Milan’s home form has become a big problem. They have won just over half of their games at San Siro this season, with seven wins, four draws and two […]\nThe post "
    },
    {
      "id": "b310a608bcd9",
      "title": "GdS: Wrong decision, long absence and renewal doubt – Milan angry after Loftus-Cheek blow",
      "url": "https://sempremilan.com/milan-angry-after-loftus-cheek-blow",
      "source": "sempremilan.com",
      "date": "2026-02-24T10:15:00+00:00",
      "summary": "AC Milan will be without Ruben Loftus-Cheek for an extended period of time, and it is a double blow for the club to digest. As La Gazzetta dello Sport (seen below) write this morning, Loftus-Cheek was left ‘bloodied and toothless, with swollen and bruised lips’ after Milan-Parma, but that could also"
    },
    {
      "id": "af0191216a1b",
      "title": "Today’s Papers: Champions League, Inter-Bodo/Glimt, McKennie renewal",
      "url": "https://football-italia.net/todays-papers-champions-league-inter-bodo/",
      "source": "football-italia.net",
      "date": "2026-02-24T08:41:35+00:00",
      "summary": "La Gazzetta dello Sport  In with the goals  Champions League: Inter looking for the comeback..."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "7d1eaf8982a2",
      "title": "Serie A | Milan 0-1 Parma – Player Ratings as Troilo and Corvi batten down the hatches",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-player-ratings/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:09:16+00:00",
      "summary": "Milan fell to a late 1-0 defeat to Parma this evening, after they were unable..."
    },
    {
      "id": "0338d8d0b0d7",
      "title": "Serie A | Milan 0-1 Parma: Rossoneri suffer shocking first defeat in 24 rounds",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-shocking-defeat-24/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:05:53+00:00",
      "summary": "Milan paid the price for insipid finishing and sluggish defending, as Parma inflicted their first..."
    },
    {
      "id": "ad92e7503a8c",
      "title": "Ex-West Ham & Villa man Reo-Coker: ‘Fabregas pull on Saelemaekers inexcusable’",
      "url": "https://football-italia.net/ex-west-ham-villa-man-reo-coker-fabregas/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:50:32+00:00",
      "summary": "Former West Ham and Aston Villa midfielder turned CBS Sports Golazo pundit Nigel Reo-Coker has..."
    },
    {
      "id": "be4ffa2fa372",
      "title": "Milan double blow as Loftus-Cheek and Gabbia suffer injuries",
      "url": "https://football-italia.net/milan-double-loftus-cheek-gabbia-injuries/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:25:58+00:00",
      "summary": "Milan suffered two major injuries in their match against Parma, as Matteo Gabbia pulled out..."
    }
  ]
}