{
  "lastUpdated": "2026-02-14T12:43:49.663325+00:00",
  "articles": [
    {
      "id": "e91f68b39d00",
      "title": "Modric MVP of Pisa-Milan for over 90% of voting AC Milan fans. Athekame, Loftus-Cheek and Pavlovic beaten",
      "url": "https://www.milannews.it/news/modric-mvp-di-pisa-milan-per-oltre-il-90-dei-milanisti-votanti-battuti-athekame-loftus-cheek-e-pavlovic-607426",
      "source": "milannews.it",
      "date": "2026-02-14T12:36:23+00:00",
      "summary": "Milan won an important victory against Pisa, winning by 2-1 thanks to an extraordinary performance by Luka Modrić."
    },
    {
      "id": "37c6408d2d83",
      "title": "LIVE MN - Primavera, Genoa-Milan (0-0): direct red for Carbone, rossoblu in 10...",
      "url": "https://www.milannews.it/primo-piano/live-mn-primavera-genoa-milan-0-0-rosso-diretto-per-carbone-rossoblu-in-10-607433",
      "source": "milannews.it",
      "date": "2026-02-14T12:33:18+00:00",
      "summary": "35' Perera heads the ball to Pandolfi who controls it with his thigh and then tries a left-footed shot just outside the penalty area, the ball goes wide."
    },
    {
      "id": "f3f919b3f2b3",
      "title": "Adani: \"Don't be fooled, I certainly am not, by the result: once again, Allegri prepared it well\"",
      "url": "https://www.milannews.it/news/adani-non-fatevi-ingannare-io-di-certo-non-lo-faccio-dal-risultato-un-altra-volta-allegri-l-ha-preparata-bene-607434",
      "source": "milannews.it",
      "date": "2026-02-14T12:29:49+00:00",
      "summary": "Daniele Adani, commentator, expressed himself as follows on his social channels, commenting on Pisa-Milan: \"Guys, don't be fooled - and I certainly am not fooled - by the result and how it developed."
    },
    {
      "id": "20abf7c34bdd",
      "title": "The club's comment on Pisa-Milan: \"Allegri's team confirms that it has the right mentality and the hunger to win\"",
      "url": "https://www.milannews.it/news/il-commento-del-club-a-pisa-milan-la-squadra-di-allegri-conferma-di-avere-la-giusta-mentalita-e-la-fame-di-vincere-607374",
      "source": "milannews.it",
      "date": "2026-02-14T12:24:30+00:00",
      "summary": "Below is AC Milan's comment, via the club's official website, on Pisa-Milan (1-2):\n\n\"The Milan overcomes the Pisa 2-1 with the thrill, picking up another three points and continuing the run of results..."
    },
    {
      "id": "5a52ab37177a",
      "title": "Photo: Rabiot sends signal to Pisa-Milan referee with Instagram story",
      "url": "https://sempremilan.com/rabiot-signal-pisa-milan-referee-instagram",
      "source": "sempremilan.com",
      "date": "2026-02-14T12:20:00+00:00",
      "summary": "Adrien Rabiot has sent a message to the Pisa-Milan referee, and the officiating team in general, with a story on Instagram. Rabiot was sent off in the dying minutes of the Rossoneri’s 2-1 win, first receiving a yellow card for a light touch on a Pisa player. Evidently not happy with the call, he sai"
    },
    {
      "id": "3d55ae251631",
      "title": "Zazzaroni: \"There are 53 points, the rest is bullshit, hot air, unmotivated dislikes, bizarre theories\"",
      "url": "https://www.milannews.it/news/zazzaroni-i-punti-sono-53-il-resto-son-cazzate-aria-fritta-antipatie-immotivate-teorie-strambe-607375",
      "source": "milannews.it",
      "date": "2026-02-14T12:12:20+00:00",
      "summary": "Ivan Zazzaroni, journalist and director of Corriere dello Sport, expressed himself as follows on Instagram commenting on Milan's victory in Pisa: \"The points are 53, the rest is bullshit, hot air, unmotivated dislikes, bizarre theories."
    },
    {
      "id": "367eafba51bc",
      "title": "Sensational in the Premier League: Tudor accepts an interim position at Tottenham",
      "url": "https://www.milannews.it/news/clamoroso-in-premier-tudor-accetta-un-incarico-ad-interim-al-tottenham-607318",
      "source": "milannews.it",
      "date": "2026-02-14T12:00:23+00:00",
      "summary": "(ANSA) - TUDOR, FEBRUARY 13 - Igor Tudor restarts from the Premier League. The former Juventus manager has accepted the role of interim manager of Tottenham until the end of the season."
    },
    {
      "id": "a5f2b100ed40",
      "title": "Pisa manager believes they ‘played a perfect game’ against Milan despite defeat",
      "url": "https://sempremilan.com/pisa-manager-perfect-game-milan-defeat",
      "source": "sempremilan.com",
      "date": "2026-02-14T11:55:00+00:00",
      "summary": "Pisa manager Oscar Hljemark believes his side played a perfect game tactically against Milan, despite coming away with zero points in the end.  After the 2-2 draw in the reverse fixture, Milan headed into the game with a lust for revenge. While it was far from brilliant, they controlled the first ha"
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "7d03a37fb402",
      "title": "Ceccarini: \"Milan, for the summer they are aiming for a great striker: from Lewandowski and Gabriel Jesus to Vlahovic and Kean\"",
      "url": "https://www.milannews.it/calciomercato-milan/ceccarini-milan-per-l-estate-si-punta-ad-un-grande-attaccante-da-lewandowski-e-gabriel-jesus-a-vlahovic-e-kean-607422",
      "source": "milannews.it",
      "date": "2026-02-14T11:49:51+00:00",
      "summary": "In his editorial for tuttomercatoweb.com, Niccolò Ceccarini spoke thus of Milan's summer transfer market: \"First the Champions League then a summer campaign with a very specific objective: a great striker."
    },
    {
      "id": "622629efc3d7",
      "title": "Primavera, the official lineups of Genoa-Milan: from the 1st minute Malick Cissé and Idrissi-Regragui",
      "url": "https://www.milannews.it/la-primavera/primavera-le-formazioni-ufficiali-di-genoa-milan-dal-1-malick-cisse-e-idrissi-regragui-607432",
      "source": "milannews.it",
      "date": "2026-02-14T11:35:05+00:00",
      "summary": "These are the official lineups for Genoa-Milan, a match valid for the 6th return day of the Primavera 1 championship:\n\nGENOA: Baccelli, Odero, Nuredini, Romano, Klisys, Lauricella, Taleb, Celik, Carbone, Arata, Lafont. Available"
    },
    {
      "id": "4df7a9eb3d81",
      "title": "MN: Leao consoled Füllkrug after penalty miss and double substitution in Pisa-Milan",
      "url": "https://sempremilan.com/mn-leao-consoled-fullkrug-penalty-miss",
      "source": "sempremilan.com",
      "date": "2026-02-14T11:30:00+00:00",
      "summary": "Niclas Füllkrug was very disappointed after his penalty miss against Pisa and was consoled by Rafael Leao, as well as other teammates, after the final whistle.  At half-time, Massimiliano Allegri decided to replace Christopher Nkunku with Füllkrug. The German was immediately involved in a wonderful "
    },
    {
      "id": "b079a7bb7797",
      "title": "Il Giornale: \"Fullkrug betrays, Modric doesn't. Milan continues the pursuit\"",
      "url": "https://www.milannews.it/news/il-giornale-fullkrug-tradisce-modric-no-il-milan-continua-l-inseguimento-607419",
      "source": "milannews.it",
      "date": "2026-02-14T11:24:43+00:00",
      "summary": "Today's edition of Il Giornale has the headline this morning: \"Fullkrug betrays, Modric doesn't. Milan continues the chase\"."
    },
    {
      "id": "e813b45e989d",
      "title": "Cuomo: “The most surprising thing about Pisa is the atmosphere after the match: it seemed that Milan hadn't won\"",
      "url": "https://www.milannews.it/news/cuomo-la-cosa-piu-sorprendente-di-pisa-e-il-clima-del-post-partita-sembrava-che-il-milan-non-avesse-vinto-607428",
      "source": "milannews.it",
      "date": "2026-02-14T11:12:49+00:00",
      "summary": "Michael Cuomo, journalist, expressed himself as follows on MilanNews.it at the end of Pisa-Milan: “The most surprising thing about Pisa is the atmosphere after the match: it seemed that Milan hadn't won."
    },
    {
      "id": "394dddd46ab0",
      "title": "CorSera: ‘The dreamcatcher’ – Modric continues to keep Milan’s Scudetto dream alive",
      "url": "https://sempremilan.com/corsera-dreamcatcher-modric-milan-scudetto",
      "source": "sempremilan.com",
      "date": "2026-02-14T11:05:00+00:00",
      "summary": "Luka Modric scored the winner for AC Milan against Pisa, showing once again just how important he is, and there has been no shortage of praise for him this morning.  At the age of 40, it’s simply incredible what Modric has brought to the team this season. In addition to his passing, which everyone k"
    },
    {
      "id": "7f647aa2a062",
      "title": "Luka Modric infinite champion: another record broken. And the future...",
      "url": "https://www.milannews.it/primo-piano/luka-modric-campione-infinito-un-altro-record-battuto-e-il-futuro-607430",
      "source": "milannews.it",
      "date": "2026-02-14T11:00:10+00:00",
      "summary": "In his long career, characterized by over thirty trophies, Luka Modric has broken many records (for example he is one of the players who has won the most Champions Leagues, six)."
    },
    {
      "id": "318331bf008f",
      "title": "Fullkrug apologizes: \"I have had better days, but fortunately the penalty was not decisive. Thank you teams and have a good weekend, fans!\"",
      "url": "https://www.milannews.it/news/fullkrug-si-scusa-ho-avuto-giorni-migliori-ma-fortunatamente-il-rigore-non-e-risultato-decisivo-grazie-squadre-e-buon-weekend-tifosi-607429",
      "source": "milannews.it",
      "date": "2026-02-14T10:48:02+00:00",
      "summary": "Niclas Fullkrug, AC Milan striker, expressed himself like this on Instagram after Pisa-Milan, a match characterized by a victory for Allegri's team, but also by the penalty missed by the German number 9: \"I certainly had a good time ..."
    },
    {
      "id": "48eeaf030fb2",
      "title": "Why Füllkrug’s penalty wasn’t retaken despite obvious encroachment",
      "url": "https://sempremilan.com/why-fullkrugs-penalty-wasnt-retaken-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-14T10:40:00+00:00",
      "summary": "Niclas Füllkrug missed a penalty for AC Milan in their 2-1 win against Pisa last night, but many have been asking why it wasn’t retaken due to obvious encroachment. It was in the 54th minute that the referee pointed to the spot, awarding a penalty to Milan. Strahinja Pabvlovic was brought down after"
    },
    {
      "id": "38cb3faca9e7",
      "title": "Rossoneri youth sector, today's matches: Primavera at 1pm, derby for the women's U17",
      "url": "https://www.milannews.it/settore-giovanile/settore-giovanile-rossonero-i-match-di-oggi-primavera-alle-13-derby-per-l-u17-femminile-607228",
      "source": "milannews.it",
      "date": "2026-02-14T10:36:46+00:00",
      "summary": "Below is today's program for the Rossoneri youth sector:\n\nUNDER 12: championship, Cimiano-Milan, 12.20 pm - Via Don Calabria 16, Milan\n\nMEN'S SPRING: 25th matchday, Genoa-Milan, 1pm."
    },
    {
      "id": "65cc76c7aa14",
      "title": "Obvious MOTM and flop: Player ratings for Pisa-Milan from Italian papers",
      "url": "https://sempremilan.com/ratings-italian-papers-pisa-1-2-milan",
      "source": "sempremilan.com",
      "date": "2026-02-14T10:15:00+00:00",
      "summary": "Luka Modric was named the MOTM in AC Milan’s 2-1 win against Pisa by every outlet, as you would expect, and there were no disagreements on the flop either.  Milan needed to clinch all three points to keep up with Inter in the Scudetto race, and that’s exactly what they did. However, it was far […]\nT"
    },
    {
      "id": "dea4ee63a540",
      "title": "Agresti in the Gazzetta: \"Milan are not as strong, complete and dominant as Inter, but they keep the fight for the scudetto open\"",
      "url": "https://www.milannews.it/news/agresti-sulla-gazzetta-il-milan-non-e-forte-completo-e-dominante-come-l-inter-ma-tiene-aperta-la-lotta-per-lo-scudetto-607415",
      "source": "milannews.it",
      "date": "2026-02-14T10:12:14+00:00",
      "summary": "Stefano Agresti, on the pages of the Gazzetta dello Sport on newsstands today, commented on Milan's moment as they beat Pisa 2-1 yesterday: \"Allegri's Milan is not as strong as Inter, nor is it as ..."
    },
    {
      "id": "ebc0fe6cd15f",
      "title": "Double yellow for Rabiot: he will be disqualified (no Como) and remains on a warning",
      "url": "https://www.milannews.it/news/doppio-giallo-a-rabiot-sara-squalificato-niente-como-e-resta-in-diffida-607403",
      "source": "milannews.it",
      "date": "2026-02-14T10:00:53+00:00",
      "summary": "\"Rabiot expelled: he will be disqualified, but remains on a warning\": this is what La Gazzetta dello Sport wrote this morning, confirming what Milannews also wrote last night."
    },
    {
      "id": "ac44c6d33098",
      "title": "Loftus-Cheek says ‘shouting’ from Allegri was important just before Pisa-Milan opener",
      "url": "https://sempremilan.com/loftus-cheek-shouting-allegri-pisa-milan",
      "source": "sempremilan.com",
      "date": "2026-02-14T09:50:00+00:00",
      "summary": "Ruben Loftus-Cheek was one of the goalscorers in AC Milan’s 2-1 win against Pisa, and afterwards, he spoke to the media about the important win.  The Englishman managed to build on his positive moment, scoring yet another goal after also getting on the scoresheet against Bologna. Considering that Ma"
    },
    {
      "id": "1728da825dc4",
      "title": "Repubblica: \"In the end Modric arrives. Milan wastes, but flies with the maestro\"",
      "url": "https://www.milannews.it/news/repubblica-alla-fine-arriva-modric-il-milan-spreca-ma-vola-con-il-maestro-607414",
      "source": "milannews.it",
      "date": "2026-02-14T09:46:34+00:00",
      "summary": "Repubblica on newsstands this morning with the headline: \"In the end Modric arrives. Milan wastes, but flies with the maestro\"."
    },
    {
      "id": "967b4bfadeff",
      "title": "Gazzetta report cards: Modric the best, excellent entry by Ricci. Bad Fullkrug, Tomori, Fofana and Nkunku",
      "url": "https://www.milannews.it/news/pagelle-gazzetta-modric-il-migliore-ottimo-ingresso-di-ricci-male-fullkrug-tomori-fofana-e-nkunku-607400",
      "source": "milannews.it",
      "date": "2026-02-14T09:34:10+00:00",
      "summary": "The highest mark in today's report cards from the Gazzetta dello Sport after last night's 2-1 victory for Milan at Pisa was obviously given to Luka Modric, scorer of the winning goal in the 85th minute: the Croatian champion & ..."
    },
    {
      "id": "66bb22f5336e",
      "title": "GdS: Allegri’s crucial changes and Modric’s brilliance – Pisa succumb to Milan",
      "url": "https://sempremilan.com/gds-allegri-changes-modric-pisa-succumb-milan",
      "source": "sempremilan.com",
      "date": "2026-02-14T09:25:00+00:00",
      "summary": "AC Milan’s narrow win against Pisa didn’t just come about thanks to the brilliance of Luka Modric, but also some tactical changes from Allegri.  As highlighted in today’s edition of Gazzetta dello Sport (see featured image), a one-two started and finished by Modric, with the help of Samuele Ricci, s"
    },
    {
      "id": "c5caf6d426c0",
      "title": "Rabiot stings on social media: he posts the photo of Fullkrug's penalty with two possible irregularities by the Pisans",
      "url": "https://www.milannews.it/news/rabiot-punge-sui-social-posta-la-foto-del-rigore-di-fullkrug-con-due-possibili-irregolarita-dei-pisani-607406",
      "source": "milannews.it",
      "date": "2026-02-14T09:24:35+00:00",
      "summary": "Still disappointed and seething over the unfair expulsion he suffered, Adrien Rabiot, on the night of his return from Pisa, posted on Instagram stories the snapshot of the penalty kick missed by Fullkrug, in which two alleged irregularities can be seen ..."
    },
    {
      "id": "941ff897bad6",
      "title": "Tomori praises Modric: \"He shows how to play, how to talk in the locker room and how to train\"",
      "url": "https://www.milannews.it/news/tomori-esalta-modric-dimostra-come-si-gioca-come-si-parla-nello-spogliatoio-e-come-ci-si-allena-607373",
      "source": "milannews.it",
      "date": "2026-02-14T09:10:10+00:00",
      "summary": "After Milan's victory against Pisa, Fikayo Tomori spoke to Telelombardia like this: \"What matters are the three points, but we always want to have a very high level."
    },
    {
      "id": "b94583ff2f60",
      "title": "Allegri rejoices and praises Modric, but knows well that his Milan must play better",
      "url": "https://www.milannews.it/primo-piano/allegri-esulta-ed-esalta-modric-ma-sa-bene-che-il-suo-milan-deve-giocare-meglio-607411",
      "source": "milannews.it",
      "date": "2026-02-14T09:00:19+00:00",
      "summary": "After Loftus-Cheek's goal shortly before the end of the first half, many Milan fans certainly thought that from then on the match against Pisa would be downhill given that the Devil had managed to break the deadlock."
    },
    {
      "id": "f974989569cc",
      "title": "Gallery: ‘Stroke of genius’, ‘Modric pushes Allegri’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/gallery-stroke-genius-modric-papers-italy",
      "source": "sempremilan.com",
      "date": "2026-02-14T09:00:00+00:00",
      "summary": "AC Milan came away with the win from their game against Pisa last night, largely thanks to Luka Modric, and the newspapers made sure to highlight him this morning. It looked like the Rossoneri were heading for more points dropped against a bottom-half side, following an equaliser by Pisa in the seco"
    },
    {
      "id": "2e41f3b0a3d5",
      "title": "Watch: “We make it difficult” – Lorenzo’s instant reaction to Pisa 1-2 AC Milan",
      "url": "https://sempremilan.com/lorenzos-instant-reaction-pisa-1-2-milan-2026",
      "source": "sempremilan.com",
      "date": "2026-02-13T22:53:00+00:00",
      "summary": "Lorenzo reacts to AC Milan’s 2-1 win against Pisa straight after the full-time whistle. The Rossoneri made things unnecessarily difficult for themselves, as has happened so many times this season. Milan stepped onto the pitch for the first time in ten days at Arena Garibaldi, having got some extra r"
    },
    {
      "id": "dd884efb9d3e",
      "title": "Modric admits Milan ‘relaxed’ against Pisa before winner and thanks fans: “It’s a privilege”",
      "url": "https://sempremilan.com/modric-milan-relaxed-pisa-fans-privilege",
      "source": "sempremilan.com",
      "date": "2026-02-13T22:52:25+00:00",
      "summary": "Luka Modric was the hero of the night for AC Milan against Pisa, and he was happy to play his part in earning three massive points. After Ruben Loftus-Cheek’s opener, it looked like being a frustrating night for Milan. A missed penalty from Niclas Füllkrug and a few other chances preceded an equalis"
    },
    {
      "id": "15eac46f48fb",
      "title": "Ricci explains Milan’s greatest strength after win against Pisa: “Feel like starters”",
      "url": "https://sempremilan.com/ricci-milans-greatest-strength-win-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-13T22:40:07+00:00",
      "summary": "Samuele Ricci came off the bench for AC Milan against Pisa and ended up playing an important role, expressing great delight afterwards.  Massimiliano Allegri opted for Youssouf Fofana in the midfield role to the right, relying on the Frenchman’s defensive work. However, as soon as attacking output w"
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "d2115c08920b",
      "title": "Tomori assesses ‘incredibly important’ Pisa win and defensive improvement: “More of a unit”",
      "url": "https://sempremilan.com/tomori-pisa-win-defensive-improvement-unit",
      "source": "sempremilan.com",
      "date": "2026-02-13T22:34:01+00:00",
      "summary": "AC Milan defender Fikayo Tomori believes that he and his team-mates secured three ‘incredibly important’ points in Pisa. Milan looked to be on the right track in the first half when Ruben Loftus-Cheek headed in the opener from a Zachary Athekame cross. Substitute Niclas Füllkrug had the chance to do"
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "775d708dced8",
      "title": "Allegri praises ‘extraordinary’ Modric and insists Milan ‘played well’ vs. Pisa but ‘have to improve’",
      "url": "https://sempremilan.com/allegri-modric-milan-pisa-need-improve",
      "source": "sempremilan.com",
      "date": "2026-02-13T22:21:03+00:00",
      "summary": "Massimiliano Allegri had mixed emotions after his AC Milan side scored a late goal to beat relegation battlers Pisa. Milan faced a Pisa side that had not won in 13 games going into tonight’s contest, and despite taking the lead through Ruben Loftus-Cheek they made very hard work of things. The game "
    },
    {
      "id": "46e226408b31",
      "title": "Player Ratings: Pisa 1-2 AC Milan – Modric maestro and mixed substitutes",
      "url": "https://sempremilan.com/player-ratings-pisa-1-2-ac-milan-modric",
      "source": "sempremilan.com",
      "date": "2026-02-13T22:09:31+00:00",
      "summary": "AC Milan clinched all three points away at Pisa and Luka Modric played a key role in the win, scoring late on. Below are the player ratings for the Rossoneri.  If you haven’t already, make sure to check out how we decide the player ratings. From the scale to what affects the rating, we have compiled"
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "e1521bd7549e",
      "title": "Adrien Rabiot sees red at the end of Pisa-Milan – how many games he will miss",
      "url": "https://sempremilan.com/rabiot-red-pisa-milan-how-many-games",
      "source": "sempremilan.com",
      "date": "2026-02-13T22:08:24+00:00",
      "summary": "Adrien Rabiot was sent off for receiving two yellow cards in quick succession in the win over Pisa, leading to confusion about his ban. Going into Friday’s match at the Arena Garibaldi, it was known that Rabiot was one caution away from reaching the threshold of five, which results in a one-game ban"
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "b02ddd38e1a8",
      "title": "Pisa 1-2 AC Milan: Modric rescues the Rossoneri amid missed penalty and red card",
      "url": "https://sempremilan.com/pisa-1-2-ac-milan-match-report",
      "source": "sempremilan.com",
      "date": "2026-02-13T21:47:46+00:00",
      "summary": "AC Milan made it consecutive away wins on Friday night against Pisa, but they were forced to fight right until the final whistle. Ruben Loftus-Cheek’s header in the first half looked like it had sent Milan on their way to a more comfortable night, but the game seemed to swing when substitute Niclas "
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "52df69e29c18",
      "title": "Watch: Luka Modric gives AC Milan the lead again vs. Pisa with composed finish late on",
      "url": "https://sempremilan.com/luka-modric-milan-goal-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-13T21:36:22+00:00",
      "summary": "AC Milan had been pegged back in the second half of their game against Pisa at the Arena Garibaldi, but inside the final 10 minutes they want back ahead. Finally, in the 85th minute – after Ruben Loftus-Cheek’s opener, a missed penalty and a few other chances spurned – Pisa’s stern resistance was br"
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "2f4bf6d23706",
      "title": "Watch: Loftus-Cheek scores in second straight game to give Milan the lead in Pisa",
      "url": "https://sempremilan.com/loftus-cheek-goal-milan-lead-in-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-13T20:32:57+00:00",
      "summary": "Ruben Loftus-Cheek got on the scoresheet for the second straight game for AC Milan, giving them the lead against Pisa. Somewhat against the run of play at the Arena Garibaldi, Milan got themselves in front just over six minutes before the break and it came from Loftus-Cheek, who repaid Massimiliano "
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "5b3c208cb1fb",
      "title": "Allegri names qualities he wants to see from Milan in Pisa and explains attacking choices",
      "url": "https://sempremilan.com/allegri-qualities-milan-pisa-explains-choices",
      "source": "sempremilan.com",
      "date": "2026-02-13T19:28:50+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri has highlighted what his side must do to emerge from Pisa with three precious points. Milan take to the field in Tuscany tonight 10 days after the last time they played, the 3-0 win away against Bologna. The Milan-Como fixture – scheduled for last weekend – h"
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    },
    {
      "id": "9c729c8148a4",
      "title": "Pisa forced to field third-choice goalkeeper in Serie A match against Milan",
      "url": "https://football-italia.net/pisa-forced-3rd-choice-goalkeeper-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T13:04:11+00:00",
      "summary": "Second-choice Pisa goalkeeper Simone Scuffet has been ruled out of tonight’s Serie A match against..."
    },
    {
      "id": "e6e4778300f1",
      "title": "Report Milan call McKennie for possible USMNT reunion with Pulisic",
      "url": "https://football-italia.net/milan-call-mckennie-usmnt-reunion-pulisic/",
      "source": "football-italia.net",
      "date": "2026-02-13T12:43:07+00:00",
      "summary": "Milan have reportedly begun preliminary talks with Weston McKennie’s entourage as the Juventus midfielder is..."
    },
    {
      "id": "bb92885e8dfd",
      "title": "Milan make Modric decision, prepare for new contract extensions after Maignan",
      "url": "https://football-italia.net/milan-modric-decision-more-contracts-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-13T11:04:46+00:00",
      "summary": "According to La Gazzetta dello Sport, Fikayo Tomori is expected to be the next Milan..."
    },
    {
      "id": "c682014167e5",
      "title": "Serie A: Pisa vs. Milan – probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/pisa-vs-milan-probable-line-ups-watch-on-tv/",
      "source": "football-italia.net",
      "date": "2026-02-13T08:53:01+00:00",
      "summary": "Ruben Loftus-Cheek and Christopher Nknuku are expected to lead the Milan attack in an away..."
    },
    {
      "id": "d50cee56a1a2",
      "title": "Capello claims Serie A title race wide open: ‘Inter & Juventus, watch out for Milan & Roma’",
      "url": "https://football-italia.net/capello-claims-serie-a-title-race-wide-open/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:30:19+00:00",
      "summary": "Fabio Capello insists the Serie A title race is far from over, warning that Inter..."
    },
    {
      "id": "ef679b7e17ab",
      "title": "Only one Serie A player included in Europe’s best paid footballers in 2026",
      "url": "https://football-italia.net/one-juventus-player-europe-top-20-best-paid/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:01:54+00:00",
      "summary": "Juventus’s Dusan Vlahovic is currently the only Serie A player to feature in the list..."
    },
    {
      "id": "00edaaaae844",
      "title": "Juventus set price tag for Gatti as Milan, Napoli and Premier League clubs queue up",
      "url": "https://football-italia.net/juventus-set-price-tag-for-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-12T14:21:33+00:00",
      "summary": "Juventus reportedly have a price tag in mind when it comes to a potential sale..."
    },
    {
      "id": "8c7c1ace3789",
      "title": "Allegri previews Pisa vs. Milan and gives injury update: ‘Pulisic only has 15-20 minutes’",
      "url": "https://football-italia.net/allegri-previews-pisa-vs-milan-injury-update/",
      "source": "football-italia.net",
      "date": "2026-02-12T12:49:06+00:00",
      "summary": "Massimiliano Allegri has shared his thoughts ahead of Milan’s upcoming Serie A clash against Pisa..."
    },
    {
      "id": "3e2b69a629df",
      "title": "Official: AFC Bournemouth sign Alex Jimenez on permanent transfer from Milan",
      "url": "https://football-italia.net/official-milan-sell-jimenez-to-bournemouth/",
      "source": "football-italia.net",
      "date": "2026-02-12T11:19:57+00:00",
      "summary": "Premier League side AFC Bournemouth have officially announced the signing of Alex Jimenez on a..."
    }
  ]
}