{
  "lastUpdated": "2026-02-22T09:29:20.534161+00:00",
  "articles": [
    {
      "id": "d4594d905943",
      "title": "Watch: AC Milan tease ‘bold, modern’ PUMA and Slam Jam fourth kit",
      "url": "https://sempremilan.com/milan-puma-slam-jam-fourth-kit-tease",
      "source": "sempremilan.com",
      "date": "2026-02-22T09:25:00+00:00",
      "summary": "AC Milan have published a video which teases the upcoming launch of the fourth shirt in collaboration with PUMA and Slam Jam. It was reported last month that Milan would be releasing yet another fourth kit, and continuing their trend of teaming up with fashion brands for it. Some more details emerge"
    },
    {
      "id": "d33391709eea",
      "title": "Inter, Chivu: \"Scudetto? There are still 36 points to go, the rest are statistics and numbers\"",
      "url": "https://www.milannews.it/news/inter-chivu-scudetto-mancano-ancora-36-punti-il-resto-sono-statistiche-e-numeri-608271",
      "source": "milannews.it",
      "date": "2026-02-22T09:24:33+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 21 - \"There are still 36 points to go, the rest are statistics and numbers. I thank the boys, it's all thanks to them, I have a group of fantastic boys who do everything with mind, body and technique."
    },
    {
      "id": "cdb760fc8c2d",
      "title": "Serie A: Milan vs. Parma: Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-milan-vs-parma-probable-line-ups-2/",
      "source": "football-italia.net",
      "date": "2026-02-22T09:17:18+00:00",
      "summary": "Christian Pulisic and Rafael Leao look set to partner each other in attack for just..."
    },
    {
      "id": "db44b1afe1d4",
      "title": "Pasotto: \"In this Milan it is not blasphemy to say that the only truly indispensable player in the starting eleven is Rabiot\"",
      "url": "https://www.milannews.it/news/pasotto-in-questo-milan-non-e-blasfemia-affermare-che-l-unico-vero-irrinunciabile-nell-undici-titolare-di-riferimento-sia-rabiot-608267",
      "source": "milannews.it",
      "date": "2026-02-22T09:12:36+00:00",
      "summary": "Marco Pasotto, journalist, expressed himself in La Gazzetta dello Sport about Adrien Rabiot: \"As Max would say, before the derby there are two more matches, possibly to be won if we then want to go all out in the ..."
    },
    {
      "id": "8e6f4d2438af",
      "title": "Allegri says that with Leao and Pulisic Milan can raise the level. First test: today. The two together with Parma",
      "url": "https://www.milannews.it/primo-piano/allegri-dice-che-con-leao-e-pulisic-il-milan-puo-alzare-il-livello-prima-prova-oggi-i-due-assieme-col-parma-608270",
      "source": "milannews.it",
      "date": "2026-02-22T09:00:00+00:00",
      "summary": "Today at 18:00 Milan will face Parma at San Siro."
    },
    {
      "id": "22c60c05d54d",
      "title": "Gallery: ‘Keep the title race alive’, ‘Milan in the slipstream’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/front-pages-italy-22-february-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-22T09:00:00+00:00",
      "summary": "AC Milan are back in action at San Siro this evening as they host Parma, and the pressure is once again on to win. After the somewhat frustrating draw against Como in midweek which saw Inter consolidate their advantage at the top, the Nerazzurri’s victory over Lecce on Saturday evening means that th"
    },
    {
      "id": "9a31c97d1487",
      "title": "Polverosi: \"10 points on Milan are a lot and behind the others they seem more interested in placing themselves in the Champions League than in seriously chasing an uncatchable team\"",
      "url": "https://www.milannews.it/news/polverosi-10-punti-sul-milan-sono-tanti-e-dietro-le-altre-sembrano-piu-interessate-a-piazzarsi-in-champions-che-a-rincorrere-sul-serio-una-squadra-imp-608266",
      "source": "milannews.it",
      "date": "2026-02-22T08:48:04+00:00",
      "summary": "Alberto Polverosi, a journalist, expressed himself as follows in Corriere dello Sport, commenting on the ranking updates in the Scudetto race: \"Inter had to sort out a few things after Bodø's three goals."
    },
    {
      "id": "1ebade3a7510",
      "title": "Today’s Papers: Juventus unrecognisable, Inter flying, Italy golden land",
      "url": "https://football-italia.net/todays-papers-juventus-unrecognisable-inter/",
      "source": "football-italia.net",
      "date": "2026-02-22T08:41:37+00:00",
      "summary": "La Gazzetta dello Sport  The golden land  The bluest Olympics ever come to an end ..."
    },
    {
      "id": "b8e19c7519b9",
      "title": "Milan, desire to start again. Allegri expects his team to extend their streak of consecutive useful results today by beating Parma",
      "url": "https://www.milannews.it/news/milan-voglia-di-ripartire-allegri-si-aspetta-che-i-suoi-oggi-allunghino-la-striscia-di-risultati-utili-consecutivi-battendo-il-parma-608269",
      "source": "milannews.it",
      "date": "2026-02-22T08:36:28+00:00",
      "summary": "Andrea Ramazzotti, journalist, expressed himself in La Gazzetta dello Sport on the words of Massimiliano Allegri on the eve of Milan-Parma: \"Milan wants to start again."
    },
    {
      "id": "8b7b751c9f81",
      "title": "Milan announces the new fourth shirt. It is made in collaboration with SlamJam",
      "url": "https://www.milannews.it/news/il-milan-annuncia-la-nuova-quarta-maglia-e-realizzata-in-collaborazione-con-slamjam-608281",
      "source": "milannews.it",
      "date": "2026-02-22T08:23:02+00:00",
      "summary": "AC Milan, together with PUMA and Slam Jam, is ready to present the new Fourth Kit, a project that combines contemporary aesthetics and the Club's historical identity, reinterpreting its most iconic symbols in a new ..."
    },
    {
      "id": "234353af724f",
      "title": "There is also talk of the transfer market: Milan are negotiating the renewal of a top player! Even before the summer",
      "url": "https://www.milannews.it/calciomercato-milan/si-parla-anche-di-mercato-il-milan-sta-trattando-il-rinnovo-di-un-top-addirittura-prima-dell-estate-608268",
      "source": "milannews.it",
      "date": "2026-02-22T08:12:13+00:00",
      "summary": "Andrea Sereni, journalist, expressed himself in Repubblica on Milan's attack against Parma: \"Together again from the start, the fourth time in the championship."
    },
    {
      "id": "45960f544c38",
      "title": "Milan Parma goalscorer odds",
      "url": "https://www.milannews.it/scommesse/pronostici/milan-parma-quote-marcatore-608142",
      "source": "milannews.it",
      "date": "2026-02-22T08:00:20+00:00",
      "summary": "After the 1-1 draw in injury time against Como, Milan will play again at San Siro, this time hosting a Parma in great form. Who could be the protagonist of the challenge? Let's see the Milan-Parma goalscorer odds."
    },
    {
      "id": "a5d7b247079f",
      "title": "Serafini: \"Settling for second place, 7 points behind Inter when we are only in mid-February clashes with Milan's history\"",
      "url": "https://www.milannews.it/news/serafini-accontentarsi-del-secondo-posto-a-7-punti-dall-inter-quando-siamo-solo-a-meta-febbraio-fa-a-pugni-con-la-storia-del-milan-608202",
      "source": "milannews.it",
      "date": "2026-02-22T07:48:46+00:00",
      "summary": "During his editorial for MilanNews."
    },
    {
      "id": "04edcc5caf24",
      "title": "Tuttosport front page: \"Two corners, two goals: Inter advance to Lecce. Sticks, what whistles! At 6pm Milan are -7\"",
      "url": "https://www.milannews.it/rassegna-stampa/prima-pagina-tuttosport-due-angoli-due-gol-l-inter-passa-a-lecce-bastoni-che-fischi-alle-18-il-milan-per-il-7-608264",
      "source": "milannews.it",
      "date": "2026-02-22T07:36:23+00:00",
      "summary": "The Turin newspaper Tuttosport today obviously features Juventus on its front page with a strong headline: \"Juventus, Como profound\", in reference to yesterday's terrible performance by the Bianconeri against Fabregas' team."
    },
    {
      "id": "54cbff245a15",
      "title": "CorSport front page: \"Inter escape: Chivu at +10 over Milan. Today Allegri tries to get back to -7\"",
      "url": "https://www.milannews.it/rassegna-stampa/prima-pagina-corsport-fuga-inter-chivu-a-10-sul-milan-oggi-allegri-prova-a-tornare-a-7-608263",
      "source": "milannews.it",
      "date": "2026-02-22T07:24:07+00:00",
      "summary": "On the front page, today's edition of Corriere dello Sport proposes the fall of Juventus with an impressive headline on the fourth shirt used yesterday by the Bianconeri against Como: \"Unrecognizable."
    },
    {
      "id": "eb2d206b144d",
      "title": "PROBABLE LINEUP - Bartesaghi ahead of De Winter, Leao and Pulisic up front",
      "url": "https://www.milannews.it/news/probabile-formazione-bartesaghi-in-vantaggio-su-de-winter-in-avanti-leao-e-pulisic-608240",
      "source": "milannews.it",
      "date": "2026-02-22T07:15:00+00:00",
      "summary": "After the draw against Como, Massimiliano Allegri's Milan immediately returned to the field against Parma on the 26th matchday of the Serie A Enilive championship."
    },
    {
      "id": "4578cff139dd",
      "title": "Gazzetta front page: \"Inter leaves: +10. At 6pm Milan tries to keep the championship alive\"",
      "url": "https://www.milannews.it/rassegna-stampa/prima-pagina-gazzetta-l-inter-se-ne-va-10-alle-18-il-milan-prova-a-tenere-vivo-il-campionato-608262",
      "source": "milannews.it",
      "date": "2026-02-22T07:12:34+00:00",
      "summary": "On the front page, today's La Gazzetta dello Sport offers praise for Italy's 30 medals at the Milan-Cortina 2026 Olympic Games. At the top there is talk of football with the headline dedicated to Inter: \"Inter is leaving."
    },
    {
      "id": "3702b4973df4",
      "title": "Yesterday, Allegri had hoped for a bit, but he described the reality. Today Milan-Parma: lineup with many changes",
      "url": "https://www.milannews.it/primo-piano/ieri-un-po-allegri-ci-aveva-sperato-ma-ha-descritto-la-realta-oggi-milan-parma-formazione-con-tanti-cambi-608261",
      "source": "milannews.it",
      "date": "2026-02-22T07:00:24+00:00",
      "summary": "Allegri probably hoped for it. Yesterday, moreover, in the press conference he said it publicly: “The championship is still long."
    },
    {
      "id": "3914c9241790",
      "title": "Bartesaghi between renewal and some interests from the Premier League: the point on the future of the Rossoneri's number 33",
      "url": "https://www.milannews.it/calciomercato-milan/bartesaghi-fra-rinnovo-ed-alcuni-interessi-dalla-premier-il-punto-sul-futuro-del-33-rossonero-608259",
      "source": "milannews.it",
      "date": "2026-02-22T06:48:40+00:00",
      "summary": "During the usual appointment with the video update on his YouTube channel, Fabrizio Romano spoke about the movements at Milan, focusing in particular on the future of Davide Bartesaghi, amidst interest from the P ..."
    },
    {
      "id": "8789452f48cd",
      "title": "Here Parma, the list of players called up for the match against Milan",
      "url": "https://www.milannews.it/news/qui-parma-la-lista-dei-convocati-per-la-partita-contro-il-milan-608257",
      "source": "milannews.it",
      "date": "2026-02-22T06:36:01+00:00",
      "summary": "Below is the note with which Parma, on its website, communicated the list of players called up for tomorrow afternoon's match at San Siro against Milan. The suspended Circati and Mikolajewski are absent."
    },
    {
      "id": "8209f2b74d84",
      "title": "Milan on the pitch today against Parma: the program for the 26th matchday of Serie A",
      "url": "https://www.milannews.it/news/milan-oggi-in-campo-contro-il-parma-il-programma-della-26esima-giornata-di-serie-a-608256",
      "source": "milannews.it",
      "date": "2026-02-22T06:24:00+00:00",
      "summary": "This afternoon, at 18:00, Milan will take the field against Parma on the 26th matchday of Serie A Enlive."
    },
    {
      "id": "19a3126ee86a",
      "title": "Ticket sales for Milan-Turin open on Friday: the details",
      "url": "https://www.milannews.it/news/aperta-venerdi-la-vendita-dei-biglietti-per-milan-torino-i-dettagli-608255",
      "source": "milannews.it",
      "date": "2026-02-22T06:12:00+00:00",
      "summary": "In the last home match of the month of March, Milan will take the field against Turin on the 30th matchday of the Serie A championship."
    },
    {
      "id": "b6d54692e19c",
      "title": "Serie A: the updated ranking after Saturday's results",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-dopo-i-risultati-del-sabato-608254",
      "source": "milannews.it",
      "date": "2026-02-22T06:00:00+00:00",
      "summary": "Below is the Serie A standings updated after Saturday's results, which saw Juventus fall at home against Como (0-2), Inter win away in Lecce (0-2) and Lazio not go beyond a 0-0 draw at Cagliari."
    },
    {
      "id": "1d36b8d43e5d",
      "title": "Milan, Allegri: \"Pavlovic recovered, Pulisic and Leao are better\"",
      "url": "https://www.milannews.it/news/milan-allegri-pavlovic-recuperato-pulisic-e-leao-stanno-meglio-608243",
      "source": "milannews.it",
      "date": "2026-02-22T00:00:00+00:00",
      "summary": "(ANSA) - MILAN, FEBRUARY 21 - \"Pavlovic seemed at risk, because we feared after the blow in the match, but fortunately he is also available."
    },
    {
      "id": "86ecaff0db99",
      "title": "Sky: Milan’s predicted XI to face Parma – Estupinan, Loftus-Cheek and Pulisic named",
      "url": "https://sempremilan.com/sky-milans-xi-parma-estupinan-rlc-pulisic",
      "source": "sempremilan.com",
      "date": "2026-02-21T19:31:42+00:00",
      "summary": "Massimiliano Allegri has decided to make some big changes to the starting eleven for Milan-Parma tomorrow, according to a report.  The mid-week game against Como didn’t go quite to plan for  Milan as a Mike Maignan howler had them trailing. They did enough to salvage a point but at the end of the da"
    },
    {
      "id": "253991d31736",
      "title": "Serie A preview: AC Milan vs. Parma – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-ac-milan-vs-parma-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-21T19:00:00+00:00",
      "summary": "After the mid-week draw, AC Milan will be looking to get back to winning ways against Parma, a team they also need to get revenge against.  Milan are entering a crucial part of the season, with just 13 games left and Inter pushing on at the top. In short, they need as many points as […]\nThe post Ser"
    },
    {
      "id": "e3fa1fdfa286",
      "title": "Di Stefano explains why Cissè signing is reminiscent of ‘the old Milan’",
      "url": "https://sempremilan.com/di-stefano-cisse-signing-reminiscent-milan",
      "source": "sempremilan.com",
      "date": "2026-02-21T18:30:00+00:00",
      "summary": "In the final days of the January window, AC Milan secured the promising Serie B talent Alphadjo Cissè, a signing that Peppe Di Stefano believes is reminiscent of the old Milan.  The transfer was announced on the final day of the window and in the statement, it was confirmed that the attacking midfie"
    },
    {
      "id": "9c459d1b6691",
      "title": "Mr 100% returns: Landucci ready to take Allegri’s duties for Milan-Parma",
      "url": "https://sempremilan.com/mr-100-returns-landucci-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-21T18:00:13+00:00",
      "summary": "Marco Landucci will be the head coach in Milan’s dugout tomorrow as Massimiliano Allegri will be serving a one-game suspension. In short, Mr 100% is back.  When Allegri signed his contract with Milan, thus confirming his return to the club, we all knew that he would wear his heart on his sleeve. In "
    },
    {
      "id": "4937576dcc2d",
      "title": "Allegri admits Scudetto is highly unlikely as things stand: “12 wins and one defeat”",
      "url": "https://sempremilan.com/allegri-admits-scudetto-highly-unlikely-milan",
      "source": "sempremilan.com",
      "date": "2026-02-21T17:30:19+00:00",
      "summary": "Massimiliano Allegri has admitted that it will be very difficult for AC Milan to compete for the Scudetto, with just 13 games remaining of the season.  Due to the 1-1 draw against Como earlier in the week, Milan are now seven points behind their city rivals Inter (before this weekend’s matchday, any"
    },
    {
      "id": "f87a7cdd1651",
      "title": "Opposition insight for Milan-Parma: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-milan-parma-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-21T17:00:00+00:00",
      "summary": "Parma will be hoping to snatch more points from AC Milan tomorrow evening, having frustrated the Rossoneri in the reverse fixture.  After a rough run of results, the Gialloblu have seemingly found a bit of a stride with two consecutive wins, beating Bologna and Hellas Verona. There is some breathing"
    },
    {
      "id": "dadf35171854",
      "title": "Not only Rabiot as Athekame and Fofana could also miss derby against Inter",
      "url": "https://sempremilan.com/not-only-rabiot-athekame-fofana-derby",
      "source": "sempremilan.com",
      "date": "2026-02-21T16:30:00+00:00",
      "summary": "Adrien Rabiot is one yellow card away from suspension, which inevitably has become a big talking point as the derby is around the corner, but the same goes for two more players.  Rabiot missed Milan-Como due to suspension, having received a double yellow against Pisa in the round before. Had he not "
    },
    {
      "id": "e7a74f8e8af7",
      "title": "Lazio 2-2 AC Milan Women: Comeback win squandered by the Rossonere",
      "url": "https://sempremilan.com/lazio-2-2-ac-milan-women-comeback-squandered",
      "source": "sempremilan.com",
      "date": "2026-02-21T16:07:20+00:00",
      "summary": "Milan Women thought they had completed a crucial comeback in the capital, but then Lazio found a way back to snatch a point.  After the defeats against Roma and Fiorentina, the Rossonere have received a fair amount of criticism as the Champions League places now seem like an impossible task. As such"
    },
    {
      "id": "845ee13a6255",
      "title": "Watch: Scotti scores brace for Milan Primavera including lovely free-kick",
      "url": "https://sempremilan.com/watch-scotti-brace-milan-primavera-lovely",
      "source": "sempremilan.com",
      "date": "2026-02-21T15:30:00+00:00",
      "summary": "Filippo Scotti, the captain of Milan Primavera, got on the scoresheet twice in the game against Napoli earlier today, helping his side secure an important 2-1 win.  After the 2-1 win against Genoa, which got them back to winning ways, the Rossoneri followed that up with the same scoreline today. Whi"
    },
    {
      "id": "795d6817169a",
      "title": "Allegri explains why Pavlovic makes him ‘angry’ despite giving ‘everything’",
      "url": "https://sempremilan.com/allegri-explains-why-pavlovic-angry",
      "source": "sempremilan.com",
      "date": "2026-02-21T15:08:47+00:00",
      "summary": "Strahinja Pavlovic will be at Massimiliano Allegri’s disposal for tomorrow’s clash between Milan and Parma, and there is one thing the Serbian can improve upon.  Pavlovic received a nasty knock against Como and Milan initially feared a broken fibula. Thankfully, it was just a case of heavy bleeding,"
    },
    {
      "id": "0ce5a9e9364d",
      "title": "Milan, Allegri: Leao and Pulisic ‘improving’, I ‘get emotional’ when I talk to Modric",
      "url": "https://football-italia.net/milan-allegri-leao-pulisic-improve-talk-modric/",
      "source": "football-italia.net",
      "date": "2026-02-21T15:04:00+00:00",
      "summary": "Milan coach Massimiliano Allegri says Rafael Leao and Christian Pulisic are ‘improving’ and admits he..."
    },
    {
      "id": "08a62b21fcd3",
      "title": "Longo: Estupinan and Pulisic could start against Parma – latest from Milanello",
      "url": "https://sempremilan.com/longo-estupinan-pulisic-start-parma-latest",
      "source": "sempremilan.com",
      "date": "2026-02-21T14:24:04+00:00",
      "summary": "AC Milan will be up against Parma tomorrow and after an unusually quiet morning, indications have now arrived on the predicted starting eleven, with a duo potentially getting the chance.  After the draw against Como, Milan have a point to prove (pun intended) as they cannot afford to increase the ga"
    },
    {
      "id": "567090fe47bd",
      "title": "Renna and Scotti react to Milan Primavera 2-1 Napoli: “A truly excellent performance”",
      "url": "https://sempremilan.com/renna-scotti-react-milan-primavera-2-0-napoli",
      "source": "sempremilan.com",
      "date": "2026-02-21T14:00:00+00:00",
      "summary": "After Milan Primavera’s 2-1 win against Napoli earlier today, head coach Giovanni Renna and captain Filippo Scotti spoke to the media.  It was the Primavera’s second win in a row, having beaten Genoa last week, and they are thus picking up some form after a tough run of results. Scotti played a huge"
    },
    {
      "id": "39bd700d0d30",
      "title": "Fabregas: ‘I made a mistake, but some are seeking excuses’ with Como",
      "url": "https://football-italia.net/fabregas-made-mistake-some-seek-excuses-como/",
      "source": "football-italia.net",
      "date": "2026-02-21T13:59:43+00:00",
      "summary": "Cesc Fabregas again takes responsibility for his mistake against Milan, but also hints they are..."
    },
    {
      "id": "d76681767343",
      "title": "Allegri previews Milan-Parma, provides injury update and reflects on season finale",
      "url": "https://sempremilan.com/allegri-previews-milan-parma-injury-presser",
      "source": "sempremilan.com",
      "date": "2026-02-21T13:31:03+00:00",
      "summary": "On the eve of the game between AC Milan and Parma, Massimiliano Allegri spoke to the media at his usual pre-game press conference.  Milan only clinched a point in their mid-week clash against Como and as a result, Inter are now seven points ahead. As such, tomorrow’s game against Parma is even more "
    },
    {
      "id": "4eda19192303",
      "title": "Bonus Podcast with Oliver and Anthony: Future of Milan’s midfield",
      "url": "https://sempremilan.com/bonus-podcast-future-of-milans-midfield",
      "source": "sempremilan.com",
      "date": "2026-02-21T12:50:00+00:00",
      "summary": "Join Oli and Anthony as they go through each of Milan’s current midfielders to discuss their future, and address which targets could complete the department. Milan’s midfield has been a hot talking point this season amid the success of Luka Modric and Adrien Rabiot, but also the injury of Ardon Jash"
    },
    {
      "id": "7f9194dab63d",
      "title": "Milan Primavera 2-1 Napoli: Captain Scotti shines with brace and lovely free-kick",
      "url": "https://sempremilan.com/milan-primavera-2-0-napoli-captain-scotti",
      "source": "sempremilan.com",
      "date": "2026-02-21T12:20:03+00:00",
      "summary": "Milan Primavera managed to build on their win last weekend with another one today, beating a struggling Napoli side thanks to Filippo Scotti’s brace.  Last weekend, Giovanni Renna’s men bounced back after a tough run of results. Two goals were enough to beat a ten-man Genoa side, and the Rossoneri w"
    },
    {
      "id": "7aa3ce96e411",
      "title": "Tresoldi thinks about Milan move ‘every morning’, but expected Italy call",
      "url": "https://football-italia.net/tresoldi-thinks-milan-move-morning-italy-call/",
      "source": "football-italia.net",
      "date": "2026-02-21T12:13:57+00:00",
      "summary": "Nicolò Tresoldi admits he thinks about joining Milan ‘every morning when I wake up’, but..."
    },
    {
      "id": "4e17c42c4d47",
      "title": "Tresoldi doubles down on Milan dream: “I think about it every morning”",
      "url": "https://sempremilan.com/tresoldi-doubles-down-milan-dream-every-morning",
      "source": "sempremilan.com",
      "date": "2026-02-21T11:56:09+00:00",
      "summary": "Nicolo Tresoldi has, once again, opened up about his desire to play for AC Milan one day, though admitting that he’s not exactly close at the moment.  Given the history of Milan, it’s not exactly strange that some players – especially Italian ones – would like to wear the red and black shirt. It doe"
    },
    {
      "id": "d9a98da7185e",
      "title": "Fonseca: ‘I deserved more time’ at Milan",
      "url": "https://football-italia.net/fonseca-deserved-more-time-milan/",
      "source": "football-italia.net",
      "date": "2026-02-21T11:31:16+00:00",
      "summary": "Paulo Fonseca says he ‘enjoyed’ his short spell at Milan, but feels he ‘deserved more..."
    },
    {
      "id": "90d6966a1a1d",
      "title": "Fonseca says he ‘deserved more time’ at Milan after ‘amazing games’ and Lyon success",
      "url": "https://sempremilan.com/fonseca-more-time-milan-amazing-games",
      "source": "sempremilan.com",
      "date": "2026-02-21T11:30:00+00:00",
      "summary": "Paulo Fonseca has opened up about his short stint at Milan, saying that he would have liked more time, having now proved what he’s capable of with Lyon.  Milan appointed Fonseca as their new manager in the summer of 2024 after saying goodbye to Stefano Pioli at the end of the season. Before the end "
    },
    {
      "id": "c11e9f08c1d4",
      "title": "Official: Piccinini will officiate Milan vs. Parma – no controversy despite two reds",
      "url": "https://sempremilan.com/piccinini-officiate-milan-parma-two-reds",
      "source": "sempremilan.com",
      "date": "2026-02-21T11:05:00+00:00",
      "summary": "Marco Piccinini has been named the referee for AC Milan’s clash against Parma tomorrow, and after recent controversy, he will surely be under the spotlight.  The refereeing situation in Italy appears to be at a breaking point, with multiple teams getting obvious wrong calls made against them. For Mi"
    },
    {
      "id": "253ce718c287",
      "title": "Bonucci hails Milan coach Allegri: ‘A master, a phenomenon’",
      "url": "https://football-italia.net/italy-gattuso-bonucci-allegri-master-milan/",
      "source": "football-italia.net",
      "date": "2026-02-20T21:08:08+00:00",
      "summary": "Leonardo Bonucci has paid a glowing tribute to AC Milan head coach Massimiliano Allegri, describing..."
    },
    {
      "id": "d57652257213",
      "title": "Former Milan & Juventus defender De Sciglio clarifies collapsed Hradec Kralove move",
      "url": "https://football-italia.net/milan-juventus-defender-de-sciglio-hradec/",
      "source": "football-italia.net",
      "date": "2026-02-20T20:28:03+00:00",
      "summary": "Mattia De Sciglio has broken his silence over his failed transfer to Czech side Hradec..."
    },
    {
      "id": "16dbbff87a34",
      "title": "Milan interested in Club Brugge forward Tresoldi: the situation",
      "url": "https://football-italia.net/milan-interested-club-brugge-forward-tresoldi/",
      "source": "football-italia.net",
      "date": "2026-02-20T18:06:59+00:00",
      "summary": "AC Milan are quietly but decisively building their plans for the summer transfer window, and..."
    },
    {
      "id": "fe2664d29bdc",
      "title": "Extra Champions League spot: Where Italy stands after Inter loss and Bologna win",
      "url": "https://football-italia.net/extra-champions-league-spot-where-italy-stands/",
      "source": "football-italia.net",
      "date": "2026-02-20T16:25:31+00:00",
      "summary": "Italy’s chances of attaining an additional spot in next year’s Champions League remain slim despite..."
    },
    {
      "id": "603a8d098889",
      "title": "Pulisic impresses Milan star: ‘He speaks Italian almost perfectly’",
      "url": "https://football-italia.net/pulisic-impresses-milan-star-italian-perfectly/",
      "source": "football-italia.net",
      "date": "2026-02-20T14:20:48+00:00",
      "summary": "Milan star Rafael Leao is full of praise for USMNT star Christian Pulisic, on and..."
    },
    {
      "id": "14c9f595a9b3",
      "title": "Leao shares Diogo Jota story, promises to ‘make him proud’ at World Cup",
      "url": "https://football-italia.net/leao-diogo-jota-story-make-him-proud-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-20T14:13:03+00:00",
      "summary": "A ‘devastated’ Rafael Leao reveals Diogo Jota wanted to watch a Milan game at San..."
    },
    {
      "id": "5a8780cd73bf",
      "title": "Rafael Leao: Ibrahimovic ‘too demanding’, I ‘don’t go out’ before Milan derby",
      "url": "https://football-italia.net/leao-don-t-go-out-milan-derby-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-20T13:47:07+00:00",
      "summary": "Milan star Rafael Leao admits he avoids going out the week before the derby against..."
    },
    {
      "id": "c765c1d746d1",
      "title": "Frustrated Milan call AIA after controversial refereeing decisions in 1-1 Como draw",
      "url": "https://football-italia.net/frustrated-milan-call-aia-after-como-draw/",
      "source": "football-italia.net",
      "date": "2026-02-20T13:18:03+00:00",
      "summary": "Milan have reportedly been in contact with the Italian referees’ association (AIA) after a series..."
    },
    {
      "id": "18a4afe5a487",
      "title": "Roma the have best defensive record in Europe as Milan, Arsenal and Real Madrid follow",
      "url": "https://football-italia.net/roma-best-defensive-record-milan-arsenal-real/",
      "source": "football-italia.net",
      "date": "2026-02-20T12:36:59+00:00",
      "summary": "Roma are the least beaten defence in the top five European leagues, but Milan and..."
    },
    {
      "id": "46350e123f0a",
      "title": "Today’s Papers – Furious Milan, McTominay’s ‘soft football’",
      "url": "https://football-italia.net/todays-papers-furious-milan-mctominay-soft/",
      "source": "football-italia.net",
      "date": "2026-02-20T08:34:08+00:00",
      "summary": "La Gazzetta dello Sport Furious Milan The club is irritated with the referees, call to..."
    },
    {
      "id": "2e2b8b55e6a6",
      "title": "Why Fabregas cannot be punished with video evidence after Milan 1-1 Como",
      "url": "https://football-italia.net/why-fabregas-cannot-be-punished-video-evidence/",
      "source": "football-italia.net",
      "date": "2026-02-19T18:02:36+00:00",
      "summary": "Many were calling for video evidence to be used in punishing Como coach Cesc Fabregas..."
    },
    {
      "id": "88f321aefd9b",
      "title": "Milan team news: Boost as Pavlovic tests reveal no fracture",
      "url": "https://football-italia.net/milan-team-news-boost-as-pavlovic-tests/",
      "source": "football-italia.net",
      "date": "2026-02-19T15:39:58+00:00",
      "summary": "Milan will breathe a sigh of relief this morning, after medical examinations revealed that Strahinja..."
    },
    {
      "id": "d1035a3b77cf",
      "title": "Video: Fabregas’ shirt tug and touchline confrontation with Allegri",
      "url": "https://football-italia.net/fabregas-shirt-tug-touchline-clash-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-19T12:02:33+00:00",
      "summary": "Watch how Cesc Fabregas pulled the shirt of Alexis Saelemaekers and how Milan coach Massimiliano..."
    },
    {
      "id": "8e22ac8839a0",
      "title": "What Allegri told Fabregas in heated post-match clash: ‘You are a kid’",
      "url": "https://football-italia.net/what-allegri-told-fabregas-kid-milan-como/",
      "source": "football-italia.net",
      "date": "2026-02-19T09:09:48+00:00",
      "summary": "More details emerge about the confrontation between Milan coach Massimiliano Allegri and Como’s Cesc Fabregas..."
    }
  ]
}