{
  "lastUpdated": "2026-02-28T16:24:58.435207+00:00",
  "articles": [
    {
      "id": "1d49a6423707",
      "title": "IFAB, all the changes to the VAR protocol and more: we start with the World Cup",
      "url": "https://www.milannews.it/news/ifab-tutte-le-modifiche-al-protocollo-var-e-non-solo-si-comincia-col-mondiale-608995",
      "source": "milannews.it",
      "date": "2026-02-28T16:11:31+00:00",
      "summary": "At its 140th Annual General Meeting (AGM), The International Football Association Board (The IFAB) approved a package of measures aimed at increasing the pace of play and reducing wasting time."
    },
    {
      "id": "c020dd6c3ed5",
      "title": "Serie A, Como-Lecce 3-1: the updated standings",
      "url": "https://www.milannews.it/news/serie-a-como-lecce-3-1-la-classifica-aggiornata-608996",
      "source": "milannews.it",
      "date": "2026-02-28T16:01:14+00:00",
      "summary": "Como, after going behind in the first minutes, easily got rid of Lecce with a clear 3-1."
    },
    {
      "id": "c84de787b058",
      "title": "Allegri confirms Rabiot will play vs. Cremonese despite suspension risk for derby",
      "url": "https://sempremilan.com/allegri-rabiot-play-cremonese-risk-derby",
      "source": "sempremilan.com",
      "date": "2026-02-28T16:00:00+00:00",
      "summary": "Massimiliano Allegri has effectively confirmed that Adrien Rabiot will play for AC Milan against Cremonese tomorrow, despite him being just one yellow card away from being suspended in the derby.  The yellow card accumulation has certainly ended up in the spotlight in recent weeks, as is sometimes t"
    },
    {
      "id": "0605967ea3f1",
      "title": "Allegri: \"The ones who are within a booking of a booking? The most important match is tomorrow\"",
      "url": "https://www.milannews.it/news/allegri-i-diffidati-la-partita-piu-importante-e-quella-di-domani-608988",
      "source": "milannews.it",
      "date": "2026-02-28T15:47:45+00:00",
      "summary": "Speaking at a press conference ahead of tomorrow's match against Cremonese, Massimiliano Allegri declared on Pulisic, Leao and the players within a ban:\n\nOn Pulisic and Leao: \n\n\"More than the chemistry, all 4 strikers I have..."
    },
    {
      "id": "81a58cc61758",
      "title": "Allegri plays down Milan exit rumours, makes Pulisic prediction",
      "url": "https://football-italia.net/allegri-milan-exit-rumours-pulisic-prediction/",
      "source": "football-italia.net",
      "date": "2026-02-28T15:47:16+00:00",
      "summary": "Massimiliano Allegri plays down Milan exit rumours, saying that there’s ‘total harmony’ with club directors..."
    },
    {
      "id": "46058cb7164a",
      "title": "Allegri and the lost unbeaten record: \"After six months in which you didn't lose everyone, we felt the backlash. Now we have to get back to racing\"",
      "url": "https://www.milannews.it/news/allegri-e-l-imbattibilita-persa-dopo-sei-mesi-in-cui-non-perdevi-tutti-abbiamo-preso-il-contraccolpo-ora-dobbiamo-tornare-a-correre-608983",
      "source": "milannews.it",
      "date": "2026-02-28T15:36:42+00:00",
      "summary": "Massimiliano Allegri, who spoke today at the press conference at Milanello, commented on his Milan's moment as follows: \n\nTomorrow marks the beginning of the month of March, a month that is often echoed in his conferences."
    },
    {
      "id": "8b164e4cc2a1",
      "title": "Longo: Three youngsters that will be promoted from the Primavera to Milan Futuro",
      "url": "https://sempremilan.com/longo-three-youngsters-promoted-primavera-futuro",
      "source": "sempremilan.com",
      "date": "2026-02-28T15:30:00+00:00",
      "summary": "The current season is far from over, but AC Milan have already begun planning for the next season. That includes the Milan Futuro team, with some notable promotions expected from the Primavera.  For those of you who aren’t familiar with the specifics, the Primavera is Milan’s U19 side, while the Fut"
    },
    {
      "id": "6c0db77f40a2",
      "title": "VAR on call? Here is the thought of Massimiliano Allegri",
      "url": "https://www.milannews.it/news/var-a-chiamata-ecco-il-pensiero-di-massimiliano-allegri-608989",
      "source": "milannews.it",
      "date": "2026-02-28T15:23:06+00:00",
      "summary": "These are the words of Massimiliano Allegri in the press conference on VAR and all the controversies that occurred after Milan-Parma: \n\nIn favor of on-call VAR:\n\"Meanwhile, today I think new rules have come out, it's a good sign."
    },
    {
      "id": "940b943c2861",
      "title": "Allegri: \"Leao as a center forward moved well many times and many times he wasn't given the ball\"",
      "url": "https://www.milannews.it/news/allegri-leao-da-centravanti-tante-volte-si-e-mosso-bene-e-tante-volte-non-gli-e-stata-data-palla-608986",
      "source": "milannews.it",
      "date": "2026-02-28T15:11:53+00:00",
      "summary": "Speaking at a press conference ahead of tomorrow's match against Cremonese, Massimiliano Allegri declared on Pulisic, Leao and the players within a ban:\n\nOn Pulisic and Leao: \n\n\"More than the chemistry, all 4 strikers I have..."
    },
    {
      "id": "5ad9064c5f6a",
      "title": "Allegri previews Cremonese-Milan and addresses exit rumours: “Complete agreement”",
      "url": "https://sempremilan.com/allegri-previews-cremonese-milan-exit-rumours",
      "source": "sempremilan.com",
      "date": "2026-02-28T15:01:05+00:00",
      "summary": "On the eve of the game between AC Milan and Cremonese, Massimiliano Allegri spoke to the media and shared his thoughts on what he expects to be a tricky task. Milan aren’t exactly in the best of form, first drawing against Como and then dropping all points against Parma to fall behind in the Scudett"
    },
    {
      "id": "cd9ea871fb7a",
      "title": "Allegri on Jashari: \"Excellent signing, he has grown a lot\"",
      "url": "https://www.milannews.it/news/allegri-su-jashari-ottimo-acquisto-e-cresciuto-tanto-608993",
      "source": "milannews.it",
      "date": "2026-02-28T15:00:37+00:00",
      "summary": "On the eve of the match against Cremonese, Massimiliano Allegri spoke like this at Ardon Jashari's press conference: \n\nOn Rabiot and Jashari:\n\"They are players with completely different characteristics."
    },
    {
      "id": "deb28cbd07ab",
      "title": "LIVE MN - Allegri: \"We got there in March, now the season will be decided. Total harmony with the club\"",
      "url": "https://www.milannews.it/primo-piano/live-mn-allegri-a-marzo-ci-siamo-arrivati-ora-si-decide-la-stagione-totale-sintonia-con-la-societa-608979",
      "source": "milannews.it",
      "date": "2026-02-28T14:56:00+00:00",
      "summary": "Friends of MilanNews.it, welcome back."
    },
    {
      "id": "d97354f6dc9e",
      "title": "Picture: Italy legend Maldini sends his Milan shirt to Barcelona talent",
      "url": "https://football-italia.net/maldini-milan-shirt-barcelona-gerard-martin/",
      "source": "football-italia.net",
      "date": "2026-02-28T14:54:14+00:00",
      "summary": "Italy and Milan legend Paolo Maldini surprisingly sent one of his signed match-worn shirts to..."
    },
    {
      "id": "b447a3e0dd7a",
      "title": "Allegri and the rumors about his future: \"Happy to be back at Milan. Total harmony with the club\"",
      "url": "https://www.milannews.it/news/allegri-e-le-voci-sul-suo-futuro-felice-di-essere-tornato-al-milan-totale-sintonia-con-il-club-608991",
      "source": "milannews.it",
      "date": "2026-02-28T14:51:19+00:00",
      "summary": "Regarding the rumors that have circulated in recent days about his future, Massimiliano Allegri explained today in a press conference at Milanello: \n\nThe future of Allegri."
    },
    {
      "id": "02a17f30318d",
      "title": "Allegri takes stock of the injured: Gabbia out, the latest on Gimenez",
      "url": "https://www.milannews.it/news/allegri-fa-il-punto-sugli-infortunati-gabbia-out-le-ultime-su-gimenez-608984",
      "source": "milannews.it",
      "date": "2026-02-28T14:48:03+00:00",
      "summary": "On the eve of the match against Cremonese, Massimiliano Allegri spoke thus in the press conference about the injured players: \n\nWhat did you say to the team after the defeat? What week was it?\n\"After six months of not losing ..."
    },
    {
      "id": "d5043e8a08da",
      "title": "How did Milan arrive in March? Allegri: \"Quite well, we could have done better. Now the season is decided\"",
      "url": "https://www.milannews.it/news/come-e-arrivato-il-milan-a-marzo-allegri-discretamente-bene-potevamo-fare-meglio-ora-si-decide-la-stagione-608982",
      "source": "milannews.it",
      "date": "2026-02-28T14:36:26+00:00",
      "summary": "Massimiliano Allegri, who spoke today at the press conference at Milanello, commented on his Milan's moment as follows: \n\nTomorrow marks the beginning of the month of March, a month that is often echoed in his conferences."
    },
    {
      "id": "a88b87e38028",
      "title": "MN - Owomoyela on Fullkurg: \"I'm sure the best is yet to come...\"",
      "url": "https://www.milannews.it/news/mn-owomoyela-su-fullkurg-sono-sicuro-che-il-bello-deve-ancora-venire-608968",
      "source": "milannews.it",
      "date": "2026-02-28T14:24:57+00:00",
      "summary": "Patrick Owomoyela, former player of Germany, Borussia Dortmund, Werder Bremen and Arminia Bielefeld, interviewed by Milannews."
    },
    {
      "id": "90bc86937bb2",
      "title": "Revenge in sight after 25 games: Milan must avoid another Cremonese upset",
      "url": "https://sempremilan.com/revenge-after-25-games-milan-cremonese",
      "source": "sempremilan.com",
      "date": "2026-02-28T14:15:00+00:00",
      "summary": "25 games since Cremonese’s upset in the opening round, winning 1-2 at San Siro, AC Milan will finally be able to get their revenge.  Prior to the defeat against Parma last weekend, Milan had only lost one game: the opening round against Cremonese at San Siro. Davide Nicola’s men made the most of two"
    },
    {
      "id": "18645651909e",
      "title": "Cremonese-Milan, Massa referee: only one precedent this season with the Rossoneri",
      "url": "https://www.milannews.it/l-arbitro/cremonese-milan-arbitra-massa-un-solo-precedente-in-stagione-con-i-rossoneri-608956",
      "source": "milannews.it",
      "date": "2026-02-28T14:12:13+00:00",
      "summary": "Below is the referee appointment for Cremonese-Milan:\n\nReferee: MASSA\nAssistants: MELI – ALASSIO\nFourth man: AYROLDI\nVAR: GUIDE\nAVAR: MAGGIONI\n\nDavide Massa of the Imperia section has directed only one volume this season ..."
    },
    {
      "id": "a4cef922b8ac",
      "title": "Towards Cremonese-Milan: 10 official precedents in Cremona between the two teams. The budget",
      "url": "https://www.milannews.it/news/verso-cremonese-milan-10-precedenti-ufficiali-a-cremona-fra-le-due-squadre-il-bilancio-608962",
      "source": "milannews.it",
      "date": "2026-02-28T14:00:09+00:00",
      "summary": "In view of Cremonese-Milan, the Lega Calcio Serie A website reports that the official precedents in Cremona between the two teams are 10: 2 grey-red victories (last 1-0, Serie A 1994/95), 4 draws (last 0-0, Serie A 2022/23) and 4 Rossone successes..."
    },
    {
      "id": "5b22504172ff",
      "title": "Serie A, 28th matchday: all those who have been booked and suspended for the day",
      "url": "https://www.milannews.it/news/serie-a-28-giornata-tutti-i-diffidati-e-gli-squalificati-della-giornata-608970",
      "source": "milannews.it",
      "date": "2026-02-28T13:48:39+00:00",
      "summary": "The 27th matchday of Serie A began yesterday with a 1-1 draw between Parma and Cagliari."
    },
    {
      "id": "e7091d89a4a9",
      "title": "CM: Milan loanee attracting interest from abroad with summer exit possible",
      "url": "https://sempremilan.com/cm-milan-loanee-bondo-summer-exit",
      "source": "sempremilan.com",
      "date": "2026-02-28T13:45:00+00:00",
      "summary": "Warren Bondo’s future will be decided upon his return to AC Milan in the summer, according to a report, with a lot riding on the pre-season contributions.  Bondo joined Cremonese on a season-long loan in the summer, right around the same time that Filippo Terracciano also left Milan for the Cremona-"
    },
    {
      "id": "8a9103e73aaa",
      "title": "The IFAB meets today: here are the regulation changes under discussion",
      "url": "https://www.milannews.it/news/oggi-si-riunisce-l-ifab-ecco-i-cambi-di-regolamento-in-discussione-608965",
      "source": "milannews.it",
      "date": "2026-02-28T13:36:23+00:00",
      "summary": "As reported by Gazzetta dello Sport, today the International Football Association Board (IFAB) will meet to approve proposals aimed at combating more than one football problem such as VAR on the second yellow, the losses of ..."
    },
    {
      "id": "0d5508c7b671",
      "title": "Milan still unbeaten away in this championship: the last defeat in May 2025",
      "url": "https://www.milannews.it/news/milan-ancora-imbattuto-in-trasferta-in-questo-campionato-l-ultimo-ko-a-maggio-2025-608961",
      "source": "milannews.it",
      "date": "2026-02-28T13:23:33+00:00",
      "summary": "In view of Cremonese-Milan, the Lega Calcio Serie A website reports these statistics on the two teams:\n\n\"Cremonese is a Serie A team that concedes the most goals in the first 15 minutes of the game (7, like Sassuolo)."
    },
    {
      "id": "024548e62e55",
      "title": "Experienced referees assigned to Cremonese-Milan after recent controversy",
      "url": "https://sempremilan.com/experienced-referees-cremonese-milan-controversy",
      "source": "sempremilan.com",
      "date": "2026-02-28T13:15:00+00:00",
      "summary": "Davide Massa has been appointed as the referee for AC Milan’s game against Cremonese tomorrow, with AIA opting for experience.  As we highlighted in our latest newsletter, the debates about the officiating in Serie A have been never-ending this season. In Milan’s case, sadly, errors have been at the"
    },
    {
      "id": "f9294c4f7f4f",
      "title": "Milan in Cremona with four warnings: derby at risk for Athekame, Rabiot, Fofana and Saelemaekers",
      "url": "https://www.milannews.it/news/milan-a-cremona-con-quattro-diffidati-derby-a-rischio-per-athekame-rabiot-fofana-e-saelemaekers-608957",
      "source": "milannews.it",
      "date": "2026-02-28T13:11:41+00:00",
      "summary": "Tomorrow at 12.30 Max Allegri's Milan will present themselves at Cremonese's home with four players who are within a ban, namely Zachary Athekame, Adrien Rabiot, Youssouf Fofana and Alexis Saelemaekers."
    },
    {
      "id": "0fde44fdad09",
      "title": "Milan, watch out for cards: 4 players within a booking are at risk of derby",
      "url": "https://www.milannews.it/primo-piano/milan-attento-ai-cartellini-sono-4-i-diffidati-a-rischio-derby-608973",
      "source": "milannews.it",
      "date": "2026-02-28T13:00:00+00:00",
      "summary": "We are on the eve of Cremonese-Milan, a match valid for the 27th matchday of Serie A which will open the ball on football Sunday."
    },
    {
      "id": "f999014612ee",
      "title": "Milan, no Cremonese for Gabbia: the defender should return to the group next week",
      "url": "https://www.milannews.it/da-milanello/milan-niente-cremonese-per-gabbia-il-difensore-dovrebbe-tornare-in-gruppo-settimana-prossima-608977",
      "source": "milannews.it",
      "date": "2026-02-28T12:48:56+00:00",
      "summary": "Milan are currently training at Milanello in view of tomorrow's away match at Cremonese."
    },
    {
      "id": "1fe0427d3790",
      "title": "Longo: Tare’s Milan future to be ‘assessed at the end of the season’ – the reasons",
      "url": "https://sempremilan.com/tare-milan-future-assessed-end-season",
      "source": "sempremilan.com",
      "date": "2026-02-28T12:45:00+00:00",
      "summary": "Igli Tare has not even done a year as AC Milan’s sporting director, but his work will be evaluated at the end of the season. As Calciomercato.com recall, last summer Milan decided that they needed a sporting director to come in and plug a gap that was there previously, ever since the departures of P"
    },
    {
      "id": "b7ac69b774b9",
      "title": "GdS: Allegri to rely on Leao-Pulisic again vs. Cremonese – the other expected choices",
      "url": "https://sempremilan.com/allegri-leao-pulisic-cremonese-choices",
      "source": "sempremilan.com",
      "date": "2026-02-28T12:20:00+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri has chosen his front two for Sunday’s game against Cremonese, a report claims. La Gazzetta dello Sport report that for tomorrow’s match against Cremonese, Allegri is once again banking on his star duo of Christian Pulisic and Rafael Leao to lead the line, who"
    },
    {
      "id": "3f3867074f3b",
      "title": "Tuttosport: Milinkovic-Savic ‘dream’ and Brahim-esque playmaker – Milan’s ideas to complete midfield",
      "url": "https://sempremilan.com/milinkovic-savic-karetsas-milan-complete-midfield",
      "source": "sempremilan.com",
      "date": "2026-02-28T11:55:00+00:00",
      "summary": "AC Milan plan to sign another midfielder in the summer to try and complete the jigsaw, according to a report. Milan are overprotected on one side of the midfield, but often rotate to the other. As Tuttosport (via MilanPress) points out, the right midfield position has had four occupants this season,"
    },
    {
      "id": "88b19246541e",
      "title": "CM: Milan’s anger fuelled by repeat Valenti incident in Parma-Cagliari",
      "url": "https://sempremilan.com/milan-anger-fuelled-valenti-parma-cagliari",
      "source": "sempremilan.com",
      "date": "2026-02-28T11:30:00+00:00",
      "summary": "AC Milan’s anger over recent refereeing incidents will not have subsided after events last night during Parma’s game against Cagliari. As Calciomercato.com write, less than a week after the controversial incident in Milan 0-1 Parma, the same situation occurred again at the Stadio Tardini with a dras"
    },
    {
      "id": "9ff19db9b0c1",
      "title": "Moretto: ‘Other objectives, other priorities’ – Milan not interested in Man Utd midfielder",
      "url": "https://sempremilan.com/milan-not-interested-casemiro-moretto",
      "source": "sempremilan.com",
      "date": "2026-02-28T11:05:00+00:00",
      "summary": "AC Milan’s interest in signing Casemiro on a free transfer from Manchester United has been denied by Matteo Moretto. Casemiro is currently set to leave United in June after four seasons at the club, and reports in recent days have suggested that Milan are keen. It would be another experienced midfie"
    },
    {
      "id": "02834a2d1378",
      "title": "GdS: Milan not giving up on Partizan striker with new attempt ready – the situation",
      "url": "https://sempremilan.com/milan-not-giving-up-kostic-attempt",
      "source": "sempremilan.com",
      "date": "2026-02-28T10:40:00+00:00",
      "summary": "AC Milan tried to get a winter deal done for young striker Andrej Kostic, and though they failed they have not given up. The main headline in this morning’s edition of La Gazzetta dello Sport concerns Milan’s plan to invest in a No.9 if Champions League qualification is secured. Massimiliano Allegri"
    },
    {
      "id": "c54515f6db48",
      "title": "Tuttosport: A three-way battle for one spot – Allegri to resolve final pre-Cremonese doubt",
      "url": "https://sempremilan.com/allegri-resolve-final-pre-cremonese-doubt",
      "source": "sempremilan.com",
      "date": "2026-02-28T10:15:00+00:00",
      "summary": "AC Milan are back on the field against Cremonese on Sunday in the early kick-off, and Massimiliano Allegri is making decisions on his line-up. According to Tuttosport (via MilanNews), Allegri has only one doubt regarding his starting XI for tomorrow’s match. It concerns who will partner the ‘usual’ "
    },
    {
      "id": "110b7961e975",
      "title": "Milan chase Guirassy and Chelsea-owned striker for next summer – report",
      "url": "https://football-italia.net/milan-guirassy-chelsea-striker-2026-summer/",
      "source": "football-italia.net",
      "date": "2026-02-28T10:00:29+00:00",
      "summary": "According to La Gazzetta dello Sport, Borussia Dortmund’s Serhou Guirassy is one of Milan’s main..."
    },
    {
      "id": "a02791d39772",
      "title": "CM: Furlani, Calvelli, Tare, Allegri – how Milan’s management could change as ‘frictions’ arise",
      "url": "https://sempremilan.com/allegri-furlani-tare-milan-frictions-arise",
      "source": "sempremilan.com",
      "date": "2026-02-28T09:50:00+00:00",
      "summary": "AC Milan could be set for further alterations to the managerial structure within the club ahead of next season. As Calciomercato.com write, Milan have felt the lack of a figure capable of acting with authority and vision in the role of sporting director for years. With the arrival of Igli Tare, the "
    },
    {
      "id": "43420c2fed48",
      "title": "Paolo Maldini sends Milan shirt to Barcelona defender as a gift amid transfer links",
      "url": "https://sempremilan.com/maldini-gift-barcelona-milan-gerard-martin",
      "source": "sempremilan.com",
      "date": "2026-02-28T09:25:00+00:00",
      "summary": "Barcelona defender Gerard Martin has received a rather special birthday gift from one of his idols, Paolo Maldini. Martin’s name has already been linked to Milan, but because of reported transfer interest. Matteo Moretto claimed earlier in the month that the Rossoneri are interested in signing the S"
    },
    {
      "id": "e22722485316",
      "title": "GdS: ‘A No.9 for the Champions League’ – Milan’s targets from Guirassy to Retegui",
      "url": "https://sempremilan.com/9-champions-league-milan-guirassy-retegui",
      "source": "sempremilan.com",
      "date": "2026-02-28T09:00:00+00:00",
      "summary": "AC Milan want to secure Champions League qualification and reinvest the money to give Massimiliano Allegri a top striker. That is according to La Gazzetta dello Sport (seen below) who recall that Milan would have already filled the major gap in their squad if Jean-Philippe Mateta’s knee hadn’t force"
    },
    {
      "id": "8286a44416b4",
      "title": "Jashari discusses the Leao assist, playing with Modric and Champions League ambition: “Win together”",
      "url": "https://sempremilan.com/jashari-discuss-leao-assist-modric-champions-league",
      "source": "sempremilan.com",
      "date": "2026-02-27T19:30:00+00:00",
      "summary": "Ardon Jashari, today, has spoken about his goals for AC Milan and his ambition to return the club to the Champions League. When Milan took so long to sign Jashari in the summer, it made one thing very clear: they believed massively in him and his potential to be a big part of the future. […]\nThe pos"
    },
    {
      "id": "98d851dd4dc5",
      "title": "Rumblings of discontent: Negative stories engulf Milan again at crucial point in season",
      "url": "https://sempremilan.com/rumblings-discontent-stories-engulf-milan",
      "source": "sempremilan.com",
      "date": "2026-02-27T19:00:00+00:00",
      "summary": "It is a critical part of the season, and once again, AC Milan are surrounded by a controversial situation, which is becoming all too common now. There were rumours about Paulo Fonseca’s job throughout his tenure, whilst Sergio Conceicao was going to be without a job before several big occasions. In "
    },
    {
      "id": "5526ea2aba1e",
      "title": "Messaggero: Nephew of Inter legend could make Milan move – the Materazzi situation",
      "url": "https://sempremilan.com/son-of-inter-legend-could-make-milan-move",
      "source": "sempremilan.com",
      "date": "2026-02-27T18:30:00+00:00",
      "summary": "AC Milan could welcome the nephew of an Inter legend to the club in the near future, due to a contract situation with Lazio. With famous fathers, their sons normally go on to represent the same club. Of course, there are anomalies, but look at the Maldini line, for example. Now, it seems that a […]\n"
    },
    {
      "id": "e46f827be9e2",
      "title": "CorSport: Allegri considering Füllkrug for Cremonese as Leao and Pulisic create doubt",
      "url": "https://sempremilan.com/allegri-considering-fullkrug-cremonese-chance",
      "source": "sempremilan.com",
      "date": "2026-02-27T18:00:00+00:00",
      "summary": "It seems that Niclas Fullkrug could be heading for his second AC Milan start of the season, with Massimiliano Allegri struggling with the alternatives. The front line has been an issue for Milan all season; there can be no denying that. Whether it has been injuries, bad form or a mix of both, Allegr"
    },
    {
      "id": "950e3dbe4545",
      "title": "Two Serie A sides interested in free transfer for Manchester United’s Casemiro",
      "url": "https://football-italia.net/two-serie-a-sides-interested-in-casemiro-free/",
      "source": "football-italia.net",
      "date": "2026-02-27T17:47:18+00:00",
      "summary": "Reports in Italy claim that two sides in Serie A are interested in a potential..."
    },
    {
      "id": "7490edb48798",
      "title": "Report: Milan want to cash in on Estupiñán, price tag set",
      "url": "https://football-italia.net/report-milan-want-estupinan-sold/",
      "source": "football-italia.net",
      "date": "2026-02-26T17:52:28+00:00",
      "summary": "Pervis Estupiñán’s time at Milan appears to be drawing to a close after just one..."
    },
    {
      "id": "4607c4ec9334",
      "title": "Report Allegri considering his future at Milan",
      "url": "https://football-italia.net/allegri-consider-future-milan-report/",
      "source": "football-italia.net",
      "date": "2026-02-25T10:56:20+00:00",
      "summary": "According to Sportitalia, Milan coach Massimiliano Allegri is considering his future at the club beyond..."
    },
    {
      "id": "7367715a2cf2",
      "title": "Former Serie A referee plays down controversial decisions in Milan defeat to Parma",
      "url": "https://football-italia.net/tommasi-milan-parma-open-var/",
      "source": "football-italia.net",
      "date": "2026-02-24T16:51:37+00:00",
      "summary": "Parma’s late 1-0 victory against Milan at San Siro has continued to generate significant debate..."
    },
    {
      "id": "af0191216a1b",
      "title": "Today’s Papers: Champions League, Inter-Bodo/Glimt, McKennie renewal",
      "url": "https://football-italia.net/todays-papers-champions-league-inter-bodo/",
      "source": "football-italia.net",
      "date": "2026-02-24T08:41:35+00:00",
      "summary": "La Gazzetta dello Sport  In with the goals  Champions League: Inter looking for the comeback..."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    }
  ]
}