{
  "lastUpdated": "2026-02-26T16:56:59.289690+00:00",
  "articles": [
    {
      "id": "c2fad024fc72",
      "title": "MN - Strasser on Goretzka at Milan: \"He could be a good choice. He would act as a bodyguard for Modric\"",
      "url": "https://www.milannews.it/news/mn-strasser-su-goretzka-al-milan-potrebbe-essere-una-buona-scelta-farebbe-da-bodyguard-a-modric-608688",
      "source": "milannews.it",
      "date": "2026-02-26T16:50:00+00:00",
      "summary": "Between one match and another there are those who are already starting to think about next season, also because in a few weeks from now the first transfer market rumors will begin to emerge in view of ..."
    },
    {
      "id": "407e26d0c1c6",
      "title": "MN - Milan-Inter tickets, an important news is coming: the details",
      "url": "https://www.milannews.it/primo-piano/mn-biglietti-milan-inter-in-arrivo-una-novita-importante-i-dettagli-608794",
      "source": "milannews.it",
      "date": "2026-02-26T16:41:35+00:00",
      "summary": "In view of next week's derby (the official date and time should arrive from the League tomorrow), Milan has decided to carry out a test for what could be a new king platform ..."
    },
    {
      "id": "25baffb6184a",
      "title": "MN - Martins is sure: \"Rafa is a top player who will continue to grow\"",
      "url": "https://www.milannews.it/news/mn-martins-e-sicuro-rafa-e-un-top-player-che-continuera-a-crescere-608763",
      "source": "milannews.it",
      "date": "2026-02-26T16:30:23+00:00",
      "summary": "Gelson Martins, Portuguese midfielder of Olympiacos, gave an interview to Alessandro Schiavone for Milannwews.it."
    },
    {
      "id": "9926db5f0ee4",
      "title": "MN: Milan keeping an eye on Europe as eight-point safety could grow",
      "url": "https://sempremilan.com/milan-keeping-eye-europe-eight-point-safety",
      "source": "sempremilan.com",
      "date": "2026-02-26T16:30:00+00:00",
      "summary": "This season, AC Milan just need to qualify for the Champions League. It sounds rather basic, but the fact is simple.  When Massimiliano Allegri arrived, his statements were only about the Champions League, rather than professing a dream to win the Scudetto in his first season back. Over the past few"
    },
    {
      "id": "f107c706e83a",
      "title": "Italia Femminile, the words of Laura Giuliani in view of the matches against Sweden and Denmark",
      "url": "https://www.milannews.it/news/italia-femminile-le-parole-di-laura-giuliani-in-vista-delle-sfide-contro-svezia-e-danimarca-608779",
      "source": "milannews.it",
      "date": "2026-02-26T16:21:43+00:00",
      "summary": "Laura Giuliani, goalkeeper of Milan and Italy Women, spoke like this from the Italian retreat in Coverciano in view of the matches against Sweden and Denmark, valid for qualifying for the next World Cup: \"This meeting is going ..."
    },
    {
      "id": "0f0cf6ae43ee",
      "title": "Youth sector, the programme: Primavera on Sunday, U18 derby on Monday",
      "url": "https://www.milannews.it/settore-giovanile/settore-giovanile-il-programma-domenica-la-primavera-lunedi-il-derby-u18-608778",
      "source": "milannews.it",
      "date": "2026-02-26T16:10:29+00:00",
      "summary": "Long weekend for the teams of the Rossoneri's Youth Sector, since the main commitment is that of the Under 18s who will play the Derby at the PUMA House of Football on Monday afternoon."
    },
    {
      "id": "0e6f8e8d6074",
      "title": "Thorsby towards Milan: \"To compete we will have to be perfect. We will try to get a result after the defeat against Parma\"",
      "url": "https://www.milannews.it/l-avversario/thorsby-verso-il-milan-per-giocarcela-dovremo-essere-perfetti-cerchera-di-fare-risultato-dopo-la-sconfitta-contro-il-parma-608786",
      "source": "milannews.it",
      "date": "2026-02-26T16:00:06+00:00",
      "summary": "Cremonese's new signing Morten Thorsby spoke at the press conference to present the match scheduled for Sunday at half time against Milan at the \"Giovanni Zini\" stadium."
    },
    {
      "id": "1032eb19107f",
      "title": "CM.it: Estupinan could already leave Milan after 12 months – the team interested",
      "url": "https://sempremilan.com/estupinan-could-already-leave-milan-team-interested",
      "source": "sempremilan.com",
      "date": "2026-02-26T16:00:00+00:00",
      "summary": "Pervis Estupinan was once deemed one of the most interesting defensive talents, but since his move to AC Milan, he has proven that those initial hopes were wayward. In the summer, there were certainly questions about whether Estupinan was the best option to replace Theo Hernandez. The Ecuadorian, ul"
    },
    {
      "id": "9ffff6fd9171",
      "title": "MN - Strasser on Goretzka: \"Perfect for Milan. He's not in his prime, but a new experience could do him good\"",
      "url": "https://www.milannews.it/news/mn-strasser-su-goretzka-perfetto-per-il-milan-non-e-nel-suo-prime-ma-una-nuova-esperienza-potrebbe-fargli-bene-608687",
      "source": "milannews.it",
      "date": "2026-02-26T15:50:58+00:00",
      "summary": "Between one match and another there are those who are already starting to think about next season, also because in a few weeks from now the first transfer market rumors will begin to emerge in view of ..."
    },
    {
      "id": "2e13f416c495",
      "title": "Eranio: \"Leao, a difficult player to place. Allegri was good at...\"",
      "url": "https://www.milannews.it/gli-ex/eranio-leao-giocatore-difficile-da-collocare-e-stato-bravo-allegri-a-608772",
      "source": "milannews.it",
      "date": "2026-02-26T15:40:10+00:00",
      "summary": "Stefano Eranio, former Rossoneri player, speaking on Carlo Pellegatti's YouTube channel, spoke thus about Allegri's Milan moment: \n\nOn Cremonese-Milan: \"It's being played after an unlucky match, beyond the controversy of ..."
    },
    {
      "id": "31d78bd492de",
      "title": "26 February 1995: Daniele Massaro scores his last goal for Milan",
      "url": "https://www.milannews.it/news/26-febbraio-1995-daniele-massaro-segna-il-suo-ultimo-gol-nel-milan-608756",
      "source": "milannews.it",
      "date": "2026-02-26T15:30:56+00:00",
      "summary": "On 26 February 1995, Daniele Massaro scored his last goal in the Rossoneri shirt: it was a Milan-Cremonese championship match and the former Milan striker scored the temporary 3-0 goal in the 86th minute with an assist from Boban (3-1 for the Devil..."
    },
    {
      "id": "89fab66faeec",
      "title": "CorSport: ‘Turning point for the attacking hierarchy’ – Allegri considering giving Füllkrug a chance",
      "url": "https://sempremilan.com/allegri-considering-fullkrug-chance",
      "source": "sempremilan.com",
      "date": "2026-02-26T15:30:00+00:00",
      "summary": "AC Milan could lineup with a different attacking shape this weekend, and Niclas Füllkrug could be the key to unlocking it.  Since the new year, it cannot be denied that Milan have been a little toothless in attack. Rafael Leao has found the net three times, whilst Christian Pulisic has failed to sco"
    },
    {
      "id": "db188f89351a",
      "title": "MN - Martins and the criticisms of Leao: \"They are part of football, Rafa just has to continue working to become one of the strongest\"",
      "url": "https://www.milannews.it/news/mn-martins-e-le-critiche-a-leao-fanno-parte-del-calcio-rafa-deve-solo-continuare-a-lavorare-per-diventare-uno-dei-piu-forti-608765",
      "source": "milannews.it",
      "date": "2026-02-26T15:21:31+00:00",
      "summary": "Gelson Martins, Portuguese midfielder of Olympiacos, gave an interview to Alessandro Schiavone for Milannwews.it."
    },
    {
      "id": "64044712e0cb",
      "title": "Cremonese-Milan, Massa referee: only one precedent this season with the Rossoneri",
      "url": "https://www.milannews.it/l-arbitro/cremonese-milan-arbitra-massa-un-solo-precedente-in-stagione-con-i-rossoneri-608758",
      "source": "milannews.it",
      "date": "2026-02-26T15:10:12+00:00",
      "summary": "Below is the referee appointment for Cremonese-Milan:\n\nReferee: MASSA\nAssistants: MELI – ALASSIO\nFourth man: AYROLDI\nVAR: GUIDE\nAVAR: MAGGIONI\n\nDavide Massa of the Imperia section has directed only one volume this season ..."
    },
    {
      "id": "58c72bb2edbd",
      "title": "MN EXCLUSIVE - Strasser (Abendzeitung): \"Goretzka would be perfect for Milan. Fullkrug must deserve confirmation\"",
      "url": "https://www.milannews.it/primo-piano/esclusiva-mn-strasser-abendzeitung-goretzka-sarebbe-perfetto-per-il-milan-fullkrug-deve-meritarsi-la-conferma-608686",
      "source": "milannews.it",
      "date": "2026-02-26T15:00:00+00:00",
      "summary": "Between one match and another there are those who are already starting to think about next season, also because in a few weeks from now the first transfer market rumors will begin to emerge in view of ..."
    },
    {
      "id": "b9155e63d97d",
      "title": "Gelson Martins discusses previous Milan links and Leao friendship: “A top player”",
      "url": "https://sempremilan.com/gelson-martins-discusses-milan-links-leao",
      "source": "sempremilan.com",
      "date": "2026-02-26T15:00:00+00:00",
      "summary": "AC Milan now have one of the most well known Portuguese talents in world football, Rafael Leao, but they had the chance to sign another previously. Leao is certainly one of the most exciting prospects to come out of Portugal in the past decade. Of course, he is no longer a prospect, and he has […]\nT"
    },
    {
      "id": "605bebbed8d2",
      "title": "Cristiano Ronaldo buys 25% of the Spanish club Almeria",
      "url": "https://www.milannews.it/news/cristiano-ronaldo-acquista-il-25-del-club-spagnolo-almeria-608767",
      "source": "milannews.it",
      "date": "2026-02-26T14:50:36+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 26 - Cristiano Ronaldo looks to the future and focuses on the shareholder structure of Spanish football."
    },
    {
      "id": "9ff8974a030b",
      "title": "Adriano: \"Golden Ball? When they gave it to Shevchenko I was at the same level\"",
      "url": "https://www.milannews.it/news/adriano-pallone-d-oro-quando-lo-hanno-dato-a-shevchenko-ero-allo-stesso-livello-608766",
      "source": "milannews.it",
      "date": "2026-02-26T14:40:30+00:00",
      "summary": "Adriano, former Inter striker, spoke to the Betsson.sport Talk format and regarding the fact of never having won the Ballon d'Or during his career he explained: \"I could have won it."
    },
    {
      "id": "07977b3507c5",
      "title": "Italy Women, the path to the Italian Women's World Cup begins. Soncin's squad",
      "url": "https://www.milannews.it/news/italia-femminile-inizia-il-percorso-vero-il-mondiale-delle-azzurre-le-convocate-di-soncin-608757",
      "source": "milannews.it",
      "date": "2026-02-26T14:30:12+00:00",
      "summary": "Concentration shines through his gaze."
    },
    {
      "id": "1668a4656bd1",
      "title": "CorSport: No Mateta means ‘significant investment’ – Milan preparing for world-class striker",
      "url": "https://sempremilan.com/no-mateta-means-significant-striker-investment-milan",
      "source": "sempremilan.com",
      "date": "2026-02-26T14:30:00+00:00",
      "summary": "A world-class striker did not arrive in January, so AC Milan will again look to recruit an elite number nine in a few months time, and the budget could be big. Jean-Philippe Mateta was seemingly going to be the man for Milan moving forwards. However, issues found in his medical cancelled the deal, a"
    },
    {
      "id": "83198ef2c75b",
      "title": "The \"Fuori Campo\" project presented: the words of the General Secretary of the Milan Foundation",
      "url": "https://www.milannews.it/news/presentato-il-progetto-fuori-campo-le-parole-del-segretario-generale-di-fondazione-milan-608761",
      "source": "milannews.it",
      "date": "2026-02-26T14:20:05+00:00",
      "summary": "Over 300 free and accessible sporting events spread across the squares and gardens of Milan from February to December 2026."
    },
    {
      "id": "e090801e3b14",
      "title": "MN - Martins on Milan: \"We are talking about a top club. In 2018...\"",
      "url": "https://www.milannews.it/news/mn-martins-sul-milan-parliamo-di-un-top-club-nel-2018-608764",
      "source": "milannews.it",
      "date": "2026-02-26T14:10:05+00:00",
      "summary": "Gelson Martins, Portuguese midfielder of Olympiacos, gave an interview to Alessandro Schiavone for Milannwews.it."
    },
    {
      "id": "9dc8c22b1308",
      "title": "Shock episode at the Bernabeu: Nazi salute from a Real Madrid member. Los Blancos' statement",
      "url": "https://www.milannews.it/news/episodio-choc-al-bernabeu-saluto-nazista-di-un-socio-del-real-madrid-il-comunicato-dei-blancos-608741",
      "source": "milannews.it",
      "date": "2026-02-26T14:00:00+00:00",
      "summary": "Shock episode at the Bernabeu before Real Madrid-Benfica: controversy exploded on social media over a video that quickly went viral."
    },
    {
      "id": "c4a05e4213a9",
      "title": "Chiellini offers update on Vlahovic’s future amid contract stalemate: “If we can do something”",
      "url": "https://sempremilan.com/chiellini-update-vlahovic-future-contract-stalemate",
      "source": "sempremilan.com",
      "date": "2026-02-26T14:00:00+00:00",
      "summary": "Dusan Vlahovic has been linked to AC Milan regularly over the past few years, and with his contract expiring, this may be their best chance. The attempts to sign Vlahovic in recent years have never gotten further than they have in the past 10 months. On several occasions, it has seemed like Milan we"
    },
    {
      "id": "c0cf0155ae26",
      "title": "Gavillucci on the reform of referees: \"The FIGC doesn't care about the technical aspect\"",
      "url": "https://www.milannews.it/news/gavillucci-sulla-riforma-degli-arbitri-la-figc-non-ha-a-cuore-l-aspetto-tecnico-608721",
      "source": "milannews.it",
      "date": "2026-02-26T13:40:00+00:00",
      "summary": "Claudio Gavillucci, former referee, spoke at Maracanà on TMW Radio, to talk about the possible reform of referees, with FIGC president Gravina pushing for an independent elite class: \"The reform ..."
    },
    {
      "id": "ce8979c187e8",
      "title": "CM: Allegri expecting answers from Milan management after completing goals – the latest",
      "url": "https://sempremilan.com/allegri-expecting-answers-milan-management",
      "source": "sempremilan.com",
      "date": "2026-02-26T13:35:00+00:00",
      "summary": "Massimiliano Allegri’s future at AC Milan has been subject to speculation recently, and a new update has been given today. In short, Allegri’s deal runs until 2027, with the option of another year on top of that. So, there are no major fears about his situation. Carlo Pellegatti offered his view on "
    },
    {
      "id": "027558f71881",
      "title": "Eranio: \"Leao has great qualities, but he is an anarchist. Loftus-Cheek bad loss\"",
      "url": "https://www.milannews.it/gli-ex/eranio-leao-ha-grandi-qualita-ma-e-un-anarchico-loftus-cheek-brutta-perdita-608768",
      "source": "milannews.it",
      "date": "2026-02-26T13:29:21+00:00",
      "summary": "Stefano Eranio, former Rossoneri player, released these words to Carlo Pellegatti's YouTube channel: \n\nOn the unbeaten record his Milan lost against Parma in 1993: \"Ours ended after a dominated match."
    },
    {
      "id": "b8d0ed93eb13",
      "title": "Photo: Milan record worst pressing numbers across Europe’s top five leagues",
      "url": "https://sempremilan.com/milan-record-worst-pressing-numbers-europe",
      "source": "sempremilan.com",
      "date": "2026-02-26T13:10:00+00:00",
      "summary": "It is clear that Massimiliano Allegri has set his team up in a very strict way, and the stats show this. Indeed, AC Milan are one of the most structured teams. When watching Milan, it is not a surprise that they are very strict in their defending. Whilst there are some pressing efforts made, his […]"
    },
    {
      "id": "2cdd4bf769e3",
      "title": "GdS: Milan have reason to be annoyed after nine crucial mistakes this season",
      "url": "https://sempremilan.com/milan-reason-be-annoyed-nine-crucial-mistakes",
      "source": "sempremilan.com",
      "date": "2026-02-26T12:45:00+00:00",
      "summary": "AC Milan have been their own biggest problem at times this season, but they have undeniably not been helped by certain things. There can be a lot said about this season, and whilst Massimiliano Allegri would probably be happy with several aspects, there have undoubtedly been a few moments which coul"
    },
    {
      "id": "b3ef13df8d2a",
      "title": "Reports: Gabbia yet to be assessed as Cremonese game draws closer – the latest",
      "url": "https://sempremilan.com/gabbia-yet-to-be-assessed-cremonese-game",
      "source": "sempremilan.com",
      "date": "2026-02-26T12:20:00+00:00",
      "summary": "AC Milan hope to have Matteo Gabbia back this weekend, but it seems unlikely considering there have been no updates yet. Gabbia was forced to miss the game against Parma, after being withdrawn from the starting lineup in the moments before kick-off. Perhaps it was a sign of what was to come on the e"
    },
    {
      "id": "dd55aef0f1b3",
      "title": "The Sun: Milan could re-unite Modric with out of contract Real Madrid teammate this summer",
      "url": "https://sempremilan.com/milan-reunite-modric-out-of-contract-real-madrid-teammate",
      "source": "sempremilan.com",
      "date": "2026-02-26T11:55:00+00:00",
      "summary": "This summer, AC Milan could get the band back together, with reports suggesting that Luka Modric could be joined in midfield by a former teammate. It is a bit of a surprise to see Milan linked with an aging talent, given they have so often focused on the younger players for the future. However, when"
    },
    {
      "id": "d881d08cbe8f",
      "title": "GdS: Rabiot expected to play with derby risk – Allegri’s plan to minimise worry",
      "url": "https://sempremilan.com/rabiot-expected-play-with-derby-risk",
      "source": "sempremilan.com",
      "date": "2026-02-26T11:30:00+00:00",
      "summary": "There is a chance that Adrien Rabiot misses the Derby della Madonnina next weekend, and AC Milan cannot afford that. It is quite simple, Milan struggle with Rabiot in the team, and Massimiliano Allegri is all too aware of that. In fact, when he is available, he plays, it is that simple for the Itali"
    },
    {
      "id": "b4117d0f6377",
      "title": "Moretto reveals Milan are attempting to sign Real Madrid starlet without key clause: “In the spotlight”",
      "url": "https://sempremilan.com/moretto-reveals-milan-attempting-sign-real-madrid-starlet",
      "source": "sempremilan.com",
      "date": "2026-02-26T11:05:00+00:00",
      "summary": "In recent years, AC Milan have made attempts to sign several youngsters from Real Madrid, and they have normally worked out well, so they will try again.  When you look at the recent history of players arriving from Los Blancos, the general feeling is positive. Brahim Diaz played a huge part in the "
    },
    {
      "id": "ac3569d1a376",
      "title": "CorSport: ‘At least five or six’ – Milan preparing for summer strengthening already",
      "url": "https://sempremilan.com/milan-preparing-summer-strengthening",
      "source": "sempremilan.com",
      "date": "2026-02-26T10:40:00+00:00",
      "summary": "In the summer, AC Milan will not have another rebuild. Instead, the club aim to strengthen the foundations set over the past two mercatos. When Massimiliano Allegri and Igli Tare arrived, it was clear that Milan needed a clear out. So, that is exactly what happened. Milan got rid of a lot of dead wo"
    },
    {
      "id": "3cdc6673e777",
      "title": "GdS: Milan ‘waiting for the turning point’ as Leao-Pulisic attack struggles so far",
      "url": "https://sempremilan.com/milan-waiting-turning-point-leao-pulisic-attack",
      "source": "sempremilan.com",
      "date": "2026-02-26T10:15:00+00:00",
      "summary": "At the start of the season, Christian Pulisic and Rafael Leao both seemingly transferred into strikers. However, they have not excelled together.  The best of Leao and Pulisic has come in different games. Indeed, the duo have struggled with injuries throughout this season, and this has certainly pla"
    },
    {
      "id": "5439dfe624b9",
      "title": "‘Daily campaign of persuasion’ – Milan begin renewal tactics with Modric deadline approaching",
      "url": "https://sempremilan.com/milan-begin-renewal-tactics-modric-deadline",
      "source": "sempremilan.com",
      "date": "2026-02-26T09:50:00+00:00",
      "summary": "This summer, Luka Modric will either extend his AC Milan deal or leave for another opportunity. It is a rare situation, but there is hope.  With contracts, it is normally the club’s choice when an option to extend is included. Where Modric is concerned, though, this is not the case. Instead, everyth"
    },
    {
      "id": "fd8bc98f43d5",
      "title": "Tuttosport: Milan need more from Pulisic as renewal issue lingers – the situation",
      "url": "https://sempremilan.com/milan-need-more-pulisic-renewal-issue-lingers",
      "source": "sempremilan.com",
      "date": "2026-02-26T09:25:00+00:00",
      "summary": "Christian Pulisic is expected to renew his deal with AC Milan in the future, but when that will be is difficult to say currently.  In the past few weeks, there have been very few positive updates about the situation with Pulisic. Of course, Milan do not have an intention of selling him in the summer"
    },
    {
      "id": "0600c3f33b7b",
      "title": "GdS: Milan must overcome San Siro issues with Champions League deciders awaiting",
      "url": "https://sempremilan.com/milan-overcome-san-siro-issues-champions-league",
      "source": "sempremilan.com",
      "date": "2026-02-26T09:00:00+00:00",
      "summary": "AC Milan have just 12 games to get to the finish line, a spot in the Champions League, and if they are to do so, things need to turn around. Indeed, looking at Milan’s position so far, they are certainly in a strong place for the top four spots. With that said, there are several […]\nThe post GdS: Mi"
    },
    {
      "id": "ea3b8cf767e4",
      "title": "MN: ‘Moment of truth’ – Gimenez hoping for March return with Milan goal in mind",
      "url": "https://sempremilan.com/gimenez-hoping-march-return-milan-goal",
      "source": "sempremilan.com",
      "date": "2026-02-25T19:00:00+00:00",
      "summary": "It seems next month will be the one for Santiago Gimenez, and the Mexican certainly has high hopes for what could be at AC Milan. This season, Gimenez has struggled, and that was immediately clear. However, it took until the Atalanta game for it to be addressed. A scan turned into a set-back and tha"
    },
    {
      "id": "0e84a1982af8",
      "title": "‘5 in 5 years’ – Ordine highlights difference between Inter and Milan’s card numbers",
      "url": "https://sempremilan.com/ordine-highlights-differences-inter-milan-red-cards",
      "source": "sempremilan.com",
      "date": "2026-02-25T18:30:00+00:00",
      "summary": "Today, the FIGC have held a ‘referee revolution’ meeting, and Franco Ordine has brought up a rather interesting stat.  The fallout from Inter’s win against Juventus is still going on, especially with Milan pretty much out of the title race now. Perhaps it is keeping an old wound open and vulnerable "
    },
    {
      "id": "4607c4ec9334",
      "title": "Report Allegri considering his future at Milan",
      "url": "https://football-italia.net/allegri-consider-future-milan-report/",
      "source": "football-italia.net",
      "date": "2026-02-25T10:56:20+00:00",
      "summary": "According to Sportitalia, Milan coach Massimiliano Allegri is considering his future at the club beyond..."
    },
    {
      "id": "7367715a2cf2",
      "title": "Former Serie A referee plays down controversial decisions in Milan defeat to Parma",
      "url": "https://football-italia.net/tommasi-milan-parma-open-var/",
      "source": "football-italia.net",
      "date": "2026-02-24T16:51:37+00:00",
      "summary": "Parma’s late 1-0 victory against Milan at San Siro has continued to generate significant debate..."
    },
    {
      "id": "af0191216a1b",
      "title": "Today’s Papers: Champions League, Inter-Bodo/Glimt, McKennie renewal",
      "url": "https://football-italia.net/todays-papers-champions-league-inter-bodo/",
      "source": "football-italia.net",
      "date": "2026-02-24T08:41:35+00:00",
      "summary": "La Gazzetta dello Sport  In with the goals  Champions League: Inter looking for the comeback..."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "7d1eaf8982a2",
      "title": "Serie A | Milan 0-1 Parma – Player Ratings as Troilo and Corvi batten down the hatches",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-player-ratings/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:09:16+00:00",
      "summary": "Milan fell to a late 1-0 defeat to Parma this evening, after they were unable..."
    },
    {
      "id": "0338d8d0b0d7",
      "title": "Serie A | Milan 0-1 Parma: Rossoneri suffer shocking first defeat in 24 rounds",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-shocking-defeat-24/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:05:53+00:00",
      "summary": "Milan paid the price for insipid finishing and sluggish defending, as Parma inflicted their first..."
    },
    {
      "id": "ad92e7503a8c",
      "title": "Ex-West Ham & Villa man Reo-Coker: ‘Fabregas pull on Saelemaekers inexcusable’",
      "url": "https://football-italia.net/ex-west-ham-villa-man-reo-coker-fabregas/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:50:32+00:00",
      "summary": "Former West Ham and Aston Villa midfielder turned CBS Sports Golazo pundit Nigel Reo-Coker has..."
    }
  ]
}