{
  "lastUpdated": "2026-02-08T06:47:34.405483+00:00",
  "articles": [
    {
      "id": "130cc14dbb32",
      "title": "Milanello, the resumption of training towards Pisa in the afternoon",
      "url": "https://www.milannews.it/news/milanello-nel-pomeriggio-la-ripresa-degli-allenamenti-verso-il-pisa-606728",
      "source": "milannews.it",
      "date": "2026-02-08T06:30:38+00:00",
      "summary": "On Wednesday morning, after Bologna, the Rossoneri carried out an unloading job at Milanello."
    },
    {
      "id": "68fc8b11d896",
      "title": "Today Milan Futuro is back on the pitch: info on the match and updated rankings",
      "url": "https://www.milannews.it/milan-futuro/oggi-milan-futuro-di-nuovo-in-campo-info-sul-match-e-classifica-aggiornata-606726",
      "source": "milannews.it",
      "date": "2026-02-08T06:15:29+00:00",
      "summary": "Today Milan Futuro returns to the pitch at Felice Chinetti to challenge Virtus Ciserano Bergamo. Kick-off at 2.30pm, with the match which can be followed on the official channels of the Rossoneri club."
    },
    {
      "id": "8dc68a24701a",
      "title": "Serie A, the day's programme: Inter and Juve between afternoon and evening",
      "url": "https://www.milannews.it/news/serie-a-il-programma-di-giornata-inter-e-juve-tra-pomeriggio-e-sera-606727",
      "source": "milannews.it",
      "date": "2026-02-08T06:00:00+00:00",
      "summary": "This is the complete program of the 24th matchday, which will see Milan and Como rest given the impossibility of playing the match at San Siro given the use of the facility for the inauguration ceremony of the O ..."
    },
    {
      "id": "86f29c3badc8",
      "title": "Baresi on the state of health: \"I'm much better, the worst is over\"",
      "url": "https://www.milannews.it/news/baresi-sullo-stato-di-salute-sto-molto-meglio-il-peggio-e-passato-606710",
      "source": "milannews.it",
      "date": "2026-02-08T00:00:00+00:00",
      "summary": "One of the great surprises of the beautiful Opening Ceremony of the 2026 Winter Olympic Games of Milan-Cortina, which was held in San Siro, was undoubtedly the entry of the Olympic torch into the stadium in the hands of Fran ..."
    },
    {
      "id": "09ebede24972",
      "title": "MN - Ravezzani: \"If Inter progress in the Champions League, losing energy and consequently points, Milan could have a chance at the Scudetto\"",
      "url": "https://www.milannews.it/news/mn-ravezzani-se-l-inter-va-avanti-in-champions-league-perdendo-energie-e-di-conseguenza-punti-il-milan-potrebbe-avere-chance-scudetto-606677",
      "source": "milannews.it",
      "date": "2026-02-07T23:45:58+00:00",
      "summary": "The director of TeleLombardia Fabio Ravezzani spoke exclusively to MilanNews.it."
    },
    {
      "id": "4f90305ecb5d",
      "title": "22 useful results in a row for Allegri. For Capello, in 1992-1993, there were 23",
      "url": "https://www.milannews.it/news/22-risultati-utili-di-fila-per-allegri-per-capello-nel-1992-1993-furono-23-606666",
      "source": "milannews.it",
      "date": "2026-02-07T23:30:30+00:00",
      "summary": "Milan (W14, D8) remained unbeaten for at least 22 games in a row in a single Serie A championship for the first time since 1992/93 (streak of 23 matches with Fabio Capello as coach). Opta reports it."
    },
    {
      "id": "97c94fd7f8b1",
      "title": "Baresi on being torchbearer: \"Bergomi and I were good at keeping the secret\"",
      "url": "https://www.milannews.it/news/baresi-sull-essere-tedoforo-io-e-bergomi-siamo-stati-bravi-a-mantenere-il-segreto-606711",
      "source": "milannews.it",
      "date": "2026-02-07T23:15:44+00:00",
      "summary": "One of the great surprises of the beautiful Opening Ceremony of the 2026 Winter Olympic Games of Milan-Cortina, which was held in San Siro, was undoubtedly the entry of the Olympic torch into the stadium in the hands of Fran ..."
    },
    {
      "id": "e32eddf98036",
      "title": "The 2 new \"acquisitions\". It can be the extra weapon. Let Tare make the market",
      "url": "https://www.milannews.it/editoriale/i-2-nuovi-acquisti-puo-essere-l-arma-in-piu-il-mercato-lo-faccia-tare-606721",
      "source": "milannews.it",
      "date": "2026-02-07T23:00:01+00:00",
      "summary": "It is a mini break between the final whistle on Tuesday of Bologna-Milan and the return to the pitch next Friday at 8.45pm in Pisa."
    },
    {
      "id": "1671bae9f128",
      "title": "MN - Ravezzani: \"Considering the conditions of Leao and Pulisic, I think Milan needed an attacker more than a defender\"",
      "url": "https://www.milannews.it/calciomercato-milan/mn-ravezzani-considerando-le-condizioni-di-leao-e-pulisic-penso-che-al-milan-servisse-piu-un-attaccante-che-un-difensore-606676",
      "source": "milannews.it",
      "date": "2026-02-07T22:45:53+00:00",
      "summary": "The director of TeleLombardia Fabio Ravezzani spoke exclusively to MilanNews.it."
    },
    {
      "id": "e87ef669a61f",
      "title": "Montervino praises Modric: \"He still makes a difference at Milan despite being 40 years old\"",
      "url": "https://www.milannews.it/news/montervino-elogia-modric-al-milan-fa-comunque-la-differenza-nonostante-i-40-anni-606664",
      "source": "milannews.it",
      "date": "2026-02-07T22:30:08+00:00",
      "summary": "Francesco Montervino, former Napoli captain, spoke to Radio Marte about Napoli, making a comparison with Milan's midfield: \"Lobotka and McTominay make up an extraordinary midfield: quantity, quality, ability to ..."
    },
    {
      "id": "017db68e8d76",
      "title": "Serie A, the updated standings after Fiorentina-Torino 2-2",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-dopo-fiorentina-torino-2-2-606725",
      "source": "milannews.it",
      "date": "2026-02-07T22:15:29+00:00",
      "summary": "This is the updated Serie A standings after Fiorentina-Torino 2-2.\n\nSERIES A, THE UPDATED RANKING\n\n1."
    },
    {
      "id": "69efcb79e325",
      "title": "Serie A, Fiorentina-Torino 2-2: the survival clash ends in a draw",
      "url": "https://www.milannews.it/news/serie-a-fiorentina-torino-2-2-finisce-in-parita-lo-scontro-salvezza-606724",
      "source": "milannews.it",
      "date": "2026-02-07T22:00:00+00:00",
      "summary": "No defeat against Lecce and relegation zone crystallized. Fiorentina-Torino ends 2-2, with the Granata equalizing in injury time with Maripan."
    },
    {
      "id": "0560125c3470",
      "title": "F. Galli: \"What particularly struck me was the quality of the performances of Athekame, De Winter and Nkunku\"",
      "url": "https://www.milannews.it/news/f-galli-cio-che-mi-ha-particolarmente-colpito-e-stata-la-qualita-delle-prestazioni-di-athekame-de-winter-e-nkunku-606623",
      "source": "milannews.it",
      "date": "2026-02-07T21:45:00+00:00",
      "summary": "Filippo Galli, former footballer, expressed himself thus in his editorial for MilanNews."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "8d4244bd18e4",
      "title": "Lazio, Sarri throws water on the fire: \"I have a contract here and I'm moving on\"",
      "url": "https://www.milannews.it/news/lazio-sarri-getta-acqua-sul-fuoco-ho-un-contratto-qui-e-vado-avanti-606708",
      "source": "milannews.it",
      "date": "2026-02-07T21:30:14+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 07 - \"There is a contract in place, I made a decision at the beginning of the year and I'm going ahead with that decision. If there are no things that can change the opinion of the two parties, we can move forward."
    },
    {
      "id": "aacdce9e541d",
      "title": "Gautieri: \"Milan is proving to be strong both at home and away\"",
      "url": "https://www.milannews.it/news/gautieri-il-milan-sta-dimostrando-di-essere-forte-sia-in-casa-che-fuori-606662",
      "source": "milannews.it",
      "date": "2026-02-07T21:15:10+00:00",
      "summary": "Carmine Gautieri, coach, expressed himself thus on Radio Tutto Napoli about the Scudetto race: \"Inter also made a very good impression on me in Cremona, playing with the second rows that in many teams would be ..."
    },
    {
      "id": "20a12cf71d84",
      "title": "Cuomo: \"De Winter's story reminds me of the year of the Scudetto, when everyone thought the purchase of a defender was essential\"",
      "url": "https://www.milannews.it/news/cuomo-la-storia-di-de-winter-mi-ricorda-l-anno-dello-scudetto-quando-tutti-pensavano-fosse-fondamentale-l-acquisto-di-un-difensore-606663",
      "source": "milannews.it",
      "date": "2026-02-07T21:00:10+00:00",
      "summary": "Michael Cuomo, journalist, expressed himself to MilanVibes on Koni De Winter: \"In the game of trading cards, De Winter is worth more than Tomori, Milan's defense is not supported by the quality of the individual, but by ..."
    },
    {
      "id": "804f79a37491",
      "title": "MN - Ravezzani: \"Roma's defeat in Udine is the best news for Milan in 2026\"",
      "url": "https://www.milannews.it/news/mn-ravezzani-la-sconfitta-della-roma-a-udine-e-la-notizia-piu-bella-per-il-milan-del-2026-606675",
      "source": "milannews.it",
      "date": "2026-02-07T20:45:49+00:00",
      "summary": "The director of TeleLombardia Fabio Ravezzani spoke exclusively to MilanNews.it."
    },
    {
      "id": "c6dfdc58c9b9",
      "title": "Barcelona's withdrawal from the Super League project is official",
      "url": "https://www.milannews.it/news/ufficiale-il-ritiro-del-barcellona-dal-progetto-superlega-606707",
      "source": "milannews.it",
      "date": "2026-02-07T20:30:31+00:00",
      "summary": "(ANSA) - BARCELONA, 07 FEB - Barcelona has formalized its withdrawal from the Super League, a project destined to revolutionize European football and now supported only by Real Madrid and its president, Florentino Pérez."
    },
    {
      "id": "765aa6cb1f97",
      "title": "Guidi: \"Rabiot is living up to his nickname Crazy Horse: no one at Milan beats him in terms of average distance traveled per game\"",
      "url": "https://www.milannews.it/news/guidi-rabiot-sta-tenendo-fede-al-suo-soprannome-cavallo-pazzo-nessuno-al-milan-lo-batte-per-distanza-media-percorsa-a-partita-606653",
      "source": "milannews.it",
      "date": "2026-02-07T20:15:26+00:00",
      "summary": "Marco Guidi, journalist, expressed himself as follows in La Gazzetta dello Sport on Adrien Rabiot: \"Rabiot is living up to the nickname given to him by the fans during his Juventus days, Crazy Horse."
    },
    {
      "id": "0a0688f603ca",
      "title": "Milan away, incredible numbers: the performance of Allegri's team is record-breaking",
      "url": "https://www.milannews.it/news/milan-in-trasferta-numeri-incredibili-il-rendimento-della-squadra-di-allegri-e-da-record-606650",
      "source": "milannews.it",
      "date": "2026-02-07T20:00:00+00:00",
      "summary": "There are images that, for Milan fans, are becoming almost a pleasant habit: the team celebrating under the away section, the players applauding following the rhythm of the supporters, the best players on the pitch greeting social media..."
    },
    {
      "id": "b7bcbeaf716f",
      "title": "Di Stefano explains difference with Allegri as Pioli also ‘wanted to win 1-0’",
      "url": "https://sempremilan.com/di-stefano-difference-allegri-pioli-win-1-0",
      "source": "sempremilan.com",
      "date": "2026-02-07T19:22:07+00:00",
      "summary": "Peppe Di Stefano has shared an interesting background on the difference between Stefano Pioli and Massimiliano Allegri, with the latter opting to do things fully his way.  Pioli achieved a lot of success during his five-year spell at the club, winning the Scudetto in 2021-22 and reaching the Champio"
    },
    {
      "id": "37d5a6207d9a",
      "title": "‘We are almost there’ – Gimenez fuels idea of early return with positive message",
      "url": "https://sempremilan.com/almost-gimenez-fuels-idea-early-return",
      "source": "sempremilan.com",
      "date": "2026-02-07T18:49:39+00:00",
      "summary": "Santiago Gimenez has sent a positive message to the AC Milan fans, stating that it’s not long before he will be back on the pitch.  The Mexican striker has been on the sidelines since the end of October, when it was decided that he would stop to try to recover from an ankle injury. In […]\nThe post ‘"
    },
    {
      "id": "58ea8db069af",
      "title": "Opinions, latest news, match results and more: Subscribe to our free weekly newsletter",
      "url": "https://sempremilan.com/opinion-news-subscribe-free-weekly-newsletter",
      "source": "sempremilan.com",
      "date": "2026-02-07T18:01:06+00:00",
      "summary": "Every week, Oliver and Isak of the SempreMilan team send out a newsletter to keep you posted on all things AC Milan, from the latest match results to news and interesting stories.  In this day and age, it can be incredibly difficult to keep up with everything that happens around a football team. We "
    },
    {
      "id": "2df72e7dae81",
      "title": "Road to the derby: A look at Milan and Inter’s fixtures before the big clash",
      "url": "https://sempremilan.com/road-derby-milan-inters-fixtures-before",
      "source": "sempremilan.com",
      "date": "2026-02-07T17:40:00+00:00",
      "summary": "Just four matchdays remain before the big Derby della Madonnina clash between AC Milan and Inter. With only five points separating the teams still, it’s possible that the game could decide a whole lot.  Considering that Milan have been able to keep up with Inter so far, sort of, the Scudetto race is"
    },
    {
      "id": "042089288980",
      "title": "GdS: Criticism partially put to bed after successful January for Milan’s signings",
      "url": "https://sempremilan.com/gds-criticism-partially-bed-january-milan",
      "source": "sempremilan.com",
      "date": "2026-02-07T17:05:56+00:00",
      "summary": "AC Milan are starting to benefit from their summer and winter signings, as highlighted by a report, after six months that were filled with hefty criticism.  As Gazzetta dello Sport points out, the comments from fans and pundits are much less harsh than they used to be, while the criticism is pretty "
    },
    {
      "id": "3f5d1fdc4a7b",
      "title": "How Cardinale and De Laurentiis want to rescue Serie A’s TV rights",
      "url": "https://sempremilan.com/how-cardinale-rescue-seriea-tv-rights",
      "source": "sempremilan.com",
      "date": "2026-02-07T16:30:04+00:00",
      "summary": "If you ask 100 people what the main problem with Serie A is, I think an overwhelming majority would say the TV rights revenue. While it risks becoming a scapegoat to explain all of the league’s problems (not a healthy mindset), it’s hard to argue against its importance. So, how do you fix it? Gerry "
    },
    {
      "id": "f258db7cc381",
      "title": "Baresi says ‘my legs were shaking’ during torch duties at Olympics inauguration",
      "url": "https://sempremilan.com/baresi-legs-shaking-torch-duties-olympics",
      "source": "sempremilan.com",
      "date": "2026-02-07T15:59:02+00:00",
      "summary": "Franco Baresi was one of the torchbearers at the inauguration of the Winter Olympics at San Siro yesterday. As he revealed afterwards, it was an experience that he will never forget.  The Winter Olympics are underway in Milano-Cortina and yesterday, the inauguration was held at San Siro. It is preci"
    },
    {
      "id": "27cf54da36ce",
      "title": "Costs of Maignan’s new deal highlight just how important star renewals are",
      "url": "https://sempremilan.com/costs-maignan-new-deal-important-renewals",
      "source": "sempremilan.com",
      "date": "2026-02-07T15:14:27+00:00",
      "summary": "The financials of Mike Maignan’s renewal have highlighted just how important it is to renew your star players, rather than going out and signing new ones.  Contract renewals have been a hot topic, and a sensitive one as well, at Milan since the departures of Gigio Donnarumma and Hakan Calhanoglu. In"
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "d9bbe93c80c0",
      "title": "Official: AC Milan Women announce two signings after key departure",
      "url": "https://sempremilan.com/official-ac-milan-women-announce-kamczyk-sesay",
      "source": "sempremilan.com",
      "date": "2026-02-07T14:46:18+00:00",
      "summary": "AC Milan Women have announced the signings of Ewelina Kamczyk and Mawa Sesay in the last few days, strengthening the side after a pretty big departure.  Two weeks ago, Milan confirmed the sale of their star forward Evelyn Ijeh to NC Courage. It is believed that the Rossoneri got a decent chunk of ca"
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "4b26b43fe7d4",
      "title": "Milan Primavera 0-1 Lazio: Three red cards shown in yet another defeat",
      "url": "https://sempremilan.com/milan-primavera-0-1-lazio-red-cards-defeat",
      "source": "sempremilan.com",
      "date": "2026-02-07T14:16:28+00:00",
      "summary": "Milan Primavera suffered a tough defeat against Lazio earlier this afternoon, definitely held back by the fact that two of their players were sent off. After the big defeat against Hellas Verona last weekend, the hope was that Giovanni Renna’s boys would be able to turn things around this time out. "
    },
    {
      "id": "b448fa404442",
      "title": "Longo: Milan have ‘earmarked’ €8m for young striker as negotiations continue",
      "url": "https://sempremilan.com/longo-milan-earmarked-8m-young-striker",
      "source": "sempremilan.com",
      "date": "2026-02-07T13:52:22+00:00",
      "summary": "AC Milan are still hoping to secure the services of Andrej Kostic and according to a report, they have earmarked €8m for the operation in the summer.  Kostic, who currently plays for Partizan Belgrade, was heavily linked with the Rossoneri last month and at one point, the move seemed imminent. Then,"
    },
    {
      "id": "c23e9467b328",
      "title": "Romano confirms Inter ‘was never an option’ for Maignan amid Milan renewal",
      "url": "https://sempremilan.com/romano-confirms-inter-never-option-maignan",
      "source": "sempremilan.com",
      "date": "2026-02-07T13:22:47+00:00",
      "summary": "Mike Maignan was courted by several clubs before AC Milan announced the contract renewal, but Inter was never an option for the goalkeeper.  On Saturday last week, Milan confirmed that Maignan had signed a new contract with the club until 2031. As such, a tiring saga was put to an end and it was cer"
    },
    {
      "id": "7f3e5913cce8",
      "title": "First shot at redemption: Milan’s run of revenge starts with Pisa return",
      "url": "https://sempremilan.com/first-shot-milans-run-revenge-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-07T12:30:00+00:00",
      "summary": "Next week’s clash against Pisa will be AC Milan’s first shot at revenge, following four now infamous games earlier in the season.  Just as Milan’s strong record against the top rivals has been highlighted this season, the same can be said for their struggles against the bottom-half sides. It all ste"
    },
    {
      "id": "8974911f0f07",
      "title": "GdS: Pulisic eyeing return for Pisa-Milan after working on his days off",
      "url": "https://sempremilan.com/gds-pulisic-return-pisa-milan-working",
      "source": "sempremilan.com",
      "date": "2026-02-07T12:00:00+00:00",
      "summary": "Christian Pulisic is eyeing a full recovery for AC Milan’s game against Pisa, eager to turn a corner after being on the sidelines for some time.  The American has been struggling with bursitis, i.e. an inflammation, in recent weeks and that’s why he has barely featured for the Rossoneri. Rather than"
    },
    {
      "id": "4ae6b735636d",
      "title": "De Sciglio explains when he realised Milan exit was inevitable: “Boos rained down”",
      "url": "https://sempremilan.com/de-sciglio-realised-milan-exit-boos",
      "source": "sempremilan.com",
      "date": "2026-02-07T11:30:00+00:00",
      "summary": "Mattia De Sciglio has opened up about the moment that forced him to reconsider his AC Milan ties, eventually joining the league rivals Juventus.  De Sciglio first appeared on the big scene in the 2011-12 season, making his debut in the Champions League (of all competitions) for Milan. He quickly pro"
    },
    {
      "id": "10736adbe3b7",
      "title": "Moretto: Allegri gave go-ahead for Disasi move – why Milan abandoned talks",
      "url": "https://sempremilan.com/moretto-allegri-disasi-why-milan-no",
      "source": "sempremilan.com",
      "date": "2026-02-07T11:05:00+00:00",
      "summary": "Massimiliano Allegri had signed off on the arrival of Axel Disasi, according to a report, but AC Milan’s management opted to abandon the pursuit instead.  Right from the start, it was reported that Allegri wanted to reinforce the squad with a centre-back during the January window. While many names w"
    },
    {
      "id": "5be803b00cc9",
      "title": "Hiljemark and Pisa hoping for new manager effect against Milan: “Ready to fight”",
      "url": "https://sempremilan.com/hiljemark-pisa-new-manager-effect-milan",
      "source": "sempremilan.com",
      "date": "2026-02-07T10:40:00+00:00",
      "summary": "Oscar Hiljemark was recently announced as the new manager of Pisa and his second match in charge will be against AC Milan. A huge opportunity for him to send a signal, in other words.  After a far from ideal first half of the season, Pisa decided to part ways with the former Milan striker Alberto […"
    },
    {
      "id": "8a8cbe837ea9",
      "title": "Moretto: ‘In the coming weeks’ – Milan and Tomori nearing renewal agreement",
      "url": "https://sempremilan.com/moretto-coming-weeks-milan-tomori-renewal",
      "source": "sempremilan.com",
      "date": "2026-02-07T10:15:00+00:00",
      "summary": "Fikayo Tomori is getting closer to renewing his contract with AC Milan, currently in advanced negotiations with the club.  After some previous concerns about his form, mainly as a result of the post-Scudetto performances, Tomori has returned to higher standards under Massimiliano Allegri. He has bee"
    },
    {
      "id": "3ff9410ee304",
      "title": "GdS: Allegri reaping the rewards from insisting on trio of Milan youngsters",
      "url": "https://sempremilan.com/gds-allegri-reaping-rewards-milan-youngsters",
      "source": "sempremilan.com",
      "date": "2026-02-07T09:50:00+00:00",
      "summary": "Massimiliano Allegri has done well to promote talents at AC Milan this season, as highlighted by a report, with a certain trio now becoming increasingly important for the team.  As stated by today’s edition of Gazzetta dello Sport (see featured image), the list of youngsters that Allegri has launche"
    },
    {
      "id": "8e22622f4463",
      "title": "Moretto: Allegri ‘not fully onboard’ with Mateta signing amid tactical concerns",
      "url": "https://sempremilan.com/moretto-allegri-not-onboard-mateta-signing",
      "source": "sempremilan.com",
      "date": "2026-02-07T09:25:00+00:00",
      "summary": "Massimiliano Allegri didn’t consider Jean-Philippe Mateta as the ideal reinforcement for AC Milan’s attack, according to the latest updates from Matteo Moretto.  Mateta was the talk of the town in the final days of the transfer window, with Milan even carrying out medical tests amid the advanced neg"
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    },
    {
      "id": "0bbe5dfeba4c",
      "title": "Milan vs. Como postponed for 2026 Winter Olympics opening ceremony: when will it be played?",
      "url": "https://football-italia.net/milan-vs-como-postponed-2026-olympics-when/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:59:54+00:00",
      "summary": "With the Stadio Meazza in San Siro unavailable for the 2026 Winter Olympics opening ceremony,..."
    },
    {
      "id": "7c148df4d4cd",
      "title": "Glasner opens up on Mateta’s failed Milan medical: ‘It wasn’t a big surprise’",
      "url": "https://football-italia.net/glasner-on-matetas-failed-milan-medical/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:55:13+00:00",
      "summary": "Crystal Palace head coach Oliver Glasner has admitted that ‘it wasn’t a big big surprise’..."
    },
    {
      "id": "c10c6a922ef6",
      "title": "San Siro’s last dance at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/san-siro-last-dance-winter-olympics-ceremony/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:23:58+00:00",
      "summary": "The opening ceremony of the 2026 Milan Cortina Winter Olympics will take place today at..."
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    },
    {
      "id": "b17892f94874",
      "title": "Hazard: ‘I was a Milan fan’, ‘special’ relationship with Sarri, but Mourinho the best",
      "url": "https://football-italia.net/hazard-milan-fan-sarri-special-mourinho-best/",
      "source": "football-italia.net",
      "date": "2026-02-05T10:54:34+00:00",
      "summary": "Former Belgian star Eden Hazard reveals he was a Milan fan as a kid and..."
    },
    {
      "id": "f86a3c2aa1e5",
      "title": "Del Piero: Juventus ‘must’ have title belief, but avoids Yildiz comparison",
      "url": "https://football-italia.net/del-piero-juventus-title-no-yildiz-comparison/",
      "source": "football-italia.net",
      "date": "2026-02-05T09:35:42+00:00",
      "summary": "Juventus legend Alessandro Del Piero feels the Bianconeri can still aim for the Serie A..."
    },
    {
      "id": "a5543b121859",
      "title": "Marotta: ‘Inter approve of rotation, Milan have an advantage for Scudetto’",
      "url": "https://football-italia.net/marotta-inter-approve-rotation-milan-advantage/",
      "source": "football-italia.net",
      "date": "2026-02-04T19:52:47+00:00",
      "summary": "Inter President Beppe Marotta backs the squad rotation for the Coppa Italia quarter-final with Torino..."
    },
    {
      "id": "9de86510452c",
      "title": "Why Inter vs. Torino Coppa Italia clash moved for 2026 Winter Olympics",
      "url": "https://football-italia.net/why-inter-vs-torino-coppa-italia-clash-moved/",
      "source": "football-italia.net",
      "date": "2026-02-04T17:23:22+00:00",
      "summary": "Tonight’s Coppa Italia quarter-final is technically Inter hosting Torino, but the 2026 Winter Olympics mean..."
    },
    {
      "id": "d1ee46184128",
      "title": "Milan eyeing Italy striker for summer transfer window but unwilling to spend €62m",
      "url": "https://football-italia.net/milan-eyeing-italy-striker-for-summer/",
      "source": "football-italia.net",
      "date": "2026-02-04T16:31:09+00:00",
      "summary": "Wednesday’s reports claim that Milan are eyeing a potential move for Italy international Moise Kean..."
    },
    {
      "id": "2b1e8827ad38",
      "title": "Capello analyses Milan’s 3-0 win over Bologna: ‘Foolish not to consider the Scudetto’",
      "url": "https://football-italia.net/capello-analyses-milans-3-0-win-over-bologna/",
      "source": "football-italia.net",
      "date": "2026-02-04T12:42:25+00:00",
      "summary": "Fabio Capello has had his say on Milan’s recent 3-0 victory over Bologna in Serie..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-04T11:21:04+00:00",
      "summary": "Recent reports claim that Alex Jimenez’s loan move to AFC Bournemouth is set to be..."
    },
    {
      "id": "b268dce71cdf",
      "title": "Today’s Papers – Milan impress in Bologna, Yildiz extends with Juventus",
      "url": "https://football-italia.net/todays-papers-milan-impress-in-bologna-yildiz-extends-with-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-04T08:29:55+00:00",
      "summary": "La Gazzetta dello Sport “What the Devil!” Milan overwhelm Bologna (3-0) and remain five points..."
    },
    {
      "id": "a7d106533e6a",
      "title": "Allegri: ‘Important to reach 50 points, but Milan have to do better’",
      "url": "https://football-italia.net/allegri-important-for-milan-to-reach-50-points/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:52:34+00:00",
      "summary": "Massimiliano Allegri believes that there is still room for improvement for his Milan side, despite..."
    },
    {
      "id": "6b625068a1fd",
      "title": "Italiano: ‘Bologna can’t put in two consecutive top-level performances’",
      "url": "https://football-italia.net/italiano-bologna-two-consecutive-performances/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:42:19+00:00",
      "summary": "Vincenzo Italiano was left bemused and questioning why his Bologna side do not seem able..."
    },
    {
      "id": "258cd38cc2c7",
      "title": "Player ratings: Bologna 0-3 Milan – French connection (and some UK)",
      "url": "https://football-italia.net/ratings-bologna-0-3-milan-french-connection/",
      "source": "football-italia.net",
      "date": "2026-02-03T22:12:07+00:00",
      "summary": "A combination of Milan’s French stars and Englishman Ruben Loftus-Cheek were among the best players..."
    }
  ]
}