{
  "lastUpdated": "2026-02-09T08:57:11.943551+00:00",
  "articles": [
    {
      "id": "43757e0d552c",
      "title": "The choices towards Pisa. CorSport: \"Leao is ready. Doubts about Saele and Pulisic\"",
      "url": "https://www.milannews.it/rassegna-stampa/le-scelte-verso-pisa-il-corsport-leao-pronto-dubbi-saele-e-pulisic-606821",
      "source": "milannews.it",
      "date": "2026-02-09T08:48:52+00:00",
      "summary": "The week of work towards Pisa has just begun, but Massimiliano Allegri already has to deal with some training doubts considering the not entirely optimal conditions of some of his players, returning from physical and/or mental problems ..."
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "a9f17cbcce4e",
      "title": "Calendar, Allegri, returns. The QS: \"Milan: here are the assault weapons\"",
      "url": "https://www.milannews.it/rassegna-stampa/calendario-allegri-rientri-il-qs-milan-ecco-le-armi-d-assalto-606820",
      "source": "milannews.it",
      "date": "2026-02-09T08:36:00+00:00",
      "summary": "The clear victory over Sassuolo confirmed the strength of Inter, currently the number one favorite to win the Scudetto."
    },
    {
      "id": "3d96dd0f38d5",
      "title": "Milan looks to the future. CorSport: \"Kostic, it's about the price to block him\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-milan-guarda-al-futuro-il-corsport-kostic-si-tratta-sul-prezzo-per-bloccarlo-606818",
      "source": "milannews.it",
      "date": "2026-02-09T08:24:58+00:00",
      "summary": "Milan's objective is not to work on the market only for the immediate present, but also for the future."
    },
    {
      "id": "124019a9a6de",
      "title": "Useful for the future. Tuttosport: \"Allegri is also waiting for Gimenez for the season finale\"",
      "url": "https://www.milannews.it/rassegna-stampa/utile-per-il-futuro-tuttosport-allegri-per-il-finale-di-stagione-aspetta-anche-gimenez-606819",
      "source": "milannews.it",
      "date": "2026-02-09T08:12:40+00:00",
      "summary": "Often during his interventions at the press conference Massimiliano Allegri spoke of Santiago Gimenez as a possible resource for Milan's season finale."
    },
    {
      "id": "57c15dffb509",
      "title": "Milanello here. La Gazzetta: \"Yesterday shooting: Leao in the group\"",
      "url": "https://www.milannews.it/rassegna-stampa/qui-milanello-la-gazzetta-ieri-ripresa-leao-in-gruppo-606817",
      "source": "milannews.it",
      "date": "2026-02-09T08:00:58+00:00",
      "summary": "Yesterday Milan met at Milanello after 3 days of rest granted by Massimiliano Allegri to begin preparing for the away match against Pisa scheduled for Friday."
    },
    {
      "id": "917f33d3caca",
      "title": "Milan attack, the nominations. Tuttosport: \"Kean, Vlahovic and Gabriel Jesus\"",
      "url": "https://www.milannews.it/rassegna-stampa/attacco-milan-le-nomination-tuttosport-kean-vlahovic-e-gabriel-jesus-606816",
      "source": "milannews.it",
      "date": "2026-02-09T07:48:10+00:00",
      "summary": "Having failed, for obvious reasons, the attack on Jean-Philippe Mateta, Milan begins to look around in view of the next summer transfer market to strengthen and complete Massimiliano Allegri's attack, waiting for answers not only from ..."
    },
    {
      "id": "3a020788963f",
      "title": "A lot depends on Modric. CorSport: \"Milan are waiting for Luka\"",
      "url": "https://www.milannews.it/news/molto-dipende-da-modric-il-corsport-il-milan-aspetta-luka-606814",
      "source": "milannews.it",
      "date": "2026-02-09T07:36:00+00:00",
      "summary": "Once we have officially entered the second part of the season, all the spotlight will be on Luka Modric, who will soon have to make an important decision regarding his future."
    },
    {
      "id": "26e1d3d0448b",
      "title": "Milan take the lead. La Gazzetta: \"Treasure worth 70 million. The ransoms bring new wealth\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-milan-all-incasso-la-gazzetta-tesoretto-da-70-milioni-i-riscatti-portano-nuova-ricchezza-606815",
      "source": "milannews.it",
      "date": "2026-02-09T07:24:50+00:00",
      "summary": "In addition to the possible Champions League prize, Milan could enjoy a further 70 million euros which they can reinvest in the next summer transfer market."
    },
    {
      "id": "a97bd43fd9b4",
      "title": "Yesterday the restart in sight of Pisa. Tuttosport: \"Pulisic-Saelemaekers personalized work\"",
      "url": "https://www.milannews.it/news/ieri-la-ripresa-in-vista-di-pisa-tuttosport-pulisic-saelemaekers-lavoro-personalizzato-606813",
      "source": "milannews.it",
      "date": "2026-02-09T07:12:00+00:00",
      "summary": "After giving him three days off, yesterday Max Allegri welcomed his players back to Milanello to begin preparing for the important away match scheduled for Friday in Pisa against Oscar Hiljemark's (new) team."
    },
    {
      "id": "1f1d5e8fa4d9",
      "title": "Milan are waiting for Luka Modric: his future depends on the end of the season",
      "url": "https://www.milannews.it/news/il-milan-aspetta-luka-modric-il-suo-futuro-passa-per-il-finale-di-stagione-606812",
      "source": "milannews.it",
      "date": "2026-02-09T07:00:00+00:00",
      "summary": "Milan and Luka Modric are looking ahead, but first there is a season to end in the best possible way."
    },
    {
      "id": "3c17b5d3cab1",
      "title": "Milan 13th in the Primavera 1 championship: the updated rankings",
      "url": "https://www.milannews.it/la-primavera/milan-13esimo-nel-campionato-primavera-1-la-classifica-aggiornata-606808",
      "source": "milannews.it",
      "date": "2026-02-09T06:40:00+00:00",
      "summary": "Giovanni Renna's Milan Primavera are 13th in the standings with 31 points on the 24th matchday of the championship."
    },
    {
      "id": "c41da65e268f",
      "title": "Milan Futuro seventh in Serie D: updated standings and next round of the championship",
      "url": "https://www.milannews.it/milan-futuro/milan-futuro-settimo-in-serie-d-classifica-aggiornata-e-prossima-turno-di-campionato-606807",
      "source": "milannews.it",
      "date": "2026-02-09T06:30:00+00:00",
      "summary": "Below is the Serie D Group B ranking updated following the results of the weekend, which saw Milan Futuro fall at home against Ciserano Bergamo: \n\nFolore Caratese 48 points\nChievo 40\nCasatese Merate 38\nBrusaporto 3 ..."
    },
    {
      "id": "798abc15e8cf",
      "title": "Yesterday Milan returned to training in view of the away match in Pisa",
      "url": "https://www.milannews.it/news/ieri-il-milan-e-tornato-ad-allenarsi-in-vista-della-trasferta-di-pisa-606806",
      "source": "milannews.it",
      "date": "2026-02-09T06:20:00+00:00",
      "summary": "As expected, yesterday the team returned to training at Milanello after the three days of rest granted by Massimiliano Allegri after the victory in Bologna: work began in view of the away match in Pisa on Friday..."
    },
    {
      "id": "802541742481",
      "title": "The Serie A standings updated after the weekend's results",
      "url": "https://www.milannews.it/news/la-classifica-di-serie-a-aggiornata-dopo-i-risultati-del-weekend-606805",
      "source": "milannews.it",
      "date": "2026-02-09T06:10:00+00:00",
      "summary": "Below is the Serie A ranking updated after the results of the championship weekend, which did not see AC Milan take to the field, which will recover its match against Como on February 18th:\n\n1. Inter 58\n2."
    },
    {
      "id": "bf3c8a4e3e1f",
      "title": "Tonight Atalanta and Roma await the recovery between Milan and Como: the results of the 23rd matchday of Serie A",
      "url": "https://www.milannews.it/news/stasera-atalanta-e-roma-in-attesa-del-recupero-tra-milan-e-como-i-risultati-della-23esima-giornata-di-serie-a-606804",
      "source": "milannews.it",
      "date": "2026-02-09T06:00:00+00:00",
      "summary": "Below are the results of the weekend's matches valid for the 24th day of the Enilive Serie A championship."
    },
    {
      "id": "8ac13c27ccbe",
      "title": "TOP NEWS of 8 February - Discovering Cissè, resumed at Milanello towards Pisa",
      "url": "https://www.milannews.it/news/top-news-dell-8-febbraio-alla-scoperta-di-cisse-ripresa-a-milanello-verso-pisa-606809",
      "source": "milannews.it",
      "date": "2026-02-09T00:00:25+00:00",
      "summary": "News, curiosities, the voices of the protagonists and the latest market news on MilanNews.it."
    },
    {
      "id": "4296da459e64",
      "title": "MN - Talarico without doubts: \"Cisse has great skills, but it's too early to say if he's already from Milan\"",
      "url": "https://www.milannews.it/news/mn-talarico-senza-dubbi-cisse-ha-grandi-doti-ma-e-presto-per-dire-se-e-gia-da-milan-606772",
      "source": "milannews.it",
      "date": "2026-02-08T23:45:00+00:00",
      "summary": "Alphadjo Cissè was the surprise of Milan's winter transfer market, also because the young Italian talent, born in 2006, was snatched away from the competition of PSV for almost 10 million euros."
    },
    {
      "id": "1ab4f4b3e3d2",
      "title": "Gasperini jokes about Totti's return to Roma: \"I'll let him play straight away\"",
      "url": "https://www.milannews.it/l-avversario/gasperini-scherza-sul-ritorno-di-totti-alla-roma-lo-faccio-giocare-subito-606801",
      "source": "milannews.it",
      "date": "2026-02-08T23:30:00+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 08 - Gian Piero Gasperini's comment on the possible return of Francesco Totti to Roma, which Claudio Ranieri mentioned, ends with a joke. \"I'll let him play straight away, but he has to train."
    },
    {
      "id": "97d13f3270da",
      "title": "Runjaic explodes after the defeat in Lecce: \"Very low level pitch, not up to Serie A\"",
      "url": "https://www.milannews.it/news/runjaic-sbotta-dopo-il-ko-di-lecce-campo-di-bassissimo-livello-non-all-altezza-della-serie-a-606795",
      "source": "milannews.it",
      "date": "2026-02-08T23:15:30+00:00",
      "summary": "Udinese coach Kosta Runjaic definitely couldn't digest his team's defeat in Lecce."
    },
    {
      "id": "928b92eae824",
      "title": "MN - Talarico sure: “Cissè has great margins for growth, it must be shaped”",
      "url": "https://www.milannews.it/news/mn-talarico-sicuro-cisse-ha-grandi-margini-di-crescita-va-plasmato-606771",
      "source": "milannews.it",
      "date": "2026-02-08T22:30:00+00:00",
      "summary": "Alphadjo Cissè was the surprise of Milan's winter transfer market, also because the young Italian talent, born in 2006, was snatched away from the competition of PSV for almost 10 million euros."
    },
    {
      "id": "17cbc166e501",
      "title": "One month until D-Day: Form, fitness and fixtures for Milan and Inter compared",
      "url": "https://sempremilan.com/form-fitness-fixtures-milan-inter-compared",
      "source": "sempremilan.com",
      "date": "2026-02-08T19:35:58+00:00",
      "summary": "There are four weeks and many games until the next instalment of the Derby della Madonnina, but it is already looking like an approaching watershed. Massimiliano Allegri has repeatedly spoken in the media about the notion of getting to March and seeing where Milan are, above all with regards to the "
    },
    {
      "id": "5ae0c757be31",
      "title": "Reports: Leao returns to full training but Pulisic and Saelemaekers remain doubts for Pisa",
      "url": "https://sempremilan.com/leao-full-pulisic-saelemaekers-doubts-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-08T18:30:00+00:00",
      "summary": "After the three days of rest granted by Massimiliano Allegri following the victory in Bologna, AC Milan officially resumed training this afternoon. As MilanNews24 report, the Milan squad have begun preparations for Friday night’s match at the Cetilar Arena against Pisa. This comes after Allegri deci"
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "d04c55144e8f",
      "title": "Bench-warmers turned match-winners: Lorenzo and Stefano discuss Allegri’s dilemma",
      "url": "https://sempremilan.com/bench-warmers-turned-match-winners-milan",
      "source": "sempremilan.com",
      "date": "2026-02-08T18:00:00+00:00",
      "summary": "AC Milan have one of the smallest squads in Serie A in terms of numbers, but Massimiliano Allegri continues to find new resources within it. For some time, there were question marks about what the summer window brought to Milan. The squad underwent a big downsizing to just 19 outfield players, and t"
    },
    {
      "id": "d9c8370987f4",
      "title": "Ambrosini sheds light on Milan’s dressing room at half-time in Istanbul collapse vs. Liverpool",
      "url": "https://sempremilan.com/ambrosini-milan-dressing-room-istanbul-liverpool",
      "source": "sempremilan.com",
      "date": "2026-02-08T17:30:00+00:00",
      "summary": "Massimo Ambrosini has lifted the lid on what happened during half-time in AC Milan’s Champions League final against Liverpool in 2005. The Champions League final in Istanbul 21 years ago is etched in everyone’s memories, but for the wrong reasons if you are a Milan fan. Carlo Ancelotti’s side had th"
    },
    {
      "id": "e21adaac6d75",
      "title": "CM: ‘Why not Milan’ – Tonali holds Italy preference despite Newcastle’s €90m price tag",
      "url": "https://sempremilan.com/tonali-why-not-milan-newcastle-90m",
      "source": "sempremilan.com",
      "date": "2026-02-08T17:00:00+00:00",
      "summary": "Sandro Tonali has made it his priority to return to Serie A if he does leave Newcastle, but AC Milan risk being bystanders. As Calciomercato.com recall, Matteo Moretto reported on Fabrizio Romano’s Italian YouTube channel that there was some talk about a deadline day move for Tonali, but Newcastle h"
    },
    {
      "id": "8d6b541d39bd",
      "title": "Milan Futuro 0-1 Virtus CiseranoBergamo: Rossoneri drop to 7th after frustrating defeat",
      "url": "https://sempremilan.com/milan-futuro-0-1-virtus-ciseranobergamo-report",
      "source": "sempremilan.com",
      "date": "2026-02-08T16:30:00+00:00",
      "summary": "Milan Futuro’s stuttering form continues, as they were beaten 1-0 by Virtus CiseranoBergamo on Sunday afternoon. Two early goals from Emanuele Sala and Lorenzo Ossola were not enough to clinch three points for Milan Futuro in their last game last weekend, as they drew 2-2 with Scanzorosciate to drop"
    },
    {
      "id": "e5d28631e58b",
      "title": "Watch: ‘Especially when it’s red’ – Zlatan Ibrahimovic gives San Siro tips and recalls farewell",
      "url": "https://sempremilan.com/ibrahimovic-san-siro-tips-farewell",
      "source": "sempremilan.com",
      "date": "2026-02-08T16:00:00+00:00",
      "summary": "As part of the continued coverage of the Winter Olympic games in Milano-Cortina, Zlatan Ibrahimovic has given his guide to the city. Ibrahimovic is someone who has been able to call Milan home for large parts of his career, both as a player and now as an executive. The former striker has been the fa"
    },
    {
      "id": "89d821583e3d",
      "title": "Tuttosport: An ascent in Modric’s shadow – Jashari begins to showcase €38m potential",
      "url": "https://sempremilan.com/ascent-jashari-modric-shadow-38m-potential",
      "source": "sempremilan.com",
      "date": "2026-02-08T15:30:00+00:00",
      "summary": "Ardon Jashari’s first season at AC Milan has certainly not been a walk in the park for various reasons, but it feels like he is back on the right track. As Tuttosport (via MilanPress) recall, the negotiations between Milan and Club Brugge for Jashari dragged on for a couple of months and it seemed l"
    },
    {
      "id": "0d07713dbe61",
      "title": "CM: Rayan already shining in the Premier League – the background on Milan’s pursuit",
      "url": "https://sempremilan.com/background-milan-pursuit-rayan-bournemouth",
      "source": "sempremilan.com",
      "date": "2026-02-08T15:00:00+00:00",
      "summary": "Rayan announced himself on the Premier League stage with a goal for Bournemouth, and AC Milan might have been watching on with envy. Rayan Vitor Simplicio Rocha, better known as simply Rayan, immediately stole the show on his full Premier League debut. He joined in the winter from Vasco da Gama, wit"
    },
    {
      "id": "80fefe20b796",
      "title": "CorSport: Pillars for the future – Milan want renewals of two defenders after Maignan’s",
      "url": "https://sempremilan.com/pillars-future-renewals-tomori-bartesaghi",
      "source": "sempremilan.com",
      "date": "2026-02-08T14:30:00+00:00",
      "summary": "AC Milan are working on two further renewals after getting Mike Maignan to pen fresh terms, and they are for two pillars of the defence. As Corriere dello Sport (via MilanPress) report this morning, Milan are not finished after Maignan’s extension. The directors also want to tie Davide Bartesaghi an"
    },
    {
      "id": "ab4ea9a04e98",
      "title": "Roma 1-0 AC Milan Women: Ex-player Bergamaschi returns to haunt Rossonere",
      "url": "https://sempremilan.com/roma-1-0-ac-milan-women-match-report",
      "source": "sempremilan.com",
      "date": "2026-02-08T14:04:20+00:00",
      "summary": "AC Milan Women suffered a setback on Sunday afternoon as they were beaten by Roma away from home, in a game with just one goal. Milan Femminile had another positive result on Sunday afternoon as they beat Genoa 2-1 thanks to a late goal. Again it was Kayleigh van Dooren who netted a brace, opening ["
    },
    {
      "id": "820a7075f7a9",
      "title": "CaughtOffside: Chelsea ready to sell defender for €35m – ‘background interest’ from Milan",
      "url": "https://sempremilan.com/chelsea-badiashile-35m-milan-background-interest",
      "source": "sempremilan.com",
      "date": "2026-02-08T13:35:13+00:00",
      "summary": "Chelsea defender Benoit Badiashile is expected to leave in the summer window, and AC Milan are among the teams linked. As CaughtOffside report, Badiashile is not considered a part of Chelsea’s plans moving forward and so a destination is already being thought about. There has been ‘some background i"
    },
    {
      "id": "8e024046b1c4",
      "title": "CM: Back with Abate, back to scoring – Zeroli hoping for spark with Milan ambition still there",
      "url": "https://sempremilan.com/zeroli-hoping-spark-milan-ambitions-abate",
      "source": "sempremilan.com",
      "date": "2026-02-08T13:10:00+00:00",
      "summary": "Kevin Zeroli was one of the most talked about talents in AC Milan’s youth sector, yet the past couple of years have been strange. As Calciomercato.com write, the hope is that Zeroli’s rebirth came in the 50th minute of the match against Padova last night. He scored his first goal for Juve Stabia, as"
    },
    {
      "id": "3e8188e5d275",
      "title": "Footy Headlines: Milan to release ‘glossy’ fourth kit with Slam Jam – the two versions",
      "url": "https://sempremilan.com/milan-slam-jam-glossy-two-versions",
      "source": "sempremilan.com",
      "date": "2026-02-08T12:45:00+00:00",
      "summary": "More information has emerged regarding the AC Milan fourth kit which will be released soon, in collaboration with PUMA and Slam Jam. According to Footy Headlines, the kits come in white and red versions with a shiny, metallic or glossy finish, which is ‘inspired by late 1990s/early 2000s design aest"
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "ecec4c2b283e",
      "title": "Tuttosport: A three-way battle – Allegri still search for final midfield piece",
      "url": "https://sempremilan.com/allegri-searching-final-midfield-piece",
      "source": "sempremilan.com",
      "date": "2026-02-08T12:20:00+00:00",
      "summary": "The central midfield department is the deepest in AC Milan’s entire squad, and Massimiliano Allegri is still searching for the perfect trio. As Tuttosport (via MilanPress) report this morning, the right midfield position in the 3-5-2 the only spot in the starting line-up without a designated starter"
    },
    {
      "id": "86c59425f8d9",
      "title": "CM: Gimenez counting down the days – the plan for his return and stance on future",
      "url": "https://sempremilan.com/gimenez-counting-down-days-return-future",
      "source": "sempremilan.com",
      "date": "2026-02-08T11:55:00+00:00",
      "summary": "Santiago Gimenez wants to play a key role in AC Milan’s season finale, and a plan has been drawn up for his return to action. Nearly two months after undergoing surgery on his right ankle in Amsterdam to resolve the issues that severely hampered him from August to the end of October, Gimenez said on"
    },
    {
      "id": "6bf08923df2f",
      "title": "Giornale: Juventus plot counter-move as Milan and rivals plot McKennie swoop",
      "url": "https://sempremilan.com/juventus-move-milan-rivals-mckennie-swoop",
      "source": "sempremilan.com",
      "date": "2026-02-08T11:30:00+00:00",
      "summary": "Dusan Vlahovic is not the only free transfer opportunity that AC Milan are looking at from Juventus, according to a report. Following Kenan Yildiz’s contract extension until 2030, this morning’s edition of Il Giornale (via MilanNews) reports that Juventus are working to secure other players whose de"
    },
    {
      "id": "24bcf10fa1cb",
      "title": "QS: Getting the max from little – how Allegri has utilised super subs the best in Serie A",
      "url": "https://sempremilan.com/how-allegri-utilised-super-subs",
      "source": "sempremilan.com",
      "date": "2026-02-08T11:05:00+00:00",
      "summary": "Massimiliano Allegri might use less substitutions than every other manager in Serie A, but he uses them the most effectively. As Quotidiano Sportivo write, Milan are second in the table, and their unbeaten streak (22 games: 14 wins, eight draws) is unmatched in Europe. All this is with an extra-smal"
    },
    {
      "id": "75c4dc105c21",
      "title": "GdS: Milan expected to have key duo back against Pisa – the latest from the treatment room",
      "url": "https://sempremilan.com/milan-saelemaekers-pulisic-pisa-treatment-room",
      "source": "sempremilan.com",
      "date": "2026-02-08T10:40:00+00:00",
      "summary": "AC Milan do not return to action until Friday night against Pisa, but information is emerging on the conditions of certain players. After Tuesday’s win against Bologna and a recovery session the next day, Massimiliano Allegri gave his players some rest. Milan will not play this weekend, as the match"
    },
    {
      "id": "d52054d7ae01",
      "title": "Footmercato: Vlahovic aware crucial decision awaits as Milan pitch project – the competition",
      "url": "https://sempremilan.com/vlahovic-crucial-decision-milan-chelsea-barcelona",
      "source": "sempremilan.com",
      "date": "2026-02-08T10:15:00+00:00",
      "summary": "Dusan Vlahovic is heading towards a free transfer in the summer, but his destination remains a mystery at this point. Footmercato report that Vlahović was no longer certain about continuing his adventure with Juventus even last year.At the end of August, the striker’s situation had taken a ‘major tu"
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    },
    {
      "id": "0bbe5dfeba4c",
      "title": "Milan vs. Como postponed for 2026 Winter Olympics opening ceremony: when will it be played?",
      "url": "https://football-italia.net/milan-vs-como-postponed-2026-olympics-when/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:59:54+00:00",
      "summary": "With the Stadio Meazza in San Siro unavailable for the 2026 Winter Olympics opening ceremony,..."
    },
    {
      "id": "7c148df4d4cd",
      "title": "Glasner opens up on Mateta’s failed Milan medical: ‘It wasn’t a big surprise’",
      "url": "https://football-italia.net/glasner-on-matetas-failed-milan-medical/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:55:13+00:00",
      "summary": "Crystal Palace head coach Oliver Glasner has admitted that ‘it wasn’t a big big surprise’..."
    },
    {
      "id": "c10c6a922ef6",
      "title": "San Siro’s last dance at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/san-siro-last-dance-winter-olympics-ceremony/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:23:58+00:00",
      "summary": "The opening ceremony of the 2026 Milan Cortina Winter Olympics will take place today at..."
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    },
    {
      "id": "b17892f94874",
      "title": "Hazard: ‘I was a Milan fan’, ‘special’ relationship with Sarri, but Mourinho the best",
      "url": "https://football-italia.net/hazard-milan-fan-sarri-special-mourinho-best/",
      "source": "football-italia.net",
      "date": "2026-02-05T10:54:34+00:00",
      "summary": "Former Belgian star Eden Hazard reveals he was a Milan fan as a kid and..."
    },
    {
      "id": "f86a3c2aa1e5",
      "title": "Del Piero: Juventus ‘must’ have title belief, but avoids Yildiz comparison",
      "url": "https://football-italia.net/del-piero-juventus-title-no-yildiz-comparison/",
      "source": "football-italia.net",
      "date": "2026-02-05T09:35:42+00:00",
      "summary": "Juventus legend Alessandro Del Piero feels the Bianconeri can still aim for the Serie A..."
    },
    {
      "id": "a5543b121859",
      "title": "Marotta: ‘Inter approve of rotation, Milan have an advantage for Scudetto’",
      "url": "https://football-italia.net/marotta-inter-approve-rotation-milan-advantage/",
      "source": "football-italia.net",
      "date": "2026-02-04T19:52:47+00:00",
      "summary": "Inter President Beppe Marotta backs the squad rotation for the Coppa Italia quarter-final with Torino..."
    },
    {
      "id": "9de86510452c",
      "title": "Why Inter vs. Torino Coppa Italia clash moved for 2026 Winter Olympics",
      "url": "https://football-italia.net/why-inter-vs-torino-coppa-italia-clash-moved/",
      "source": "football-italia.net",
      "date": "2026-02-04T17:23:22+00:00",
      "summary": "Tonight’s Coppa Italia quarter-final is technically Inter hosting Torino, but the 2026 Winter Olympics mean..."
    },
    {
      "id": "d1ee46184128",
      "title": "Milan eyeing Italy striker for summer transfer window but unwilling to spend €62m",
      "url": "https://football-italia.net/milan-eyeing-italy-striker-for-summer/",
      "source": "football-italia.net",
      "date": "2026-02-04T16:31:09+00:00",
      "summary": "Wednesday’s reports claim that Milan are eyeing a potential move for Italy international Moise Kean..."
    },
    {
      "id": "2b1e8827ad38",
      "title": "Capello analyses Milan’s 3-0 win over Bologna: ‘Foolish not to consider the Scudetto’",
      "url": "https://football-italia.net/capello-analyses-milans-3-0-win-over-bologna/",
      "source": "football-italia.net",
      "date": "2026-02-04T12:42:25+00:00",
      "summary": "Fabio Capello has had his say on Milan’s recent 3-0 victory over Bologna in Serie..."
    }
  ]
}