{
  "lastUpdated": "2026-02-10T09:59:57.050084+00:00",
  "articles": [
    {
      "id": "ea0eff65557b",
      "title": "MN: A year one apprenticeship – Jashari growing under Modric as crucial role beckons",
      "url": "https://sempremilan.com/apprenticeship-jashari-modric-crucial-role-beckons",
      "source": "sempremilan.com",
      "date": "2026-02-10T09:50:00+00:00",
      "summary": "Ardon Jashari was one of the most eagerly anticipated signings for AC Milan in recent times, but he is yet to carve out a starting role. Given the length of negotiations with Club Brugge and the amount that Milan agreed to invest to land him (almost €40m, including bonuses), expectations for Jashari"
    },
    {
      "id": "a9d60f9278d9",
      "title": "Nkunku explains: \"Condition matters a lot: as if a journalist did an interview without preparing the questions\"",
      "url": "https://www.milannews.it/news/nkunku-spiega-condizione-conta-tantissimo-come-se-un-giornalista-facesse-un-intervista-senza-preparare-le-domande-606917",
      "source": "milannews.it",
      "date": "2026-02-10T09:48:26+00:00",
      "summary": "The month of January was the turning point for Christopher Nkunku who saw several sliding doors close and others open suddenly."
    },
    {
      "id": "38233f6b5e55",
      "title": "Milan-Inter in a month: the words of Nerazzurri Dumfries on his return",
      "url": "https://www.milannews.it/l-avversario/tra-un-mese-milan-inter-le-parole-del-nerazzurro-dumfries-sul-suo-rientro-606953",
      "source": "milannews.it",
      "date": "2026-02-10T09:36:02+00:00",
      "summary": "In exactly one month, on the weekend of March 8, Milan will face Inter in a derby that already promises to be very heated and which could say a lot about the season of both teams, especially s ..."
    },
    {
      "id": "174e651f3e15",
      "title": "Tuttosport: ‘Operation Kean’ – Milan outline strategy to land striker Allegri sees as perfect",
      "url": "https://sempremilan.com/operation-kean-milan-strategy-allegri-perfect",
      "source": "sempremilan.com",
      "date": "2026-02-10T09:25:00+00:00",
      "summary": "We may be a few months away from the transfer window reopening, but AC Milan are already plotting their attempt for Moise Kean. Milan came very close to signing the striker for the future towards the end of the winter mercato. Jean-Philippe Mateta looked all set to be joining, but the move collapsed"
    },
    {
      "id": "02fc859c7eb0",
      "title": "Milan already in contact with Gila's agents: here's how much the Rossoneri club wants to spend",
      "url": "https://www.milannews.it/calciomercato-milan/milan-gia-in-contatto-con-gli-agenti-di-gila-ecco-quanto-vuole-spendere-il-club-rossonero-606962",
      "source": "milannews.it",
      "date": "2026-02-10T09:24:25+00:00",
      "summary": "The name of Mario Gila, Spanish defender born in 2000 from the Real Madrid school and from 2022 to Lazio, is certainly one of those at the top of the list of Igli Tare and the AC Milan management for next summer when he decides ..."
    },
    {
      "id": "9a25a7a3d504",
      "title": "The Serbia coach: \"Vlahovic will go to Barcelona, ​​for me. He must renew his career\"",
      "url": "https://www.milannews.it/news/il-preparatore-della-serbia-vlahovic-andra-al-barcellona-per-me-deve-rinnovare-la-sua-carriera-606943",
      "source": "milannews.it",
      "date": "2026-02-10T09:12:19+00:00",
      "summary": "One of the hottest names in the next summer transfer market will certainly be Dusan Vlahovic, the Serbian striker from Juventus who has been out of action for a few months today and is expected to be out of action for a further ..."
    },
    {
      "id": "f66ff62d5b3f",
      "title": "Milan is observing Kean closely: the aim is to negotiate directly with Fiorentina",
      "url": "https://www.milannews.it/primo-piano/il-milan-osserva-kean-da-vicino-si-punta-a-trattare-direttamente-con-la-fiorentina-606957",
      "source": "milannews.it",
      "date": "2026-02-10T09:00:00+00:00",
      "summary": "In the month of January, Milan brought to Allegri's court a striker with very specific characteristics such as Niclas Fullkrug but it cannot be said that the German, even if he were to be redeemed at the end of the season for 5 ..."
    },
    {
      "id": "79fcc69dccd2",
      "title": "Nkunku lifts lid on initial difficulties at Milan, exit rumours, team-mates and desire to win",
      "url": "https://sempremilan.com/nkunku-difficulties-milan-exit-rumours-win",
      "source": "sempremilan.com",
      "date": "2026-02-10T09:00:00+00:00",
      "summary": "Christopher Nkunku has revealed his love for AC Milan, and also shed some light on why he encountered difficulties at first. Nkunku was the last signing that Milan made in the summer transfer window and the management chose to invest heavily in him, agreeing a deal with Chelsea widely reported to be"
    },
    {
      "id": "ce532bed3cb1",
      "title": "Nkunku: \"I think Rabiot can play 90 minutes every day: he always pushes, he's a beast\"",
      "url": "https://www.milannews.it/news/nkunku-penso-che-rabiot-possa-giocare-90-minuti-ogni-giorno-spinge-sempre-e-una-bestia-606923",
      "source": "milannews.it",
      "date": "2026-02-10T08:48:04+00:00",
      "summary": "The month of January was the turning point for Christopher Nkunku who saw several sliding doors close and others open suddenly."
    },
    {
      "id": "2f4aaf0dca79",
      "title": "Pulisic is also on his way back, Tuttosport headlines: \"He goes on the bench in Pisa\"",
      "url": "https://www.milannews.it/rassegna-stampa/anche-pulisic-sulla-via-del-ritorno-tuttosport-titola-a-pisa-va-in-panchina-606939",
      "source": "milannews.it",
      "date": "2026-02-10T08:36:49+00:00",
      "summary": "The days of rest required by the Opening Ceremony of the Winter Olympic Games, have borne fruit for Milan. As also reported by MilanNews."
    },
    {
      "id": "db98faef212a",
      "title": "Fullkrug redemption, CorSport: \"He has 15 games to leave his mark\"",
      "url": "https://www.milannews.it/rassegna-stampa/riscatto-fullkrug-il-corsport-ha-15-partite-per-lasciare-il-segno-606936",
      "source": "milannews.it",
      "date": "2026-02-10T08:24:35+00:00",
      "summary": "Yesterday Niclas Fullkrug celebrated his 33rd birthday, his first in the Rossoneri."
    },
    {
      "id": "c2d9db5ce04b",
      "title": "The QS warms up the atmosphere at San Siro: \"A month of derby fever\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-qs-scalda-l-atmosfera-di-san-siro-un-mese-di-febbre-da-derby-606934",
      "source": "milannews.it",
      "date": "2026-02-10T08:12:55+00:00",
      "summary": "February will probably be a very important month in the economy of the season of Milan and Inter, also because its culmination will take place precisely in the derby between the two teams which will be played in ..."
    },
    {
      "id": "ee63ddce069b",
      "title": "Rafa confidence, the Gazzetta confirms: \"Leao on the upswing: Pisa in the sights\"",
      "url": "https://www.milannews.it/rassegna-stampa/fiducia-rafa-la-gazzetta-conferma-leao-in-ripresa-pisa-nel-mirino-606927",
      "source": "milannews.it",
      "date": "2026-02-10T08:00:00+00:00",
      "summary": "In the last match played by Milan, now a week ago at Bologna's home, Rafael Leao did not take the field, despite having been called up by Massimiliano Allegri."
    },
    {
      "id": "18a671315b1a",
      "title": "Nkunku: \"When Allegri says something, you have to do it. I was able to play a few games in a row: this helped me\"",
      "url": "https://www.milannews.it/news/nkunku-quando-allegri-dice-qualcosa-devi-farla-ho-potuto-giocare-qualche-gara-di-fila-questo-mi-ha-aiutato-606916",
      "source": "milannews.it",
      "date": "2026-02-10T07:48:10+00:00",
      "summary": "The month of January was the turning point for Christopher Nkunku who saw several sliding doors close and others open suddenly."
    },
    {
      "id": "100395333f38",
      "title": "Milan transfer market, CorSport: \"Gila remains the favorite for defense\"",
      "url": "https://www.milannews.it/rassegna-stampa/mercato-milan-il-corsport-gila-rimane-il-favorito-per-la-difesa-606913",
      "source": "milannews.it",
      "date": "2026-02-10T07:36:55+00:00",
      "summary": "The transfer market never ends, this saying is even more true at the end of the winter transfer market in January after which you can also get in touch with players expiring or in any case go and identify objectives ..."
    },
    {
      "id": "e294531fa5a7",
      "title": "Kean is a temptation for the Devil, Tuttosport: \"Milan are spying on him\"",
      "url": "https://www.milannews.it/rassegna-stampa/kean-e-una-tentazione-per-il-diavolo-tuttosport-il-milan-lo-spia-606909",
      "source": "milannews.it",
      "date": "2026-02-10T07:24:56+00:00",
      "summary": "The name of Moise Kean is back in fashion forcefully for the future of Milan's attack."
    },
    {
      "id": "4920eabb73fe",
      "title": "Milan on Weston McKennie? Moretto turns off the voices: his words",
      "url": "https://www.milannews.it/calciomercato-milan/il-milan-su-weston-mckennie-moretto-spegne-le-voci-le-sue-parole-606906",
      "source": "milannews.it",
      "date": "2026-02-10T07:12:34+00:00",
      "summary": "In the last few hours, despite the transfer market having just concluded, some rumors and indiscretions have emerged regarding AC Milan's possible interest in Juventus player Weston McKennie."
    },
    {
      "id": "64f78dfa094f",
      "title": "Nkunku: \"Never thought about leaving. Milan is the biggest club in Italy: it was born to win. It's also my goal\"",
      "url": "https://www.milannews.it/primo-piano/nkunku-mai-pensato-di-andar-via-milan-club-piu-grande-di-italia-e-nato-per-vincere-e-anche-il-mio-obiettivo-606900",
      "source": "milannews.it",
      "date": "2026-02-10T07:00:00+00:00",
      "summary": "Christopher Nkunku's season, after a limping start, seems to have finally taken off in this first month of 2026: the former Chelsea Frenchman broke free in the last match against Hellas and from that moment on he hasn't stopped ..."
    },
    {
      "id": "6804c23f27f2",
      "title": "Towards Pisa-Milan: ticket sales have also started for the guest sector",
      "url": "https://www.milannews.it/news/verso-pisa-milan-iniziata-la-vendita-dei-biglietti-anche-per-il-settore-ospiti-606898",
      "source": "milannews.it",
      "date": "2026-02-10T06:48:00+00:00",
      "summary": "This is all the information on the sale of tickets for Pisa-Milan on Friday, published by the official website of the Tuscan club:\n\n\"The Pisa Sporting Club communicates the methods of purchasing tickets for the ..."
    },
    {
      "id": "9cee24a53513",
      "title": "Milan Futuro, updated standings and next match: the details",
      "url": "https://www.milannews.it/milan-futuro/milan-futuro-classifica-aggiornata-e-prossimo-match-i-dettagli-606889",
      "source": "milannews.it",
      "date": "2026-02-10T06:36:25+00:00",
      "summary": "Below is the Serie D Group B ranking updated following the results of the weekend, which saw Milan Futuro fall at home against Ciserano Bergamo: \n\nFolore Caratese 48 points\nChievo 40\nCasatese Merate 38\nBrusaporto 3 ..."
    },
    {
      "id": "d036fce3195a",
      "title": "Italian Cup, this evening the quarter-finals between Naples and Como",
      "url": "https://www.milannews.it/l-avversario/coppa-italia-questa-sera-i-quarti-di-finale-tra-napoli-e-como-606888",
      "source": "milannews.it",
      "date": "2026-02-10T06:24:34+00:00",
      "summary": "This evening Napoli-Como will be staged, a single match valid for the quarter-finals of the Italian Cup."
    },
    {
      "id": "7383e3abc21f",
      "title": "Serie A, the program for the next round: Milan opens on Friday, on Valentine's Day there is Inter-Juve",
      "url": "https://www.milannews.it/news/serie-a-il-programma-del-prossimo-turno-il-milan-apre-venerdi-a-san-valentino-c-e-inter-juve-606895",
      "source": "milannews.it",
      "date": "2026-02-10T06:12:20+00:00",
      "summary": "This is the program for the next round of Serie A, the twenty-fourth.\n\nFRIDAY 13 FEBRUARY\nPisa-Milan 20."
    },
    {
      "id": "5637073c0f78",
      "title": "Serie A, the updated standings. Milan still second with a game in hand",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-milan-sempre-secondo-con-una-partita-in-meno-606894",
      "source": "milannews.it",
      "date": "2026-02-10T06:00:18+00:00",
      "summary": "This is the updated ranking at the end of the 23rd round of Serie A. Milan still second in the standings despite the match against Como still to be recovered."
    },
    {
      "id": "b6f8fecb873b",
      "title": "Alphadjo Cissè insight: Background, strengths, weaknesses and tactical fit",
      "url": "https://sempremilan.com/alphadjo-cisse-insight-scouting-report-milan",
      "source": "sempremilan.com",
      "date": "2026-02-09T19:48:37+00:00",
      "summary": "The winter transfer window ended up being a quiet one for AC Milan after an initial flurry, but one signing might go under the radar: Alphadjo Cissè. The big news concerning the first team in the mid-season mercato was the signing of Niclas Füllkrug from West Ham United on loan with option to buy, o"
    },
    {
      "id": "f91d10c378fd",
      "title": "‘A bit grotesque’ – Journalist breaks down timeline of Mateta to Milan saga",
      "url": "https://sempremilan.com/schira-breaks-down-timeline-mateta-milan-saga",
      "source": "sempremilan.com",
      "date": "2026-02-09T18:30:00+00:00",
      "summary": "Journalist Nicolo Schira has provided a detailed breakdown of exactly what happened in the Jean-Philippe Mateta saga. On the penultimate day of the winter window on February 1, multiple reliable sources stated that Milan and Crystal Palace had agreed a deal worth €30-35m for Mateta, the striker that"
    },
    {
      "id": "1d5d3d04dd95",
      "title": "Reports: Saelemaekers set to miss Pisa game after further MRI scan – the situation",
      "url": "https://sempremilan.com/saelemaekers-miss-pisa-mri-scan-situation",
      "source": "sempremilan.com",
      "date": "2026-02-09T18:02:10+00:00",
      "summary": "There were hopes that Alexis Saelemaekers could recover in time to face Pisa on Friday night, but the chances seem to have faded. According to MilanNews, the signs from training at Milanello today are that Christian Pulisic should be called up by Massimiliano Allegri in Pisa. Rafael Leao will be the"
    },
    {
      "id": "be67e20f950c",
      "title": "The odd one out: Estupinan immune to Allegri’s cure as question marks grow",
      "url": "https://sempremilan.com/estupinan-immune-to-allegri-cure-questions",
      "source": "sempremilan.com",
      "date": "2026-02-09T17:38:22+00:00",
      "summary": "Massimiliano Allegri is gradually getting more and more contributions from the summer signings, but there is one outlier. Milan’s squad is not a deep one after the cull that took place ahead of the season, and while some of the new additions – Luka Modric and Adrien Rabiot, above all – hit the groun"
    },
    {
      "id": "4c29e890bc21",
      "title": "TMW: Following Comotto’s path – enquiries arrive with Milan talent ready for next step",
      "url": "https://sempremilan.com/sala-comotto-path-enquiries-serie-b",
      "source": "sempremilan.com",
      "date": "2026-02-09T17:00:00+00:00",
      "summary": "Emanuele Sala is continuing his development with Milan Futuro, and his performances this season have attracted some interest. As TMW report, the 18-year-old – who signed a renewal on his birthday – is making a name for himself with Milan Futuro in Serie D under Massimo Oddo. His excellent performanc"
    },
    {
      "id": "bab1c884a3e7",
      "title": "CM: First-team plans to consecutive exclusions – Milan watching Max Ibrahimovic closely at Ajax",
      "url": "https://sempremilan.com/milan-watching-max-ibrahimovic-closely-ajax",
      "source": "sempremilan.com",
      "date": "2026-02-09T16:30:00+00:00",
      "summary": "AC Milan are keeping an eye on Maximilian Ibrahimovic’s time at Ajax, given that some money rests on the option to buy. As Calciomercato.com recall, Ibrahimovic introduced himself as a new Ajax player on January 14, stating: “I’m an independent player, and I want to write my own story. I feel good. "
    },
    {
      "id": "5451e22bee5a",
      "title": "CM: A familiar feeling – Bennacer sidelined again with €10m move in doubt",
      "url": "https://sempremilan.com/bennacer-sidelined-again-10m-dinamo-doubt",
      "source": "sempremilan.com",
      "date": "2026-02-09T16:00:00+00:00",
      "summary": "Ismael Bennacer has suffered a setback which puts his potential permanent move to Dinamo Zagreb in even more dought. In the summer window, Bennacer returned from Marseille who chose not to use their option to buy, but he didn’t remain for long. He again left Milan to move on loan to Dinamo Zagreb, w"
    },
    {
      "id": "01ca9ebf4d55",
      "title": "Report: Milan’s January signing Cissè suffers untimely blow – prolonged absence expected",
      "url": "https://sempremilan.com/alphadjo-cisse-untimely-blow-prolonged-absence",
      "source": "sempremilan.com",
      "date": "2026-02-09T15:30:00+00:00",
      "summary": "Some bad news has arrived for AC Milan’s January signing Alphadjo Cisse, who could be forced to sit out most of the rest of the season. Milan officially confirmed the signing of Cissè on a permanent deal from Hellas Verona on deadline day for the winter window. As part of the deal, it was also annou"
    },
    {
      "id": "955d1212b6f4",
      "title": "Sky: Leao back, Pulisic better, more tests for Saelemaekers – the latest from Milanello",
      "url": "https://sempremilan.com/leao-pulisic-saelemaekers-tests-latest-milanello",
      "source": "sempremilan.com",
      "date": "2026-02-09T15:00:00+00:00",
      "summary": "The AC Milan squad were once again at Milanello on Monday, as preparations continue for Friday night’s game in Pisa. According to what is being reported by Sky (via MilanNews), Milan had a double session today at Milanello. The team did some work in the gym this morning and training on one of the pi"
    },
    {
      "id": "44a1e116e494",
      "title": "‘A fantastic transfer window’ – Di Marzio explains why Milan’s management deserve praise",
      "url": "https://sempremilan.com/di-marzio-milan-fantastic-window-praise",
      "source": "sempremilan.com",
      "date": "2026-02-09T14:34:09+00:00",
      "summary": "Gianluca Di Marzio believes that AC Milan did fantastic business in the window, largely because they were able to complete Mike Maignan’s renewal. A week has already passed since the winter transfer window closed, and it’s time to take stock of things. Milan acquired a striker for the present in Nic"
    },
    {
      "id": "73c50e6dc84b",
      "title": "MN: Operation 12 from 12 – Milan enter crucial quartet of games with plenty to prove",
      "url": "https://sempremilan.com/milan-crucial-quartet-games-plenty-prove",
      "source": "sempremilan.com",
      "date": "2026-02-09T14:05:49+00:00",
      "summary": "AC Milan play four games between now and the derby against Inter on March 8, and the objective is simple: win them all. As MilanNews writes, Inter have moved eight points clear at the top again after hammering Sassuolo 5-0 on Sunday. Milan have a game in hand, but they cannot concern themselves with"
    },
    {
      "id": "dcf008d9eccd",
      "title": "CorSport: The three factors that will determine if Modric has a ‘final showcase’ with Milan",
      "url": "https://sempremilan.com/three-factors-modric-final-showcase-milan",
      "source": "sempremilan.com",
      "date": "2026-02-09T13:41:54+00:00",
      "summary": "Luka Modric is a pillar of the current AC Milan side, but at present there is uncertainty regarding whether he will remain beyond June. Corriere dello Sport (via MN24) wites this morning that the future of Milan’s midfield passes through what Modric chooses to do. More specifically, Igli Tare’s summ"
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "e2939d39a994",
      "title": "Tuttosport: Milan table €24m net contract to Vlahovic – agent wants double digits",
      "url": "https://sempremilan.com/milan-contract-vlahovic-agent-double-digits",
      "source": "sempremilan.com",
      "date": "2026-02-09T13:10:00+00:00",
      "summary": "AC Milan risk being priced out of the Dusan Vlahovic sweepstakes because of the striker’s salary remands, a report claims. According to the latest from Tuttosport, sporting director Igli Tare has re-established contact with Vlahovic’s agent, Darko Ristic, in order to try and make progress. Although "
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "6ce0d878c795",
      "title": "CorSport: Nkunku plus one – Leao and Füllkrug to fight for spot in Pisa",
      "url": "https://sempremilan.com/nkunku-plus-one-leao-fullkrug-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-09T12:45:00+00:00",
      "summary": "Due to a rather strange scheduling quirk, AC Milan had the weekend off while all of their top four rivals played. On Friday, though, they return to action in Pisa. As Corriere dello Sport (via MilanPress) write this morning, Milan were not in action due to the postponement of the match against Como "
    },
    {
      "id": "2dd78534f8a6",
      "title": "Schira: Milan send scout to watch Fiorentina star ahead of potential swoop – the details",
      "url": "https://sempremilan.com/milan-scout-fiorentina-kean-swoop-details",
      "source": "sempremilan.com",
      "date": "2026-02-09T12:20:00+00:00",
      "summary": "AC Milan had a scout present to watch Moise Kean in action ahead of a potential move in the summer window, it is claimed. With Jean-Philippe Mateta now crossed off the list following the knee issues that his medical revealed on deadline day, Milan are looking ahead to 2026-27 with the intention of s"
    },
    {
      "id": "94af64931b73",
      "title": "Oddo states ‘good football’ matters for Milan Futuro over results: “Not here to win the league”",
      "url": "https://sempremilan.com/oddo-milan-future-not-here-win-league",
      "source": "sempremilan.com",
      "date": "2026-02-09T11:55:00+00:00",
      "summary": "Massimo Oddo has once again stressed that Milan Futuro do not see winning Serie D as their aim, after another tough defeat. There have been times this season when the Futuro have flirted with a push for top spot, though they have almost always been in a play-off position. Early in 2026 though their "
    },
    {
      "id": "791ad6ad5341",
      "title": "Albertini reflects on dazzling Milan career including debut, coaches and best moments",
      "url": "https://sempremilan.com/albertini-milan-debut-coaches-best-moments",
      "source": "sempremilan.com",
      "date": "2026-02-09T11:30:00+00:00",
      "summary": "Demetrio Albertini has opened up about his time with AC Milan, including the prevailing memories and some of the coaches he worked with. Albertini was a hugely influential figure in Milan’s golden era back in the 1990s, when red and black ruled the world. The midfielder was even nicknamed ‘The Metro"
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    },
    {
      "id": "0bbe5dfeba4c",
      "title": "Milan vs. Como postponed for 2026 Winter Olympics opening ceremony: when will it be played?",
      "url": "https://football-italia.net/milan-vs-como-postponed-2026-olympics-when/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:59:54+00:00",
      "summary": "With the Stadio Meazza in San Siro unavailable for the 2026 Winter Olympics opening ceremony,..."
    },
    {
      "id": "7c148df4d4cd",
      "title": "Glasner opens up on Mateta’s failed Milan medical: ‘It wasn’t a big surprise’",
      "url": "https://football-italia.net/glasner-on-matetas-failed-milan-medical/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:55:13+00:00",
      "summary": "Crystal Palace head coach Oliver Glasner has admitted that ‘it wasn’t a big big surprise’..."
    },
    {
      "id": "c10c6a922ef6",
      "title": "San Siro’s last dance at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/san-siro-last-dance-winter-olympics-ceremony/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:23:58+00:00",
      "summary": "The opening ceremony of the 2026 Milan Cortina Winter Olympics will take place today at..."
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    },
    {
      "id": "b17892f94874",
      "title": "Hazard: ‘I was a Milan fan’, ‘special’ relationship with Sarri, but Mourinho the best",
      "url": "https://football-italia.net/hazard-milan-fan-sarri-special-mourinho-best/",
      "source": "football-italia.net",
      "date": "2026-02-05T10:54:34+00:00",
      "summary": "Former Belgian star Eden Hazard reveals he was a Milan fan as a kid and..."
    },
    {
      "id": "f86a3c2aa1e5",
      "title": "Del Piero: Juventus ‘must’ have title belief, but avoids Yildiz comparison",
      "url": "https://football-italia.net/del-piero-juventus-title-no-yildiz-comparison/",
      "source": "football-italia.net",
      "date": "2026-02-05T09:35:42+00:00",
      "summary": "Juventus legend Alessandro Del Piero feels the Bianconeri can still aim for the Serie A..."
    },
    {
      "id": "a5543b121859",
      "title": "Marotta: ‘Inter approve of rotation, Milan have an advantage for Scudetto’",
      "url": "https://football-italia.net/marotta-inter-approve-rotation-milan-advantage/",
      "source": "football-italia.net",
      "date": "2026-02-04T19:52:47+00:00",
      "summary": "Inter President Beppe Marotta backs the squad rotation for the Coppa Italia quarter-final with Torino..."
    },
    {
      "id": "9de86510452c",
      "title": "Why Inter vs. Torino Coppa Italia clash moved for 2026 Winter Olympics",
      "url": "https://football-italia.net/why-inter-vs-torino-coppa-italia-clash-moved/",
      "source": "football-italia.net",
      "date": "2026-02-04T17:23:22+00:00",
      "summary": "Tonight’s Coppa Italia quarter-final is technically Inter hosting Torino, but the 2026 Winter Olympics mean..."
    }
  ]
}