{
  "lastUpdated": "2026-02-28T10:21:25.923448+00:00",
  "articles": [
    {
      "id": "c54515f6db48",
      "title": "Tuttosport: A three-way battle for one spot – Allegri to resolve final pre-Cremonese doubt",
      "url": "https://sempremilan.com/allegri-resolve-final-pre-cremonese-doubt",
      "source": "sempremilan.com",
      "date": "2026-02-28T10:15:00+00:00",
      "summary": "AC Milan are back on the field against Cremonese on Sunday in the early kick-off, and Massimiliano Allegri is making decisions on his line-up. According to Tuttosport (via MilanNews), Allegri has only one doubt regarding his starting XI for tomorrow’s match. It concerns who will partner the ‘usual’ "
    },
    {
      "id": "b77101a11118",
      "title": "Milan transfer market, Gazzetta: \"Kostic remains on the Rossoneri's roster\"",
      "url": "https://www.milannews.it/calciomercato-milan/mercato-milan-gazzetta-kostic-resta-sul-taccuino-dei-rossoneri-608954",
      "source": "milannews.it",
      "date": "2026-02-28T10:12:21+00:00",
      "summary": "Regarding the Milan transfer market, today's edition of the Gazzetta dello Sport headlines as follows: \"Kostic remains on the Rossoneri's notebook\"."
    },
    {
      "id": "110b7961e975",
      "title": "Milan chase Guirassy and Chelsea-owned striker for next summer – report",
      "url": "https://football-italia.net/milan-guirassy-chelsea-striker-2026-summer/",
      "source": "football-italia.net",
      "date": "2026-02-28T10:00:29+00:00",
      "summary": "According to La Gazzetta dello Sport, Borussia Dortmund’s Serhou Guirassy is one of Milan’s main..."
    },
    {
      "id": "933a39d0948d",
      "title": "Pellegatti doesn't agree: \"Let's stop the ball, that's not the way it goes. Respect for Milan\"",
      "url": "https://www.milannews.it/news/pellegatti-non-ci-sta-fermiamo-il-pallone-cosi-non-va-rispetto-per-il-milan-608953",
      "source": "milannews.it",
      "date": "2026-02-28T10:00:05+00:00",
      "summary": "On his YouTube channel, Carlo Pellegatti commented on last night's refereeing episode in Parma-Cagliari where the same block made by Valenti to Maignan in Milan-Parma was whistled because it was deemed a foul."
    },
    {
      "id": "a02791d39772",
      "title": "CM: Furlani, Calvelli, Tare, Allegri – how Milan’s management could change as ‘frictions’ arise",
      "url": "https://sempremilan.com/allegri-furlani-tare-milan-frictions-arise",
      "source": "sempremilan.com",
      "date": "2026-02-28T09:50:00+00:00",
      "summary": "AC Milan could be set for further alterations to the managerial structure within the club ahead of next season. As Calciomercato.com write, Milan have felt the lack of a figure capable of acting with authority and vision in the role of sporting director for years. With the arrival of Igli Tare, the "
    },
    {
      "id": "3dd9c5fa6689",
      "title": "Jashari: \"Milan must be in the Champions League: we are angry not to be part of it\"",
      "url": "https://www.milannews.it/news/jashari-il-milan-deve-stare-in-champions-league-siamo-arrabbiati-di-non-esserne-parte-608929",
      "source": "milannews.it",
      "date": "2026-02-28T09:46:00+00:00",
      "summary": "Ardon Jashari is finally finding some continuity, after the serious injury at the start of the season which compromised the first half of the year."
    },
    {
      "id": "49b0af12b80f",
      "title": "Gazzetta: \"Now it's definitive: Women's Day with the Milan derby\"",
      "url": "https://www.milannews.it/news/gazzetta-adesso-e-definitivo-festa-della-donna-con-il-derby-di-milano-608946",
      "source": "milannews.it",
      "date": "2026-02-28T09:34:16+00:00",
      "summary": "\"Now it's official: Women's Day with the Milan derby\": this is the headline this morning from La Gazzetta dello Sport, which reports that the date and time of the Milan derby has been official since yesterday."
    },
    {
      "id": "43420c2fed48",
      "title": "Paolo Maldini sends Milan shirt to Barcelona defender as a gift amid transfer links",
      "url": "https://sempremilan.com/maldini-gift-barcelona-milan-gerard-martin",
      "source": "sempremilan.com",
      "date": "2026-02-28T09:25:00+00:00",
      "summary": "Barcelona defender Gerard Martin has received a rather special birthday gift from one of his idols, Paolo Maldini. Martin’s name has already been linked to Milan, but because of reported transfer interest. Matteo Moretto claimed earlier in the month that the Rossoneri are interested in signing the S"
    },
    {
      "id": "6b69a6975772",
      "title": "Milan, Paolo Maldini gives his shirt to Gerard Martin of Barça",
      "url": "https://www.milannews.it/gli-ex/milan-paolo-maldini-regala-la-sua-maglia-a-gerard-martin-del-barca-608950",
      "source": "milannews.it",
      "date": "2026-02-28T09:22:14+00:00",
      "summary": "Gerard Martin, Barcelona defender born in 2002, published a story on Instagram to thank Paolo Maldini who sent him his number 3 AC Milan shirt."
    },
    {
      "id": "f28ba7407247",
      "title": "Towards Cremonese-Milan: Fofana ahead of Jashari and Ricci",
      "url": "https://www.milannews.it/news/verso-cremonese-milan-fofana-in-vantaggio-su-jashari-e-ricci-608944",
      "source": "milannews.it",
      "date": "2026-02-28T09:10:29+00:00",
      "summary": "In view of tomorrow's away match on the Cremonese pitch (kick-off at 12."
    },
    {
      "id": "3c417740ddd0",
      "title": "Three for a starting shirt. Fofana, Jashari and Ricci: who will play in Cremona with the \"usual\" Modric and Rabiot?",
      "url": "https://www.milannews.it/primo-piano/in-tre-per-una-maglia-da-titolare-fofana-jashari-e-ricci-chi-giochera-a-cremona-con-i-soliti-modric-e-rabiot-608951",
      "source": "milannews.it",
      "date": "2026-02-28T09:00:54+00:00",
      "summary": "Massimiliano Allegri actually has only one doubt about his lineup for tomorrow's match away to Cremonese: who will join the \"usual\" Luka Modric and Adrien Rabiot in the middle of the pitch? There are three players in the running for a t-shirt..."
    },
    {
      "id": "e22722485316",
      "title": "GdS: ‘A No.9 for the Champions League’ – Milan’s targets from Guirassy to Retegui",
      "url": "https://sempremilan.com/9-champions-league-milan-guirassy-retegui",
      "source": "sempremilan.com",
      "date": "2026-02-28T09:00:00+00:00",
      "summary": "AC Milan want to secure Champions League qualification and reinvest the money to give Massimiliano Allegri a top striker. That is according to La Gazzetta dello Sport (seen below) who recall that Milan would have already filled the major gap in their squad if Jean-Philippe Mateta’s knee hadn’t force"
    },
    {
      "id": "49933e1a9b2c",
      "title": "Milan, little hope for Gabbia's recovery for the away match in Cremona",
      "url": "https://www.milannews.it/rassegna-stampa/milan-poche-speranze-per-il-recupero-di-gabbia-per-la-trasferta-di-cremona-608947",
      "source": "milannews.it",
      "date": "2026-02-28T08:47:19+00:00",
      "summary": "According to what Corriere dello Sport reports on newsstands this morning, there is little hope for Matteo Gabbia's recovery for tomorrow's away match on the Cremonese pitch."
    },
    {
      "id": "516db866ad92",
      "title": "Milan, today's program: training at lunchtime to adapt to the time of tomorrow's match, then departure for Cremona in the afternoon",
      "url": "https://www.milannews.it/rassegna-stampa/milan-il-programma-di-oggi-allenamento-all-ora-di-pranzo-per-adattarsi-all-orario-della-gara-di-domani-poi-nel-pomeriggio-la-partenza-per-cremona-608943",
      "source": "milannews.it",
      "date": "2026-02-28T08:35:36+00:00",
      "summary": "Today's edition of the Gazzetta dello Sport reports today's AC Milan program on the eve of tomorrow's championship match away to Cremonese, valid for the 27th matchday of Serie A: to adapt to the time of the ..."
    },
    {
      "id": "e45a3b7d1747",
      "title": "QS: \"Milan let go of Valhovic, now only Juventus remains\"",
      "url": "https://www.milannews.it/rassegna-stampa/qs-il-milan-molla-valhovic-ora-resta-solo-la-juventus-608949",
      "source": "milannews.it",
      "date": "2026-02-28T08:23:36+00:00",
      "summary": "The Quotidiano Sportivo headline this morning: \"Milan drop Valhovic, now only Juventus remains\"."
    },
    {
      "id": "7aca80b5050d",
      "title": "CorSport: \"Leao-Pulisic, the encore. Max confirms them from the 1st minute\"",
      "url": "https://www.milannews.it/rassegna-stampa/corsport-leao-pulisic-il-bis-max-li-conferma-dal-1-608948",
      "source": "milannews.it",
      "date": "2026-02-28T08:11:20+00:00",
      "summary": "The Corriere dello Sport on newsstands today has the following headline on Massimiliano Allegri's probable attacking choices for tomorrow's match at 12.30pm on the Cremonese pitch: \"Leao-Pulisic, the encore."
    },
    {
      "id": "3c9e3e5556ad",
      "title": "Milan, only today will it be known whether Gabbia will be able to at least be on the bench against Cremonese",
      "url": "https://www.milannews.it/rassegna-stampa/milan-solo-oggi-si-sapra-se-gabbia-potra-andare-almeno-in-panchina-contro-la-cremonese-608942",
      "source": "milannews.it",
      "date": "2026-02-28T07:59:24+00:00",
      "summary": "Even yesterday Matteo Gabbia, who is dealing with a muscle strain suffered last Sunday during the warm-up before Milan-Parma, did not train in a group, but continued his personalized work."
    },
    {
      "id": "2933bd40e55d",
      "title": "Towards Cremonese-Milan, Tuttosport: \"Ricci is looking for Allegri's yes\"",
      "url": "https://www.milannews.it/rassegna-stampa/verso-cremonese-milan-tuttosport-ricci-cerca-il-si-di-allegri-608945",
      "source": "milannews.it",
      "date": "2026-02-28T07:48:52+00:00",
      "summary": "Ahead of Cremonese-Milan tomorrow at 12.30pm, today's edition of Tuttosport has the headline: \"Ricci seeks Allegri's yes\"."
    },
    {
      "id": "f93c4a2d7374",
      "title": "Towards Cremonese-Milan, Gazzetta: \"The Pulisic-Leao duo is still forward. Fofana is back in midfield from the 1st minute?\"",
      "url": "https://www.milannews.it/rassegna-stampa/verso-cremonese-milan-gazzetta-in-avanti-ancora-la-coppia-pulisic-leao-a-centrocampo-torna-fofana-dal-1-608941",
      "source": "milannews.it",
      "date": "2026-02-28T07:36:48+00:00",
      "summary": "\"The Pulisic-Leao pair are still forward. Fofana returns to midfield from the 1st minute?\": this is the headline in La Gazzetta dello Sport this morning regarding Max Allegri's possible formation choices in view of tomorrow's away match at 12pm."
    },
    {
      "id": "69562f1fbe3f",
      "title": "Milan transfer market, Tuttosport headlines: \"There is a desire for Karetsas\"",
      "url": "https://www.milannews.it/rassegna-stampa/mercato-milan-tuttosport-titola-c-e-voglia-di-karetsas-608940",
      "source": "milannews.it",
      "date": "2026-02-28T07:24:50+00:00",
      "summary": "Tuttosport headlines this morning on the Milan transfer market: \"There is a desire for Karetsas\"."
    },
    {
      "id": "c7c2f533e92c",
      "title": "La Gazzetta opening: \"A 9 from Milan. The center forward is needed, Guirassy favored over Jackson and Retegui\"",
      "url": "https://www.milannews.it/rassegna-stampa/la-gazzetta-in-apertura-un-9-da-milan-serve-il-centravanti-guirassy-favorito-su-jackson-e-retegui-608939",
      "source": "milannews.it",
      "date": "2026-02-28T07:12:08+00:00",
      "summary": "Today's edition of the Gazzetta dello Sport headlines this morning on the front page: \"A 9 from Milan. The center forward is needed, Guirassy favored over Jackson and Retegui\"."
    },
    {
      "id": "de114f7eb2f8",
      "title": "Milan on the hunt for a real striker: Guirassy on pole, Retegui, Nunez and Jackson also in the running",
      "url": "https://www.milannews.it/primo-piano/milan-a-caccia-di-un-vero-bomber-guirassy-in-pole-in-corsa-anche-retegui-nunez-e-jackson-608938",
      "source": "milannews.it",
      "date": "2026-02-28T07:00:30+00:00",
      "summary": "There is still a Champions League to win, but Milan is already starting to think a bit about next season too."
    },
    {
      "id": "59cca46947b4",
      "title": "Serie A: advances and postponements, Milan-Inter on 8 March at 8.45pm",
      "url": "https://www.milannews.it/news/serie-a-anticipi-e-posticipi-milan-inter-l-8-marzo-alle-20-45-608920",
      "source": "milannews.it",
      "date": "2026-02-28T06:48:58+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 27 - The Serie A Football League has announced advances, postponements and TV programming of the championship days from the 28th to the 30th, before the national team break."
    },
    {
      "id": "eaf267139b51",
      "title": "Milan Futuro is back: date and time of the match against Folgore Caratese",
      "url": "https://www.milannews.it/news/torna-il-milan-futuro-data-e-ora-della-sfida-con-la-folgore-caratese-608916",
      "source": "milannews.it",
      "date": "2026-02-28T06:36:27+00:00",
      "summary": "After the excellent away win against Caldiero Terme, a clear and convincing 3-0, Mr. Oddo's Milan Futuro will face Folgore Caratese first in the standings. The appointment is for Sunday 1 March 2026 at 2 pm."
    },
    {
      "id": "2612528726e6",
      "title": "Primavera on the pitch tomorrow: match time and updated rankings",
      "url": "https://www.milannews.it/la-primavera/primavera-domani-in-campo-ora-della-sfida-e-classifica-aggiornata-608917",
      "source": "milannews.it",
      "date": "2026-02-28T06:24:33+00:00",
      "summary": "On Sunday 1 March, at 11am, Milan Primavera faces Roma at the Tre Fontane stadium in a match valid for the 27th matchday of the Primavera 1 championship. Renna's Rossoneri are coming off a great 2-1 victory against Napoli."
    },
    {
      "id": "8286a44416b4",
      "title": "Jashari discusses the Leao assist, playing with Modric and Champions League ambition: “Win together”",
      "url": "https://sempremilan.com/jashari-discuss-leao-assist-modric-champions-league",
      "source": "sempremilan.com",
      "date": "2026-02-27T19:30:00+00:00",
      "summary": "Ardon Jashari, today, has spoken about his goals for AC Milan and his ambition to return the club to the Champions League. When Milan took so long to sign Jashari in the summer, it made one thing very clear: they believed massively in him and his potential to be a big part of the future. […]\nThe pos"
    },
    {
      "id": "98d851dd4dc5",
      "title": "Rumblings of discontent: Negative stories engulf Milan again at crucial point in season",
      "url": "https://sempremilan.com/rumblings-discontent-stories-engulf-milan",
      "source": "sempremilan.com",
      "date": "2026-02-27T19:00:00+00:00",
      "summary": "It is a critical part of the season, and once again, AC Milan are surrounded by a controversial situation, which is becoming all too common now. There were rumours about Paulo Fonseca’s job throughout his tenure, whilst Sergio Conceicao was going to be without a job before several big occasions. In "
    },
    {
      "id": "5526ea2aba1e",
      "title": "Messaggero: Nephew of Inter legend could make Milan move – the Materazzi situation",
      "url": "https://sempremilan.com/son-of-inter-legend-could-make-milan-move",
      "source": "sempremilan.com",
      "date": "2026-02-27T18:30:00+00:00",
      "summary": "AC Milan could welcome the nephew of an Inter legend to the club in the near future, due to a contract situation with Lazio. With famous fathers, their sons normally go on to represent the same club. Of course, there are anomalies, but look at the Maldini line, for example. Now, it seems that a […]\n"
    },
    {
      "id": "e46f827be9e2",
      "title": "CorSport: Allegri considering Füllkrug for Cremonese as Leao and Pulisic create doubt",
      "url": "https://sempremilan.com/allegri-considering-fullkrug-cremonese-chance",
      "source": "sempremilan.com",
      "date": "2026-02-27T18:00:00+00:00",
      "summary": "It seems that Niclas Fullkrug could be heading for his second AC Milan start of the season, with Massimiliano Allegri struggling with the alternatives. The front line has been an issue for Milan all season; there can be no denying that. Whether it has been injuries, bad form or a mix of both, Allegr"
    },
    {
      "id": "950e3dbe4545",
      "title": "Two Serie A sides interested in free transfer for Manchester United’s Casemiro",
      "url": "https://football-italia.net/two-serie-a-sides-interested-in-casemiro-free/",
      "source": "football-italia.net",
      "date": "2026-02-27T17:47:18+00:00",
      "summary": "Reports in Italy claim that two sides in Serie A are interested in a potential..."
    },
    {
      "id": "9a6059ed4cca",
      "title": "Official: Date and times confirmed for Serie A Matchday 28-30 – when Milan-Inter will take place",
      "url": "https://sempremilan.com/dates-times-confirmed-serie-a-matchday-28-30-milan-inter-game",
      "source": "sempremilan.com",
      "date": "2026-02-27T17:23:45+00:00",
      "summary": "AC Milan, in the last few minutes, have discovered when they will play Serie A Matchdays 28 through 30, including the game against Inter. In the past few weeks, it has been discussed a lot about when Milan would face Inter. However, with the Rossoneri out of the title race, it has become more diffic"
    },
    {
      "id": "0896ca65fd8b",
      "title": "GdS: Juventus the latest Serie A competition for Goretzka as Milan continue evaluations",
      "url": "https://sempremilan.com/juventus-latest-serie-a-competition-goretzka",
      "source": "sempremilan.com",
      "date": "2026-02-27T17:00:00+00:00",
      "summary": "Leon Goretzka has been a name of extreme interest for AC Milan recently. However, he is also a target for several other clubs.  Milan’s position in the Goretzka race has never been the strongest. They have been at the window, but it does not seem like they have been pressing their noses against the "
    },
    {
      "id": "324e5ea13656",
      "title": "Tuttosport: Two Premier League sides retain interest in €32m Milan striker",
      "url": "https://sempremilan.com/two-premier-league-sides-interested-32m-milan-striker",
      "source": "sempremilan.com",
      "date": "2026-02-27T16:30:00+00:00",
      "summary": "Santiago Gimenez is expected to return to AC Milan in the near future, but his future may already be decided.  It has been a while since we have seen Gimenez in action. Furthermore, it can be suggested that it has been even longer since we have seen the real Gimenez in action, considering his ankle "
    },
    {
      "id": "7a384ce8e0c5",
      "title": "Schira: Allegri wants ‘greater say’ amid ‘internal frictions’ at Milan – the issues",
      "url": "https://sempremilan.com/allegri-wants-greater-say-internal-frictions-milan",
      "source": "sempremilan.com",
      "date": "2026-02-27T16:00:00+00:00",
      "summary": "There have been several rumours about Massimiliano Allegri’s AC Milan future recently, and a report today has offered a bit of clarity.  In the past few days, Milan have faced a few questions about Allegri’s position at the club, and what the future may hold for the parties. There have, as expected,"
    },
    {
      "id": "04dfe27158d5",
      "title": "CM: Thiaw linked with €60-70m move to Man Utd or Bayern – Milan’s sell-on regret",
      "url": "https://sempremilan.com/thiaw-linked-70m-move-bayern-man-utd-milan-regret",
      "source": "sempremilan.com",
      "date": "2026-02-27T15:30:00+00:00",
      "summary": "AC Milan could be left red-faced with Malick Thiaw being linked with several European heavyweights, and them having no interest in the matter. In the summer, Thiaw was sold to Newcastle United for a fee of €35 million. Of course, that is a hefty sum, and to Milan, it was the value that was considere"
    },
    {
      "id": "b3b40d7cac82",
      "title": "GdS: Serie A experiencing a ‘European crisis’ – Milan’s supporting role",
      "url": "https://sempremilan.com/serie-a-experiencing-european-crisis-milan-role",
      "source": "sempremilan.com",
      "date": "2026-02-27T15:00:00+00:00",
      "summary": "Since 2004-05, at least one of AC Milan, Inter or Juventus have been in the last 16 of the Champions League. This year, things changed.  Of course, it has been well spoken about already that Milan have been out of the Champions League this season. In fact, a lot of Massimiliano Allegri’s appointment"
    },
    {
      "id": "9af592119b53",
      "title": "MN: ‘Increasingly unlikely’ – Cremonese appearance difficult as Gabbia continues alone",
      "url": "https://sempremilan.com/cremonese-unlikely-gabbia-trains-alone",
      "source": "sempremilan.com",
      "date": "2026-02-27T14:30:00+00:00",
      "summary": "AC Milan were hoping to have Matteo Gabbia back this weekend, but it seems that the defender will be absent once again.  After being withdrawn from the starting XI before kick-off, Gabbia underwent tests to determine the problem, and thankfully, any serious injury was ruled out quite quickly. Howeve"
    },
    {
      "id": "135a52a5466c",
      "title": "CM: Milan pondering Casemiro move with Man Utd exit imminent – the details",
      "url": "https://sempremilan.com/milan-pondering-casemiro-move-manchester-united",
      "source": "sempremilan.com",
      "date": "2026-02-27T14:00:00+00:00",
      "summary": "Another source has confirmed that AC Milan could consider a move for Casemiro, who is expected to leave Manchester United. According to Calciomercato.com, Casemiro recently discussed Serie A and Italian football with Luka Modric, the lynchpin of Milan’s midfield and his former team-mate at Real Madr"
    },
    {
      "id": "e846651fa410",
      "title": "Watch: Leao stars at Milan Fashion Week as part of Adidas show",
      "url": "https://sempremilan.com/leao-stars-milan-fashion-week-adidas",
      "source": "sempremilan.com",
      "date": "2026-02-27T13:35:00+00:00",
      "summary": "There is very little time for a break in a city like Milano, and it has gone straight from the Winter Olympics into Fashion Week. The famous Milan Fashion Week, is underway in the Lombardy capital, and among the public figures attending the various shows are Serie A players. Last night, Rafael Leao "
    },
    {
      "id": "ad7ada1fb636",
      "title": "Tuttosport: Kirovski to stay as Milan’s faith grows – how the Futuro project has adapted",
      "url": "https://sempremilan.com/kirovski-stay-how-futuro-project-adapted",
      "source": "sempremilan.com",
      "date": "2026-02-27T13:10:00+00:00",
      "summary": "AC Milan are in talks with Jovan Kirovski over extending his contract despite the relegation Milan Futuro suffered in year one. The Futuro dropped from Serie C to Serie D after the play-off that they lost against SPAL at the end of last season. The club decided to persist with the project though, em"
    },
    {
      "id": "3504abab92f5",
      "title": "GdS: ‘Renewals on the way’ – Milan’s wage bill would increase with Champions League return",
      "url": "https://sempremilan.com/milan-wage-bill-increase-champions-league",
      "source": "sempremilan.com",
      "date": "2026-02-27T12:45:00+00:00",
      "summary": "The watchword at AC Milan is to secure Champions League qualification as soon as possible. Then, further work on the squad can commence. As La Gazzetta dello Sport (seen below) recall, Massimiliano Allegri has stressed multiple times that qualifying for the most important club competition ‘is vital "
    },
    {
      "id": "c954d6badf45",
      "title": "Schira: Milan closing in on renewal of deputy goalkeeper Terracciano",
      "url": "https://sempremilan.com/milan-renewal-deputy-goalkeeper-terracciano",
      "source": "sempremilan.com",
      "date": "2026-02-27T12:20:00+00:00",
      "summary": "AC Milan continues to move with extreme foresight when it comes to contract renewals, aiming to consolidate the backbone of the team. According to journalist Nicolò Schira, one of the names that Milan are working on is Pietro Terracciano, who is currently the deputy to the starter and captain Mike M"
    },
    {
      "id": "7490edb48798",
      "title": "Report: Milan want to cash in on Estupiñán, price tag set",
      "url": "https://football-italia.net/report-milan-want-estupinan-sold/",
      "source": "football-italia.net",
      "date": "2026-02-26T17:52:28+00:00",
      "summary": "Pervis Estupiñán’s time at Milan appears to be drawing to a close after just one..."
    },
    {
      "id": "4607c4ec9334",
      "title": "Report Allegri considering his future at Milan",
      "url": "https://football-italia.net/allegri-consider-future-milan-report/",
      "source": "football-italia.net",
      "date": "2026-02-25T10:56:20+00:00",
      "summary": "According to Sportitalia, Milan coach Massimiliano Allegri is considering his future at the club beyond..."
    },
    {
      "id": "7367715a2cf2",
      "title": "Former Serie A referee plays down controversial decisions in Milan defeat to Parma",
      "url": "https://football-italia.net/tommasi-milan-parma-open-var/",
      "source": "football-italia.net",
      "date": "2026-02-24T16:51:37+00:00",
      "summary": "Parma’s late 1-0 victory against Milan at San Siro has continued to generate significant debate..."
    },
    {
      "id": "af0191216a1b",
      "title": "Today’s Papers: Champions League, Inter-Bodo/Glimt, McKennie renewal",
      "url": "https://football-italia.net/todays-papers-champions-league-inter-bodo/",
      "source": "football-italia.net",
      "date": "2026-02-24T08:41:35+00:00",
      "summary": "La Gazzetta dello Sport  In with the goals  Champions League: Inter looking for the comeback..."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    }
  ]
}