{
  "lastUpdated": "2026-02-25T11:39:30.617720+00:00",
  "articles": [
    {
      "id": "2d103d0a821b",
      "title": "Milan-Parma case, Ravezzani: \"The dialogues between the referee and the various players are disconcerting\"",
      "url": "https://www.milannews.it/news/caso-milan-parma-ravezzani-i-dialoghi-tra-arbitro-e-varisti-sono-sconcertanti-608629",
      "source": "milannews.it",
      "date": "2026-02-25T11:31:07+00:00",
      "summary": "Fabio Ravezzani, director of Telelombardia, commented on the audio between referee Piccinini and the VAR room on the occasion of Parma's goal against Milan as follows on"
    },
    {
      "id": "9976a496ef8e",
      "title": "GdS: 30 months, many issue – Loftus-Cheek’s constant battle with injuries at Milan",
      "url": "https://sempremilan.com/loftus-cheek-constant-battle-injuries-milan",
      "source": "sempremilan.com",
      "date": "2026-02-25T11:30:00+00:00",
      "summary": "Ruben Loftus-Cheek has suffered yet another injury setback, which has been the running theme of his troubled time at AC Milan. La Gazzetta dello Sport confirm that Milan will be without Loftus-Cheek for approximately two months. On Monday morning, the Englishman underwent surgery at Milan’s San Paol"
    },
    {
      "id": "a8c07bea2256",
      "title": "Biasin on Milan-Parma: \"The Rossoneri's pressing was asphyxiating and lacking clarity. And on Open Var...\"",
      "url": "https://www.milannews.it/news/biasin-su-milan-parma-pressing-dei-rossoneri-asfissiante-e-poco-lucido-e-su-open-var-608608",
      "source": "milannews.it",
      "date": "2026-02-25T11:20:00+00:00",
      "summary": "Fabrizio Biasin, in his usual editorial on TMW, spoke like this about Milan-Parma: \"Milan comes away with broken bones from the match against Parma."
    },
    {
      "id": "7634d1847f5a",
      "title": "Pastore confident: \"The championship fight is over, 10 points are too many\"",
      "url": "https://www.milannews.it/news/pastore-sicuro-lotta-scudetto-finita-10-punti-sono-troppi-608600",
      "source": "milannews.it",
      "date": "2026-02-25T11:10:04+00:00",
      "summary": "During the last episode of Fontana di Trevi, a format of Cronache di Spogliatoio, Giuseppe Pastore spoke like this about the championship race:\n\n\"The championship is over, first of all because the numbers say so, we have never ..."
    },
    {
      "id": "e4f860ec8001",
      "title": "Tuttosport: Milan hunting for the right No.9 – the names in the mix from Kean to Nunez",
      "url": "https://sempremilan.com/milan-right-no9-names-kean-nunez",
      "source": "sempremilan.com",
      "date": "2026-02-25T11:05:00+00:00",
      "summary": "AC Milan will have to fix some gaps in the squad during the summer window, and the biggest is the centre-forward role. As Tuttosport (via MilanNews) report this morning, Milan need a true No.9 for next season and this will be the management’s main mission in the summer. It’s no secret that in Januar"
    },
    {
      "id": "d22cc2c2148d",
      "title": "Milan with the double director in Cremona? For Allegri, Jashari can coexist with Modric",
      "url": "https://www.milannews.it/primo-piano/milan-con-il-doppio-regista-a-cremona-per-allegri-jashari-puo-coesistere-con-modric-608638",
      "source": "milannews.it",
      "date": "2026-02-25T11:00:51+00:00",
      "summary": "Ardon Jashari played 90 minutes against Como and 74 against Parma, for a total of 164 minutes, almost as many as he had collected in the other matches in this Serie A."
    },
    {
      "id": "4607c4ec9334",
      "title": "Report Allegri considering his future at Milan",
      "url": "https://football-italia.net/allegri-consider-future-milan-report/",
      "source": "football-italia.net",
      "date": "2026-02-25T10:56:20+00:00",
      "summary": "According to Sportitalia, Milan coach Massimiliano Allegri is considering his future at the club beyond..."
    },
    {
      "id": "d180edbe9553",
      "title": "UEFA ranking, the race for fifth place: Inter out, extra place for Italy",
      "url": "https://www.milannews.it/news/ranking-uefa-la-corsa-al-quinto-posto-inter-out-posto-extra-lontano-per-l-italia-608622",
      "source": "milannews.it",
      "date": "2026-02-25T10:50:00+00:00",
      "summary": "With Inter's heavy elimination from the Champions League, an extra place next season in Europe's top competition is increasingly distant for Italy.\n\nTHE UPDATED UEFA RANKING\n\n1."
    },
    {
      "id": "e7ffad54e322",
      "title": "From Cremona to Naples: Milan's commitments until Easter",
      "url": "https://www.milannews.it/news/da-cremona-a-napoli-gli-impegni-del-milan-fino-a-pasqua-608619",
      "source": "milannews.it",
      "date": "2026-02-25T10:40:00+00:00",
      "summary": "A bad week for Milan: first the draw against Como, then the defeat against Parma and an Inter at +10 in the standings."
    },
    {
      "id": "79b51922cfe1",
      "title": "‘Watch out Max’ – Capello explains why Milan must be ‘wary of those behind them’",
      "url": "https://sempremilan.com/capello-max-milan-wary-those-behind",
      "source": "sempremilan.com",
      "date": "2026-02-25T10:40:00+00:00",
      "summary": "Fabio Capello believes a top four spot is not locked up for AC Milan, who could pay for the energy they spent chasing Inter. Milan’s unbeaten run came to an end at San Siro on Sunday night as they were beaten 1-0 by Parma, which likely ends any faint title hopes too. It means that […]\nThe post ‘Watc"
    },
    {
      "id": "fe97318a10ab",
      "title": "Center forward Leao continues to not convince Capello: \"He is unable to be a point of reference for his teammates\"",
      "url": "https://www.milannews.it/gli-ex/leao-centravanti-continua-a-non-convincere-capello-non-riesce-a-essere-un-punto-di-riferimento-per-i-compagni-608631",
      "source": "milannews.it",
      "date": "2026-02-25T10:30:02+00:00",
      "summary": "Fabio Capello, former Rossoneri coach, gave a long interview to the Gazzetta dello Sport in which he also spoke about Max Allegri's Milan: \"Milan favorites for the Champions League race? True, but they often get distracted against the small teams ..."
    },
    {
      "id": "dc5eaf93ec03",
      "title": "Loftus-Cheek out, who in his place? Here are Allegri's options",
      "url": "https://www.milannews.it/news/loftus-cheek-out-chi-al-suo-posto-ecco-le-opzioni-di-allegri-608615",
      "source": "milannews.it",
      "date": "2026-02-25T10:20:00+00:00",
      "summary": "Milan-Parma brought Ruben Loftus-Cheek's stoppage with them. The Englishman will be out for around two months and Massimiliano Allegri will have to find alternative situations."
    },
    {
      "id": "d4a31e229684",
      "title": "Hauge reveals added ‘pressure’ after knocking out Inter: “The Milan fans are really passionate”",
      "url": "https://sempremilan.com/hauge-added-pressure-milan-inter-passionate",
      "source": "sempremilan.com",
      "date": "2026-02-25T10:15:00+00:00",
      "summary": "Jens Petter Hauge has admitted he felt the pressure from AC Milan fans to do the business for Bodo/Glimt against Inter last night. Bodo/Glimt stunned San Siro on Tuesday night as they build on a 3-1 lead against Inter from the first leg to win 2-1 on the night and 5-2 on aggregate, knocking last […]"
    },
    {
      "id": "8edf60a95915",
      "title": "Milan, an important haul: here is the difference in points compared to recent seasons",
      "url": "https://www.milannews.it/news/milan-un-bottino-importante-ecco-la-differenza-punti-rispetto-alle-ultime-stagioni-608618",
      "source": "milannews.it",
      "date": "2026-02-25T10:10:00+00:00",
      "summary": "A bad moment for Milan, yes, but all of this absolutely shouldn't be thrown away."
    },
    {
      "id": "575c7ac3d09a",
      "title": "Milan will wear the Fourth Kit 25/26 also against Torino",
      "url": "https://www.milannews.it/news/il-milan-indossera-il-fourth-kit-25-26-anche-contro-il-torino-608636",
      "source": "milannews.it",
      "date": "2026-02-25T10:00:48+00:00",
      "summary": "Milan, together with Puma, presented the fourth kit for the 2025-2026 season this morning which already made its debut on Sunday evening in the match against Parma."
    },
    {
      "id": "b4c6444f7abc",
      "title": "CorSport: Füllkrug has ‘impressed’ Allegri but Milan future unclear – the factors at play",
      "url": "https://sempremilan.com/fullkrug-impressed-allegri-milan-future-unclear",
      "source": "sempremilan.com",
      "date": "2026-02-25T09:50:00+00:00",
      "summary": "Niclas Füllkrug was AC Milan’s only signing of the winter transfer window, and so far he has not really had the desired impact. As Corriere dello Sport (via MilanNews) write this morning, Milan are going through difficult times. The last week has seen the Rossoneri fall 10 points behind Inter, and n"
    },
    {
      "id": "16d68dbf9030",
      "title": "Milan, another fine from the Sports Judge: the total (for now) is 85 thousand euros",
      "url": "https://www.milannews.it/news/milan-altra-multa-dal-giudice-sportivo-il-totale-per-ora-e-di-85-mila-euro-608627",
      "source": "milannews.it",
      "date": "2026-02-25T09:48:25+00:00",
      "summary": "The Sports Judge has imposed a new fine on Milan after the 26th matchday of Serie A: \"Fine of €20,000.00: to the Soc."
    },
    {
      "id": "b7e654bca56b",
      "title": "Fullkrug, a halfway contribution: the German and a rebus redemption",
      "url": "https://www.milannews.it/news/fullkrug-un-apporto-a-meta-il-tedesco-e-un-riscatto-rebus-608616",
      "source": "milannews.it",
      "date": "2026-02-25T09:40:00+00:00",
      "summary": "Milan will have to carefully evaluate what the future of Niclas Fullkrug will be."
    },
    {
      "id": "c918cbae5a94",
      "title": "Capello warns Milan: \"The Scudetto dream was a utopia, now they must pay attention to who is behind them\"",
      "url": "https://www.milannews.it/gli-ex/capello-avverte-il-milan-il-sogno-scudetto-era-un-utopia-adesso-deve-stare-attento-a-chi-sta-dietro-608630",
      "source": "milannews.it",
      "date": "2026-02-25T09:28:08+00:00",
      "summary": "Fabio Capello, former Rossoneri coach, gave a long interview to Gazzetta dello Sport in which he also spoke about Milan: \"The defeat against Parma told us that the Scudetto dream was a utopia, now Milan must star ..."
    },
    {
      "id": "970315eee723",
      "title": "GdS: The ‘double playmaker’ idea is born – how Allegri will build around Jashari and Modric",
      "url": "https://sempremilan.com/how-allegri-build-around-jashari-modic",
      "source": "sempremilan.com",
      "date": "2026-02-25T09:25:00+00:00",
      "summary": "Massimiliano Allegri wants to change the way that his AC Milan side play, and his latest idea concerns the midfield configuration. As La Gazzetta dello Sport (seen below) write this morning, Ardon Jashari has played almost as much as he has in the rest of the season during the last two games. He pla"
    },
    {
      "id": "9601d2df03df",
      "title": "Bodo/Glimt, Hauge after the goal against Inter: \"The AC Milan fans put a lot of pressure on me, but now I feel great\"",
      "url": "https://www.milannews.it/gli-ex/bodo-glimt-hauge-dopo-la-rete-all-inter-i-tifosi-del-milan-mi-hanno-messo-tanta-pressione-ma-ora-mi-sento-benissimo-608635",
      "source": "milannews.it",
      "date": "2026-02-25T09:18:41+00:00",
      "summary": "Jens-Petter Hauge, former Rossoneri striker now at Bodo/Glimt, told CBS Sports Golazo after the goal scored last night against Inter in the second leg of the Champions League playoffs: \"There was a lot of pressure on my shoulders from the fans..."
    },
    {
      "id": "f73a7ea97d77",
      "title": "PHOTOGALLERY - Milan and Puma present the Fourth Kit 25/26",
      "url": "https://www.milannews.it/news/photogallery-milan-e-puma-presentano-il-fourth-kit-25-26-608634",
      "source": "milannews.it",
      "date": "2026-02-25T09:08:26+00:00",
      "summary": "Here is the press release published by the Milan website: \"AC Milan and PUMA launch the Club's Fourth Kit for the 2025/26 season, created in collaboration with Slam Jam, a brand symbol of contemporary Italian culture."
    },
    {
      "id": "542d4cb56551",
      "title": "Fullkrug is a puzzle to solve. Future doubtful, what is the best option?",
      "url": "https://www.milannews.it/primo-piano/fullkrug-e-un-rebus-da-risolvere-futuro-dubbio-qual-e-l-opzione-migliore-608626",
      "source": "milannews.it",
      "date": "2026-02-25T09:00:00+00:00",
      "summary": "Milan is experiencing complicated days. Last week he dragged the Rossoneri to -10 behind Inter."
    },
    {
      "id": "7e9e7a58aa62",
      "title": "Official: AC Milan unveil new PUMA x Slam Jam fourth kits – ‘Benvenuti all’Inferno’",
      "url": "https://sempremilan.com/official-ac-milan-slam-jam-puma-fourth-kits",
      "source": "sempremilan.com",
      "date": "2026-02-25T09:00:00+00:00",
      "summary": "AC Milan have officially unveiled their 2025-26 fourth kits, which are in collaboration with PUMA and fashion brand Slam Jam. The shirts were actually worn for the first time on Sunday during Milan’s 1-0 defeat at home to Parma at San Siro. The design had been teased for many weeks, but when the tea"
    },
    {
      "id": "06215fca4349",
      "title": "Milan, Gimenez's return is approaching: the latest",
      "url": "https://www.milannews.it/rassegna-stampa/milan-si-avvicina-il-rientro-di-gimenez-le-ultime-608621",
      "source": "milannews.it",
      "date": "2026-02-25T08:49:22+00:00",
      "summary": "Good news arrives on Santiago Gimenez, out for several months with an ankle injury which also forced him to undergo surgery in mid-December."
    },
    {
      "id": "04ed44055356",
      "title": "The QS on Milan: \"Devil 'checked'. When a real bomber is missing\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-qs-sul-milan-diavolo-spuntato-quando-manca-un-vero-bomber-608625",
      "source": "milannews.it",
      "date": "2026-02-25T08:39:29+00:00",
      "summary": "The Quotidiano Sportivo on newsstands today has the following headline on Milan: \"Devil 'checked'. When a real bomber is missing\"."
    },
    {
      "id": "cc1bf06fc192",
      "title": "What will be the fate of Fullkrug? CorSport: \"The future in 12 games\"",
      "url": "https://www.milannews.it/rassegna-stampa/quale-sara-il-destino-di-fullkrug-il-corsport-il-futuro-in-12-partite-608613",
      "source": "milannews.it",
      "date": "2026-02-25T08:30:00+00:00",
      "summary": "Complicated days for Milan after the latest disappointing results which saw the Rossoneri slip to -10 behind Inter."
    },
    {
      "id": "73c9e17681bb",
      "title": "\"Welcome to Hell\": Milan and Puma together with Slam Jam for the 2025/2026 Fourth Kit",
      "url": "https://www.milannews.it/news/benvenuti-all-inferno-milan-e-puma-insieme-a-slam-jam-per-il-fourth-kit-2025-2026-608628",
      "source": "milannews.it",
      "date": "2026-02-25T08:19:54+00:00",
      "summary": "AC Milan and PUMA launch the Club's Fourth Kit for the 2025/26 season, created in collaboration with Slam Jam, a brand symbolizing contemporary Italian culture."
    },
    {
      "id": "c09bbcf4c99d",
      "title": "GdS: Why there are still doubts about Milan-Inter derby will be played",
      "url": "https://sempremilan.com/why-doubts-milan-inter-derby-played",
      "source": "sempremilan.com",
      "date": "2026-02-24T20:11:45+00:00",
      "summary": "The Milan derby is one of those occasions that almost every Italian football fan stops to watch, but there are doubts about when it will be played. According to La Gazzetta dello Sport, the Derby della Madonnina is scheduled to be played on Sunday, March 8th at 20:45 CEST. The match is one of the […"
    },
    {
      "id": "ba735388b4ef",
      "title": "Video exposes the 10 refereeing errors that have gone against AC Milan this season",
      "url": "https://sempremilan.com/10-refereeing-errors-against-milan-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-24T19:00:00+00:00",
      "summary": "A video that has gone viral on social media has explained the 10 major errors that AC Milan have been on the wrong end of this season. After the Como draw, Milan left San Siro bitter about Van der Brempt’s nasty foul on Pavlovic and the failure to send off Cesc Fabregas for holding Alexis […]\nThe po"
    },
    {
      "id": "37828f3229f1",
      "title": "Sky: Nkunku in line to return vs. Cremonese as Leao battles inflammation again",
      "url": "https://sempremilan.com/nkunku-return-cremonese-leao-inflammation",
      "source": "sempremilan.com",
      "date": "2026-02-24T18:36:36+00:00",
      "summary": "AC Milan resumed training at Milanello on Tuesday, beginning preparations for Sunday’s match against Cremonese. The defeat against Parma on Sunday has pretty much put an end to the Scudetto pursuit, barring a miraculous run of form that would also have to coincide with Inter having a drop-off that t"
    },
    {
      "id": "eda27f8559d0",
      "title": "Late changes, in-game tweaks and set-piece woes: Tactical analysis of AC Milan 0-1 Parma",
      "url": "https://sempremilan.com/tactical-analysis-of-ac-milan-0-1-parma",
      "source": "sempremilan.com",
      "date": "2026-02-24T18:00:00+00:00",
      "summary": "AC Milan suffered their second defeat and most damaging result of the league season on Sunday night, losing to Parma at San Siro. There should have been a desire for revenge in the air after the 2-2 draw in the reverse fixture and the perceived injustices of the 1-1 tie with Como four nights prior, "
    },
    {
      "id": "aa70d59b9006",
      "title": "CM: Why Milan face a tough battle to sign Goretzka despite contacts and Allegri’s push",
      "url": "https://sempremilan.com/why-milan-battle-goretzka-contacts-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-24T17:30:00+00:00",
      "summary": "Leon Goretzka remains a name that AC Milan are exploring, but signing him on a free transfer will be a difficult mission. According to Calciomercato.com, Goretzka has chosen not to renew his contract with Bayern Munich which means that he is available to agree a pre-contract with another club now. T"
    },
    {
      "id": "efda16e14f03",
      "title": "Sportitalia: Allegri considering Milan future – why he is ‘unhappy with many things’",
      "url": "https://sempremilan.com/allegri-considering-milan-future-unhappy",
      "source": "sempremilan.com",
      "date": "2026-02-24T17:00:00+00:00",
      "summary": "Massimiliano Allegri is not guaranteed to stay at AC Milan beyond the end of the current season, according to a shock report. Allegri’s return to Milan was made official before the start of the new campaign, with the coach returning after a previous four year spell from 2010 to 2014 which culminated"
    },
    {
      "id": "7367715a2cf2",
      "title": "Former Serie A referee plays down controversial decisions in Milan defeat to Parma",
      "url": "https://football-italia.net/tommasi-milan-parma-open-var/",
      "source": "football-italia.net",
      "date": "2026-02-24T16:51:37+00:00",
      "summary": "Parma’s late 1-0 victory against Milan at San Siro has continued to generate significant debate..."
    },
    {
      "id": "9c6bd17e5300",
      "title": "GdS: Four obvious areas to address – Milan’s summer squad improvement strategy",
      "url": "https://sempremilan.com/milan-summer-squad-improvement-strategy",
      "source": "sempremilan.com",
      "date": "2026-02-24T16:40:04+00:00",
      "summary": "AC Milan’s squad has shown itself to be not up to task in the Scudetto battle, so some changes are needed in the summer. As La Gazzetta dello Sport report, when a season takes a turn for the worse and snatches away dreams of glory, it becomes almost automatic to put the team under the […]\nThe post G"
    },
    {
      "id": "db235266865b",
      "title": "Open VAR reveals confusion between officials over Parma’s goal vs. Milan",
      "url": "https://sempremilan.com/open-var-confusion-officials-parma-milan",
      "source": "sempremilan.com",
      "date": "2026-02-24T16:00:00+00:00",
      "summary": "The highly anticipated episode of Open VAR has been released, which reveals the conversations between officials for controversial incidents. There has been a lot of debate surrounding a couple of key incidents that happened during Sunday’s match against Parma at San Siro, above all the winning goal "
    },
    {
      "id": "58a90e871e18",
      "title": "SempreMilan Podcast: Episode 402 – The Week The Dream Died",
      "url": "https://sempremilan.com/sempremilan-podcast-episode-402-the-week-the-dream-died",
      "source": "sempremilan.com",
      "date": "2026-02-24T15:30:00+00:00",
      "summary": "Join Oli, Anthony and ‪Bdair as they discuss the feisty draw with Como, the controversial loss to Parma and where this leaves the title race. This week’s topics include… ↳ Fabregas a disgrace in Como draw ↳ More VAR drama in Parma loss ↳ Revenge needed on Cremonese ↳ Concerns about Allegri and the 3"
    },
    {
      "id": "dcae094c9ff5",
      "title": "Alphadjo Cissè undergoes surgery on tendon in Finland – four-month absence expected",
      "url": "https://sempremilan.com/alphadjo-cisse-surgery-four-months-out",
      "source": "sempremilan.com",
      "date": "2026-02-24T15:00:00+00:00",
      "summary": "An update has arrived regarding Alphadjo Cissè, and it has been confirmed that the season has come to an early end for the young midfielder. The signing of Cissè from Hellas Verona was announced on the final day of the window. In the statement, it was confirmed that the attacking midfielder would re"
    },
    {
      "id": "2b340034eaf2",
      "title": "Tuttosport: Juventus to discuss renewal with star – Milan remain at the window",
      "url": "https://sempremilan.com/juventus-renewal-vlahovic-milan-remain-window",
      "source": "sempremilan.com",
      "date": "2026-02-24T14:27:30+00:00",
      "summary": "For several months now, AC Milan have been among the teams most interested in Dusan Vlahovic, whose contract expires in June. According to today’s edition of Tuttosport (via MilanPress) however, Vlahovic has always kept the door open for Juventus and the idea of extending. Given the difficulties for"
    },
    {
      "id": "b5674eb1f598",
      "title": "‘End of discussion’ – Ex-Milan and Parma goalkeeper Galli explains why Maignan was fouled",
      "url": "https://sempremilan.com/galli-why-maignan-failed-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-24T13:35:00+00:00",
      "summary": "Former AC Milan goalkeeper Giovanni Galli has explained why the winning goal for Parma on Sunday should have been disallowed. Inside the final 10 minutes of Milan’s streak-ending defeat to Parma, there was a hugely divisive incident from which the away side took the lead and ultimately snatched all "
    },
    {
      "id": "edfac022e6f4",
      "title": "MN: Milan silent, rivals make noise – calm approach over refereeing errors not working",
      "url": "https://sempremilan.com/milan-silent-rivals-noise-refereeing-errors",
      "source": "sempremilan.com",
      "date": "2026-02-24T13:10:00+00:00",
      "summary": "AC Milan have chosen an approach different to that of their rivals when it comes to disagreeing with refereeing decisions. As MilanNews write, Sunday’s defeat against Parma was just the latest in a series of matches that saw Milan harmed in some way by rather dubious officiating decisions. The list "
    },
    {
      "id": "af0191216a1b",
      "title": "Today’s Papers: Champions League, Inter-Bodo/Glimt, McKennie renewal",
      "url": "https://football-italia.net/todays-papers-champions-league-inter-bodo/",
      "source": "football-italia.net",
      "date": "2026-02-24T08:41:35+00:00",
      "summary": "La Gazzetta dello Sport  In with the goals  Champions League: Inter looking for the comeback..."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "7d1eaf8982a2",
      "title": "Serie A | Milan 0-1 Parma – Player Ratings as Troilo and Corvi batten down the hatches",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-player-ratings/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:09:16+00:00",
      "summary": "Milan fell to a late 1-0 defeat to Parma this evening, after they were unable..."
    },
    {
      "id": "0338d8d0b0d7",
      "title": "Serie A | Milan 0-1 Parma: Rossoneri suffer shocking first defeat in 24 rounds",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-shocking-defeat-24/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:05:53+00:00",
      "summary": "Milan paid the price for insipid finishing and sluggish defending, as Parma inflicted their first..."
    },
    {
      "id": "ad92e7503a8c",
      "title": "Ex-West Ham & Villa man Reo-Coker: ‘Fabregas pull on Saelemaekers inexcusable’",
      "url": "https://football-italia.net/ex-west-ham-villa-man-reo-coker-fabregas/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:50:32+00:00",
      "summary": "Former West Ham and Aston Villa midfielder turned CBS Sports Golazo pundit Nigel Reo-Coker has..."
    }
  ]
}