{
  "lastUpdated": "2026-02-18T18:53:26.552876+00:00",
  "articles": [
    {
      "id": "62b50d405d45",
      "title": "Catanzaro, Liberali: \"Milan gave me a lot both from a footballing and human point of view\"",
      "url": "https://www.milannews.it/gli-ex/catanzaro-liberali-il-milan-mi-ha-dato-tanto-sia-dal-punto-di-vista-calcistico-che-umano-607850",
      "source": "milannews.it",
      "date": "2026-02-18T18:50:17+00:00",
      "summary": "Mattia Liberali, a player signed by Catanzaro from Milan on a permanent basis in the summer, told Gianluca Di Marzio's website about his growth in the Rossoneri club: \"I did the whole youth system there."
    },
    {
      "id": "2b2cc07ffa69",
      "title": "Real Madrid, Vinicius' anger: \"Racists are cowards\"",
      "url": "https://www.milannews.it/news/real-madrid-la-rabbia-di-vinicius-i-razzisti-sono-dei-codardi-607849",
      "source": "milannews.it",
      "date": "2026-02-18T18:40:09+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 18 - \"Racists are first of all cowards. They need to put their shirts in their mouths to demonstrate how weak they are\"."
    },
    {
      "id": "87ee45277e83",
      "title": "Official: AC Milan vs. Como starting XIs – four changes from Pisa win",
      "url": "https://sempremilan.com/official-ac-milan-como-starting-xis-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-18T18:39:21+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri has named his team for tonight’s rematch against Como at San Siro. It has been exactly one month since Milan last took to the field to play in front of their home fans, the 1-0 win over Lecce to be precise. Since then they have been on the road, […]\nThe post "
    },
    {
      "id": "740924179509",
      "title": "Serie A official Week 24 line-ups: Milan vs. Como",
      "url": "https://football-italia.net/serie-a-official-wk-24-line-ups-milan-vs-como/",
      "source": "football-italia.net",
      "date": "2026-02-18T18:39:09+00:00",
      "summary": "Milan have Rafael Leao and Christopher Nkunku upfront for the rescheduled Serie A clash with..."
    },
    {
      "id": "f3ddcbad229c",
      "title": "Serie A and UCL Liveblog: Milan vs. Como and Bodo/Glimt vs. Inter",
      "url": "https://football-italia.net/serie-a-ucl-liveblog-milan-como-bodo-inter/",
      "source": "football-italia.net",
      "date": "2026-02-18T18:35:19+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "a5f8729ef383",
      "title": "Milan-Como, the official lineups: Ricci and Jashari in midfield, Leao and Nkunku forward",
      "url": "https://www.milannews.it/primo-piano/milan-como-le-formazioni-ufficiali-ricci-e-jashari-a-centrocampo-leao-e-nkunku-in-avanti-607875",
      "source": "milannews.it",
      "date": "2026-02-18T18:33:52+00:00",
      "summary": "These are the official lineups for Milan-Como, valid for the second half of the twenty-fourth matchday of Serie A 2025/26.\n\nMILAN (3-5-2): Maignan; Tomori, De Winter, Pavlović; Athekame, Jashari, Modrić, Ricci, Bartesaghi; Nkunku, Leão."
    },
    {
      "id": "ebafc62c1e49",
      "title": "Milan-Como, Apolloni \"warns\" the Rossoneri: \"The physical aspect should not be underestimated\"",
      "url": "https://www.milannews.it/news/milan-como-apolloni-avvisa-i-rossoneri-da-non-sottovalutare-l-aspetto-fisico-607814",
      "source": "milannews.it",
      "date": "2026-02-18T18:30:00+00:00",
      "summary": "Gigi Apolloni, at ParmaLive."
    },
    {
      "id": "4fbecbb2999a",
      "title": "VIDEO MN - The AC Milan bus arrived at San Siro. Tonight the match against Como",
      "url": "https://www.milannews.it/news/video-mn-arrivato-a-san-siro-il-pullman-del-milan-stasera-la-sfida-col-como-607874",
      "source": "milannews.it",
      "date": "2026-02-18T18:25:48+00:00",
      "summary": "The AC Milan bus has just arrived at San Siro, welcomed as always by the warm Rossoneri crowd. This evening Allegri's team faces Cesc Fabregas' Como in the second half of the 24th matchday of Serie A."
    },
    {
      "id": "f921700048c6",
      "title": "Paganin on the Scudetto fight: \"Inter are superior, but I don't trust them. There's the derby and...\"",
      "url": "https://www.milannews.it/news/paganin-sulla-lotta-scudetto-l-inter-e-superiore-ma-non-mi-fido-c-e-il-derby-e-607798",
      "source": "milannews.it",
      "date": "2026-02-18T18:20:00+00:00",
      "summary": "Antonio Paganin, on TMW Radio, spoke like this about the championship fight: \"Milan don't have the cups and it's an important advantage, it's there and the championships tell you that if you stay there, something happens."
    },
    {
      "id": "fba302ae9a9f",
      "title": "Rampulla on the Scudetto fight: \"Inter clearly superior, Milan are there\"",
      "url": "https://www.milannews.it/news/rampulla-sulla-lotta-scudetto-inter-nettamente-superiore-il-milan-e-li-607790",
      "source": "milannews.it",
      "date": "2026-02-18T18:10:00+00:00",
      "summary": "Michelangelo Rampulla, on TMW Radio during Maracanà, spoke like this about the championship fight: \"Juve has improved since Spalletti arrived, it's logical for a coach like him to fix a lot of things for you."
    },
    {
      "id": "391531afaf48",
      "title": "Orlando on Milan: \"If he wins against Como he is still there to compete for the scudetto\"",
      "url": "https://www.milannews.it/news/orlando-sul-milan-se-vince-col-como-e-ancora-li-a-giocarsi-lo-scudetto-607795",
      "source": "milannews.it",
      "date": "2026-02-18T18:00:00+00:00",
      "summary": "Massimo Orlando spoke thus about Milan on TMW Radio: \"Milan made the first shot in the 39th minute, there is always a pain to bring home the result which is incredible, but it must be recognized that if they win against Como they are..."
    },
    {
      "id": "f2dc5f533ae3",
      "title": "CM: Strong performances, strong bonds – why a renewal for Modric is gaining in likelihood",
      "url": "https://sempremilan.com/why-renewal-modric-gaining-in-likelihood",
      "source": "sempremilan.com",
      "date": "2026-02-18T18:00:00+00:00",
      "summary": "Yet another source has claimed that the chances of Luka Modric extending his contract with AC Milan seem to be increasing. Modric was the star of the show on Friday night in Pisa, as his 85th-minute secured three precious points and just about kept the title race. With his composed finish over the g"
    },
    {
      "id": "4434d09bb3ab",
      "title": "MN - D'Amico on Rocchi: \"He must be self-critical and stop always blaming others\"",
      "url": "https://www.milannews.it/news/mn-d-amico-su-rocchi-deve-fare-autocritica-e-finirla-di-dare-sempre-la-colpa-ad-altri-607839",
      "source": "milannews.it",
      "date": "2026-02-18T17:50:00+00:00",
      "summary": "Tonight Milan will host Como at San Siro to try to put pressure on Inter. But these are moments in which Italian football is facing complicated days."
    },
    {
      "id": "3c8f692c7f20",
      "title": "LIVE MN - Towards Milan-Como: Jashari is back in midfield, the Nkunku-Leao pair up front",
      "url": "https://www.milannews.it/primo-piano/live-mn-verso-milan-como-si-rivede-jashari-a-centrocampo-in-avanti-la-coppia-nkunku-leao-607854",
      "source": "milannews.it",
      "date": "2026-02-18T17:40:00+00:00",
      "summary": "This is Milan's probable lineup: (3-5-2) Maignan; Tomori, De Winter, Pavlovic; Athekame, Jashari, Modric, Ricci, Bartesaghi; Nkunku, Leao.\n\nFriends of MilanNews."
    },
    {
      "id": "1c0676965eb2",
      "title": "Biasin praises Allegri: \"They should all learn to take themselves less seriously like him\"",
      "url": "https://www.milannews.it/news/biasin-elogia-allegri-dovrebbero-tutti-imparare-a-prendersi-meno-sul-serio-come-lui-607818",
      "source": "milannews.it",
      "date": "2026-02-18T17:40:00+00:00",
      "summary": "Fabrizio Biasin, in his editorial on TMW, spoke about Massimiliano Allegri like this: \"Is he the best communicator in the championship? Certainly the least whiny: if he misses a player he doesn't complain, if they ask him about the case-Bastoni doesn't..."
    },
    {
      "id": "322ea27e026b",
      "title": "Calori: \"I would think twice before criticizing Allegri\"",
      "url": "https://www.milannews.it/news/calori-prima-di-fare-una-critica-ad-allegri-ci-penserei-due-volte-607871",
      "source": "milannews.it",
      "date": "2026-02-18T17:30:38+00:00",
      "summary": "The former footballer and coach Alessandro Calori, Tuscan by birth, was a guest on Wednesday morning on the frequencies of Radio Serie A and among the topics covered he also spoke about Milan and in particular about ..."
    },
    {
      "id": "8fe9c6f14e97",
      "title": "Transfermarkt: Milan lead Inter in Serie A attendance ranking with big games to come",
      "url": "https://sempremilan.com/transfermarkt-milan-lead-inter-attendance",
      "source": "sempremilan.com",
      "date": "2026-02-18T17:30:00+00:00",
      "summary": "AC Milan are second in the Serie A standings for points accrued to this stage, but they are top when it comes to fan backing. Which team brings the most fans to the stadium? According to a special ranking compiled by the football statistics website Transfermarkt – based on average and total attendan"
    },
    {
      "id": "1d7b4359955e",
      "title": "Impallomeni: \"The principle of sporting loyalty in football? This world is the one where there is least\"",
      "url": "https://www.milannews.it/news/impallomeni-il-principio-di-lealta-sportiva-nel-calcio-questo-mondo-e-quello-dove-c-e-meno-607803",
      "source": "milannews.it",
      "date": "2026-02-18T17:20:00+00:00",
      "summary": "Stefano Impallomeni spoke like this to TMW Radio after the Bastoni-Kalulu chaos: “The principle of sporting loyalty in football? This world is the one where there is least."
    },
    {
      "id": "480f0a07090d",
      "title": "Milan optimistic over one-year Modric extension",
      "url": "https://football-italia.net/milan-optimistic-over-modric-extension/",
      "source": "football-italia.net",
      "date": "2026-02-18T17:17:48+00:00",
      "summary": "Milan are working hard to sign Luka Modric to a new one-year contract extension, after..."
    },
    {
      "id": "de54361ef1e1",
      "title": "MN - Verheyen and Jashari's difficulties: \"Moving from Bruges to Milan is a very big step. The injury did the rest\"",
      "url": "https://www.milannews.it/news/mn-verheyen-e-le-difficolta-di-jashari-passare-dal-bruges-al-milan-e-uno-step-molto-grande-l-infortunio-ha-fatto-il-resto-607866",
      "source": "milannews.it",
      "date": "2026-02-18T17:10:53+00:00",
      "summary": "Gert Verheyen, former Bruges player, spoke thus to Milannews."
    },
    {
      "id": "263917d79dd8",
      "title": "Benfica, Prestianni rejects the accusations: \"No racist insult to Vinicius\"",
      "url": "https://www.milannews.it/news/benfica-prestianni-respinge-le-accuse-nessun-insulto-razzista-a-vinicius-607842",
      "source": "milannews.it",
      "date": "2026-02-18T17:00:46+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 18 - Exchange of accusations between Benfica and Real Madrid after the Fifa anti-racism protocol was activated yesterday, during the Champions League match, following a report from the team's Brazilian striker ..."
    },
    {
      "id": "a9e73a62327e",
      "title": "Sky: Milan’s reliance on Rabiot evident through results – the alarming numbers",
      "url": "https://sempremilan.com/milan-reliance-rabiot-alarming-numbers",
      "source": "sempremilan.com",
      "date": "2026-02-18T17:00:00+00:00",
      "summary": "AC Milan will be without Adrien Rabiot for tonight’s game against Como, and they must find a way to improve results without him. Milan got the job done against Pisa on Friday night, even if the game agains the second-bottom side was not entirely straightforward. Indeed, the fact that Rabiot was sent"
    },
    {
      "id": "db6e589c5e00",
      "title": "MN - D'Amico on the Var: \"The Italian protocol has become a jungle of \"clear and evident errors\"",
      "url": "https://www.milannews.it/news/mn-d-amico-sul-var-il-protocollo-italiano-e-diventato-una-giungla-di-chiaro-ed-evidente-errore-607838",
      "source": "milannews.it",
      "date": "2026-02-18T16:50:00+00:00",
      "summary": "Tonight Milan will host Como at San Siro to try to put pressure on Inter. But these are moments in which Italian football is facing complicated days."
    },
    {
      "id": "117da8f3245f",
      "title": "Amoroso: \"Galliani told me I would be the fourth striker. I'm just sorry...\"",
      "url": "https://www.milannews.it/gli-ex/amoroso-galliani-mi-disse-che-avrei-fatto-la-quarta-punta-mi-spiace-solo-607827",
      "source": "milannews.it",
      "date": "2026-02-18T16:40:00+00:00",
      "summary": "Marcio Amoroso, to the Gazzetta dello Sport, recalled his arrival at Milan: \"Galliani told me that I would be the fourth striker, I accepted with enthusiasm."
    },
    {
      "id": "781ac2b90794",
      "title": "Fabregas analyzes Milan: \"They only lost two games, they know how to manage the match\"",
      "url": "https://www.milannews.it/l-avversario/fabregas-analizza-il-milan-hanno-perso-solo-due-partite-sanno-come-gestire-la-gara-607826",
      "source": "milannews.it",
      "date": "2026-02-18T16:30:00+00:00",
      "summary": "Cesc Fabregas, in a press conference to present this evening's match against Milan, spoke thus of his expectations for the match against the Rossoneri: \"Is Rabiot missing? They also have Jashari for example."
    },
    {
      "id": "165cd8b61587",
      "title": "Schira: Five Serie A clubs queuing up to land talented Milan midfielder on loan",
      "url": "https://sempremilan.com/five-serie-a-clubs-queuing-comotto-loan",
      "source": "sempremilan.com",
      "date": "2026-02-18T16:30:00+00:00",
      "summary": "A number of clubs are already circling to try and sign Christian Comotto in view of next season, a journalist has claimed. Many Milan fans will remember Comotto as the young midfielder with long hair who looked mature beyond his age in preseason, at ease in possession and with an eye for a pass. Kno"
    },
    {
      "id": "2f879be6f431",
      "title": "Vinicius-Prestianni case, UEFA issues a statement: the situation",
      "url": "https://www.milannews.it/news/caso-vinicius-prestianni-la-uefa-diffonde-un-comunicato-la-situazione-607824",
      "source": "milannews.it",
      "date": "2026-02-18T16:20:00+00:00",
      "summary": "UEFA has released an official note to clarify its position regarding the alleged racist insults attributed to Gianluca Prestianni, after the chaos with Vinicius in Benfica-Real Madrid."
    },
    {
      "id": "2be52e265955",
      "title": "De Paola after the Bastoni-Kalulu chaos: \"Here's what this unsportsmanlike attitude makes us understand\"",
      "url": "https://www.milannews.it/news/de-paola-dopo-il-caos-bastoni-kalulu-ecco-cosa-ci-fa-capire-questa-antisportivita-607807",
      "source": "milannews.it",
      "date": "2026-02-18T16:10:00+00:00",
      "summary": "Paolo De Paola spoke thus to TMW Radio about the chaos in Inter-Juventus: \"It is now made to understand that it is obvious that a player can mislead the referee by simulating."
    },
    {
      "id": "df6a20246c5a",
      "title": "Mundo Deportivo: Barcelona defender has ‘no interest whatsoever’ in Milan move",
      "url": "https://sempremilan.com/barcelona-martin-no-interest-milan-move",
      "source": "sempremilan.com",
      "date": "2026-02-18T16:00:00+00:00",
      "summary": "Gerard Martín has no interest in leaving Barcelona ahead of 2026-27, despite the recent links with a move to AC Milan. The reliable Matteo Moretto reported earlier in the week that Milan are interested in signing Martin in the summer transfer window. After being linked with a number of defenders in "
    },
    {
      "id": "106b61e66abd",
      "title": "CF: Milan heading for single-season capital gains record from sales – the figures",
      "url": "https://sempremilan.com/milan-single-season-capital-gains-record",
      "source": "sempremilan.com",
      "date": "2026-02-18T15:30:00+00:00",
      "summary": "The permanent exits of Alex Jimenez and Tommaso Pobega will see AC Milan record a single-season capital gains record, a report claims. As Calcio e Finanza report, Milan are weighed down by the absence of European competitions this season which means the revenues take a hit. However, the permanent sa"
    },
    {
      "id": "6dc5a25930b4",
      "title": "Milan team news: Loftus-Cheek set to miss Como clash; Nkunku to start instead",
      "url": "https://football-italia.net/milan-team-news-loftus-cheek-como-nkunku/",
      "source": "football-italia.net",
      "date": "2026-02-18T15:19:36+00:00",
      "summary": "Milan are preparing to host Como at San Siro this evening, as the Rossoneri look..."
    },
    {
      "id": "b951e9d6ebcb",
      "title": "A 41-year wait for a San Siro win: All the key stats ahead of Milan vs. Como",
      "url": "https://sempremilan.com/all-key-stats-milan-como-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-18T15:00:00+00:00",
      "summary": "AC Milan and Como will face each other for the second time in just over a month tonight at San Siro, a first home game for the Rossoneri in 31 days. Milan and Como have faced each other 35 times across all competitions, with the Diavolo winning on 20 occasions. The Biancoblu have just five […]\nThe p"
    },
    {
      "id": "0cbf3162da79",
      "title": "CM: Milan and Juventus retain interest in Parma star despite renewal – the situation",
      "url": "https://sempremilan.com/milan-juventus-parma-pellegrino-renewal-situation",
      "source": "sempremilan.com",
      "date": "2026-02-18T14:30:00+00:00",
      "summary": "It is well-known that AC Milan are looking for the right striker in view of the summer, and a domestic option is gaining momentum. As Calciomercato.com report, Parma’s survival depends primarily on the goals of Mateo Pellegrino, the centre-forward who has been a regular starter in the Gialloblu’s at"
    },
    {
      "id": "3ecccc1bff44",
      "title": "Why is Milan vs. Como the only Serie A match being played on Wednesday?",
      "url": "https://football-italia.net/why-is-milan-como-being-played-on-wednesday/",
      "source": "football-italia.net",
      "date": "2026-02-18T14:08:50+00:00",
      "summary": "Milan are due to take on Como in Serie A on Sunday evening, the only..."
    },
    {
      "id": "5abfc55eb210",
      "title": "GdS: Cardinale aiming to enforce three key RedBird concepts with increased Milan presence",
      "url": "https://sempremilan.com/cardinale-redbird-concepts-increased-milan-presence",
      "source": "sempremilan.com",
      "date": "2026-02-18T14:00:00+00:00",
      "summary": "Gerry Cardinale has visited Milanello twice in quick succession (at least by his usual timescale), and more frequent trips could follow. La Gazzetta dello Sport‘s report begins by outlining the ‘three corporate cornerstones’ around which RedBird Capital want to run Milan: continuity, stability, cent"
    },
    {
      "id": "8263b5a32c55",
      "title": "Sky: Loftus-Cheek to miss Como game with physical problem – who will replace him",
      "url": "https://sempremilan.com/loftus-cheek-miss-como-who-replace",
      "source": "sempremilan.com",
      "date": "2026-02-18T13:35:00+00:00",
      "summary": "There is some late and not very great injury news for AC Milan on the day of their game against Pisa at San Siro. According to what is being reported by Sky (via MilanNews), Massimiliano Allegri had made a decision on the attacking duo that he was going to field against Como: it was going […]\nThe po"
    },
    {
      "id": "eb060911f496",
      "title": "Italy’s extra Champions League spot fades away after Juventus and Atalanta losses",
      "url": "https://football-italia.net/italys-extra-champions-league-spot-fades-away/",
      "source": "football-italia.net",
      "date": "2026-02-18T13:33:42+00:00",
      "summary": "Italy’s chances of receiving an extra spot in next season’s Champions League were dealt another..."
    },
    {
      "id": "23da12719f38",
      "title": "Liberali thanks Fonseca and Milan but reveals why he left: “I have no regrets”",
      "url": "https://sempremilan.com/liberali-fonseca-milan-no-regrets-left",
      "source": "sempremilan.com",
      "date": "2026-02-18T13:10:00+00:00",
      "summary": "Mattia Liberali has thanked AC Milan for what they have given him in his young career, including his debut in Serie A. Liberali rather surprisingly left Milan on a permanent basis to join Catanzaro in the summer mercato, and while he had some difficulties initially, he has begun to shine in Serie B."
    },
    {
      "id": "57223f4804cd",
      "title": "The five key battles that could win or lose the game for Milan against Como",
      "url": "https://sempremilan.com/five-key-battles-milan-como-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-18T12:45:00+00:00",
      "summary": "It has been a while since AC Milan ran out in front of their home fans at San Siro – one month to be exact – but they will do so again tonight. There is plenty of attention surrounding the ‘rematch’ between Milan and Como, after the 3-1 win for the Rossoneri last month sparked […]\nThe post The five "
    },
    {
      "id": "6e8ccb197068",
      "title": "Official: Bologna sign Milan midfielder on permanent basis",
      "url": "https://football-italia.net/bologna-sign-milan-midfielder-on-permanent/",
      "source": "football-italia.net",
      "date": "2026-02-18T12:41:09+00:00",
      "summary": "Bologna have officially announced their signing of Tommaso Pobega on a definitive, permanent transfer from..."
    },
    {
      "id": "cdd85edb01a3",
      "title": "GdS: Home again at last – 75,000 fans expected at San Siro for first game in a month",
      "url": "https://sempremilan.com/home-at-last-come-75000",
      "source": "sempremilan.com",
      "date": "2026-02-18T12:20:00+00:00",
      "summary": "Exactly one month after the last time (against Lecce, a 1-0 win), AC Milan will play a home league game at San Siro. As La Gazzetta dello Sport (seen below) recall, back on January 18 Milan hosted Lecce and Niclas Füllkrug scoring the winning goal. Then came the unusual run of three consecutive away"
    },
    {
      "id": "0b70e8e15b15",
      "title": "CM: When Gimenez should return for Milan and the two reasons it could be crucial",
      "url": "https://sempremilan.com/when-gimenez-return-two-reasons-crucial",
      "source": "sempremilan.com",
      "date": "2026-02-18T11:55:00+00:00",
      "summary": "AC Milan’s Santiago Gimenez has been out since December 18th, but his return is getting closer with each passing day. As Calciomercato.com recall, Gimenez had to undergo arthroscopic surgery to fix a lingering issue in his right ankle, but now there is a ‘glimmer of light at the end of the tunnel’. "
    },
    {
      "id": "9bee6e15eb43",
      "title": "CorSport: A chance to end a drought – Leao to return to the XI against Como",
      "url": "https://sempremilan.com/chance-end-drought-leao-return-como",
      "source": "sempremilan.com",
      "date": "2026-02-18T11:30:00+00:00",
      "summary": "AC Milan need to continue their winning ways against Como or they risk Inter running away with the title, and Rafael Leao will be key again. As Corriere dello Sport (via MilanPress) report this morning, Milan are chasing their city rivals against with the derby in early March on the horizon. They wi"
    },
    {
      "id": "5964f9085752",
      "title": "Moretto reveals Milan’s strategy regarding Bartesaghi: “At the end of the season”",
      "url": "https://sempremilan.com/moretto-milan-strategy-bartesaghi-end-season",
      "source": "sempremilan.com",
      "date": "2026-02-18T11:05:00+00:00",
      "summary": "AC Milan are planning to sit down with Davide Bartesaghi and discuss a contract renewal, but not for a few more weeks. Bartesaghi came into the season as the back-up on the left side with Pervis Estupinan having signed from Brighton. However, after the Ecuadorian picked up an injury, the Milan acade"
    },
    {
      "id": "82b74bc659f8",
      "title": "GdS: Predicted XIs for AC Milan vs. Como – changes in each department",
      "url": "https://sempremilan.com/predicted-xis-milan-como-changes-department",
      "source": "sempremilan.com",
      "date": "2026-02-18T10:40:00+00:00",
      "summary": "AC Milan will play at San Siro for the first time in 31 days tonight as they welcome Lombardy neighbours Como. There is a lot of intrigue surrounding this game for a couple of reasons. Firstly, Milan’s 3-1 against Como last month sparked a debate about style of play versus getting results, with Cesc"
    },
    {
      "id": "7044dcedc704",
      "title": "Tuttosport: Ricci and Jashari in line for big chance vs. Como – why Allegri will pick them",
      "url": "https://sempremilan.com/ricci-jashari-big-chance-como-why",
      "source": "sempremilan.com",
      "date": "2026-02-18T10:15:00+00:00",
      "summary": "Massimiliano Allegri will be forced to make changes tonight against Como, and appears to have finally settled on his line-up. As Tuttosport (via MilanNews) report this morning, the most significant change will be in midfield, with a significant absence: Adrien Rabiot. The Frenchman was handed a one-"
    },
    {
      "id": "4a89cd0e7212",
      "title": "Official: Tommaso Pobega completes full AC Milan exit as Bologna confirm permanent deal",
      "url": "https://sempremilan.com/official-pobega-bologna-milan-permanent-deal",
      "source": "sempremilan.com",
      "date": "2026-02-18T09:50:00+00:00",
      "summary": "Tommaso Pobega’s loan spell at Bologna has been turned into a permanent one after various clauses were triggered, it has been confirmed. After the winter window closed, Alex Jimenez’s move to AFC Bournemouth from Milan was turned from a loan into a permanent deal, both clubs recently confirmed. The "
    },
    {
      "id": "f5ba944f0536",
      "title": "Serie A: Milan vs. Como – Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-milan-vs-como-probable-line-ups/",
      "source": "football-italia.net",
      "date": "2026-02-18T09:16:33+00:00",
      "summary": "Milan will be without several of their key first team players when they take on..."
    },
    {
      "id": "88e05da709e9",
      "title": "Today’s Papers: An historic Juve blunder, Galagoal, Bastoni apology",
      "url": "https://football-italia.net/today-papers-historic-juve-blunder-galagoal/",
      "source": "football-italia.net",
      "date": "2026-02-18T08:37:44+00:00",
      "summary": "La Gazzetta dello Sport  Not like that  An historic gaffe in the Champions League Bremer..."
    },
    {
      "id": "6f0a372ca4ee",
      "title": "How much Milan will earn as Pobega completes permanent Bologna move",
      "url": "https://football-italia.net/milan-earn-pobega-permanent-bologna-move/",
      "source": "football-italia.net",
      "date": "2026-02-17T14:16:49+00:00",
      "summary": "Reports in Italy claim that Tommaso Pobega has formally joined Bologna on a permanent deal..."
    },
    {
      "id": "185e6c8ca2a4",
      "title": "Allegri: Pulisic doubt for Milan, Inter ‘clear title favourites’",
      "url": "https://football-italia.net/allegri-pulisic-doubt-milan-inter-favourite/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:44:56+00:00",
      "summary": "Milan coach Massimiliano Allegri says Christian Pulisic is in doubt for tomorrow’s Serie A match..."
    },
    {
      "id": "28770c59c3ab",
      "title": "Allegri weighs in on diving debate and asks for offside rule change",
      "url": "https://football-italia.net/allegri-weighs-in-on-diving-debate/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:28:16+00:00",
      "summary": "Massimiliano Allegri has had his say on the diving debate that has cropped up in..."
    },
    {
      "id": "04fdb1372c8f",
      "title": "Why Milan director Tare was fined after win over Pisa",
      "url": "https://football-italia.net/why-milan-director-tare-fined-after-win-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-17T13:12:36+00:00",
      "summary": "Milan director Igli Tare was fined €10,000 after the Rossoneri’s 2-1 win over Pisa on..."
    },
    {
      "id": "068c9b768450",
      "title": "Official: Juventus directors Comolli and Chiellini given lengthy bans after Derby d’Italia",
      "url": "https://football-italia.net/official-juventus-comolli-and-chiellini-banned/",
      "source": "football-italia.net",
      "date": "2026-02-17T12:58:31+00:00",
      "summary": "Juventus directors Damien Comolli and Giorgio Cheillini, plus players Pierre Kalulu, Nicolo Barella and Hakan..."
    },
    {
      "id": "825c7f4cae9c",
      "title": "Inter vs. Juventus refereeing upset Milan too – report",
      "url": "https://football-italia.net/inter-vs-juventus-refereeing-upset-milan-too/",
      "source": "football-italia.net",
      "date": "2026-02-16T14:46:52+00:00",
      "summary": "Corriere dello Sport reports that the officiating in Inter-Juventus did not infuriate the Bianconeri only,..."
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    }
  ]
}