{
  "lastUpdated": "2026-02-02T17:37:03.957222+00:00",
  "articles": [
    {
      "id": "fff7dd1bd2f0",
      "title": "Romano lifts lid on fall-out after Mateta deal collapse: “Unrest among all parties”",
      "url": "https://sempremilan.com/romano-fall-out-mateta-unrest-milan",
      "source": "sempremilan.com",
      "date": "2026-02-02T17:32:11+00:00",
      "summary": "Fabrizio Romano has shed a bit more light on the fall-out after Jean-Philippe Mateta’s move to AC Milan collapsed on deadline day. It has been nothing short of a chaotic last 24 hours for Mateta, Milan and Crystal Palace. On Sunday evening, it emerged that the Rossoneri had agreed a deal worth ‘in e"
    },
    {
      "id": "3368bdc47796",
      "title": "Golden bench: Conte wins ahead of Gasperini and Fabregas",
      "url": "https://www.milannews.it/news/panchina-d-oro-vince-conte-davanti-a-gasperini-e-fabregas-606123",
      "source": "milannews.it",
      "date": "2026-02-02T17:30:42+00:00",
      "summary": "As reported by Sky Sport, Antonio Conte is the winner of the golden bench. It is the fifth in his career for the Lecce coach who had already won 3 with Juventus and one with Inter."
    },
    {
      "id": "5e2bff43aa28",
      "title": "LIVE MN - Milan transfer market: Mateta missed. Officer Cissé. No defender",
      "url": "https://www.milannews.it/calciomercato-milan/live-mn-mercato-milan-saltato-mateta-ufficiale-cisse-niente-difensore-606104",
      "source": "milannews.it",
      "date": "2026-02-02T17:25:00+00:00",
      "summary": "Friends of MilanNews.it, today is the last day of the transfer market! \nOur editorial team will accompany you throughout the day with all the news on the Milan transfer market minute by minute."
    },
    {
      "id": "e60a64c1d853",
      "title": "OFFICIAL: The young Dalpiaz is a new Rossoneri player",
      "url": "https://www.milannews.it/milan-futuro/ufficiale-il-giovane-dalpiaz-e-un-nuovo-calciatore-rossonero-606151",
      "source": "milannews.it",
      "date": "2026-02-02T17:20:00+00:00",
      "summary": "New reinforcement for Milan Futuro: the arrival of the young Magnus Dalpiaz has been announced."
    },
    {
      "id": "9fd0696e2c14",
      "title": "Serie A preview: Bologna vs. AC Milan – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-bologna-ac-milan-team-news-stats",
      "source": "sempremilan.com",
      "date": "2026-02-02T17:20:00+00:00",
      "summary": "If AC Milan are to continue fighting in the Scudetto, then Tuesday’s game against Bologna is must-win, especially considering their recent form.  As the last game of the weekend, Milan come into this needing a result. Failing to do so could write them off for the title. Nevertheless, just getting th"
    },
    {
      "id": "7dc85d1c9d55",
      "title": "Verona, Zanetti sacked: evaluations underway for the replacement",
      "url": "https://www.milannews.it/news/verona-esonerato-zanetti-valutazioni-in-corso-per-il-sostituto-606119",
      "source": "milannews.it",
      "date": "2026-02-02T17:10:44+00:00",
      "summary": "As reported in the Club's official press release, Paolo Zanetti has been relieved of his duties as Verona coach."
    },
    {
      "id": "f2f623636667",
      "title": "Tonali agent: ‘No Arsenal talks, we’ll evaluate if Newcastle open to Juventus’",
      "url": "https://football-italia.net/tonali-agent-arsenal-talks-newcastle-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-02T17:00:10+00:00",
      "summary": "Sandro Tonali’s agent Beppe Riso denies reports he offered the Newcastle United player to Arsenal,..."
    },
    {
      "id": "b590d6f3b657",
      "title": "Sky: Pulisic ruled out of Milan’s trip to Bologna due to battle with bursitis",
      "url": "https://sempremilan.com/pulisic-out-bologna-milan-bursitis",
      "source": "sempremilan.com",
      "date": "2026-02-02T16:51:04+00:00",
      "summary": "Massimiliano Allegri will once again have a depleted attack at his disposal for tomorrow night’s game against Bologna. According to Sky, Milan will depart for the game on Tuesday night at the Stadio Renato dall’Ara without Christian Pulisic. Allegri said that Pulisic was dealing with bursitis in his"
    },
    {
      "id": "6df5742f0ea5",
      "title": "Bucchioni and the search for a defender: \"In the absence of opportunities, Dalpiaz will be looked at with interest\"",
      "url": "https://www.milannews.it/news/bucchioni-e-la-ricerca-del-difensore-in-assenza-di-occasioni-si-guardera-con-interesse-a-dalpiaz-606100",
      "source": "milannews.it",
      "date": "2026-02-02T16:50:00+00:00",
      "summary": "Enzo Bucchioni, in his usual editorial on TMW, spoke thus about Milan and the defender issue: \"If there are no acceptable opportunities, Milan will still look with great interest at the young Austrian Magnus Dalpia..."
    },
    {
      "id": "8a88acc59cb3",
      "title": "Serious Mateta injury behind failed Milan transfer – report",
      "url": "https://football-italia.net/serious-mateta-injury-failed-milan-transfer/",
      "source": "football-italia.net",
      "date": "2026-02-02T16:48:36+00:00",
      "summary": "Jean-Philippe Mateta has failed his medical tests with Milan, and according to Sacha Tavolieri, his..."
    },
    {
      "id": "6e3d5a0d23e4",
      "title": "Pellegatti on Disasi: \"I hear that Allegri doesn't like him, it's not true\"",
      "url": "https://www.milannews.it/news/pellegatti-su-disasi-sento-dire-che-ad-allegri-non-piace-non-e-vero-606113",
      "source": "milannews.it",
      "date": "2026-02-02T16:40:24+00:00",
      "summary": "In his YouTube channel, Carlo Pellegatti spoke about the Chelsea defender who in recent weeks has been strongly linked to Milan but in the end, journalistic rumors have declared that the coach and the team ..."
    },
    {
      "id": "463c56a2088f",
      "title": "Serie A Milan Scudetto odds, bets on the Rossoneri",
      "url": "https://www.milannews.it/scommesse/quote-antepost/quote-scudetto-serie-a-milan-le-scommesse-sui-rossoneri-579454",
      "source": "milannews.it",
      "date": "2026-02-02T16:38:00+00:00",
      "summary": "Milan awaits the match against Bologna, after seeing Inter gain further ground with the success against Cremonese."
    },
    {
      "id": "810e8d2a9a3c",
      "title": "Towards Bologna-Milan, Leao one step away from yet another personal best",
      "url": "https://www.milannews.it/news/verso-bologna-milan-leao-a-un-passo-dall-ennesimo-record-personale-606018",
      "source": "milannews.it",
      "date": "2026-02-02T16:30:00+00:00",
      "summary": "Between the transfer market, possible arrivals and negotiations already concluded, Milan is thus approaching the delicate away match in Bologna, scheduled for Tuesday evening at the Dall'Ara at 8.45pm."
    },
    {
      "id": "be07e8bd7e6e",
      "title": "Milan star Pulisic ruled out of Bologna clash",
      "url": "https://football-italia.net/milan-star-pulisic-ruled-out-of-bologna-clash/",
      "source": "football-italia.net",
      "date": "2026-02-02T16:27:40+00:00",
      "summary": "Milan are travelling to Bologna for an away Serie A match without their star Christian..."
    },
    {
      "id": "4251fb33d8a0",
      "title": "Sky: How Milan’s points percentage against different parts of Serie A table compares to rivals",
      "url": "https://sempremilan.com/how-milan-points-percentage-compares-rivals",
      "source": "sempremilan.com",
      "date": "2026-02-02T16:25:58+00:00",
      "summary": "Sky have once again published the numbers regarding how the top four contenders do in games against different parts of the table. The Calcio Club took a look at the data when it comes to how Inter, Milan, Napoli, Juventus and Roma do against the different quadrants of the table: 1st to 5th, 6th to ["
    },
    {
      "id": "383f3559fd40",
      "title": "OFFICIAL: Diego Sia transferred to Mirandés on a temporary basis",
      "url": "https://www.milannews.it/calciomercato-milan/ufficiale-diego-sia-ceduto-al-mirandes-a-titolo-temporaneo-606140",
      "source": "milannews.it",
      "date": "2026-02-02T16:20:00+00:00",
      "summary": "On the last day of the transfer market, Diego Sia says goodbye to Milan, even if only temporarily: the young striker from Milan Futuro, born in 2006, has been loaned to Club Deportivo Mirandés, a team that ..."
    },
    {
      "id": "9150cffb382c",
      "title": "Pulisic not called up for Bologna-Milan tomorrow",
      "url": "https://www.milannews.it/news/pulisic-non-convocato-per-bologna-milan-di-domani-606139",
      "source": "milannews.it",
      "date": "2026-02-02T16:13:20+00:00",
      "summary": "Christian Pulisic will not be called up for Bologna-Milan tomorrow night at the Dall'Ara."
    },
    {
      "id": "5c48ccf38b71",
      "title": "Mateta, Romano: \"Agitation among all parties involved: Palace not very happy\"",
      "url": "https://www.milannews.it/calciomercato-milan/mateta-romano-agitazione-tra-tutte-le-parti-coinvolte-palace-non-contentissimo-606138",
      "source": "milannews.it",
      "date": "2026-02-02T16:08:00+00:00",
      "summary": "In the latest video on his YouTube channel, the transfer market expert Fabrizio Romano, in the company of his colleague Matteo Moretto, also commented and confirmed the news of the failed negotiation between Milan and Jean-Philippe Mateta."
    },
    {
      "id": "8b7947566a46",
      "title": "Milan Women's transfer market: two new profiles to strengthen the squad",
      "url": "https://www.milannews.it/news/calciomercato-milan-femminile-due-nuovi-profili-per-rinforzare-la-rosa-606017",
      "source": "milannews.it",
      "date": "2026-02-02T16:00:00+00:00",
      "summary": "February of the Serie A Women begins as January ended, for Suzanne Bakker's Milan. That is, with three points bearing the signature of Kayleigh Van Dooren."
    },
    {
      "id": "3e92c9cf6b6c",
      "title": "January transfer liveblog: Juventus striker hunt, Mateta’s Milan medical",
      "url": "https://football-italia.net/january-transfer-liveblog-rumours-done-deals-2/",
      "source": "football-italia.net",
      "date": "2026-02-02T16:00:00+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "4c440ff4bd3a",
      "title": "Opposition insight ahead of Bologna-Milan: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-bologna-milan-february-2026",
      "source": "sempremilan.com",
      "date": "2026-02-02T16:00:00+00:00",
      "summary": "AC Milan will travel to the Stadio Renato Dall’Ara on Tuesday night to face a Bologna side who have been a bit hit and miss in recent Serie A fixtures. Taking the final spot on Matchday 23, Milan will hope to continue their unbeaten record in Serie A with a strong result against another European […]"
    },
    {
      "id": "960c267df8fe",
      "title": "Di Canio: \"With Mateta I would play 4-3-3 with Leao as a winger\"",
      "url": "https://www.milannews.it/news/di-canio-con-mateta-giocherei-4-3-3-con-leao-esterno-606061",
      "source": "milannews.it",
      "date": "2026-02-02T15:50:01+00:00",
      "summary": "Great confusion at the top of the table, in the Champions League area."
    },
    {
      "id": "070cc9813784",
      "title": "Milan, Alphadjo Cisse has signed his contract: the first images as a Rossoneri player",
      "url": "https://www.milannews.it/news/milan-alphadjo-cisse-ha-firmato-il-proprio-contratto-le-prime-immagini-da-giocatore-rossonero-606133",
      "source": "milannews.it",
      "date": "2026-02-02T15:40:00+00:00",
      "summary": "Alphadjo Cisse is a new player for Milan. The first images of the young midfielder as he signed his contract with the Via Aldo Rossi club appeared on the Rossoneri club's Instagram profile."
    },
    {
      "id": "c837b8bdd013",
      "title": "Official: AC Milan sign Alphadjo Cissè from Hellas Verona on permanent deal",
      "url": "https://sempremilan.com/official-ac-milan-sign-alphadjo-cisse",
      "source": "sempremilan.com",
      "date": "2026-02-02T15:33:29+00:00",
      "summary": "AC Milan have officially confirmed the signing of Alphadjo Cissè on a permanent deal from Hellas Verona. A statement on the club’s official website reads: “AC Milan is delighted to announce the permanent signing of Alphadjo Cissè from Hellas Verona. The midfielder, born in 2006, with continue his lo"
    },
    {
      "id": "df1ad1b68b62",
      "title": "Towards Bologna-Milan, the finishing touches for the rossoblù this afternoon",
      "url": "https://www.milannews.it/l-avversario/verso-bologna-milan-oggi-pomeriggio-la-rifinitura-dei-rossoblu-606083",
      "source": "milannews.it",
      "date": "2026-02-02T15:30:00+00:00",
      "summary": "Milan is ready to return to the field tomorrow evening, at the Dall'Ara stadium, against Bologna."
    },
    {
      "id": "0904fa46a8c6",
      "title": "Alphadjo Cisse to Milan: Hellas Verona also formalizes the transfer of the midfielder to the Rossoneri",
      "url": "https://www.milannews.it/news/alphadjo-cisse-al-milan-anche-l-hellas-verona-ufficializza-la-cessione-del-centrocampista-ai-rossoneri-606131",
      "source": "milannews.it",
      "date": "2026-02-02T15:20:00+00:00",
      "summary": "After the press release issued by AC Milan (click here), Verona also makes the transfer of the young midfielder Alphadjo Cisse official."
    },
    {
      "id": "2c5065400e73",
      "title": "OFFICIAL: Alphadjo Cissè to Milan. He will remain at Catanzaro until the end of the season",
      "url": "https://www.milannews.it/primo-piano/ufficiale-alphadjo-cisse-al-milan-rimarra-al-catanzaro-fino-a-fine-stagione-606132",
      "source": "milannews.it",
      "date": "2026-02-02T15:16:47+00:00",
      "summary": "AC Milan announces that it has definitively acquired the right to the sporting performances of the footballer Alphadjo Cissè from Hellas Verona."
    },
    {
      "id": "b03c95b1a495",
      "title": "‘I was confident’ – Allegri addresses Maignan’s renewal and Modric’s future",
      "url": "https://sempremilan.com/allegri-addresses-maignan-renewal-modric-future",
      "source": "sempremilan.com",
      "date": "2026-02-02T15:16:35+00:00",
      "summary": "Massimiliano Allegri has expressed his delight regarding Mike Maignan’s renewal, and he confirmed Luka Modric will decide his future. It looked for a while like things would be very different, but the arrival of Allegri and Igli Tare – as well as the new coaching staff – has managed to mend the situ"
    },
    {
      "id": "8ca7ba0f38b5",
      "title": "MN - Gambaro candid about Bologna-Milan: \"We already know what match awaits us\"",
      "url": "https://www.milannews.it/news/mn-gambaro-sincero-su-bologna-milan-sappiamo-gia-che-partita-ci-aspetta-606035",
      "source": "milannews.it",
      "date": "2026-02-02T15:10:00+00:00",
      "summary": "Enzo Gambaro, a former AC Milan footballer in the 90s and Telenova commentator, spoke exclusively on MilanNews.it."
    },
    {
      "id": "6ddcb361ce93",
      "title": "Galliani praises Berlusconi: \"He was an innovator, a visionary. He had a mind different from all other people\"",
      "url": "https://www.milannews.it/news/galliani-elogia-berlusconi-era-un-innovatore-un-visionario-aveva-una-mente-diversa-da-tutte-le-altre-persone-605982",
      "source": "milannews.it",
      "date": "2026-02-02T14:50:06+00:00",
      "summary": "During the presentation of the book Ashort Snout by Giuseppe Alberto Falci, Adriano Galliani was present as a guest and spoke about Allegri, current Milan and many anecdotes from the past linked to the Livorno coach."
    },
    {
      "id": "a8f03dd316be",
      "title": "Di Stefano: \"In Allegri's mind Mateta was the striker of the future. The knee problem is there\"",
      "url": "https://www.milannews.it/calciomercato-milan/di-stefano-nella-testa-di-allegri-mateta-era-l-attaccante-del-futuro-il-problema-al-ginocchio-c-e-606128",
      "source": "milannews.it",
      "date": "2026-02-02T14:43:06+00:00",
      "summary": "Here's Peppe Di Stefano live from Milanello on the Mateta deal:\n\n\"You've heard the news of the last minutes, read it, Mateta jumped."
    },
    {
      "id": "c3ae3dbb4bc8",
      "title": "Reports: Milan decide not to sign Mateta after medical in Paris – the details",
      "url": "https://sempremilan.com/milan-decide-not-to-sign-mateta",
      "source": "sempremilan.com",
      "date": "2026-02-02T14:31:04+00:00",
      "summary": "AC Milan will not proceed with the signing of Jean-Philippe Mateta after undertaking further medical tests on his knees. Heading into deadline day, we knew that a deal had been agreed between Milan and Crystal Palace after negotiations over the weekend. It was expected that the striker would pass a "
    },
    {
      "id": "29d2a2266654",
      "title": "Milan deal for Crystal Palace striker Mateta has fallen through",
      "url": "https://football-italia.net/milan-deal-for-mateta-has-fallen-through/",
      "source": "football-italia.net",
      "date": "2026-02-02T14:28:35+00:00",
      "summary": "The latest updates in Italy claim that Milan’s deal for Crystal Palace striker Jean-Philippe Mateta..."
    },
    {
      "id": "3963a11dd2ce",
      "title": "Conte aims dig at Allegri and Milan: ‘Not playing that much’",
      "url": "https://football-italia.net/conte-aims-dig-allegri-milan-not-playing-much/",
      "source": "football-italia.net",
      "date": "2026-02-02T14:17:00+00:00",
      "summary": "Antonio Conte insists no action is being taken to ease the fixture congestion and taunts..."
    },
    {
      "id": "9134afde8e82",
      "title": "Intermediaries vs. injury worries: Sources disagree over Mateta-Milan hold-up",
      "url": "https://sempremilan.com/sources-disagree-over-mateta-milan-hold-up",
      "source": "sempremilan.com",
      "date": "2026-02-02T13:55:07+00:00",
      "summary": "Just a few hours before the winter window closes, we are none the wiser as to whether AC Milan will sign Jean-Philippe Mateta. Heading into the final day of the mercato, it emerged that Milan had agreed a deal worth ‘in excess of €30m’ to sign Mateta from Crystal Palace. However, it emerged last nig"
    },
    {
      "id": "df683355bddf",
      "title": "Moretto: Milan Futuro star Diego Sia expected to join Mirandes – the latest",
      "url": "https://sempremilan.com/milan-futuro-star-diego-sia-mirandes",
      "source": "sempremilan.com",
      "date": "2026-02-02T13:31:09+00:00",
      "summary": "There is always room for surprises on deadline day, and AC Milan letting Diego Sia leave might just fall into that category. The winter transfer window has seen Milan’s youth sector be more active than the first team, which is perhaps to be expected. There have been several incoming and outgoing dea"
    },
    {
      "id": "109ba03fcc02",
      "title": "CorSport: Internal solutions prevail – why Milan will not sign a defender",
      "url": "https://sempremilan.com/why-milan-not-sign-defender-winter",
      "source": "sempremilan.com",
      "date": "2026-02-02T12:59:41+00:00",
      "summary": "AC Milan’s management have decided not to pursue a deadline day deal for a central defender, according to a report. During the winter mercato, Milan have been linked with several centre-backs, from Thiago Silva and Joe Gomez to Axel Disasi and Nathan Ake. For various reasons none of these ideas mate"
    },
    {
      "id": "02aa9c9a52aa",
      "title": "Sky: Juventus re-enter Mateta picture with Milan expected to make decision soon",
      "url": "https://sempremilan.com/juventus-mateta-milan-decision-soon",
      "source": "sempremilan.com",
      "date": "2026-02-02T12:27:25+00:00",
      "summary": "AC Milan will soon make a call on whether or not to proceed with the deadline day signing of Jean-Philippe Mateta, a report claims. According to Sky (via MilanNews), it’s almost time to see how the Mateta-Milan situation will end up. The player is undergoing additional medical checks requested by th"
    },
    {
      "id": "9cd905da4573",
      "title": "Sky: Juventus resume Mateta talks, propose different terms than Milan",
      "url": "https://football-italia.net/juventus-mateta-talks-different-terms-milan/",
      "source": "football-italia.net",
      "date": "2026-02-02T12:26:48+00:00",
      "summary": "Sky Sport Italia reports that Juventus have resumed talks for Jean-Philippe Mateta, but the Bianconeri..."
    },
    {
      "id": "56f47fdb0852",
      "title": "Nkunku set to stay with Milan beyond January deadline: ‘We’re happy with him’",
      "url": "https://football-italia.net/nkunku-set-to-stay-with-milan-beyond-january/",
      "source": "football-italia.net",
      "date": "2026-02-02T12:20:28+00:00",
      "summary": "According to the latest updates, Christopher Nkunku is set to stay on with Milan on..."
    },
    {
      "id": "62a1893c0930",
      "title": "Reports: West Ham to sign Disasi from Chelsea – confusion emerges over Milan’s pursuit",
      "url": "https://sempremilan.com/west-ham-disasi-chelsea-confusion-milan",
      "source": "sempremilan.com",
      "date": "2026-02-02T12:09:55+00:00",
      "summary": "Axel Disasi is expected to sign for West Ham today, joining from Chelsea on loan, and that means AC Milan will not land him. According to Sky, Disasi will join West Ham on Deadline Day ‘despite interest from a number of other clubs, including AC Milan’. A medical is scheduled for this morning, with "
    },
    {
      "id": "30aa78cb6e24",
      "title": "Where Milan stand with Mateta heading into final hours of January transfer window",
      "url": "https://football-italia.net/where-milan-stand-with-mateta-on-deadline-day/",
      "source": "football-italia.net",
      "date": "2026-02-02T11:59:57+00:00",
      "summary": "Milan are still yet to make a final decision on Crystal Palace striker Jean-Philippe Mateta..."
    },
    {
      "id": "0be3dfa99cd6",
      "title": "Allegri: ‘Not right’ to talk about Mateta, ‘I’m happy with the guys I have at my disposal’",
      "url": "https://football-italia.net/allegri-not-right-to-talk-about-mateta/",
      "source": "football-italia.net",
      "date": "2026-02-02T11:39:31+00:00",
      "summary": "Massimiliano Allegri insists that it is ‘not right’ for him to comment on developments regarding..."
    },
    {
      "id": "e0467530a8c9",
      "title": "Allegri discusses injury woes, Mateta speculation, deadline day and crucial phase in season",
      "url": "https://sempremilan.com/allegri-injuries-mateta-deadline-day-season",
      "source": "sempremilan.com",
      "date": "2026-02-02T11:31:55+00:00",
      "summary": "AC Milan boss Massimiliano Allegri refused to comment on the Jean-Philippe Mateta pursuit, and gave an update on the injury situation. Milan resume Serie A action as they take on Bologna at the Stadio Renato dall’Ara and they are under pressure to win again, with Napoli, Juventus and Inter all havin"
    },
    {
      "id": "fc7843ae70a7",
      "title": "CorSport: Over €10m spent on three deals – Milan invest in trio of youth talents",
      "url": "https://sempremilan.com/milan-invest-trio-youth-talents",
      "source": "sempremilan.com",
      "date": "2026-02-02T11:00:13+00:00",
      "summary": "While waiting to see if Jean-Philippe Mateta is the statement winter signing for AC Milan, the management have decided to invest in youth. Today’s edition of Corriere dello Sport (via MilanNews) recall how Milan have completed three deals for three talented teenagers who the club hope could flourish"
    },
    {
      "id": "90d33b5e2b29",
      "title": "The Boniface and Pubill precedents: Milan exercise caution again with Mateta",
      "url": "https://sempremilan.com/milan-caution-mateta-boniface-pubill-precedents",
      "source": "sempremilan.com",
      "date": "2026-02-02T10:37:15+00:00",
      "summary": "AC Milan head into deadline day still unsure if they are going to sign Jean-Philippe Mateta, despite a deal being agreed with Crystal Palace. On Sunday, The Athletic among other sources confirmed that Milan have agreed a deal worth ‘in excess of €30m’ to sign Mateta from Crystal Palace, with his med"
    },
    {
      "id": "a02f80ad4d3f",
      "title": "GdS: Leao, Pulisic and Saelemaekers at risk – Allegri facing headaches ahead of Bologna trip",
      "url": "https://sempremilan.com/allegri-facing-headaches-ahead-of-bologna",
      "source": "sempremilan.com",
      "date": "2026-02-02T10:15:06+00:00",
      "summary": "AC Milan will be back in Serie A action on Tuesday night in Bologna, and Massimiliano Allegri will have a depleted attack. As La Gazzetta dello Sport (seen below) write this morning, Jean-Philippe Mateta’s arrival is hinging on an extra medical regarding his knee condition, while Allegri is preparin"
    },
    {
      "id": "9ff33510a069",
      "title": "Official: AC Milan announce signing of Yahya Idrissi Regragui for Futuro squad – photo",
      "url": "https://sempremilan.com/official-ac-milan-yahya-idrissi-chelsea",
      "source": "sempremilan.com",
      "date": "2026-02-02T09:37:08+00:00",
      "summary": "AC Milan have got their first deal officially across the line, as Yahya Idrissi Regragui has arrived from Chelsea. A statement on the official website reads as follows: “AC Milan is pleased to announce the signing of Yahya Idrissi, who will be part of the Milan Futuro Project, dedicated to the growt"
    },
    {
      "id": "83a0a101a0a2",
      "title": "Tuttosport: Mateta now, Vlahovic in June – Milan plotting ‘revolution’ in attack",
      "url": "https://sempremilan.com/milan-plot-attacking-revolution-mateta-vlahovic",
      "source": "sempremilan.com",
      "date": "2026-02-02T09:26:55+00:00",
      "summary": "AC Milan’s plan for the attacking department involves a potential signing in January and one in June, a report has claimed. The final hours of the winter window could well be hectic for Milan, as Jean-Philippe Mateta has dominated the scene over the past 24 hours. There is a deal agreed with Crystal"
    },
    {
      "id": "1e60abad6348",
      "title": "Watch: Bayern Munich talent arrives ahead of Milan medical – the terms of the deal",
      "url": "https://sempremilan.com/bayern-dalpiaz-milan-medical-terms-deal",
      "source": "sempremilan.com",
      "date": "2026-02-02T09:01:04+00:00",
      "summary": "Magnus Dalpiaz arrived in Italy last night ahead of his medical before joining AC Milan from Bayern Munich. A lot of the late movement for Milan in this winter window has been regarding young talents set to bolster the youth system. For example, Verona’s Alphadjo Cisse and Chelsea’s Yahya Idrissi Re"
    },
    {
      "id": "0d9605bcd666",
      "title": "When is the 2026 January transfer deadline in Serie A?",
      "url": "https://football-italia.net/when-is-the-2026-january-transfer-deadline/",
      "source": "football-italia.net",
      "date": "2026-02-02T08:44:50+00:00",
      "summary": "January has brought plenty of transfer action in Serie A, but teams now have less..."
    },
    {
      "id": "95dc6085a265",
      "title": "Today’s Papers: Mateta tests, Audero shock, Inter flying, Juventus run continues",
      "url": "https://football-italia.net/todays-papers-mateta-tests-audero-shock/",
      "source": "football-italia.net",
      "date": "2026-02-02T08:34:03+00:00",
      "summary": "La Gazzetta dello Sport Inter run away (and thank Audero) Hit by a firework, the..."
    },
    {
      "id": "1ed7b9c5253e",
      "title": "Milan to send club doctor to London before making final Mateta decision",
      "url": "https://football-italia.net/milan-send-doctor-before-mateta-decision/",
      "source": "football-italia.net",
      "date": "2026-02-01T20:25:40+00:00",
      "summary": "Reports from various outlets in Italy claim that Milan will send a club doctor to..."
    },
    {
      "id": "12ed7bd1d2f4",
      "title": "Report Mateta transfer to Milan on standby despite agreement",
      "url": "https://football-italia.net/report-mateta-transfer-to-milan-on-standby/",
      "source": "football-italia.net",
      "date": "2026-02-01T18:20:29+00:00",
      "summary": "The latest updates in Italy claim that Milan’s deal for Crystal Palace striker Jean-Philippe Mateta..."
    },
    {
      "id": "5890087ed87f",
      "title": "Why Milan decided against signing Chelsea defender Disasi",
      "url": "https://football-italia.net/why-milan-not-signing-chelsea-disasi/",
      "source": "football-italia.net",
      "date": "2026-02-01T15:52:34+00:00",
      "summary": "Milan have reportedly decided against signing Chelsea defender Axel Disasi following ‘technical assessments’ made with..."
    },
    {
      "id": "7ced8c889f25",
      "title": "Mateta medical given green light ahead of Milan transfer",
      "url": "https://football-italia.net/mateta-medical-given-greenlight/",
      "source": "football-italia.net",
      "date": "2026-02-01T15:34:33+00:00",
      "summary": "Jean-Philippe Mateta is set to have a medical on Sunday ahead of a permanent transfer..."
    },
    {
      "id": "e1d0a9aa5edc",
      "title": "Milan handed Mateta boost as Strand Larsen set for Palace medical",
      "url": "https://football-italia.net/milan-mateta-boost-strand-larsen-palace-deal/",
      "source": "football-italia.net",
      "date": "2026-02-01T14:40:02+00:00",
      "summary": "Multiple sources claim that Wolverhampton Wanderers have accepted an offer from Crystal Palace for Jorgen..."
    },
    {
      "id": "1b9cb60a6c31",
      "title": "Milan move for unhappy Mateta under threat as Crystal Palace struggle to find replacement",
      "url": "https://football-italia.net/milan-move-for-mateta-under-threat-palace/",
      "source": "football-italia.net",
      "date": "2026-01-31T18:40:04+00:00",
      "summary": "Milan’s pursuit of Jean-Philippe Mateta has hit a fresh obstacle as Crystal Palace struggle to..."
    },
    {
      "id": "e04ac95912a5",
      "title": "Official: Maignan signs new deal with Milan until 2031",
      "url": "https://football-italia.net/official-maignan-signs-new-deal-milan-2031/",
      "source": "football-italia.net",
      "date": "2026-01-31T18:20:12+00:00",
      "summary": "AC Milan have secured the long-term future of captain Mike Maignan, with the goalkeeper putting..."
    },
    {
      "id": "132dcdaa7db5",
      "title": "Maignan has signed new Milan contract to June 2030 plus option",
      "url": "https://football-italia.net/maignan-has-signed-new-milan-contract-to-2030/",
      "source": "football-italia.net",
      "date": "2026-01-31T16:14:20+00:00",
      "summary": "Milan are not expected to announce it until Sunday, but today Mike Maignan signed the..."
    }
  ]
}