{
  "lastUpdated": "2026-02-09T14:51:31.467584+00:00",
  "articles": [
    {
      "id": "dd72c6ebdb64",
      "title": "Fiorentina, tests for Gudmundsson: left ankle injuries ruled out",
      "url": "https://www.milannews.it/news/fiorentina-accertamenti-per-gudmundsson-escluse-lesioni-alla-caviglia-sinistra-606855",
      "source": "milannews.it",
      "date": "2026-02-09T14:48:40+00:00",
      "summary": "(ANSA) - FLORENCE, 09 FEB - \"Acute capsuloligamentous lesions affecting the left ankle are excluded\"."
    },
    {
      "id": "b9c2cc324e52",
      "title": "Tegola Cisse, right adductor injury: 2 months out",
      "url": "https://www.milannews.it/news/tegola-cisse-lesione-all-adduttore-destro-2-mesi-out-606854",
      "source": "milannews.it",
      "date": "2026-02-09T14:36:15+00:00",
      "summary": "In the last championship match against Reggiana, Alphadjo Cisse had to come off in the 18th minute due to an injury to his right adductor. As reported by Uscatanzarocalcionews."
    },
    {
      "id": "44a1e116e494",
      "title": "‘A fantastic transfer window’ – Di Marzio explains why Milan’s management deserve praise",
      "url": "https://sempremilan.com/di-marzio-milan-fantastic-window-praise",
      "source": "sempremilan.com",
      "date": "2026-02-09T14:34:09+00:00",
      "summary": "Gianluca Di Marzio believes that AC Milan did fantastic business in the window, largely because they were able to complete Mike Maignan’s renewal. A week has already passed since the winter transfer window closed, and it’s time to take stock of things. Milan acquired a striker for the present in Nic"
    },
    {
      "id": "2e1406e18f54",
      "title": "The latest from Milanello: Pulisic is better, checks for Saelemaekers",
      "url": "https://www.milannews.it/da-milanello/le-ultime-da-milanello-pulisic-sta-meglio-controlli-per-saelemaekers-606865",
      "source": "milannews.it",
      "date": "2026-02-09T14:23:36+00:00",
      "summary": "Double session today at Milanello for Milan who worked in the gym this morning, while training is scheduled for the afternoon on one of the pitches of the Carnago Sports Centre."
    },
    {
      "id": "b9ed6f5b8625",
      "title": "Gasperini shock: \"Teams have people from the refereeing world who teach them how to stay on the ground\"",
      "url": "https://www.milannews.it/news/gasperini-shock-squadre-hanno-persone-dal-mondo-arbitrare-che-insegnano-come-rimanere-a-terra-606851",
      "source": "milannews.it",
      "date": "2026-02-09T14:12:05+00:00",
      "summary": "Gian Piero Gasperini, during the usual Roma-Cagliari pre-match press conference, launched a very serious accusation that leaves the entire football system stunned, asserting the presence of specific figures within the ..."
    },
    {
      "id": "73c50e6dc84b",
      "title": "MN: Operation 12 from 12 – Milan enter crucial quartet of games with plenty to prove",
      "url": "https://sempremilan.com/milan-crucial-quartet-games-plenty-prove",
      "source": "sempremilan.com",
      "date": "2026-02-09T14:05:49+00:00",
      "summary": "AC Milan play four games between now and the derby against Inter on March 8, and the objective is simple: win them all. As MilanNews writes, Inter have moved eight points clear at the top again after hammering Sassuolo 5-0 on Sunday. Milan have a game in hand, but they cannot concern themselves with"
    },
    {
      "id": "ab7841c04918",
      "title": "Nations League 2026/2027, the draw on Thursday: Italy in the second pot",
      "url": "https://www.milannews.it/news/nations-league-2026-2027-giovedi-il-sorteggio-italia-in-seconda-fascia-606848",
      "source": "milannews.it",
      "date": "2026-02-09T14:01:34+00:00",
      "summary": "As reported by the FIGC website, the draw for the 2026/2027 UEFA Nations League is scheduled for Thursday 12 February in Brussels: \"Waiting to return to the pitch on 26 March in Bergamo for the semi-final of the World Cup play-offs ..."
    },
    {
      "id": "32b581f123d2",
      "title": "Estupinan and the difficulties he is having at Milan. The former coach speaks: \"I'm surprised, for me he's a top player in his role\"",
      "url": "https://www.milannews.it/news/estupinan-e-le-difficolta-che-sta-trovando-al-milan-parla-l-ex-tecnico-sono-sorpreso-per-me-e-un-top-nel-suo-ruolo-606846",
      "source": "milannews.it",
      "date": "2026-02-09T13:49:35+00:00",
      "summary": "Interviewed by TuttoMercatoWeb."
    },
    {
      "id": "dcf008d9eccd",
      "title": "CorSport: The three factors that will determine if Modric has a ‘final showcase’ with Milan",
      "url": "https://sempremilan.com/three-factors-modric-final-showcase-milan",
      "source": "sempremilan.com",
      "date": "2026-02-09T13:41:54+00:00",
      "summary": "Luka Modric is a pillar of the current AC Milan side, but at present there is uncertainty regarding whether he will remain beyond June. Corriere dello Sport (via MN24) wites this morning that the future of Milan’s midfield passes through what Modric chooses to do. More specifically, Igli Tare’s summ"
    },
    {
      "id": "fb15a1bd8ff0",
      "title": "Milan remembers the penalty saved by Lautaro and wishes Tatarusanu best wishes for his 40th birthday",
      "url": "https://www.milannews.it/news/il-milan-ricorda-il-rigore-parato-a-lautaro-e-fa-tanti-auguri-a-tatarusanu-per-i-suoi-40-anni-606845",
      "source": "milannews.it",
      "date": "2026-02-09T13:36:23+00:00",
      "summary": "Today, February 9, Ciprian Tatarusanu turns 40. The Romanian goalkeeper played for Milan for 3 years, from 2020 to 2023, conceding 35 goals."
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "7b3e6cf1f656",
      "title": "Women's Serie A, the report of the 13th matchday: Milan narrowly defeated in Rome",
      "url": "https://www.milannews.it/milan-femminile/serie-a-femminile-il-resoconto-della-13-giornata-milan-sconfitto-di-misura-a-roma-606842",
      "source": "milannews.it",
      "date": "2026-02-09T13:24:09+00:00",
      "summary": "The FIGC website reports the results of the 13th matchday of the Women's Serie A, the standings and the program of the next round: \"Roma narrowly wins the big match against Milan, 3-0 for Inter over Fiorentina and 3-1 against Napo..."
    },
    {
      "id": "cf3ee786de09",
      "title": "Pellegatti is with Leao: \"I hear tired fans, but he's playing at 30%\"",
      "url": "https://www.milannews.it/news/pellegatti-sta-con-leao-sento-tifosi-stanchi-ma-sta-giocando-al-30-606838",
      "source": "milannews.it",
      "date": "2026-02-09T13:12:24+00:00",
      "summary": "In his YouTube channel, Carlo Pellegatti spoke about Rafa Leao and the fans who are tired and would like to sell the Portuguese. This is his comment: \n\n\"Leao is back in the group."
    },
    {
      "id": "e2939d39a994",
      "title": "Tuttosport: Milan table €24m net contract to Vlahovic – agent wants double digits",
      "url": "https://sempremilan.com/milan-contract-vlahovic-agent-double-digits",
      "source": "sempremilan.com",
      "date": "2026-02-09T13:10:00+00:00",
      "summary": "AC Milan risk being priced out of the Dusan Vlahovic sweepstakes because of the striker’s salary remands, a report claims. According to the latest from Tuttosport, sporting director Igli Tare has re-established contact with Vlahovic’s agent, Darko Ristic, in order to try and make progress. Although "
    },
    {
      "id": "1d14db2dc28d",
      "title": "Pisa, Como, Parma and Cremonese: target 12 points. In the first leg there were only 5 with these teams",
      "url": "https://www.milannews.it/primo-piano/pisa-como-parma-e-cremonese-obiettivo-12-punti-all-andata-furono-solo-5-con-queste-squadre-606849",
      "source": "milannews.it",
      "date": "2026-02-09T13:00:00+00:00",
      "summary": "This round of Serie A is now over, with the exception of this evening's postponements between Roma-Cagliari and Atalanta-Cremonese, which saw Milan rest given the unusability of San Siro for the opening ceremony of the O..."
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "131fe0071125",
      "title": "Inter at +8 on Milan. Bisseck: \"We don't think about it. We want to win every game, no matter what the others do\"",
      "url": "https://www.milannews.it/news/inter-a-8-sul-milan-bisseck-non-ci-pensiamo-vogliamo-vincere-ogni-partita-non-importa-cosa-fanno-gli-altri-606840",
      "source": "milannews.it",
      "date": "2026-02-09T12:48:20+00:00",
      "summary": "After the success against Sassuolo, Yann Bisseck, the Inter defender who scored the goal that opened the scoring, told SportMediaset: \"It wasn't as easy as it seems, especially the first 10-15 minutes we were a bit…"
    },
    {
      "id": "6ce0d878c795",
      "title": "CorSport: Nkunku plus one – Leao and Füllkrug to fight for spot in Pisa",
      "url": "https://sempremilan.com/nkunku-plus-one-leao-fullkrug-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-09T12:45:00+00:00",
      "summary": "Due to a rather strange scheduling quirk, AC Milan had the weekend off while all of their top four rivals played. On Friday, though, they return to action in Pisa. As Corriere dello Sport (via MilanPress) write this morning, Milan were not in action due to the postponement of the match against Como "
    },
    {
      "id": "cb14f5ea219d",
      "title": "The 2026 Champions League final ball presented: the photo",
      "url": "https://www.milannews.it/news/presentato-il-pallone-della-finale-di-champions-league-2026-la-foto-606841",
      "source": "milannews.it",
      "date": "2026-02-09T12:36:29+00:00",
      "summary": "The ball that will be used in the next Champions League final in Budapest, on 30 May 2026 at the Puskás Aréna, has been presented."
    },
    {
      "id": "06d07aa5d194",
      "title": "Spalletti without brakes: \"The only non-professional driver yesterday, a reform is needed\"",
      "url": "https://www.milannews.it/news/spalletti-senza-freni-guida-unico-non-professionista-ieri-serve-una-riforma-606839",
      "source": "milannews.it",
      "date": "2026-02-09T12:24:11+00:00",
      "summary": "After the Juventus-Lazio match, which ended 2-2, there was a lot of controversy from Juventus fans and players over a possible penalty not called in the first half on Cabal."
    },
    {
      "id": "2dd78534f8a6",
      "title": "Schira: Milan send scout to watch Fiorentina star ahead of potential swoop – the details",
      "url": "https://sempremilan.com/milan-scout-fiorentina-kean-swoop-details",
      "source": "sempremilan.com",
      "date": "2026-02-09T12:20:00+00:00",
      "summary": "AC Milan had a scout present to watch Moise Kean in action ahead of a potential move in the summer window, it is claimed. With Jean-Philippe Mateta now crossed off the list following the knee issues that his medical revealed on deadline day, Milan are looking ahead to 2026-27 with the intention of s"
    },
    {
      "id": "bdb3c24a838c",
      "title": "Pellegatti harsh: \"Whoever doesn't want Allegri must tell me which coach they would get now\"",
      "url": "https://www.milannews.it/news/pellegatti-duro-chi-non-vuole-allegri-mi-deve-dire-che-allenatore-prenderebbe-adesso-606837",
      "source": "milannews.it",
      "date": "2026-02-09T12:12:48+00:00",
      "summary": "In his YouTube channel, Carlo Pellegatti spoke about Massimiliano Allegri and who, among the Rossoneri fans, would like another coach in his place."
    },
    {
      "id": "2170d358f144",
      "title": "Rome, Gasperini agrees with De Rossi: \"Football is not 'stealing' a penalty\"",
      "url": "https://www.milannews.it/l-avversario/roma-gasperini-e-d-accordo-con-de-rossi-il-calcio-non-e-fregare-un-rigore-606764",
      "source": "milannews.it",
      "date": "2026-02-09T12:00:00+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 08 - \"It's not the favor of one or the other, we as coaches probably need to gather together for a moment and make our voice heard in the world of football because I think like Daniele\"."
    },
    {
      "id": "94af64931b73",
      "title": "Oddo states ‘good football’ matters for Milan Futuro over results: “Not here to win the league”",
      "url": "https://sempremilan.com/oddo-milan-future-not-here-win-league",
      "source": "sempremilan.com",
      "date": "2026-02-09T11:55:00+00:00",
      "summary": "Massimo Oddo has once again stressed that Milan Futuro do not see winning Serie D as their aim, after another tough defeat. There have been times this season when the Futuro have flirted with a push for top spot, though they have almost always been in a play-off position. Early in 2026 though their "
    },
    {
      "id": "345815b8025c",
      "title": "Pellegatti calm: \"Unlucky to have the match at home on February 8, but Allegri is there\"",
      "url": "https://www.milannews.it/news/pellegatti-sereno-sfortunati-ad-avere-proprio-noi-la-partita-in-casa-l-8-febbraio-ma-c-e-allegri-606836",
      "source": "milannews.it",
      "date": "2026-02-09T11:48:05+00:00",
      "summary": "In his YouTube channel, Carlo Pellegatti spoke about the postponement of the AC Milan-Como match and the possibility that the pressure will rise as they are -8 behind Inter."
    },
    {
      "id": "b6167bff7e7d",
      "title": "Ravanelli against VAR: \"It allows any player to cheat\"",
      "url": "https://www.milannews.it/news/ravanelli-contro-il-var-permette-a-qualsiasi-giocatore-di-barare-606831",
      "source": "milannews.it",
      "date": "2026-02-09T11:36:00+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 09 - \"It is unrecognizable football, we have arrived adrift and only we in Italy use VAR in this way. In other championships, VAR is used in another way."
    },
    {
      "id": "791ad6ad5341",
      "title": "Albertini reflects on dazzling Milan career including debut, coaches and best moments",
      "url": "https://sempremilan.com/albertini-milan-debut-coaches-best-moments",
      "source": "sempremilan.com",
      "date": "2026-02-09T11:30:00+00:00",
      "summary": "Demetrio Albertini has opened up about his time with AC Milan, including the prevailing memories and some of the coaches he worked with. Albertini was a hugely influential figure in Milan’s golden era back in the 1990s, when red and black ruled the world. The midfielder was even nicknamed ‘The Metro"
    },
    {
      "id": "6d843a132ad4",
      "title": "Milan Cortina, Malagò: \"Football overshadowed by the Games? Happy it came later\"",
      "url": "https://www.milannews.it/news/milano-cortina-malago-calcio-oscurato-dai-giochi-felice-sia-arrivato-dopo-606832",
      "source": "milannews.it",
      "date": "2026-02-09T11:24:03+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 09 - \"I wasn't surprised and I was happy that the Olympic events were at the center of the media scene and football came later.\""
    },
    {
      "id": "c692dfd12d8b",
      "title": "Modric guest of Sergio Ramos: \"Always an immense joy to see you brother\"",
      "url": "https://www.milannews.it/news/modric-ospite-di-sergio-ramos-sempre-un-allegria-immensa-vederti-fratello-606835",
      "source": "milannews.it",
      "date": "2026-02-09T11:12:00+00:00",
      "summary": "In these days of rest granted by Massimiliano Allegri, Luka Modric had the opportunity to visit his old friend and teammate, Sergio Ramos, today a free agent after his interesting experience in Mexico with the Mont shirt..."
    },
    {
      "id": "ea7be9cb09e2",
      "title": "CorSport: Milan still pursuing Partizan star on Savicevic’s recommendation – the situation",
      "url": "https://sempremilan.com/milan-partizan-kostic-savicevic-recommendation",
      "source": "sempremilan.com",
      "date": "2026-02-09T11:05:00+00:00",
      "summary": "Despite failing to get the deal done in the winter transfer window, AC Milan have no intention of giving up on Andrej Kostic. According to Corriere dello Sport (via MN24) this morning, Milan have continued work to try and get Kostic ahead of the summer. Discussions with Partizan Belgrade have contin"
    },
    {
      "id": "50e0f640e371",
      "title": "Milan in the black: redemptions in sight for 70 million euros",
      "url": "https://www.milannews.it/primo-piano/milan-in-attivo-riscatti-in-vista-per-70-milioni-di-euro-606834",
      "source": "milannews.it",
      "date": "2026-02-09T11:00:00+00:00",
      "summary": "Milan can smile on the economic front: thanks to the players currently on loan, in the next transfer window the Rossoneri club could collect around 70 million euros from buyouts from other clubs."
    },
    {
      "id": "579e2ead7437",
      "title": "Schira: Lazio star gives priority to Milan for summer move – talks continue over €20m deal",
      "url": "https://sempremilan.com/lazio-gila-priority-milan-20m-deal",
      "source": "sempremilan.com",
      "date": "2026-02-09T10:40:00+00:00",
      "summary": "AC Milan are thinking ahead to the summer window, and they have identified their main target for the centre-back department. Milan were linked with various defensive options during the winter mercato that has just closed, from Axel Disasi to Radu Dragusin. In the end, the management decided to keep "
    },
    {
      "id": "28d1d1cab55d",
      "title": "QS: Schedule, Allegri and returns – three reasons Milan should believe in a Scudetto surge",
      "url": "https://sempremilan.com/three-reasons-milan-believe-scudetto-surge",
      "source": "sempremilan.com",
      "date": "2026-02-09T10:15:00+00:00",
      "summary": "First place is now eight points away, but AC Milan still have reasons to believe that they can challenge Inter all the way in the title race. As Quotidiano Sportivo write this morning, the mountain to climb is steep, and the declared primary objective remains a Champions League spot. The temptation "
    },
    {
      "id": "281202816568",
      "title": "MN: ‘Inexhaustible’ Modric is Milan’s shining light – end point remains unknown",
      "url": "https://sempremilan.com/inexhaustible-modric-milan-shining-light-unknown",
      "source": "sempremilan.com",
      "date": "2026-02-09T09:50:00+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri understandably continues to rely on Luka Modric, but for how much longer will he be able to? As MilanNews recall, the contract Modric signed with Milan in the summer was a one-year deal. There is an option for another year, but there is a rather unusual cavea"
    },
    {
      "id": "54aa72eef4fb",
      "title": "Tuttosport: Milan resume search for the right No.9 – Arsenal man among three candidates",
      "url": "https://sempremilan.com/milan-no-9-arsenal-jesus-kean-vlahovic",
      "source": "sempremilan.com",
      "date": "2026-02-09T09:25:00+00:00",
      "summary": "With Jean-Philippe Mateta now crossed off the list, AC Milan are looking ahead to a summer window in which they again need to sign a striker. As Tuttosport (via MilanNews) report this morning, the Milan management will now tasked with choosing the right man to lead the attack for next season and bey"
    },
    {
      "id": "f52fce8cbefe",
      "title": "GdS: ‘A €70m treasure’ – why Milan’s summer budget will get a big boost from sales",
      "url": "https://sempremilan.com/why-milan-summer-budget-boost-sales",
      "source": "sempremilan.com",
      "date": "2026-02-09T09:01:10+00:00",
      "summary": "AC Milan have reason to hope that the players out on loan currently can generate a ‘treasure’ to be reinvested in the summer. La Gazzetta dello Sport (seen below) speak this morning of ‘€80m in cash, and it has nothing to do with the Champions League prize money’. To get it, Milan didn’t have to […]"
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "17cbc166e501",
      "title": "One month until D-Day: Form, fitness and fixtures for Milan and Inter compared",
      "url": "https://sempremilan.com/form-fitness-fixtures-milan-inter-compared",
      "source": "sempremilan.com",
      "date": "2026-02-08T19:35:58+00:00",
      "summary": "There are four weeks and many games until the next instalment of the Derby della Madonnina, but it is already looking like an approaching watershed. Massimiliano Allegri has repeatedly spoken in the media about the notion of getting to March and seeing where Milan are, above all with regards to the "
    },
    {
      "id": "5ae0c757be31",
      "title": "Reports: Leao returns to full training but Pulisic and Saelemaekers remain doubts for Pisa",
      "url": "https://sempremilan.com/leao-full-pulisic-saelemaekers-doubts-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-08T18:30:00+00:00",
      "summary": "After the three days of rest granted by Massimiliano Allegri following the victory in Bologna, AC Milan officially resumed training this afternoon. As MilanNews24 report, the Milan squad have begun preparations for Friday night’s match at the Cetilar Arena against Pisa. This comes after Allegri deci"
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "d04c55144e8f",
      "title": "Bench-warmers turned match-winners: Lorenzo and Stefano discuss Allegri’s dilemma",
      "url": "https://sempremilan.com/bench-warmers-turned-match-winners-milan",
      "source": "sempremilan.com",
      "date": "2026-02-08T18:00:00+00:00",
      "summary": "AC Milan have one of the smallest squads in Serie A in terms of numbers, but Massimiliano Allegri continues to find new resources within it. For some time, there were question marks about what the summer window brought to Milan. The squad underwent a big downsizing to just 19 outfield players, and t"
    },
    {
      "id": "d9c8370987f4",
      "title": "Ambrosini sheds light on Milan’s dressing room at half-time in Istanbul collapse vs. Liverpool",
      "url": "https://sempremilan.com/ambrosini-milan-dressing-room-istanbul-liverpool",
      "source": "sempremilan.com",
      "date": "2026-02-08T17:30:00+00:00",
      "summary": "Massimo Ambrosini has lifted the lid on what happened during half-time in AC Milan’s Champions League final against Liverpool in 2005. The Champions League final in Istanbul 21 years ago is etched in everyone’s memories, but for the wrong reasons if you are a Milan fan. Carlo Ancelotti’s side had th"
    },
    {
      "id": "e21adaac6d75",
      "title": "CM: ‘Why not Milan’ – Tonali holds Italy preference despite Newcastle’s €90m price tag",
      "url": "https://sempremilan.com/tonali-why-not-milan-newcastle-90m",
      "source": "sempremilan.com",
      "date": "2026-02-08T17:00:00+00:00",
      "summary": "Sandro Tonali has made it his priority to return to Serie A if he does leave Newcastle, but AC Milan risk being bystanders. As Calciomercato.com recall, Matteo Moretto reported on Fabrizio Romano’s Italian YouTube channel that there was some talk about a deadline day move for Tonali, but Newcastle h"
    },
    {
      "id": "8d6b541d39bd",
      "title": "Milan Futuro 0-1 Virtus CiseranoBergamo: Rossoneri drop to 7th after frustrating defeat",
      "url": "https://sempremilan.com/milan-futuro-0-1-virtus-ciseranobergamo-report",
      "source": "sempremilan.com",
      "date": "2026-02-08T16:30:00+00:00",
      "summary": "Milan Futuro’s stuttering form continues, as they were beaten 1-0 by Virtus CiseranoBergamo on Sunday afternoon. Two early goals from Emanuele Sala and Lorenzo Ossola were not enough to clinch three points for Milan Futuro in their last game last weekend, as they drew 2-2 with Scanzorosciate to drop"
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    },
    {
      "id": "0bbe5dfeba4c",
      "title": "Milan vs. Como postponed for 2026 Winter Olympics opening ceremony: when will it be played?",
      "url": "https://football-italia.net/milan-vs-como-postponed-2026-olympics-when/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:59:54+00:00",
      "summary": "With the Stadio Meazza in San Siro unavailable for the 2026 Winter Olympics opening ceremony,..."
    },
    {
      "id": "7c148df4d4cd",
      "title": "Glasner opens up on Mateta’s failed Milan medical: ‘It wasn’t a big surprise’",
      "url": "https://football-italia.net/glasner-on-matetas-failed-milan-medical/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:55:13+00:00",
      "summary": "Crystal Palace head coach Oliver Glasner has admitted that ‘it wasn’t a big big surprise’..."
    },
    {
      "id": "c10c6a922ef6",
      "title": "San Siro’s last dance at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/san-siro-last-dance-winter-olympics-ceremony/",
      "source": "football-italia.net",
      "date": "2026-02-06T14:23:58+00:00",
      "summary": "The opening ceremony of the 2026 Milan Cortina Winter Olympics will take place today at..."
    },
    {
      "id": "35e6d473d193",
      "title": "Agent makes Lucca prediction after Forest move, confirms Camarda was close to Milan return",
      "url": "https://football-italia.net/agent-lucca-prediction-camarda-close-milan/",
      "source": "football-italia.net",
      "date": "2026-02-06T10:37:16+00:00",
      "summary": "Lorenzo Lucca’s agent is confident that the Italian striker will ‘do well’ at Nottingham Forest..."
    },
    {
      "id": "6df1dfcad057",
      "title": "Nkunku delivers the goods at Milan after 37m move from Chelsea",
      "url": "https://football-italia.net/nkunku-delivers-milan-37-move-chelsea/",
      "source": "football-italia.net",
      "date": "2026-02-05T12:49:44+00:00",
      "summary": "Christopher Nkunku is finally delivering the goods at Milan, having averaged one goal every 63..."
    },
    {
      "id": "b17892f94874",
      "title": "Hazard: ‘I was a Milan fan’, ‘special’ relationship with Sarri, but Mourinho the best",
      "url": "https://football-italia.net/hazard-milan-fan-sarri-special-mourinho-best/",
      "source": "football-italia.net",
      "date": "2026-02-05T10:54:34+00:00",
      "summary": "Former Belgian star Eden Hazard reveals he was a Milan fan as a kid and..."
    },
    {
      "id": "f86a3c2aa1e5",
      "title": "Del Piero: Juventus ‘must’ have title belief, but avoids Yildiz comparison",
      "url": "https://football-italia.net/del-piero-juventus-title-no-yildiz-comparison/",
      "source": "football-italia.net",
      "date": "2026-02-05T09:35:42+00:00",
      "summary": "Juventus legend Alessandro Del Piero feels the Bianconeri can still aim for the Serie A..."
    },
    {
      "id": "a5543b121859",
      "title": "Marotta: ‘Inter approve of rotation, Milan have an advantage for Scudetto’",
      "url": "https://football-italia.net/marotta-inter-approve-rotation-milan-advantage/",
      "source": "football-italia.net",
      "date": "2026-02-04T19:52:47+00:00",
      "summary": "Inter President Beppe Marotta backs the squad rotation for the Coppa Italia quarter-final with Torino..."
    },
    {
      "id": "9de86510452c",
      "title": "Why Inter vs. Torino Coppa Italia clash moved for 2026 Winter Olympics",
      "url": "https://football-italia.net/why-inter-vs-torino-coppa-italia-clash-moved/",
      "source": "football-italia.net",
      "date": "2026-02-04T17:23:22+00:00",
      "summary": "Tonight’s Coppa Italia quarter-final is technically Inter hosting Torino, but the 2026 Winter Olympics mean..."
    }
  ]
}