{
  "lastUpdated": "2026-02-26T14:45:19.272864+00:00",
  "articles": [
    {
      "id": "9ff8974a030b",
      "title": "Adriano: \"Golden Ball? When they gave it to Shevchenko I was at the same level\"",
      "url": "https://www.milannews.it/news/adriano-pallone-d-oro-quando-lo-hanno-dato-a-shevchenko-ero-allo-stesso-livello-608766",
      "source": "milannews.it",
      "date": "2026-02-26T14:40:30+00:00",
      "summary": "Adriano, former Inter striker, spoke to the Betsson.sport Talk format and regarding the fact of never having won the Ballon d'Or during his career he explained: \"I could have won it."
    },
    {
      "id": "07977b3507c5",
      "title": "Italy Women, the path to the Italian Women's World Cup begins. Soncin's squad",
      "url": "https://www.milannews.it/news/italia-femminile-inizia-il-percorso-vero-il-mondiale-delle-azzurre-le-convocate-di-soncin-608757",
      "source": "milannews.it",
      "date": "2026-02-26T14:30:12+00:00",
      "summary": "Concentration shines through his gaze."
    },
    {
      "id": "1668a4656bd1",
      "title": "CorSport: No Mateta means ‘significant investment’ – Milan preparing for world-class striker",
      "url": "https://sempremilan.com/no-mateta-means-significant-striker-investment-milan",
      "source": "sempremilan.com",
      "date": "2026-02-26T14:30:00+00:00",
      "summary": "A world-class striker did not arrive in January, so AC Milan will again look to recruit an elite number nine in a few months time, and the budget could be big. Jean-Philippe Mateta was seemingly going to be the man for Milan moving forwards. However, issues found in his medical cancelled the deal, a"
    },
    {
      "id": "83198ef2c75b",
      "title": "The \"Fuori Campo\" project presented: the words of the General Secretary of the Milan Foundation",
      "url": "https://www.milannews.it/news/presentato-il-progetto-fuori-campo-le-parole-del-segretario-generale-di-fondazione-milan-608761",
      "source": "milannews.it",
      "date": "2026-02-26T14:20:05+00:00",
      "summary": "Over 300 free and accessible sporting events spread across the squares and gardens of Milan from February to December 2026."
    },
    {
      "id": "e090801e3b14",
      "title": "MN - Martins on Milan: \"We are talking about a top club. In 2018...\"",
      "url": "https://www.milannews.it/news/mn-martins-sul-milan-parliamo-di-un-top-club-nel-2018-608764",
      "source": "milannews.it",
      "date": "2026-02-26T14:10:05+00:00",
      "summary": "Gelson Martins, Portuguese midfielder of Olympiacos, gave an interview to Alessandro Schiavone for Milannwews.it."
    },
    {
      "id": "9dc8c22b1308",
      "title": "Shock episode at the Bernabeu: Nazi salute from a Real Madrid member. The Blancos press release",
      "url": "https://www.milannews.it/news/episodio-choc-al-bernabeu-saluto-nazista-di-un-socio-del-real-madrid-il-comunicato-dei-blancos-608741",
      "source": "milannews.it",
      "date": "2026-02-26T14:00:00+00:00",
      "summary": "Shock episode at the Bernabeu before Real Madrid-Benfica: controversy exploded on social media over a video that quickly went viral."
    },
    {
      "id": "c4a05e4213a9",
      "title": "Chiellini offers update on Vlahovic’s future amid contract stalemate: “If we can do something”",
      "url": "https://sempremilan.com/chiellini-update-vlahovic-future-contract-stalemate",
      "source": "sempremilan.com",
      "date": "2026-02-26T14:00:00+00:00",
      "summary": "Dusan Vlahovic has been linked to AC Milan regularly over the past few years, and with his contract expiring, this may be their best chance. The attempts to sign Vlahovic in recent years have never gotten further than they have in the past 10 months. On several occasions, it has seemed like Milan we"
    },
    {
      "id": "c0cf0155ae26",
      "title": "Gavillucci on the reform of referees: \"The FIGC doesn't care about the technical aspect\"",
      "url": "https://www.milannews.it/news/gavillucci-sulla-riforma-degli-arbitri-la-figc-non-ha-a-cuore-l-aspetto-tecnico-608721",
      "source": "milannews.it",
      "date": "2026-02-26T13:40:00+00:00",
      "summary": "Claudio Gavillucci, former referee, spoke at Maracanà on TMW Radio, to talk about the possible reform of referees, with FIGC president Gravina pushing for an independent elite class: \"The reform ..."
    },
    {
      "id": "ce8979c187e8",
      "title": "CM: Allegri expecting answers from Milan management after completing goals – the latest",
      "url": "https://sempremilan.com/allegri-expecting-answers-milan-management",
      "source": "sempremilan.com",
      "date": "2026-02-26T13:35:00+00:00",
      "summary": "Massimiliano Allegri’s future at AC Milan has been subject to speculation recently, and a new update has been given today. In short, Allegri’s deal runs until 2027, with the option of another year on top of that. So, there are no major fears about his situation. Carlo Pellegatti offered his view on "
    },
    {
      "id": "027558f71881",
      "title": "Eranio: \"Leao has great qualities, but he is an anarchist. Loftus-Cheek bad loss\"",
      "url": "https://www.milannews.it/gli-ex/eranio-leao-ha-grandi-qualita-ma-e-un-anarchico-loftus-cheek-brutta-perdita-608768",
      "source": "milannews.it",
      "date": "2026-02-26T13:29:21+00:00",
      "summary": "Stefano Eranio, former Rossoneri player, released these words to Carlo Pellegatti's YouTube channel: \n\nOn the unbeaten record his Milan lost against Parma in 1993: \"Ours ended after a dominated match."
    },
    {
      "id": "c529a6d89411",
      "title": "MN - Riva: \"Work on the new stadium is progressing. We must be absolutely ready for Euro 2032\"",
      "url": "https://www.milannews.it/news/mn-riva-i-lavori-per-il-nuovo-stadio-procedono-dovremo-essere-assolutamente-pronti-per-euro-2032-608774",
      "source": "milannews.it",
      "date": "2026-02-26T13:18:49+00:00",
      "summary": "On the sidelines of the presentation of the \"Fuori Campo\" project, Martina Riva, Councilor for Sport, Tourism and Youth Policies of the Municipality of Milan, declared: \"We have presented this project whose aim is not to wait for it to be ..."
    },
    {
      "id": "01374155d8eb",
      "title": "Milan in Cremona with four warnings: derby at risk for Athekame, Rabiot, Fofana and Saelemaekers",
      "url": "https://www.milannews.it/news/milan-a-cremona-con-quattro-diffidati-derby-a-rischio-per-athekame-rabiot-fofana-e-saelemaekers-608770",
      "source": "milannews.it",
      "date": "2026-02-26T13:10:11+00:00",
      "summary": "On Sunday at 12.30 Max Allegri's Milan will present themselves at Cremonese's home with four players who have been booked within a ban, namely Zachary Athekame, Adrien Rabiot, Youssouf Fofana and Alexis Saelemaekers."
    },
    {
      "id": "b8d0ed93eb13",
      "title": "Photo: Milan record worst pressing numbers across Europe’s top five leagues",
      "url": "https://sempremilan.com/milan-record-worst-pressing-numbers-europe",
      "source": "sempremilan.com",
      "date": "2026-02-26T13:10:00+00:00",
      "summary": "It is clear that Massimiliano Allegri has set his team up in a very strict way, and the stats show this. Indeed, AC Milan are one of the most structured teams. When watching Milan, it is not a surprise that they are very strict in their defending. Whilst there are some pressing efforts made, his […]"
    },
    {
      "id": "0926df3a7cab",
      "title": "Jashari, you need time and trust: do you remember Tonali's first year?",
      "url": "https://www.milannews.it/primo-piano/jashari-serve-tempo-e-fiducia-vi-ricordate-il-primo-anno-di-tonali-608694",
      "source": "milannews.it",
      "date": "2026-02-26T13:00:00+00:00",
      "summary": "Ardon Jashari's season remains a puzzle difficult to interpret and understand."
    },
    {
      "id": "c093b1a4c68d",
      "title": "MN - Milanello, team divided between field and gym. Still apart from Gabbia",
      "url": "https://www.milannews.it/da-milanello/mn-milanello-squadra-divisa-tra-campo-e-palestra-ancora-a-parte-gabbia-608771",
      "source": "milannews.it",
      "date": "2026-02-26T12:50:15+00:00",
      "summary": "Milan continued its preparation this morning at Milanello in view of the away match on Sunday at 12.30 on the Cremonese pitch."
    },
    {
      "id": "2cdd4bf769e3",
      "title": "GdS: Milan have reason to be annoyed after nine crucial mistakes this season",
      "url": "https://sempremilan.com/milan-reason-be-annoyed-nine-crucial-mistakes",
      "source": "sempremilan.com",
      "date": "2026-02-26T12:45:00+00:00",
      "summary": "AC Milan have been their own biggest problem at times this season, but they have undeniably not been helped by certain things. There can be a lot said about this season, and whilst Massimiliano Allegri would probably be happy with several aspects, there have undoubtedly been a few moments which coul"
    },
    {
      "id": "96de83b38b92",
      "title": "From the club to his teammates: all together for Modric's stay",
      "url": "https://www.milannews.it/news/dal-club-ai-compagni-tutti-insieme-per-la-permanenza-di-modric-608754",
      "source": "milannews.it",
      "date": "2026-02-26T12:40:00+00:00",
      "summary": "Between the pitch and the market, Milan is busy on multiple fronts. As today's edition of Tuttosport recalls, at the Rossoneri we will need to understand what Luka Modric's future will be."
    },
    {
      "id": "57244da4f5a3",
      "title": "Jashari next to Modric? Bucchioni: \"No, here's who I prefer\"",
      "url": "https://www.milannews.it/news/jashari-accanto-a-modric-bucchioni-no-ecco-chi-preferisco-608725",
      "source": "milannews.it",
      "date": "2026-02-26T12:30:00+00:00",
      "summary": "Enzo Bucchioni, on TMW Radio, spoke about the possibility of seeing Jashari next to Modric: \"I always prefer Fofana alongside Modric, perhaps tactically he is undisciplined. Modric needs two legs next to him."
    },
    {
      "id": "2b08dee8bc02",
      "title": "Conference League, the return playoffs tonight: the complete program",
      "url": "https://www.milannews.it/news/conference-league-stasera-i-playoff-di-ritorno-il-programma-completo-608727",
      "source": "milannews.it",
      "date": "2026-02-26T12:20:00+00:00",
      "summary": "After the Champions League matches, this evening, in addition to the Europa League, the Conference League playoff matches will also be played."
    },
    {
      "id": "b3ef13df8d2a",
      "title": "Reports: Gabbia yet to be assessed as Cremonese game draws closer – the latest",
      "url": "https://sempremilan.com/gabbia-yet-to-be-assessed-cremonese-game",
      "source": "sempremilan.com",
      "date": "2026-02-26T12:20:00+00:00",
      "summary": "AC Milan hope to have Matteo Gabbia back this weekend, but it seems unlikely considering there have been no updates yet. Gabbia was forced to miss the game against Parma, after being withdrawn from the starting lineup in the moments before kick-off. Perhaps it was a sign of what was to come on the e"
    },
    {
      "id": "8dd17105bc71",
      "title": "Gavillucci: \"The AIA needs reforms, the results speak clearly\"",
      "url": "https://www.milannews.it/news/gavillucci-l-aia-necessita-di-riforme-i-risultati-parlano-chiaro-608722",
      "source": "milannews.it",
      "date": "2026-02-26T12:10:00+00:00",
      "summary": "Claudio Gavillucci, former referee, spoke at Maracanà, on TMW Radio, to talk about the possible reform of referees, with FIGC president Gravina pushing for an independent elite class."
    },
    {
      "id": "055eb2ed071b",
      "title": "MN EXCLUSIVE - Gelson Martins: \"In 2018 I was close to Milan, but that's over. My friend Leao is one of the best in the world\"",
      "url": "https://www.milannews.it/esclusive-mn/esclusiva-mn-gelson-martins-nel-2018-fui-vicino-al-milan-ma-e-passato-il-mio-amico-leao-uno-dei-migliori-al-mondo-608762",
      "source": "milannews.it",
      "date": "2026-02-26T12:00:48+00:00",
      "summary": "Gelson Martins, Portuguese midfielder of Olympiacos, gave an interview to Alessandro Schiavone for Milannwews.it."
    },
    {
      "id": "dd55aef0f1b3",
      "title": "The Sun: Milan could re-unite Modric with out of contract Real Madrid teammate this summer",
      "url": "https://sempremilan.com/milan-reunite-modric-out-of-contract-real-madrid-teammate",
      "source": "sempremilan.com",
      "date": "2026-02-26T11:55:00+00:00",
      "summary": "This summer, AC Milan could get the band back together, with reports suggesting that Luka Modric could be joined in midfield by a former teammate. It is a bit of a surprise to see Milan linked with an aging talent, given they have so often focused on the younger players for the future. However, when"
    },
    {
      "id": "f28a6185d1b9",
      "title": "Braglia on Jashari's moment: \"Quality player, he needs quantity\"",
      "url": "https://www.milannews.it/news/braglia-sul-momento-di-jashari-giocatore-di-qualita-ha-bisogno-di-quantita-608724",
      "source": "milannews.it",
      "date": "2026-02-26T11:50:00+00:00",
      "summary": "Simone Braglia, on TMW Radio, spoke like this about the possibility of seeing Ardon Jashari on the pitch alongside Luka Modric: \"Yes, he is a quality player."
    },
    {
      "id": "0321a8d11d51",
      "title": "UEFA ranking, the race for fifth place: Atalanta keeps Italy's hopes alive",
      "url": "https://www.milannews.it/news/ranking-uefa-la-corsa-al-quinto-posto-l-atalanta-mantiene-vive-le-speranze-dell-italia-608728",
      "source": "milannews.it",
      "date": "2026-02-26T11:40:00+00:00",
      "summary": "The race for the extra slot for the next Champions League continues. Atalanta's qualification for the round of 16 keeps hope alive for Italy, who will now have to rely on Bologna and Fiorentina."
    },
    {
      "id": "a003506e84b0",
      "title": "Europa League, the return playoffs tonight: the complete programme",
      "url": "https://www.milannews.it/news/europa-league-stasera-i-playoff-di-ritorno-il-programma-completo-608726",
      "source": "milannews.it",
      "date": "2026-02-26T11:30:00+00:00",
      "summary": "After the two nights of the Champions League, the playoff matches of the Europa League conclude this evening, with the return matches."
    },
    {
      "id": "d881d08cbe8f",
      "title": "GdS: Rabiot expected to play with derby risk – Allegri’s plan to minimise worry",
      "url": "https://sempremilan.com/rabiot-expected-play-with-derby-risk",
      "source": "sempremilan.com",
      "date": "2026-02-26T11:30:00+00:00",
      "summary": "There is a chance that Adrien Rabiot misses the Derby della Madonnina next weekend, and AC Milan cannot afford that. It is quite simple, Milan struggle with Rabiot in the team, and Massimiliano Allegri is all too aware of that. In fact, when he is available, he plays, it is that simple for the Itali"
    },
    {
      "id": "839d5544c5fe",
      "title": "Beretta: \"Jashari is proving to be an excellent player\"",
      "url": "https://www.milannews.it/news/beretta-jashari-si-sta-dimostrando-un-ottimo-giocatore-608723",
      "source": "milannews.it",
      "date": "2026-02-26T11:20:00+00:00",
      "summary": "Mario Beretta, speaking on TMW Radio during Maracanà, analyzed Ardon Jashari's good form in this way, after a complicated period of adaptation: \"Jashari struggled at the beginning but he is proving himself ..."
    },
    {
      "id": "b4117d0f6377",
      "title": "Moretto reveals Milan are attempting to sign Real Madrid starlet without key clause: “In the spotlight”",
      "url": "https://sempremilan.com/moretto-reveals-milan-attempting-sign-real-madrid-starlet",
      "source": "sempremilan.com",
      "date": "2026-02-26T11:05:00+00:00",
      "summary": "In recent years, AC Milan have made attempts to sign several youngsters from Real Madrid, and they have normally worked out well, so they will try again.  When you look at the recent history of players arriving from Los Blancos, the general feeling is positive. Brahim Diaz played a huge part in the "
    },
    {
      "id": "ac3569d1a376",
      "title": "CorSport: ‘At least five or six’ – Milan preparing for summer strengthening already",
      "url": "https://sempremilan.com/milan-preparing-summer-strengthening",
      "source": "sempremilan.com",
      "date": "2026-02-26T10:40:00+00:00",
      "summary": "In the summer, AC Milan will not have another rebuild. Instead, the club aim to strengthen the foundations set over the past two mercatos. When Massimiliano Allegri and Igli Tare arrived, it was clear that Milan needed a clear out. So, that is exactly what happened. Milan got rid of a lot of dead wo"
    },
    {
      "id": "3cdc6673e777",
      "title": "GdS: Milan ‘waiting for the turning point’ as Leao-Pulisic attack struggles so far",
      "url": "https://sempremilan.com/milan-waiting-turning-point-leao-pulisic-attack",
      "source": "sempremilan.com",
      "date": "2026-02-26T10:15:00+00:00",
      "summary": "At the start of the season, Christian Pulisic and Rafael Leao both seemingly transferred into strikers. However, they have not excelled together.  The best of Leao and Pulisic has come in different games. Indeed, the duo have struggled with injuries throughout this season, and this has certainly pla"
    },
    {
      "id": "5439dfe624b9",
      "title": "‘Daily campaign of persuasion’ – Milan begin renewal tactics with Modric deadline approaching",
      "url": "https://sempremilan.com/milan-begin-renewal-tactics-modric-deadline",
      "source": "sempremilan.com",
      "date": "2026-02-26T09:50:00+00:00",
      "summary": "This summer, Luka Modric will either extend his AC Milan deal or leave for another opportunity. It is a rare situation, but there is hope.  With contracts, it is normally the club’s choice when an option to extend is included. Where Modric is concerned, though, this is not the case. Instead, everyth"
    },
    {
      "id": "fd8bc98f43d5",
      "title": "Tuttosport: Milan need more from Pulisic as renewal issue lingers – the situation",
      "url": "https://sempremilan.com/milan-need-more-pulisic-renewal-issue-lingers",
      "source": "sempremilan.com",
      "date": "2026-02-26T09:25:00+00:00",
      "summary": "Christian Pulisic is expected to renew his deal with AC Milan in the future, but when that will be is difficult to say currently.  In the past few weeks, there have been very few positive updates about the situation with Pulisic. Of course, Milan do not have an intention of selling him in the summer"
    },
    {
      "id": "0600c3f33b7b",
      "title": "GdS: Milan must overcome San Siro issues with Champions League deciders awaiting",
      "url": "https://sempremilan.com/milan-overcome-san-siro-issues-champions-league",
      "source": "sempremilan.com",
      "date": "2026-02-26T09:00:00+00:00",
      "summary": "AC Milan have just 12 games to get to the finish line, a spot in the Champions League, and if they are to do so, things need to turn around. Indeed, looking at Milan’s position so far, they are certainly in a strong place for the top four spots. With that said, there are several […]\nThe post GdS: Mi"
    },
    {
      "id": "ea3b8cf767e4",
      "title": "MN: ‘Moment of truth’ – Gimenez hoping for March return with Milan goal in mind",
      "url": "https://sempremilan.com/gimenez-hoping-march-return-milan-goal",
      "source": "sempremilan.com",
      "date": "2026-02-25T19:00:00+00:00",
      "summary": "It seems next month will be the one for Santiago Gimenez, and the Mexican certainly has high hopes for what could be at AC Milan. This season, Gimenez has struggled, and that was immediately clear. However, it took until the Atalanta game for it to be addressed. A scan turned into a set-back and tha"
    },
    {
      "id": "0e84a1982af8",
      "title": "‘5 in 5 years’ – Ordine highlights difference between Inter and Milan’s card numbers",
      "url": "https://sempremilan.com/ordine-highlights-differences-inter-milan-red-cards",
      "source": "sempremilan.com",
      "date": "2026-02-25T18:30:00+00:00",
      "summary": "Today, the FIGC have held a ‘referee revolution’ meeting, and Franco Ordine has brought up a rather interesting stat.  The fallout from Inter’s win against Juventus is still going on, especially with Milan pretty much out of the title race now. Perhaps it is keeping an old wound open and vulnerable "
    },
    {
      "id": "339a1d078013",
      "title": "Home advantage… or not – San Siro proving to be Milan’s biggest downfall this season",
      "url": "https://sempremilan.com/home-advantage-not-milan-downfall-this-season",
      "source": "sempremilan.com",
      "date": "2026-02-25T18:00:00+00:00",
      "summary": "San Siro is probably imagined as a bit of a fortress for some, and it may have been correct in recent years. However, AC Milan have struggled this season. As the year has gone on, it has become growingly noticeable that Milan have a problem at San Siro. Considering the record for the season, it […]\n"
    },
    {
      "id": "08ffebe89485",
      "title": "Gazzetta journalist states that Derby della Madonna ‘will be played’ on March 8",
      "url": "https://sempremilan.com/gds-journalist-states-milan-derby-played-march-8",
      "source": "sempremilan.com",
      "date": "2026-02-25T17:30:00+00:00",
      "summary": "AC Milan and Inter are still waiting for the Derby della Madonnina to be written into the calendar officially. However, it may be possible to work out when the game will take place.  Unlike many European calendars, the Italian fixture list is confirmed, at least date-wise, in a periodic basis. Whils"
    },
    {
      "id": "28cdba3bdee0",
      "title": "Falk: Inter join Milan and Arsenal in the race for out of contract Bayern star",
      "url": "https://sempremilan.com/inter-join-milan-arsenal-bayern-star",
      "source": "sempremilan.com",
      "date": "2026-02-25T17:00:00+00:00",
      "summary": "AC Milan will face further competition to sign Leon Goretzka in the summer, with a new suitor coming to light today.  It has been suggested that signing Goretzka would be a difficult feat for Milan already. In fact, they almost lost the chance to sign him in January, with Atletico Madrid seemingly o"
    },
    {
      "id": "3c55d0b0d876",
      "title": "GdS: FIGC hosting ‘referee revolution’ after recent incidents – the situation",
      "url": "https://sempremilan.com/figc-host-referee-revolution-after-incidents",
      "source": "sempremilan.com",
      "date": "2026-02-25T16:30:00+00:00",
      "summary": "AC Milan are no strangers to strange decisions, and this season has seen several questionable calls go against them, the latest of which occurred this weekend. It has been a difficult year for the officials. Indeed, throughout this season, the scrutiny on them has been higher than ever. Unfortunatel"
    },
    {
      "id": "4607c4ec9334",
      "title": "Report Allegri considering his future at Milan",
      "url": "https://football-italia.net/allegri-consider-future-milan-report/",
      "source": "football-italia.net",
      "date": "2026-02-25T10:56:20+00:00",
      "summary": "According to Sportitalia, Milan coach Massimiliano Allegri is considering his future at the club beyond..."
    },
    {
      "id": "7367715a2cf2",
      "title": "Former Serie A referee plays down controversial decisions in Milan defeat to Parma",
      "url": "https://football-italia.net/tommasi-milan-parma-open-var/",
      "source": "football-italia.net",
      "date": "2026-02-24T16:51:37+00:00",
      "summary": "Parma’s late 1-0 victory against Milan at San Siro has continued to generate significant debate..."
    },
    {
      "id": "af0191216a1b",
      "title": "Today’s Papers: Champions League, Inter-Bodo/Glimt, McKennie renewal",
      "url": "https://football-italia.net/todays-papers-champions-league-inter-bodo/",
      "source": "football-italia.net",
      "date": "2026-02-24T08:41:35+00:00",
      "summary": "La Gazzetta dello Sport  In with the goals  Champions League: Inter looking for the comeback..."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "7d1eaf8982a2",
      "title": "Serie A | Milan 0-1 Parma – Player Ratings as Troilo and Corvi batten down the hatches",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-player-ratings/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:09:16+00:00",
      "summary": "Milan fell to a late 1-0 defeat to Parma this evening, after they were unable..."
    },
    {
      "id": "0338d8d0b0d7",
      "title": "Serie A | Milan 0-1 Parma: Rossoneri suffer shocking first defeat in 24 rounds",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-shocking-defeat-24/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:05:53+00:00",
      "summary": "Milan paid the price for insipid finishing and sluggish defending, as Parma inflicted their first..."
    },
    {
      "id": "ad92e7503a8c",
      "title": "Ex-West Ham & Villa man Reo-Coker: ‘Fabregas pull on Saelemaekers inexcusable’",
      "url": "https://football-italia.net/ex-west-ham-villa-man-reo-coker-fabregas/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:50:32+00:00",
      "summary": "Former West Ham and Aston Villa midfielder turned CBS Sports Golazo pundit Nigel Reo-Coker has..."
    }
  ]
}