{
  "lastUpdated": "2026-02-12T13:04:16.535259+00:00",
  "articles": [
    {
      "id": "80b84a1b661b",
      "title": "Milan player Brignone is an Olympic champion. Compliments from Milan: \"You are a phenomenon, Fede!\"",
      "url": "https://www.milannews.it/news/la-milanista-brignone-e-campionessa-olimpica-i-complimenti-del-milan-sei-un-fenomeno-fede-607184",
      "source": "milannews.it",
      "date": "2026-02-12T12:50:57+00:00",
      "summary": "Federica Brignone is the new Olympic champion in Super G: the Milanese skier, a great AC Milan fan, won the gold medal in Cortina ahead of the French Miradoli and the Austrian Huetter."
    },
    {
      "id": "8c7c1ace3789",
      "title": "Allegri previews Pisa vs. Milan and gives injury update: ‘Pulisic only has 15-20 minutes’",
      "url": "https://football-italia.net/allegri-previews-pisa-vs-milan-injury-update/",
      "source": "football-italia.net",
      "date": "2026-02-12T12:49:06+00:00",
      "summary": "Massimiliano Allegri has shared his thoughts ahead of Milan’s upcoming Serie A clash against Pisa..."
    },
    {
      "id": "c58463a64570",
      "title": "Moretto reveals Allegri called Juventus defender: “No unanimity within the Milan world”",
      "url": "https://sempremilan.com/moretto-allegri-juventus-gatti-no-unanimity",
      "source": "sempremilan.com",
      "date": "2026-02-12T12:45:00+00:00",
      "summary": "AC Milan tried to see if there was an opening to sign Federico Gatti in the winter window, but were unable to pursue a deal. Milan were linked with a number of different central defenders during the January mercato, but in the end they decided to stay as they are. One of the most frequently […]\nThe "
    },
    {
      "id": "c04139af4bce",
      "title": "Allegri returns to Pisa where he made his debut in Serie A as a footballer: \"It's important to go happy and return happier\"",
      "url": "https://www.milannews.it/news/allegri-torna-a-pisa-dove-aveva-esordito-in-a-da-calciatore-e-importante-andare-contenti-e-tornare-piu-contenti-607167",
      "source": "milannews.it",
      "date": "2026-02-12T12:40:18+00:00",
      "summary": "These are the words of Massimiliano Allegri in the press conference on tomorrow's match against Pisa: \n\nWe return to the field after almost 10 days."
    },
    {
      "id": "b420c5d2bd27",
      "title": "Brignone, what a feat: Olympic gold in Super G. The skier is a big AC Milan fan",
      "url": "https://www.milannews.it/news/brignone-che-impresa-oro-olimpico-in-super-g-la-sciatrice-e-una-grande-tifosa-del-milan-607181",
      "source": "milannews.it",
      "date": "2026-02-12T12:30:58+00:00",
      "summary": "Historic achievement by Federica Brignone who won the gold medal in the Super G which took place this morning in Cortina valid for the Winter Olympics."
    },
    {
      "id": "2ea8e51f5a15",
      "title": "Allegri on the probable lineup: \"I'll decide after today's training. In the last half hour the changes become decisive\"",
      "url": "https://www.milannews.it/news/allegri-sulla-probabile-formazione-la-decido-dopo-l-allenamento-di-oggi-nell-ultima-mezz-ora-i-cambi-diventano-determinanti-607163",
      "source": "milannews.it",
      "date": "2026-02-12T12:20:51+00:00",
      "summary": "On the eve of the match against Pisa, Massimiliano Allegri spoke like this in the press conference about the injured players: \"Pulisic trained yesterday for the first time in the group, he is available but will have fifteen minutes..."
    },
    {
      "id": "71c32d5efbab",
      "title": "Capello explains why Allegri and Milan should try chase Inter down: “They’re the closest”",
      "url": "https://sempremilan.com/capello-why-milan-chase-inter-closest",
      "source": "sempremilan.com",
      "date": "2026-02-12T12:20:00+00:00",
      "summary": "Fabio Capello has given an updated view on how he sees the Scudetto race at present, confirming his belief that AC Milan are Inter’s main rivals. A glance at the Serie A table seems to show Inter running away with it given that they are eight points clear. However, there are four games for Milan […]"
    },
    {
      "id": "9b41add42b4c",
      "title": "Do the Milan players believe in the Scudetto? Allegri: \"It's a positive thing, we all have to aspire to the maximum\"",
      "url": "https://www.milannews.it/news/i-giocatori-del-milan-credono-nello-scudetto-allegri-e-un-cosa-positiva-tutti-dobbiamo-ambire-al-massimo-607168",
      "source": "milannews.it",
      "date": "2026-02-12T12:10:28+00:00",
      "summary": "Speaking at a press conference ahead of tomorrow's match against Pisa, Massimiliano Allegri declared on Milan's season: \n\nThe players say they believe in the championship. How do you rate it?\n\"I rate it positively."
    },
    {
      "id": "7c18e22069ef",
      "title": "Towards Pisa, Allegri: \"We need to be ready immediately. It's one of the four matches that will take us to the derby\"",
      "url": "https://www.milannews.it/news/verso-il-pisa-allegri-bisognera-essere-subito-pronti-e-una-delle-quattro-partite-che-ci-portera-al-derby-607166",
      "source": "milannews.it",
      "date": "2026-02-12T12:01:16+00:00",
      "summary": "These are the words of Massimiliano Allegri in the press conference on tomorrow's match against Pisa: \n\nWe return to the field after almost 10 days."
    },
    {
      "id": "f21e40e4567e",
      "title": "CorSport: Milan continue talks with Bayern Munich midfielder in bid to beat competition",
      "url": "https://sempremilan.com/milan-continues-talks-goretzka-bayern-atletico",
      "source": "sempremilan.com",
      "date": "2026-02-12T11:55:00+00:00",
      "summary": "AC Milan have not given up on the idea of signing Leon Goretzka, and are keeping contacts alive to see if they can pull off the coup. Goretzka’s fate was sealed last month when Christoph Freund – a director at Bayern Munich – did a press conference held together with coach Vincent Kompany, in which "
    },
    {
      "id": "3af31b9af801",
      "title": "Allegri's thoughts on referees: \"There will always be controversies. It would be nice to talk about technique...\"",
      "url": "https://www.milannews.it/news/il-pensiero-di-allegri-sugli-arbitri-ci-saranno-sempre-polemiche-sarebbe-bello-parlare-di-tecnica-607165",
      "source": "milannews.it",
      "date": "2026-02-12T11:49:05+00:00",
      "summary": "Regarding the controversy over the referees, Massimiliano Allegri explained today in a press conference at Milanello: \n\nMassimiliano Allegri's thoughts on referees:\n\"Fifty years ago there were discussions about referees."
    },
    {
      "id": "7080d4912c9e",
      "title": "Would you sign today for the Scudetto play-off with Inter? Allegri's response",
      "url": "https://www.milannews.it/news/oggi-firmerebbe-per-lo-spareggio-scudetto-con-l-inter-la-risposta-di-allegri-607170",
      "source": "milannews.it",
      "date": "2026-02-12T11:40:26+00:00",
      "summary": "Massimiliano Allegri released these statements today at a press conference:\n\nWould you sign for the Scudetto play-off with Inter today?\n\n\"(Laughs, ed.) Yes."
    },
    {
      "id": "d18491eedbef",
      "title": "Serie A, Cremonese-Milan on Sunday 1 March at 12.30",
      "url": "https://www.milannews.it/news/serie-a-cremonese-milan-domenica-1-marzo-alle-12-30-607172",
      "source": "milannews.it",
      "date": "2026-02-12T11:35:14+00:00",
      "summary": "Advances and Postponements 27th matchday Serie A\n\n27 FEBRUARY 2026\nParma-Cagliari 8.45pm DAZN\n\n28 FEBRUARY 2026\nComo-Lecce 15."
    },
    {
      "id": "5f4802a2c083",
      "title": "Gimenez, recovery is progressing well. Allegri's confirmation: \"Within a month he will be available\"",
      "url": "https://www.milannews.it/news/gimenez-il-recupero-procede-bene-la-conferma-di-allegri-nel-giro-di-un-mesetto-potra-essere-a-disposizione-607162",
      "source": "milannews.it",
      "date": "2026-02-12T11:30:14+00:00",
      "summary": "On the eve of the match against Pisa, Massimiliano Allegri spoke like this in the press conference about the injured players: \"Pulisic trained yesterday for the first time in the group, he is available but will have fifteen minutes..."
    },
    {
      "id": "b4f39f97b2b7",
      "title": "Allegri discusses injuries, favourable round, Milan’s ‘natural habitat’ and being ‘hungry for revenge’",
      "url": "https://sempremilan.com/allegri-injuries-pisa-round-milan-revenge",
      "source": "sempremilan.com",
      "date": "2026-02-12T11:30:00+00:00",
      "summary": "AC Milan head coach Massimiliano Allegri has provided a fitness update ahead of the trip to Pisa, playing down the Scudetto pursuit once again. While a glance at the present table shows Inter eight points ahead and Roma just four points back in fifth place, Milan simply have to seize the opportunity"
    },
    {
      "id": "52d63c95be76",
      "title": "LIVE MN - Allegri: \"We must be ready immediately. Pulisic has 15-20 minutes\"",
      "url": "https://www.milannews.it/primo-piano/live-mn-allegri-bisognera-essere-subito-pronti-pulisic-ha-15-20-minuti-607160",
      "source": "milannews.it",
      "date": "2026-02-12T11:22:00+00:00",
      "summary": "Friends of MilanNews.it, welcome back."
    },
    {
      "id": "ded0f7a87410",
      "title": "Allegri on Nkunku's growth: \"It's a question of settling in. He has an extraordinary technique\"",
      "url": "https://www.milannews.it/news/allegri-sulla-crescita-di-nkunku-e-una-questione-di-ambientamento-ha-una-tecnica-straordinaria-607164",
      "source": "milannews.it",
      "date": "2026-02-12T11:20:37+00:00",
      "summary": "Massimiliano Allegri, who spoke today at the press conference at Milanello, commented on Nkunku's growth and Leao's moment: \n\nHow much Allegri is there in Nkunku's rebirth?\n\"It's a matter of environment..."
    },
    {
      "id": "3e2b69a629df",
      "title": "Official: AFC Bournemouth sign Alex Jimenez on permanent transfer from Milan",
      "url": "https://football-italia.net/official-milan-sell-jimenez-to-bournemouth/",
      "source": "football-italia.net",
      "date": "2026-02-12T11:19:57+00:00",
      "summary": "Premier League side AFC Bournemouth have officially announced the signing of Alex Jimenez on a..."
    },
    {
      "id": "2883e23c03f0",
      "title": "Allegri takes stock of the injured players: \"Pulisic will have 15-20 minutes in his legs, Leao is much better. Saelemaekers out, let's see for Como\"",
      "url": "https://www.milannews.it/news/allegri-fa-il-punto-sugli-infortunati-pulisic-avra-15-20-minuti-nelle-gambe-leao-sta-molto-meglio-out-saelemaekers-vediamo-per-il-como-607161",
      "source": "milannews.it",
      "date": "2026-02-12T11:09:34+00:00",
      "summary": "On the eve of the match against Pisa, Massimiliano Allegri spoke like this in the press conference about the injured players: \"Pulisic trained yesterday for the first time in a group, he is available but he will have fifteen or twenty ..."
    },
    {
      "id": "0cc6d02b24ed",
      "title": "Tuttosport: Dilemmas in defence and attack – Allegri to make final decisions before Pisa trip",
      "url": "https://sempremilan.com/dilemmas-defence-attack-allegri-decisions-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-12T11:05:00+00:00",
      "summary": "After almost two weeks without a match, AC Milan are ready to return to Serie A action against Pisa away from home on Friday night. Ahead of this match, Massimiliano Allegri can be happy with the recovery of Christian Pulisic, while it will take a few more days to see Alexis Saelemaekers back on the"
    },
    {
      "id": "52aa88b4a393",
      "title": "In Pisa in 1987, Sacchi's AC Milan debut in Serie A: the memory of Filippo Galli",
      "url": "https://www.milannews.it/gli-ex/a-pisa-nel-1987-la-prima-in-a-del-milan-di-sacchi-il-ricordo-di-filippo-galli-607129",
      "source": "milannews.it",
      "date": "2026-02-12T11:01:34+00:00",
      "summary": "Flippo Galli, former Rossoneri defender, thus recalled to Tuttosport's microphones that Pisa-Milan on 13 September 1987, the first Serie A match of the Arrigo Sacchi-led Devil: \"The beginning of a new era, at least looking at it with ..."
    },
    {
      "id": "e84c3f40a5ab",
      "title": "Kaladze: \"In 2008 there was a terrible war in Georgia. I went to Berlusconi and he called Putin in front of me: shortly after peace was signed\"",
      "url": "https://www.milannews.it/news/kaladze-nel-2008-c-era-una-guerra-tremenda-in-georgia-io-andai-da-berlusconi-e-lui-chiamo-putin-davanti-a-me-poco-tempo-dopo-fu-firmata-la-pace-607151",
      "source": "milannews.it",
      "date": "2026-02-12T10:48:29+00:00",
      "summary": "Kakhaber Kaladze, former AC Milan player, spoke to La Gazzetta dello Sport about his memories of playing for the Rossoneri."
    },
    {
      "id": "42f85f11f3f3",
      "title": "CM: Liberali begins to shine in Serie B – the truth about his future and summer Milan exit",
      "url": "https://sempremilan.com/liberali-truth-milan-exit-future",
      "source": "sempremilan.com",
      "date": "2026-02-12T10:40:00+00:00",
      "summary": "Not much had been heard about Mattia Liberali following his rather surprising summer exit, but the weekend may have provided a turning point. As Calciomercato.com report, Catanzaro’s pursuit of the dream called Serie A can definitively add a new weapon to its arsenal. Liberali has been providing pos"
    },
    {
      "id": "56f25df024a1",
      "title": "Moretto on Gatti's future: \"Juventus will listen to offers for him in the summer\"",
      "url": "https://www.milannews.it/news/moretto-sul-futuro-di-gatti-la-juventus-ascoltera-offerte-per-lui-in-estate-607140",
      "source": "milannews.it",
      "date": "2026-02-12T10:36:45+00:00",
      "summary": "Matteo Moretto, in a video published by Fabrizio Romano's YouTube channel, spoke thus about the future of Federico Gatti, the Juventus defender who in January was also often linked to Milan: \"Gatti has a contract in himself ..."
    },
    {
      "id": "6274ca3b5877",
      "title": "Nations League 2026/2027, the draw today at 6pm: Italy in the second pot",
      "url": "https://www.milannews.it/news/nations-league-2026-2027-oggi-alle-18-il-sorteggio-italia-in-seconda-fascia-607157",
      "source": "milannews.it",
      "date": "2026-02-12T10:24:54+00:00",
      "summary": "As reported by the FIGC website, today, Thursday 12 February, the draw for the 2026/2027 UEFA Nations League is scheduled for 6pm in Brussels: \"Waiting to return to the field on 26 March in Bergamo for the semi-final of the ..."
    },
    {
      "id": "642dc092f64f",
      "title": "‘Create financial difficulties’ – Moretto highlights potential issue for Milan in Pulisic talks",
      "url": "https://sempremilan.com/moretto-potential-issue-milan-pulisic-talks",
      "source": "sempremilan.com",
      "date": "2026-02-12T10:15:00+00:00",
      "summary": "There has once again been panic spreading among the AC Milan fan base regarding Christian Pulisic’s future, and a clarification has arrived. Earlier in the week, Tuttomercatoweb published a story about Pulisic, claiming that the forward expected a contract offer from Milan by now, and that both Arse"
    },
    {
      "id": "b0e4a6ae4134",
      "title": "Roberto De Zerbi favorite to replace Tottenham",
      "url": "https://www.milannews.it/news/roberto-de-zerbi-favorito-per-la-panchina-del-tottenham-607156",
      "source": "milannews.it",
      "date": "2026-02-12T10:12:34+00:00",
      "summary": "(ANSA) - LONDON, FEBRUARY 12 - After the sudden dismissal of Thomas Frank, Tottenham fans dream of the sensational return of Mauricio Pochettino."
    },
    {
      "id": "0fd700da2a57",
      "title": "Capello: \"Milan is growing. Allegri is thinking about the Champions League, but if I were him...\"",
      "url": "https://www.milannews.it/gli-ex/capello-il-milan-sta-crescendo-allegri-pensa-alla-champions-ma-se-fossi-in-lui-607155",
      "source": "milannews.it",
      "date": "2026-02-12T10:00:40+00:00",
      "summary": "Fabio Capello, former Rossoneri coach, spoke like this about the Scudetto race on the pages of the Gazzetta dello Sport on newsstands today: \"Everyone thinks that Inter are the favourites."
    },
    {
      "id": "28f58ec2a812",
      "title": "Official: Alex Jimenez completes full AC Milan exit as Bournemouth confirm permanent deal",
      "url": "https://sempremilan.com/official-alex-jimenez-bournemouth-milan-permanent",
      "source": "sempremilan.com",
      "date": "2026-02-12T09:50:00+00:00",
      "summary": "Alex Jimenez’s move to AFC Bournemouth from AC Milan has been turned from a loan into a permanent deal, both clubs have confirmed. Jimenez joined Bournemouth towards the end of the summer transfer window on an initial loan deal. The formula was a bit more complex than that though: it included an opt"
    },
    {
      "id": "b017f06011ad",
      "title": "The QS headline: \"Milan relief: Pulisic rushes towards his return\"",
      "url": "https://www.milannews.it/news/il-qs-titola-sollievo-milan-pulisic-corre-verso-il-rientro-607134",
      "source": "milannews.it",
      "date": "2026-02-12T09:46:46+00:00",
      "summary": "The Quotidiano Sportivo headline this morning: \"Milan relief: Pulisic rushes towards his return\"."
    },
    {
      "id": "4a00219e8ebf",
      "title": "Camarda responds to silly stories after Inter answer: “My Milanismo cannot be questioned”",
      "url": "https://sempremilan.com/camarda-responds-inter-milanismo-cannot-questioned",
      "source": "sempremilan.com",
      "date": "2026-02-12T09:25:00+00:00",
      "summary": "Francesco Camarda has been forced to respond on social media after ridiculous accusations following an answer he gave about playing for Inter. It is rather remarkable that this has even become a story, but we will provide some context nonetheless. Camarda was a guest on the Panini Sport Italia YouTu"
    },
    {
      "id": "f4dab64d9e5d",
      "title": "GdS: ‘Milan chase’ – how Allegri plans to keep Inter under pressure during derby run-in",
      "url": "https://sempremilan.com/milan-chase-allegri-plans-inter-pressure",
      "source": "sempremilan.com",
      "date": "2026-02-12T09:00:00+00:00",
      "summary": "AC Milan have four league games before the derby against Inter in early March, and their mission is simple: to cut the gap. As La Gazzetta dello Sport (seen below) report, Inter currently have an eight-point lead over Milan but they have played one game more. The numbers will only balance out (more "
    },
    {
      "id": "b6c36ecd9191",
      "title": "From SOS to potential logjam: How the future of Milan’s attack could be decided in 15 games",
      "url": "https://sempremilan.com/how-future-milan-attack-decided-15-games",
      "source": "sempremilan.com",
      "date": "2026-02-11T20:01:53+00:00",
      "summary": "The attacking department has not allowed Massimiliano Allegri to rest easy this season so far, for various different reasons. We start from a premise: going int the 2025-26 season, Allegri had earmarked Rafael Leao and Christian Pulisic as the duo that he wanted to spearhead his 3-5-2 system. There "
    },
    {
      "id": "3f942ce678a8",
      "title": "De Winter talks favoured role, adaptation at Milan and first goal – video",
      "url": "https://sempremilan.com/de-winter-favoured-role-adaptation-milan-goal",
      "source": "sempremilan.com",
      "date": "2026-02-11T18:55:27+00:00",
      "summary": "Koni De Winter has given a third interview to the media in the past 24 hours, this time speaking to AC Milan’s official channels. It would be fair to say that De Winter is in demand, having already spoken to SportMediaset and Tuttosport over the past day. It is deserved time in the limelight for […]"
    },
    {
      "id": "b8aff92d98d7",
      "title": "GdS: Barcelona ‘obstacle’, salary, Milan interest – why Vlahovic is taking time over his future",
      "url": "https://sempremilan.com/barcelona-salary-milan-interest-vlahovic-future",
      "source": "sempremilan.com",
      "date": "2026-02-11T18:14:22+00:00",
      "summary": "Dusan Vlahovic has not yet made a decision regarding his future beyond this season yet, but AC Milan are at the window. Vlahovic’s five years with Juventus have seen him rack up 162 appearances so far, with 64 goals and 16 assists. He has six goals this season – three each in Serie A and […]\nThe pos"
    },
    {
      "id": "f17bb4131b53",
      "title": "MN: Milan fans left angry again after ‘unorganised’ Pisa ticketing situation – the reasons",
      "url": "https://sempremilan.com/milan-fans-angry-pisa-the-reasons",
      "source": "sempremilan.com",
      "date": "2026-02-11T17:47:03+00:00",
      "summary": "There is once again drama concerning AC Milan’s away sector in the build-up to a game, this time Friday’s trip to Pisa. As MilanNews report, Milan fans ‘have suffered yet more deplorable organisational treatment’ regarding the sale of away tickets. For the game at the Arena Garibaldi, there was no p"
    },
    {
      "id": "ac9876ea2425",
      "title": "‘Needs to be addressed’ – Gazzetta journalist confirms Pulisic-Milan contract ‘stalemate’",
      "url": "https://sempremilan.com/gazzetta-pulisic-milan-contract-stalemate",
      "source": "sempremilan.com",
      "date": "2026-02-11T17:00:00+00:00",
      "summary": "Christian Pulisic’s contract with AC Milan officially expires at the end of next season, and the club must work on his renewal. There is no doubting that Pulisic has been probably Milan’s most consistent player since his arrival from Chelsea in 2023. In fact, he has recorded 42 goals and 25 assists "
    },
    {
      "id": "e758f584091a",
      "title": "Camarda answers questions from kids on Milan debut, opponents and possible future at Inter",
      "url": "https://sempremilan.com/camarda-milan-debut-opponents-inter",
      "source": "sempremilan.com",
      "date": "2026-02-11T16:30:00+00:00",
      "summary": "Francesco Camarda did not rule out the idea of joining Inter one day, while he recalled some of his favourite memories from his young career. Last season, Camarda earned the distinction of becoming the youngest debutant in Serie A history, making his first appearance for Milan on 25 November 2023. H"
    },
    {
      "id": "ba5343954769",
      "title": "MN: Fight for minutes and to stay at Milan – Gimenez to face immediate crossroads",
      "url": "https://sempremilan.com/fight-minutes-gimenez-immediate-crossroads-milan",
      "source": "sempremilan.com",
      "date": "2026-02-11T16:00:00+00:00",
      "summary": "AC Milan are waiting for Santiago Gimenez, hoping that he can provide a valuable production in the final part of the season. As MilanNews write, Milan have been waiting for practically a year now for Gimenez to show his worth, ever since his €32m arrival from Feyenoord. The recent period has been es"
    },
    {
      "id": "388489af4709",
      "title": "Romano reveals figures of Jimenez sale to Bournemouth: “Good news for AC Milan’s coffers”",
      "url": "https://sempremilan.com/romano-figures-jimenez-bournemouth-sale",
      "source": "sempremilan.com",
      "date": "2026-02-11T15:30:00+00:00",
      "summary": "Alex Jimenez’s move to AFC Bournemouth has now been made permanent after a series of targets were hit, it has been confirmed. The Spanish full-back left Milan in the summer window despite showing signs of his potential during his stint at the club. He joined Bournemouth on loan with an option to buy"
    },
    {
      "id": "6b7c62dbc4ab",
      "title": "How much Milan and Real Madrid earn from Jimenez’s Bournemouth move as documents signed",
      "url": "https://football-italia.net/milan-real-madrid-earn-jimenez-bournemouth/",
      "source": "football-italia.net",
      "date": "2026-02-11T15:20:29+00:00",
      "summary": "Fabrizio Romano confirms that Milan and Bournemouth have signed the documents for Alex Jimenez’s permanent..."
    },
    {
      "id": "59a750d454c0",
      "title": "‘Top-quality’ striker and Nkunku stay – Journalist reveals predictions for Milan’s attack",
      "url": "https://sempremilan.com/top-striker-nkunku-stay-predictions-attack",
      "source": "sempremilan.com",
      "date": "2026-02-11T15:00:00+00:00",
      "summary": "AC Milan will sign a top-level striker in the summer window, according to La Gazzetta dello Sport journalist Marco Guidi. The ongoing physical problems that Christian Pulisic and Rafael Leao were battling saw Milan agree a deal for Jean-Philippe Mateta with Crystal Palace worth €30-35m. It seemed th"
    },
    {
      "id": "413696c0d798",
      "title": "Sky: Milan’s atmosphere change evident – 70 players and staff enjoy fine-funded dinner",
      "url": "https://sempremilan.com/70-players-staff-milan-fine-funded-dinner",
      "source": "sempremilan.com",
      "date": "2026-02-11T14:30:00+00:00",
      "summary": "In the space of a year, the atmosphere at AC Milan has completely changed, and there are signs of this that continue to emerge. Last season, Milan were in the headlines constantly for the wrong reasons. There was the cooling break incident against Lazio, the penalty mutiny in the defeat to Fiorentin"
    },
    {
      "id": "12df281becc6",
      "title": "Milan handed Pulisic injury boost for Pisa clash",
      "url": "https://football-italia.net/milan-pulisic-injury-boost-for-pisa-clash/",
      "source": "football-italia.net",
      "date": "2026-02-11T14:19:12+00:00",
      "summary": "Milan star Christian Pulisic returned to group training on Wednesday, meaning he’ll probably be available..."
    },
    {
      "id": "6cf456b44487",
      "title": "De Winter hopes Milan help him get Belgium 2026 World Cup spot",
      "url": "https://football-italia.net/de-winter-hope-milan-beligum-spot-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-11T11:44:07+00:00",
      "summary": "Milan defender Koni De Winter hopes that his performances with the Rossoneri this season will..."
    },
    {
      "id": "394a459f8eaf",
      "title": "Mateta mystery deepens, Crystal Palace insist failed Milan transfer ‘does not need surgery’",
      "url": "https://football-italia.net/mateta-mystery-crystal-palacefailed-milan-move/",
      "source": "football-italia.net",
      "date": "2026-02-10T17:19:18+00:00",
      "summary": "Jean-Philippe Mateta failed a medical test with Milan to scupper his €30m transfer from Crystal..."
    },
    {
      "id": "44962c2fbe63",
      "title": "Jimenez feared limited Milan playing time, Nico Paz ‘ready’ for Real Madrid return",
      "url": "https://football-italia.net/jimenez-fear-limited-milan-time-paz-madrid/",
      "source": "football-italia.net",
      "date": "2026-02-10T14:42:00+00:00",
      "summary": "Alex Jimenez feared he’d get limited playing time at Milan, so he joined Bournemouth last..."
    },
    {
      "id": "303da62cf040",
      "title": "Report Pulisic waits for Milan contract offer as Liverpool and Arsenal loom",
      "url": "https://football-italia.net/pulisic-waits-milan-contract-liverpool-arsenal/",
      "source": "football-italia.net",
      "date": "2026-02-10T12:04:47+00:00",
      "summary": "Liverpool and Arsenal are reportedly interested in Milan star Christian Pulisic, who hasn’t yet received..."
    },
    {
      "id": "f688f227c904",
      "title": "Gattuso meets Italy players across the globe ahead of World Cup play-off",
      "url": "https://football-italia.net/gattuso-meets-italy-players-globe-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:54:51+00:00",
      "summary": "Denied a training retreat this month, Italy coach Gennaro Gattuso has taken his World Cup..."
    },
    {
      "id": "e43af22dbbb7",
      "title": "Nkunku: France have three teams to win World Cup, Rabiot ‘a beast’",
      "url": "https://football-italia.net/france-3-teams-win-world-cup-rabiot-beast/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:23:18+00:00",
      "summary": "During his interview with Gazzetta dello Sport, Milan striker Christopher Nkunku praised many of his Rossoneri..."
    },
    {
      "id": "b12a747674d2",
      "title": "Nkunku: ‘Never’ wanted to leave Milan, Ibrahimovic hasn’t changed",
      "url": "https://football-italia.net/nkunku-never-wanted-leave-milan-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:00:31+00:00",
      "summary": "Milan striker Christopher Nkunku insists he didn’t consider leaving the Rossoneri in the January transfer..."
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    }
  ]
}