{
  "lastUpdated": "2026-02-12T10:44:02.469971+00:00",
  "articles": [
    {
      "id": "42f85f11f3f3",
      "title": "CM: Liberali begins to shine in Serie B – the truth about his future and summer Milan exit",
      "url": "https://sempremilan.com/liberali-truth-milan-exit-future",
      "source": "sempremilan.com",
      "date": "2026-02-12T10:40:00+00:00",
      "summary": "Not much had been heard about Mattia Liberali following his rather surprising summer exit, but the weekend may have provided a turning point. As Calciomercato.com report, Catanzaro’s pursuit of the dream called Serie A can definitively add a new weapon to its arsenal. Liberali has been providing pos"
    },
    {
      "id": "56f25df024a1",
      "title": "Moretto on Gatti's future: \"Juventus will listen to offers for him in the summer\"",
      "url": "https://www.milannews.it/news/moretto-sul-futuro-di-gatti-la-juventus-ascoltera-offerte-per-lui-in-estate-607140",
      "source": "milannews.it",
      "date": "2026-02-12T10:36:45+00:00",
      "summary": "Matteo Moretto, in a video published by Fabrizio Romano's YouTube channel, spoke thus about the future of Federico Gatti, the Juventus defender who in January was also often linked to Milan: \"Gatti has a contract in himself ..."
    },
    {
      "id": "6274ca3b5877",
      "title": "Nations League 2026/2027, the draw today at 6pm: Italy in the second pot",
      "url": "https://www.milannews.it/news/nations-league-2026-2027-oggi-alle-18-il-sorteggio-italia-in-seconda-fascia-607157",
      "source": "milannews.it",
      "date": "2026-02-12T10:24:54+00:00",
      "summary": "As reported by the FIGC website, today, Thursday 12 February, the draw for the 2026/2027 UEFA Nations League is scheduled for 6pm in Brussels: \"Waiting to return to the field on 26 March in Bergamo for the semi-final of the ..."
    },
    {
      "id": "642dc092f64f",
      "title": "‘Create financial difficulties’ – Moretto highlights potential issue for Milan in Pulisic talks",
      "url": "https://sempremilan.com/moretto-potential-issue-milan-pulisic-talks",
      "source": "sempremilan.com",
      "date": "2026-02-12T10:15:00+00:00",
      "summary": "There has once again been panic spreading among the AC Milan fan base regarding Christian Pulisic’s future, and a clarification has arrived. Earlier in the week, Tuttomercatoweb published a story about Pulisic, claiming that the forward expected a contract offer from Milan by now, and that both Arse"
    },
    {
      "id": "b0e4a6ae4134",
      "title": "Roberto De Zerbi favorite to replace Tottenham",
      "url": "https://www.milannews.it/news/roberto-de-zerbi-favorito-per-la-panchina-del-tottenham-607156",
      "source": "milannews.it",
      "date": "2026-02-12T10:12:34+00:00",
      "summary": "(ANSA) - LONDON, FEBRUARY 12 - After the sudden dismissal of Thomas Frank, Tottenham fans dream of the sensational return of Mauricio Pochettino."
    },
    {
      "id": "0fd700da2a57",
      "title": "Capello: \"Milan is growing. Allegri is thinking about the Champions League, but if I were him...\"",
      "url": "https://www.milannews.it/gli-ex/capello-il-milan-sta-crescendo-allegri-pensa-alla-champions-ma-se-fossi-in-lui-607155",
      "source": "milannews.it",
      "date": "2026-02-12T10:00:40+00:00",
      "summary": "Fabio Capello, former Rossoneri coach, spoke like this about the Scudetto race on the pages of the Gazzetta dello Sport on newsstands today: \"Everyone thinks that Inter are the favourites."
    },
    {
      "id": "28f58ec2a812",
      "title": "Official: Alex Jimenez completes full AC Milan exit as Bournemouth confirm permanent deal",
      "url": "https://sempremilan.com/official-alex-jimenez-bournemouth-milan-permanent",
      "source": "sempremilan.com",
      "date": "2026-02-12T09:50:00+00:00",
      "summary": "Alex Jimenez’s move to AFC Bournemouth from AC Milan has been turned from a loan into a permanent deal, both clubs have confirmed. Jimenez joined Bournemouth towards the end of the summer transfer window on an initial loan deal. The formula was a bit more complex than that though: it included an opt"
    },
    {
      "id": "b017f06011ad",
      "title": "The QS headline: \"Milan relief: Pulisic rushes towards his return\"",
      "url": "https://www.milannews.it/news/il-qs-titola-sollievo-milan-pulisic-corre-verso-il-rientro-607134",
      "source": "milannews.it",
      "date": "2026-02-12T09:46:46+00:00",
      "summary": "The Quotidiano Sportivo headline this morning: \"Milan relief: Pulisic rushes towards his return\"."
    },
    {
      "id": "c65610665473",
      "title": "Milan, Rafael Leao's condition is improving",
      "url": "https://www.milannews.it/news/milan-in-miglioramento-le-condizioni-di-rafael-leao-607123",
      "source": "milannews.it",
      "date": "2026-02-12T09:34:07+00:00",
      "summary": "These days without matches have been useful for Milan to recover some injured players such as Christan Pulisic and also to improve the condition of some injured players, including for example Rafael Leao who has been conditioned for weeks now..."
    },
    {
      "id": "4a00219e8ebf",
      "title": "Camarda responds to silly stories after Inter answer: “My Milanismo cannot be questioned”",
      "url": "https://sempremilan.com/camarda-responds-inter-milanismo-cannot-questioned",
      "source": "sempremilan.com",
      "date": "2026-02-12T09:25:00+00:00",
      "summary": "Francesco Camarda has been forced to respond on social media after ridiculous accusations following an answer he gave about playing for Inter. It is rather remarkable that this has even become a story, but we will provide some context nonetheless. Camarda was a guest on the Panini Sport Italia YouTu"
    },
    {
      "id": "ec74dad3e97c",
      "title": "OFFICIAL: Bournemouth have signed Alex Jimenez",
      "url": "https://www.milannews.it/calciomercato-milan/ufficiale-il-bournemouth-ha-riscattato-alex-jimenez-607158",
      "source": "milannews.it",
      "date": "2026-02-12T09:22:24+00:00",
      "summary": "Through its official website, Bournemouth announced that it has bought Alex Jimenez from Milan and is therefore now a player owned by the English club: \"AFC Bournemouth can confirm that Alex Jimé..."
    },
    {
      "id": "a869d5961d31",
      "title": "Moretto on Pulisic's contract: \"There is a renewal option until 2028 in favor of Milan which Milan will certainly exercise\"",
      "url": "https://www.milannews.it/calciomercato-milan/moretto-sul-contratto-di-pulisic-c-e-un-opzione-di-rinnovo-fino-al-2028-a-favore-del-milan-che-il-milan-sicuramente-esercitera-607110",
      "source": "milannews.it",
      "date": "2026-02-12T09:10:46+00:00",
      "summary": "On Fabrizio Romano's YouTube channel, Matteo Moretto spoke about Pulisic's renewal. These are his words: \"There is a lot of talk about the possible renewal of Pulisic, in short the possibility that he might not renew."
    },
    {
      "id": "3e64e48331c2",
      "title": "Pisa, Como, Parma and Cremonese: Milan, a string of victories to get closer to Inter before the derby",
      "url": "https://www.milannews.it/primo-piano/pisa-como-parma-e-cremonese-milan-un-filotto-di-vittorie-per-avvicinarsi-all-inter-prima-del-derby-607154",
      "source": "milannews.it",
      "date": "2026-02-12T09:00:26+00:00",
      "summary": "There is still just under a month to go, but there is already a lot of talk about the Milan derby scheduled for 7 or 8 March at San Siro between the two teams, Milan and Inter, who are currently in second and first place in the table respectively."
    },
    {
      "id": "f4dab64d9e5d",
      "title": "GdS: ‘Milan chase’ – how Allegri plans to keep Inter under pressure during derby run-in",
      "url": "https://sempremilan.com/milan-chase-allegri-plans-inter-pressure",
      "source": "sempremilan.com",
      "date": "2026-02-12T09:00:00+00:00",
      "summary": "AC Milan have four league games before the derby against Inter in early March, and their mission is simple: to cut the gap. As La Gazzetta dello Sport (seen below) report, Inter currently have an eight-point lead over Milan but they have played one game more. The numbers will only balance out (more "
    },
    {
      "id": "ab86b8ccb323",
      "title": "CorSport: \"Goretzka is tempting, Milan tries to blitz\"",
      "url": "https://www.milannews.it/rassegna-stampa/corsport-goretzka-fa-gola-il-milan-tenta-il-blitz-607141",
      "source": "milannews.it",
      "date": "2026-02-12T08:47:58+00:00",
      "summary": "\"Goretzka is tempting, Milan tries to blitz\": this is the headline in Corriere dello Sport this morning, explaining that the Devil is also among the many clubs who are on the trail of Leon Goretzka, a midfielder who will leave ..."
    },
    {
      "id": "d0ae856fe09a",
      "title": "Max returns to Pisa. Gazzetta: \"Allegri, this is special. In 1989 the debut in Serie A, tomorrow the great return\"",
      "url": "https://www.milannews.it/rassegna-stampa/max-torna-a-pisa-gazzetta-allegri-questa-e-speciale-nel-1989-l-esordio-in-a-domani-il-grande-ritorno-607122",
      "source": "milannews.it",
      "date": "2026-02-12T08:35:10+00:00",
      "summary": "Tomorrow's match at Pisa will certainly be a special match for Massimiliano Allegri who, as a footballer, made his debut in Serie A with that shirt and in that stadium. \"Allegri, this is special."
    },
    {
      "id": "d4bfe8a788cd",
      "title": "Moretto: \"Allegri-Gatti phone call in January: this is why Milan didn't sink\"",
      "url": "https://www.milannews.it/calciomercato-milan/moretto-a-gennaio-telefonata-allegri-gatti-ecco-perche-il-milan-non-ha-affondato-607139",
      "source": "milannews.it",
      "date": "2026-02-12T08:23:33+00:00",
      "summary": "Matteo Moretto, in a video published by Fabrizio Romano's YouTube channel, spoke thus about the future of Federico Gatti, the Juventus defender who in January was also often linked to Milan: \"Gatti has a contract in himself ..."
    },
    {
      "id": "bcb0c8020108",
      "title": "Milan, Saelemaekers also misses Pisa: we hope to recover him for Como",
      "url": "https://www.milannews.it/rassegna-stampa/milan-saelemaekers-salta-anche-il-pisa-si-spera-di-recuperarlo-per-il-como-607120",
      "source": "milannews.it",
      "date": "2026-02-12T08:11:12+00:00",
      "summary": "If Christian Pulisic is recovered for tomorrow's away match at Pisa, the same cannot be said of Alexis Saelemaekers who has not yet returned to work in the group and therefore, after Bologna, he will be forced to know..."
    },
    {
      "id": "3bbddfde8a3d",
      "title": "F.Galli has no doubts: \"In Italy there was football before and after Sacchi\"",
      "url": "https://www.milannews.it/gli-ex/f-galli-non-ha-dubbi-in-italia-c-e-stato-un-calcio-prima-e-dopo-sacchi-607128",
      "source": "milannews.it",
      "date": "2026-02-12T07:59:40+00:00",
      "summary": "Interviewed by Tuttosport, former Rossoneri defender Filippo Galli spoke thus of Arrigo Sacchi: \"How was Sacchi in training? Obsessive, attentive to the smallest detail."
    },
    {
      "id": "3f58ec0231e5",
      "title": "Towards Pisa-Milan, Gazzetta: \"Loftus-Cheek hopes for confirmation. Pulisic on the bench, Saelemaekers knocked out\"",
      "url": "https://www.milannews.it/rassegna-stampa/verso-pisa-milan-gazzetta-loftus-cheek-spera-nella-conferma-pulisic-in-panchina-saelemaekers-ko-607112",
      "source": "milannews.it",
      "date": "2026-02-12T07:48:19+00:00",
      "summary": "\"Loftus-Cheek hopes for confirmation. Pulisic on the bench, Saelemaekers knocked out\": this is the headline in La Gazzetta dello Sport this morning in view of Milan's match against Pisa tomorrow evening."
    },
    {
      "id": "8e0efe49aa44",
      "title": "Moretto: \"Pulisic renewal? Pay attention to the growth decree\"",
      "url": "https://www.milannews.it/calciomercato-milan/moretto-rinnovo-pulisic-attenzione-al-decreto-crescita-607104",
      "source": "milannews.it",
      "date": "2026-02-12T07:36:52+00:00",
      "summary": "On Fabrizio Romano's YouTube channel, Matteo Moretto spoke about Pulisic's renewal. These are his words: \"There is a lot of talk about the possible renewal of Pulisic, in short the possibility that he might not renew."
    },
    {
      "id": "9166a1fda2ee",
      "title": "Tuttosport headline: \"Milan, now spin without going off the road\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-titola-milan-ora-testa-coda-senza-uscire-di-strada-607107",
      "source": "milannews.it",
      "date": "2026-02-12T07:24:15+00:00",
      "summary": "Tuttosport on newsstands this morning with the headline: \"Milan, now spin without going off the road\"."
    },
    {
      "id": "5b19ce5472c2",
      "title": "Gazzetta: \"Milan chase. Short distance derby: the Devil's plan begins with Pisa\"",
      "url": "https://www.milannews.it/rassegna-stampa/gazzetta-rincorsa-milan-derby-a-distanza-ridotta-il-piano-del-diavolo-comincia-con-il-pisa-607105",
      "source": "milannews.it",
      "date": "2026-02-12T07:12:22+00:00",
      "summary": "Today's edition of the Gazzetta dello Sport on newsstands this morning has the headline: \"Milan run-up. Short distance derby: the Devil's plan begins with Pisa\"."
    },
    {
      "id": "1cb79ab0a05e",
      "title": "Milan, Pulisic recovered for Pisa. Allegri's possible choices",
      "url": "https://www.milannews.it/primo-piano/milan-pulisic-recuperato-per-pisa-le-possibili-scelte-di-allegri-607103",
      "source": "milannews.it",
      "date": "2026-02-12T07:00:33+00:00",
      "summary": "After almost two weeks without matches, Milan is ready to return to the field in an official match: tomorrow evening the Rossoneri will be playing at Pisa in the first match of the 25th matchday of Serie A."
    },
    {
      "id": "760f9a572875",
      "title": "Primavera, Milan on the pitch on Saturday against Genoa: complete program and standings",
      "url": "https://www.milannews.it/la-primavera/primavera-milan-in-campo-sabato-contro-il-genoa-programma-completo-e-classifica-607102",
      "source": "milannews.it",
      "date": "2026-02-12T06:48:00+00:00",
      "summary": "Below is the program for the 25th day of the Primavera 1 championship and the updated rankings. \n\n25TH DAY PROGRAM \n\nSATURDAY 14/02\nCremonese - Frosinone h."
    },
    {
      "id": "b6c36ecd9191",
      "title": "From SOS to potential logjam: How the future of Milan’s attack could be decided in 15 games",
      "url": "https://sempremilan.com/how-future-milan-attack-decided-15-games",
      "source": "sempremilan.com",
      "date": "2026-02-11T20:01:53+00:00",
      "summary": "The attacking department has not allowed Massimiliano Allegri to rest easy this season so far, for various different reasons. We start from a premise: going int the 2025-26 season, Allegri had earmarked Rafael Leao and Christian Pulisic as the duo that he wanted to spearhead his 3-5-2 system. There "
    },
    {
      "id": "3f942ce678a8",
      "title": "De Winter talks favoured role, adaptation at Milan and first goal – video",
      "url": "https://sempremilan.com/de-winter-favoured-role-adaptation-milan-goal",
      "source": "sempremilan.com",
      "date": "2026-02-11T18:55:27+00:00",
      "summary": "Koni De Winter has given a third interview to the media in the past 24 hours, this time speaking to AC Milan’s official channels. It would be fair to say that De Winter is in demand, having already spoken to SportMediaset and Tuttosport over the past day. It is deserved time in the limelight for […]"
    },
    {
      "id": "b8aff92d98d7",
      "title": "GdS: Barcelona ‘obstacle’, salary, Milan interest – why Vlahovic is taking time over his future",
      "url": "https://sempremilan.com/barcelona-salary-milan-interest-vlahovic-future",
      "source": "sempremilan.com",
      "date": "2026-02-11T18:14:22+00:00",
      "summary": "Dusan Vlahovic has not yet made a decision regarding his future beyond this season yet, but AC Milan are at the window. Vlahovic’s five years with Juventus have seen him rack up 162 appearances so far, with 64 goals and 16 assists. He has six goals this season – three each in Serie A and […]\nThe pos"
    },
    {
      "id": "f17bb4131b53",
      "title": "MN: Milan fans left angry again after ‘unorganised’ Pisa ticketing situation – the reasons",
      "url": "https://sempremilan.com/milan-fans-angry-pisa-the-reasons",
      "source": "sempremilan.com",
      "date": "2026-02-11T17:47:03+00:00",
      "summary": "There is once again drama concerning AC Milan’s away sector in the build-up to a game, this time Friday’s trip to Pisa. As MilanNews report, Milan fans ‘have suffered yet more deplorable organisational treatment’ regarding the sale of away tickets. For the game at the Arena Garibaldi, there was no p"
    },
    {
      "id": "ac9876ea2425",
      "title": "‘Needs to be addressed’ – Gazzetta journalist confirms Pulisic-Milan contract ‘stalemate’",
      "url": "https://sempremilan.com/gazzetta-pulisic-milan-contract-stalemate",
      "source": "sempremilan.com",
      "date": "2026-02-11T17:00:00+00:00",
      "summary": "Christian Pulisic’s contract with AC Milan officially expires at the end of next season, and the club must work on his renewal. There is no doubting that Pulisic has been probably Milan’s most consistent player since his arrival from Chelsea in 2023. In fact, he has recorded 42 goals and 25 assists "
    },
    {
      "id": "e758f584091a",
      "title": "Camarda answers questions from kids on Milan debut, opponents and possible future at Inter",
      "url": "https://sempremilan.com/camarda-milan-debut-opponents-inter",
      "source": "sempremilan.com",
      "date": "2026-02-11T16:30:00+00:00",
      "summary": "Francesco Camarda did not rule out the idea of joining Inter one day, while he recalled some of his favourite memories from his young career. Last season, Camarda earned the distinction of becoming the youngest debutant in Serie A history, making his first appearance for Milan on 25 November 2023. H"
    },
    {
      "id": "ba5343954769",
      "title": "MN: Fight for minutes and to stay at Milan – Gimenez to face immediate crossroads",
      "url": "https://sempremilan.com/fight-minutes-gimenez-immediate-crossroads-milan",
      "source": "sempremilan.com",
      "date": "2026-02-11T16:00:00+00:00",
      "summary": "AC Milan are waiting for Santiago Gimenez, hoping that he can provide a valuable production in the final part of the season. As MilanNews write, Milan have been waiting for practically a year now for Gimenez to show his worth, ever since his €32m arrival from Feyenoord. The recent period has been es"
    },
    {
      "id": "388489af4709",
      "title": "Romano reveals figures of Jimenez sale to Bournemouth: “Good news for AC Milan’s coffers”",
      "url": "https://sempremilan.com/romano-figures-jimenez-bournemouth-sale",
      "source": "sempremilan.com",
      "date": "2026-02-11T15:30:00+00:00",
      "summary": "Alex Jimenez’s move to AFC Bournemouth has now been made permanent after a series of targets were hit, it has been confirmed. The Spanish full-back left Milan in the summer window despite showing signs of his potential during his stint at the club. He joined Bournemouth on loan with an option to buy"
    },
    {
      "id": "6b7c62dbc4ab",
      "title": "How much Milan and Real Madrid earn from Jimenez’s Bournemouth move as documents signed",
      "url": "https://football-italia.net/milan-real-madrid-earn-jimenez-bournemouth/",
      "source": "football-italia.net",
      "date": "2026-02-11T15:20:29+00:00",
      "summary": "Fabrizio Romano confirms that Milan and Bournemouth have signed the documents for Alex Jimenez’s permanent..."
    },
    {
      "id": "59a750d454c0",
      "title": "‘Top-quality’ striker and Nkunku stay – Journalist reveals predictions for Milan’s attack",
      "url": "https://sempremilan.com/top-striker-nkunku-stay-predictions-attack",
      "source": "sempremilan.com",
      "date": "2026-02-11T15:00:00+00:00",
      "summary": "AC Milan will sign a top-level striker in the summer window, according to La Gazzetta dello Sport journalist Marco Guidi. The ongoing physical problems that Christian Pulisic and Rafael Leao were battling saw Milan agree a deal for Jean-Philippe Mateta with Crystal Palace worth €30-35m. It seemed th"
    },
    {
      "id": "413696c0d798",
      "title": "Sky: Milan’s atmosphere change evident – 70 players and staff enjoy fine-funded dinner",
      "url": "https://sempremilan.com/70-players-staff-milan-fine-funded-dinner",
      "source": "sempremilan.com",
      "date": "2026-02-11T14:30:00+00:00",
      "summary": "In the space of a year, the atmosphere at AC Milan has completely changed, and there are signs of this that continue to emerge. Last season, Milan were in the headlines constantly for the wrong reasons. There was the cooling break incident against Lazio, the penalty mutiny in the defeat to Fiorentin"
    },
    {
      "id": "12df281becc6",
      "title": "Milan handed Pulisic injury boost for Pisa clash",
      "url": "https://football-italia.net/milan-pulisic-injury-boost-for-pisa-clash/",
      "source": "football-italia.net",
      "date": "2026-02-11T14:19:12+00:00",
      "summary": "Milan star Christian Pulisic returned to group training on Wednesday, meaning he’ll probably be available..."
    },
    {
      "id": "3a766bc033ef",
      "title": "Conte mentions Milan in Scudetto assessment but loses cool after Como loss: “Serious problems”",
      "url": "https://sempremilan.com/conte-milan-loses-cool-scudetto-como",
      "source": "sempremilan.com",
      "date": "2026-02-11T14:00:00+00:00",
      "summary": "Antonio Conte was not happy about Napoli being eliminated from the Coppa Italia, and once again spoke about the Scudetto race. Conte’s side experienced another bad night on Tuesday as they were beaten on penalties by Como in the quarter-finals of the Coppa Italia. It means that the club from the lak"
    },
    {
      "id": "5c37982ca415",
      "title": "Tuttosport: Why Allegri is tempted to give Füllkrug a start against Pisa",
      "url": "https://sempremilan.com/why-allegri-tempted-fullkrug-start-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-11T13:35:00+00:00",
      "summary": "Massimiliano Allegri is studying the best attacking duo to field against Pisa, and one temptation in particular is growing. The build-up to Friday’s match in Tuscany against Pisa is in full swing, and Allegri has some tough decisions to make. With Rafael Leão’s recovery appears to be confirmed and C"
    },
    {
      "id": "014667952e7f",
      "title": "MN: Milan given big pre-Pisa boost as Pulisic returns to full training – the latest",
      "url": "https://sempremilan.com/pulisic-returns-to-full-training-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-11T13:10:00+00:00",
      "summary": "AC Milan were back in training again at Milanello two days before the trip to Pisa, and some good news came regarding Christian Pulisic. MilanNews are reporting that Christian Pulisic returned to training with the rest of the squad this morning. The American had been training separately in recent da"
    },
    {
      "id": "920f190ef582",
      "title": "De Winter reveals childhood bond with Milan including father’s plan to name him after Seedorf",
      "url": "https://sempremilan.com/de-winter-childhood-bond-milan-seedorf",
      "source": "sempremilan.com",
      "date": "2026-02-11T12:45:00+00:00",
      "summary": "AC Milan central defender Koni De Winter seems to be doing the media rounds at the moment, and has given another interview this morning. Having signed from Genoa in the summer mercato, De Winter initially had to make do with being the fourth choice centre-back, with Fikayo Tomori, Matteo Gabbia and "
    },
    {
      "id": "c75f61a00269",
      "title": "CorSport: ‘Seduced and abandoned’ – why Paratici could complicate Milan’s striker plan",
      "url": "https://sempremilan.com/why-paratici-complicate-milan-striker-furlani",
      "source": "sempremilan.com",
      "date": "2026-02-11T12:20:00+00:00",
      "summary": "AC Milan are evaluating making a move for Moise Kean in view of the summer, but Fabio Paritici could complicate matters. This morning’s Corriere dello Sport (via MN24) urges caution regarding the names Dusan Vlahovic and Moise Kean, suggesting that Giorgio Furlani and Zlatan Ibrahimovic ‘s strategy "
    },
    {
      "id": "6cf456b44487",
      "title": "De Winter hopes Milan help him get Belgium 2026 World Cup spot",
      "url": "https://football-italia.net/de-winter-hope-milan-beligum-spot-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-11T11:44:07+00:00",
      "summary": "Milan defender Koni De Winter hopes that his performances with the Rossoneri this season will..."
    },
    {
      "id": "394a459f8eaf",
      "title": "Mateta mystery deepens, Crystal Palace insist failed Milan transfer ‘does not need surgery’",
      "url": "https://football-italia.net/mateta-mystery-crystal-palacefailed-milan-move/",
      "source": "football-italia.net",
      "date": "2026-02-10T17:19:18+00:00",
      "summary": "Jean-Philippe Mateta failed a medical test with Milan to scupper his €30m transfer from Crystal..."
    },
    {
      "id": "44962c2fbe63",
      "title": "Jimenez feared limited Milan playing time, Nico Paz ‘ready’ for Real Madrid return",
      "url": "https://football-italia.net/jimenez-fear-limited-milan-time-paz-madrid/",
      "source": "football-italia.net",
      "date": "2026-02-10T14:42:00+00:00",
      "summary": "Alex Jimenez feared he’d get limited playing time at Milan, so he joined Bournemouth last..."
    },
    {
      "id": "303da62cf040",
      "title": "Report Pulisic waits for Milan contract offer as Liverpool and Arsenal loom",
      "url": "https://football-italia.net/pulisic-waits-milan-contract-liverpool-arsenal/",
      "source": "football-italia.net",
      "date": "2026-02-10T12:04:47+00:00",
      "summary": "Liverpool and Arsenal are reportedly interested in Milan star Christian Pulisic, who hasn’t yet received..."
    },
    {
      "id": "f688f227c904",
      "title": "Gattuso meets Italy players across the globe ahead of World Cup play-off",
      "url": "https://football-italia.net/gattuso-meets-italy-players-globe-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:54:51+00:00",
      "summary": "Denied a training retreat this month, Italy coach Gennaro Gattuso has taken his World Cup..."
    },
    {
      "id": "e43af22dbbb7",
      "title": "Nkunku: France have three teams to win World Cup, Rabiot ‘a beast’",
      "url": "https://football-italia.net/france-3-teams-win-world-cup-rabiot-beast/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:23:18+00:00",
      "summary": "During his interview with Gazzetta dello Sport, Milan striker Christopher Nkunku praised many of his Rossoneri..."
    },
    {
      "id": "b12a747674d2",
      "title": "Nkunku: ‘Never’ wanted to leave Milan, Ibrahimovic hasn’t changed",
      "url": "https://football-italia.net/nkunku-never-wanted-leave-milan-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:00:31+00:00",
      "summary": "Milan striker Christopher Nkunku insists he didn’t consider leaving the Rossoneri in the January transfer..."
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    }
  ]
}