{
  "lastUpdated": "2026-02-11T17:14:14.875410+00:00",
  "articles": [
    {
      "id": "2e0c8777f82d",
      "title": "Passerini: \"To date I can't tell you if Athekame can have the necessary continuity to be able, in my opinion, to almost permanently replace Saelemaekers\"",
      "url": "https://www.milannews.it/news/passerini-ad-oggi-non-so-dirti-se-athekame-puo-avere-la-continuita-necessaria-per-poter-secondo-me-sostituire-quasi-stabilmente-saelemaekers-607033",
      "source": "milannews.it",
      "date": "2026-02-11T17:10:06+00:00",
      "summary": "Carlos Passerini, journalist, spoke to MilanVibes."
    },
    {
      "id": "cc5e36de168d",
      "title": "From Milanello: Pulisic returns to the group and Allegri's various tests towards Pisa",
      "url": "https://www.milannews.it/podcast-mn/da-milanello-pulisic-torna-in-gruppo-e-le-varie-prove-di-allegri-verso-il-pisa-607073",
      "source": "milannews.it",
      "date": "2026-02-11T17:00:00+00:00",
      "summary": "Pisa-Milan is approaching, Friday preview of the twenty-fifth matchday of Serie A 2025/26. Good news today for Max Allegri: Christian Pulisic returned to group training this morning."
    },
    {
      "id": "ac9876ea2425",
      "title": "‘Needs to be addressed’ – Gazzetta journalist confirms Pulisic-Milan contract ‘stalemate’",
      "url": "https://sempremilan.com/gazzetta-pulisic-milan-contract-stalemate",
      "source": "sempremilan.com",
      "date": "2026-02-11T17:00:00+00:00",
      "summary": "Christian Pulisic’s contract with AC Milan officially expires at the end of next season, and the club must work on his renewal. There is no doubting that Pulisic has been probably Milan’s most consistent player since his arrival from Chelsea in 2023. In fact, he has recorded 42 goals and 25 assists "
    },
    {
      "id": "b3f82b0d6017",
      "title": "MN - Marcolin: \"The practicality of this Milan amazed me\"",
      "url": "https://www.milannews.it/news/mn-marcolin-di-questo-milan-mi-ha-stupito-la-praticita-606990",
      "source": "milannews.it",
      "date": "2026-02-11T16:50:24+00:00",
      "summary": "The former Napoli, Lazio and Sampdoria player, among others, Dario Marcolin, spoke exclusively to MilanNews."
    },
    {
      "id": "ee6ee9c83689",
      "title": "Tickets for the guest sector in Pisa are on sale: info and prices",
      "url": "https://www.milannews.it/news/in-vendita-i-biglietti-per-il-settore-ospiti-di-pisa-le-info-e-i-prezzi-606937",
      "source": "milannews.it",
      "date": "2026-02-11T16:40:43+00:00",
      "summary": "This is all the information on the sale of tickets for Pisa-Milan on Friday, published by the official website of the Tuscan club:\n\n\"The Pisa Sporting Club communicates the methods of purchasing tickets for the ..."
    },
    {
      "id": "7f68bbd43856",
      "title": "Guidi talks about Nkunku: \"Very shy boy, he's melting away. Glad he stayed\"",
      "url": "https://www.milannews.it/news/guidi-racconta-nkunku-ragazzo-molto-timido-si-sta-sciogliendo-contento-che-sia-rimasto-607010",
      "source": "milannews.it",
      "date": "2026-02-11T16:30:13+00:00",
      "summary": "On his YouTube channel, Carlo Pellegatti hosted Marco Guidi, a writer for the Gazzetta dello Sport, who spoke thus about Nkunku and the corporate situation of Milan:\n\n\"I believe that in football teams it is not the first time ..."
    },
    {
      "id": "e758f584091a",
      "title": "Camarda answers questions from kids on Milan debut, opponents and possible future at Inter",
      "url": "https://sempremilan.com/camarda-milan-debut-opponents-inter",
      "source": "sempremilan.com",
      "date": "2026-02-11T16:30:00+00:00",
      "summary": "Francesco Camarda did not rule out the idea of joining Inter one day, while he recalled some of his favourite memories from his young career. Last season, Camarda earned the distinction of becoming the youngest debutant in Serie A history, making his first appearance for Milan on 25 November 2023. H"
    },
    {
      "id": "2b8faa6ed388",
      "title": "Jimenez will be bought out by Bournemouth, but he is already talking about his Real Madrid dream",
      "url": "https://www.milannews.it/calciomercato-milan/jimenez-sara-riscattato-dal-bournemouth-ma-parla-gia-del-sogno-real-madrid-607038",
      "source": "milannews.it",
      "date": "2026-02-11T16:22:49+00:00",
      "summary": "Alex Jimenez, a Bournemouth player on loan from Milan, expressed himself as follows to Mundo Deportivo: “In Italy the pace is decidedly lower because they play much more tactical football r ..."
    },
    {
      "id": "bd321e0d9c04",
      "title": "Pellegatti: \"I often read criticisms, legitimate of course, about Allegri. It's sad that many don't understand the importance of a coach like him in this historical phase\"",
      "url": "https://www.milannews.it/news/pellegatti-leggo-spesso-critiche-legittime-per-carita-ad-allegri-dispiace-che-molti-non-capiscano-l-importanza-di-un-allenatore-come-lui-in-questa-fas-607043",
      "source": "milannews.it",
      "date": "2026-02-11T16:11:47+00:00",
      "summary": "During his editorial for MilanNews.it, the journalist Carlo Pellegatti expressed himself as follows about Massimiliano Allegri: \"How superficiality! I often read criticisms, legitimate of course, of Massimiliano Allegri."
    },
    {
      "id": "2431d947f7b4",
      "title": "Milan, there is interest in Vlahovic. But he hasn't decided his future yet",
      "url": "https://www.milannews.it/calciomercato-milan/milan-l-interesse-per-vlahovic-c-e-ma-lui-non-ha-ancora-deciso-il-suo-futuro-607011",
      "source": "milannews.it",
      "date": "2026-02-11T16:00:23+00:00",
      "summary": "On his YouTube channel, Carlo Pellegatti hosted Marco Guidi, a writer for the Gazzetta dello Sport, who spoke thus about the incoming market in Milan's attack and above all about Dusan Vlahovic:\n\n\"On Vlahovic, given that Juventus..."
    },
    {
      "id": "ba5343954769",
      "title": "MN: Fight for minutes and to stay at Milan – Gimenez to face immediate crossroads",
      "url": "https://sempremilan.com/fight-minutes-gimenez-immediate-crossroads-milan",
      "source": "sempremilan.com",
      "date": "2026-02-11T16:00:00+00:00",
      "summary": "AC Milan are waiting for Santiago Gimenez, hoping that he can provide a valuable production in the final part of the season. As MilanNews write, Milan have been waiting for practically a year now for Gimenez to show his worth, ever since his €32m arrival from Feyenoord. The recent period has been es"
    },
    {
      "id": "ad8569d83916",
      "title": "MN - Marcolin on Allegri: \"It almost seems to me that he is waiting for the opponent's difficulties before hitting him\"",
      "url": "https://www.milannews.it/news/mn-marcolin-su-allegri-mi-sembra-quasi-che-aspetti-le-difficolta-dell-avversario-per-poi-colpirlo-606989",
      "source": "milannews.it",
      "date": "2026-02-11T15:50:00+00:00",
      "summary": "The former Napoli, Lazio and Sampdoria player, among others, Dario Marcolin, spoke exclusively to MilanNews."
    },
    {
      "id": "3bca786517fe",
      "title": "The Municipality of Bologna cancels the spending commitment for the restyling of the Dall'Ara",
      "url": "https://www.milannews.it/news/il-comune-di-bologna-cancella-l-impegno-di-spesa-per-restyling-del-dall-ara-607030",
      "source": "milannews.it",
      "date": "2026-02-11T15:40:57+00:00",
      "summary": "(ANSA) - BOLOGNA, FEBRUARY 10 - The Bologna city council has canceled the spending commitment of 40 million for the renovation of the Dall'Ara stadium."
    },
    {
      "id": "4c5ed885de50",
      "title": "Pastore dryly on the results/players diatribe: \"Every coach wakes up in the morning and thinks about winning, not about playing well\"",
      "url": "https://www.milannews.it/news/pastore-secco-sulla-diatriba-risultatisti-giochisti-ogni-allenatore-si-sveglia-la-mattina-e-pensa-a-vincere-non-a-giocare-bene-607035",
      "source": "milannews.it",
      "date": "2026-02-11T15:30:24+00:00",
      "summary": "Giuseppe Pastore, journalist, expressed himself thus on Radio Rossonera on the dispute between results supporters and game players: \"I care very little."
    },
    {
      "id": "388489af4709",
      "title": "Romano reveals figures of Jimenez sale to Bournemouth: “Good news for AC Milan’s coffers”",
      "url": "https://sempremilan.com/romano-figures-jimenez-bournemouth-sale",
      "source": "sempremilan.com",
      "date": "2026-02-11T15:30:00+00:00",
      "summary": "Alex Jimenez’s move to AFC Bournemouth has now been made permanent after a series of targets were hit, it has been confirmed. The Spanish full-back left Milan in the summer window despite showing signs of his potential during his stint at the club. He joined Bournemouth on loan with an option to buy"
    },
    {
      "id": "6b7c62dbc4ab",
      "title": "How much Milan and Real Madrid earn from Jimenez’s Bournemouth move as documents signed",
      "url": "https://football-italia.net/milan-real-madrid-earn-jimenez-bournemouth/",
      "source": "football-italia.net",
      "date": "2026-02-11T15:20:29+00:00",
      "summary": "Fabrizio Romano confirms that Milan and Bournemouth have signed the documents for Alex Jimenez’s permanent..."
    },
    {
      "id": "8cbb6413c035",
      "title": "Italian Cup, the first semi-final (round trip) will be Como-Inter. First leg before the derby",
      "url": "https://www.milannews.it/news/coppa-italia-la-prima-semifinale-andata-e-ritorno-sara-como-inter-andata-prima-del-derby-607028",
      "source": "milannews.it",
      "date": "2026-02-11T15:20:07+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 10 - Como beat Napoli 7-6 on penalties at Diego Armando Maradona and qualify for the semi-final of the Italian Cup where they will challenge Inter."
    },
    {
      "id": "781e7f4b66b2",
      "title": "De Winter: \"In my opinion I didn't do that badly in the first half of the season\"",
      "url": "https://www.milannews.it/news/de-winter-secondo-me-non-ho-fatto-cosi-male-nella-prima-meta-di-stagione-607046",
      "source": "milannews.it",
      "date": "2026-02-11T15:10:01+00:00",
      "summary": "The start of 2026 was a positive period for several Milan players who, in the first part of the season, had struggled to get going."
    },
    {
      "id": "2702ade994f8",
      "title": "MN EXCLUSIVE - Marcolin: \"Scudetto? Milan and Napoli lurking against Inter. Del Diavolo surprised me with his practicality\"",
      "url": "https://www.milannews.it/esclusive-mn/esclusiva-mn-marcolin-scudetto-milan-e-napoli-in-agguato-dell-inter-del-diavolo-mi-ha-sorpreso-la-praticita-606988",
      "source": "milannews.it",
      "date": "2026-02-11T15:00:00+00:00",
      "summary": "The former Napoli, Lazio and Sampdoria player, among others, Dario Marcolin, spoke exclusively to MilanNews."
    },
    {
      "id": "59a750d454c0",
      "title": "‘Top-quality’ striker and Nkunku stay – Journalist reveals predictions for Milan’s attack",
      "url": "https://sempremilan.com/top-striker-nkunku-stay-predictions-attack",
      "source": "sempremilan.com",
      "date": "2026-02-11T15:00:00+00:00",
      "summary": "AC Milan will sign a top-level striker in the summer window, according to La Gazzetta dello Sport journalist Marco Guidi. The ongoing physical problems that Christian Pulisic and Rafael Leao were battling saw Milan agree a deal for Jean-Philippe Mateta with Crystal Palace worth €30-35m. It seemed th"
    },
    {
      "id": "6ae122fb6e3b",
      "title": "Order: \"I ask why there were only three episodes of field referees confirming the field decision despite the VAR call\"",
      "url": "https://www.milannews.it/news/ordine-chiedo-per-quale-motivo-ci-sono-stati-solo-tre-episodi-di-arbitri-di-campo-che-hanno-confermato-la-decisione-di-campo-nonostante-la-chiamata-de-607032",
      "source": "milannews.it",
      "date": "2026-02-11T14:50:34+00:00",
      "summary": "Franco Ordine, journalist, was interviewed by MilanVibes.\n\nIs there something wrong between VAR and arbitrage?\n\n“For this topic I ask a very general question."
    },
    {
      "id": "8aa9ad85ae24",
      "title": "Lazio, who eliminated Milan from the Italian Cup, will challenge Bologna in a one-off match this evening",
      "url": "https://www.milannews.it/news/la-lazio-che-ha-eliminato-il-milan-dalla-coppa-italia-stasera-sfidera-il-bologna-in-gara-secca-607027",
      "source": "milannews.it",
      "date": "2026-02-11T14:40:34+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 10 - The Italian Cup quarter-final program ends tomorrow with Bologna-Lazio, a match between two teams that are going through a complicated period."
    },
    {
      "id": "04413e1b1401",
      "title": "Shevchenko reveals: \"After Chelsea Roma wanted me, but shortly after Berlusconi called me\"",
      "url": "https://www.milannews.it/news/shevchenko-rivela-dopo-il-chelsea-mi-voleva-la-roma-ma-poco-dopo-mi-chiamo-berlusconi-607015",
      "source": "milannews.it",
      "date": "2026-02-11T14:30:26+00:00",
      "summary": "Guest of the Amazon Prime Video format \"FENOMENI\" in the company of former footballer Luca Toni, Andriy Shevchenko, historic AC Milan striker who won everything with the Rossoneri between 1999 and 2006, including a Ballon d'Or."
    },
    {
      "id": "413696c0d798",
      "title": "Sky: Milan’s atmosphere change evident – 70 players and staff enjoy fine-funded dinner",
      "url": "https://sempremilan.com/70-players-staff-milan-fine-funded-dinner",
      "source": "sempremilan.com",
      "date": "2026-02-11T14:30:00+00:00",
      "summary": "In the space of a year, the atmosphere at AC Milan has completely changed, and there are signs of this that continue to emerge. Last season, Milan were in the headlines constantly for the wrong reasons. There was the cooling break incident against Lazio, the penalty mutiny in the defeat to Fiorentin"
    },
    {
      "id": "b51ec099f710",
      "title": "It remains to be understood whether the situation for Pulisic's renewal came from the player or the club",
      "url": "https://www.milannews.it/calciomercato-milan/e-da-capire-se-la-situazione-per-il-rinnovo-di-pulisic-e-nata-dal-giocatore-o-dal-club-607012",
      "source": "milannews.it",
      "date": "2026-02-11T14:22:56+00:00",
      "summary": "On his YouTube channel, Carlo Pellegatti hosted Marco Guidi, signature of the Gazzetta dello Sport, who spoke thus about Christian Pulisic's renewal situation:\n\n\"There is a stalemate that has been going on for a long time."
    },
    {
      "id": "12df281becc6",
      "title": "Milan handed Pulisic injury boost for Pisa clash",
      "url": "https://football-italia.net/milan-pulisic-injury-boost-for-pisa-clash/",
      "source": "football-italia.net",
      "date": "2026-02-11T14:19:12+00:00",
      "summary": "Milan star Christian Pulisic returned to group training on Wednesday, meaning he’ll probably be available..."
    },
    {
      "id": "08647d6e8e8b",
      "title": "All documents ratified for Jimenez's ransom: the figures of the operation",
      "url": "https://www.milannews.it/calciomercato-milan/tutti-documenti-ratificati-per-il-riscatto-di-jimenez-le-cifre-dell-operazione-607006",
      "source": "milannews.it",
      "date": "2026-02-11T14:10:00+00:00",
      "summary": "During the usual appointment with the video update on his YouTube channel, Fabrizio Romano took stock of Milan and the transfer market operations linked to the Rossoneri club."
    },
    {
      "id": "41ec39bbc449",
      "title": "Milan, how the climate changes in a year: yesterday dinner with the players and all the Milanello staff",
      "url": "https://www.milannews.it/news/milan-come-cambia-il-clima-in-un-anno-ieri-cena-tra-giocatori-e-tutto-lo-staff-di-milanello-607070",
      "source": "milannews.it",
      "date": "2026-02-11T14:00:00+00:00",
      "summary": "In the space of a year the climate in the Milan world has changed completely. We went from the mutinies during the cooling break and the argument between the coach and captain in the middle of the pitch to a serene, concentrated and respectful environment."
    },
    {
      "id": "3a766bc033ef",
      "title": "Conte mentions Milan in Scudetto assessment but loses cool after Como loss: “Serious problems”",
      "url": "https://sempremilan.com/conte-milan-loses-cool-scudetto-como",
      "source": "sempremilan.com",
      "date": "2026-02-11T14:00:00+00:00",
      "summary": "Antonio Conte was not happy about Napoli being eliminated from the Coppa Italia, and once again spoke about the Scudetto race. Conte’s side experienced another bad night on Tuesday as they were beaten on penalties by Como in the quarter-finals of the Coppa Italia. It means that the club from the lak"
    },
    {
      "id": "5c37982ca415",
      "title": "Tuttosport: Why Allegri is tempted to give Füllkrug a start against Pisa",
      "url": "https://sempremilan.com/why-allegri-tempted-fullkrug-start-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-11T13:35:00+00:00",
      "summary": "Massimiliano Allegri is studying the best attacking duo to field against Pisa, and one temptation in particular is growing. The build-up to Friday’s match in Tuscany against Pisa is in full swing, and Allegri has some tough decisions to make. With Rafael Leão’s recovery appears to be confirmed and C"
    },
    {
      "id": "014667952e7f",
      "title": "MN: Milan given big pre-Pisa boost as Pulisic returns to full training – the latest",
      "url": "https://sempremilan.com/pulisic-returns-to-full-training-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-11T13:10:00+00:00",
      "summary": "AC Milan were back in training again at Milanello two days before the trip to Pisa, and some good news came regarding Christian Pulisic. MilanNews are reporting that Christian Pulisic returned to training with the rest of the squad this morning. The American had been training separately in recent da"
    },
    {
      "id": "920f190ef582",
      "title": "De Winter reveals childhood bond with Milan including father’s plan to name him after Seedorf",
      "url": "https://sempremilan.com/de-winter-childhood-bond-milan-seedorf",
      "source": "sempremilan.com",
      "date": "2026-02-11T12:45:00+00:00",
      "summary": "AC Milan central defender Koni De Winter seems to be doing the media rounds at the moment, and has given another interview this morning. Having signed from Genoa in the summer mercato, De Winter initially had to make do with being the fourth choice centre-back, with Fikayo Tomori, Matteo Gabbia and "
    },
    {
      "id": "c75f61a00269",
      "title": "CorSport: ‘Seduced and abandoned’ – why Paratici could complicate Milan’s striker plan",
      "url": "https://sempremilan.com/why-paratici-complicate-milan-striker-furlani",
      "source": "sempremilan.com",
      "date": "2026-02-11T12:20:00+00:00",
      "summary": "AC Milan are evaluating making a move for Moise Kean in view of the summer, but Fabio Paritici could complicate matters. This morning’s Corriere dello Sport (via MN24) urges caution regarding the names Dusan Vlahovic and Moise Kean, suggesting that Giorgio Furlani and Zlatan Ibrahimovic ‘s strategy "
    },
    {
      "id": "62863c967793",
      "title": "Kaladze compares current Milan with Berlusconi era and praises Allegri’s impact",
      "url": "https://sempremilan.com/kaladze-compares-current-milan-berlusconi-allegri",
      "source": "sempremilan.com",
      "date": "2026-02-11T11:55:00+00:00",
      "summary": "Kakhaber Kaladze has claimed that the current AC Milan cannot be compared to the one he played in, with Silvio Berlusconi at the helm. Kaladze had an illustrious playing career in which he became perhaps Georgia’s most famous export, and now he is serving a third term as the Mayor of Tbilisi. He joi"
    },
    {
      "id": "6cf456b44487",
      "title": "De Winter hopes Milan help him get Belgium 2026 World Cup spot",
      "url": "https://football-italia.net/de-winter-hope-milan-beligum-spot-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-11T11:44:07+00:00",
      "summary": "Milan defender Koni De Winter hopes that his performances with the Rossoneri this season will..."
    },
    {
      "id": "f75655907b10",
      "title": "Sky Germany: Mainz star ‘one to watch’ ahead of summer – Milan and Inter among admirers",
      "url": "https://sempremilan.com/mainz-potulski-milan-inter-como",
      "source": "sempremilan.com",
      "date": "2026-02-11T11:30:00+00:00",
      "summary": "There is a Polish talent playing in the Bundesliga that is catching the eye of some top teams in Italy: Kacper Potulski of Mainz. Milan have always shown a willingness to invest in young talent under the ownership of RedBird Capital and Elliott Management prior. Even in the most recent summer window"
    },
    {
      "id": "94911fedaf36",
      "title": "Malpensa24: Work to be completed on Milan Futuro’s home this year after €2.5m investment",
      "url": "https://sempremilan.com/work-completed-milan-futuro-2-5m-investment",
      "source": "sempremilan.com",
      "date": "2026-02-11T11:05:00+00:00",
      "summary": "As part of the agreement to share the Stadio Felice Chinetti, AC Milan are carrying out some work on the ground which should soon be done. When Milan launched their ‘Milan Futuro’ project ahead of the 2024-25 season, one which began badly with relegation to Serie D, they struck a deal to use the sta"
    },
    {
      "id": "4513c075f64b",
      "title": "Ordine: Tare’s tip-off results in bullet dodged – why Milan pulled the plug on Mateta deal",
      "url": "https://sempremilan.com/tare-tip-off-milan-mateta-pull-plug",
      "source": "sempremilan.com",
      "date": "2026-02-11T10:40:00+00:00",
      "summary": "AC Milan put the brakes on a potential move for Jean-Philippe Mateta thanks in part to the intervention of Igli Tare, it is claimed. Milan’s winter transfer window ended with a dramatic turn of events that saved them from a risky investment worth over €35m. The deal for Mateta – which seemed to be c"
    },
    {
      "id": "8484bf50a4c8",
      "title": "CorSport: A potential €108m ‘treasure’ – Milan plan to reinvest proceeds from buy-outs",
      "url": "https://sempremilan.com/milan-108m-treasure-reinvest-proceeds-buyouts",
      "source": "sempremilan.com",
      "date": "2026-02-11T10:15:00+00:00",
      "summary": "With the winter transfer window now behind us, calculators are already in hand at AC Milan as they plan for the summer. As Corriere dello Sport (via MN24) report this morning, Milan are ‘sitting on a potential goldmine’ generated by the numerous players currently on loan with options or obligations "
    },
    {
      "id": "74f693667e4e",
      "title": "Romano claims Nkunku is ‘annoyed’ after January rumours: “Linked to 300 teams”",
      "url": "https://sempremilan.com/romano-nkunku-annoyed-after-january-rumours",
      "source": "sempremilan.com",
      "date": "2026-02-11T09:50:00+00:00",
      "summary": "Christopher Nkunku was not particularly happy about all of the talk of a potential exit in the January window, Fabrizio Romano has claimed. As we approached the winter mercato and with Nkunku struggling for form following his big-money arrival from Chelsea in the summer, stories began to build about"
    },
    {
      "id": "037cf29236f2",
      "title": "De Winter discusses recent resurgence, Allegri’s impact, Scudetto pursuit and idols",
      "url": "https://sempremilan.com/de-winter-resurgence-allegri-impact-scudetto",
      "source": "sempremilan.com",
      "date": "2026-02-11T09:25:00+00:00",
      "summary": "Koni De Winter is the man of the moment for AC Milan, at least from a defensive perspective, and he has spoken about his recent form. After signing from Genoa during the summer transfer window to replace Malick Thiaw, the first few games were a struggle for De Winter. He tended to only get the […]\nT"
    },
    {
      "id": "1b55b6d119de",
      "title": "GdS: Physically better and fired up – Leao aims to re-conquer Milan in search of 30th winner",
      "url": "https://sempremilan.com/leao-physically-better-fired-up-milan",
      "source": "sempremilan.com",
      "date": "2026-02-11T09:00:00+00:00",
      "summary": "Rafael Leao is working on getting back towards 100% fitness, and he is fired up to become decisive for AC Milan once again. As La Gazzetta dello Sport (seen below) report, Leao is feeling better physically, making it easier for him to joke around and bring cheer. He confirmed his physical improvemen"
    },
    {
      "id": "596dad6cb3a8",
      "title": "‘Always been welcome’ – Romano offers update on Vlahovic-Milan situation",
      "url": "https://sempremilan.com/always-welcome-romano-update-vlahovic-milan-situation",
      "source": "sempremilan.com",
      "date": "2026-02-10T19:30:00+00:00",
      "summary": "Dusan Vlahovic’s name has been regularly linked to AC Milan over the past few months, but whether he actually moves to Milano is another thing entirely. Looking at Vlahovic, there are several reasons why the links to Milan are so prevalent. More than anything, Massimiliano Allegri has pleaded to bri"
    },
    {
      "id": "394a459f8eaf",
      "title": "Mateta mystery deepens, Crystal Palace insist failed Milan transfer ‘does not need surgery’",
      "url": "https://football-italia.net/mateta-mystery-crystal-palacefailed-milan-move/",
      "source": "football-italia.net",
      "date": "2026-02-10T17:19:18+00:00",
      "summary": "Jean-Philippe Mateta failed a medical test with Milan to scupper his €30m transfer from Crystal..."
    },
    {
      "id": "44962c2fbe63",
      "title": "Jimenez feared limited Milan playing time, Nico Paz ‘ready’ for Real Madrid return",
      "url": "https://football-italia.net/jimenez-fear-limited-milan-time-paz-madrid/",
      "source": "football-italia.net",
      "date": "2026-02-10T14:42:00+00:00",
      "summary": "Alex Jimenez feared he’d get limited playing time at Milan, so he joined Bournemouth last..."
    },
    {
      "id": "303da62cf040",
      "title": "Report Pulisic waits for Milan contract offer as Liverpool and Arsenal loom",
      "url": "https://football-italia.net/pulisic-waits-milan-contract-liverpool-arsenal/",
      "source": "football-italia.net",
      "date": "2026-02-10T12:04:47+00:00",
      "summary": "Liverpool and Arsenal are reportedly interested in Milan star Christian Pulisic, who hasn’t yet received..."
    },
    {
      "id": "f688f227c904",
      "title": "Gattuso meets Italy players across the globe ahead of World Cup play-off",
      "url": "https://football-italia.net/gattuso-meets-italy-players-globe-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:54:51+00:00",
      "summary": "Denied a training retreat this month, Italy coach Gennaro Gattuso has taken his World Cup..."
    },
    {
      "id": "e43af22dbbb7",
      "title": "Nkunku: France have three teams to win World Cup, Rabiot ‘a beast’",
      "url": "https://football-italia.net/france-3-teams-win-world-cup-rabiot-beast/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:23:18+00:00",
      "summary": "During his interview with Gazzetta dello Sport, Milan striker Christopher Nkunku praised many of his Rossoneri..."
    },
    {
      "id": "b12a747674d2",
      "title": "Nkunku: ‘Never’ wanted to leave Milan, Ibrahimovic hasn’t changed",
      "url": "https://football-italia.net/nkunku-never-wanted-leave-milan-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-10T10:00:31+00:00",
      "summary": "Milan striker Christopher Nkunku insists he didn’t consider leaving the Rossoneri in the January transfer..."
    },
    {
      "id": "df6e963b7d03",
      "title": "Milan expecting to raise €70m by selling six loanees",
      "url": "https://football-italia.net/milan-expect-70m-from-selling-six-loanees/",
      "source": "football-italia.net",
      "date": "2026-02-09T13:31:28+00:00",
      "summary": "Monday’s reports claim that the sales of the players that Milan currently have out on..."
    },
    {
      "id": "8112d04e415c",
      "title": "Albertini: Two Italy players ‘hid behind’ bench to avoid taking penalty in 1994 World Cup Final",
      "url": "https://football-italia.net/albertini-2-italy-players-hid-bench-penalty/",
      "source": "football-italia.net",
      "date": "2026-02-09T12:53:52+00:00",
      "summary": "Ex-Italy and Milan midfielder Demetrio Albertini says two Azzurri, playing for Inter and Milan, ‘hid..."
    },
    {
      "id": "53ddfc68f656",
      "title": "Today’s Papers – Unplayable Inter, McTominay’s relief, Juventus’ heart and rage",
      "url": "https://football-italia.net/today-papers-inter-unplayable-mctominay-juve/",
      "source": "football-italia.net",
      "date": "2026-02-09T08:40:24+00:00",
      "summary": "La Gazzetta dello Sport Inter’s boom Half team scores, super Dimarco: three assists and one..."
    },
    {
      "id": "9bacf2e36a90",
      "title": "Manchester United targeting Tonali to replace Casemiro for 2026-27",
      "url": "https://football-italia.net/man-utd-targeting-tonali-to-replace-casemiro/",
      "source": "football-italia.net",
      "date": "2026-02-08T18:08:58+00:00",
      "summary": "Reports in the UK claim that Manchester United could target Italy international Sandro Tonali to..."
    },
    {
      "id": "b7b698e1f1a7",
      "title": "When could Pulisic and Saelemaekers return to action for Milan?",
      "url": "https://football-italia.net/when-could-pulisic-and-saelemaekers-for-milan/",
      "source": "football-italia.net",
      "date": "2026-02-08T12:24:44+00:00",
      "summary": "Christian Pulisic and Alexis Saelemaekers were both unavailable for Milan’s recent 3-0 victory over Bologna,..."
    },
    {
      "id": "0363d2d1c6d1",
      "title": "How much will Milan receive from Alex Jimenez transfer to AFC Bournemouth?",
      "url": "https://football-italia.net/how-much-milan-will-receive-from-alex-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-08T09:50:04+00:00",
      "summary": "Alex Jimenez has recently completed his permanent transfer to AFC Bournemouth, but how much will..."
    },
    {
      "id": "82f6c1d96879",
      "title": "Today’s Papers: Yildiz renewal, Italy gold, Hojlund 95th",
      "url": "https://football-italia.net/todays-papers-yildiz-renewal-italy-gold/",
      "source": "football-italia.net",
      "date": "2026-02-08T08:38:49+00:00",
      "summary": "La Gazzetta dello Sport  Mamma, how about Italy Winter Olympics: An unforgettable first day Lollobrigida..."
    },
    {
      "id": "1c4fd7787c2a",
      "title": "Done Deal: Bournemouth complete permanent purchase of Milan loanee Jimenez – the details",
      "url": "https://football-italia.net/done-deal-bournemouth-milan-jimenez/",
      "source": "football-italia.net",
      "date": "2026-02-07T21:30:32+00:00",
      "summary": "Bournemouth have triggered their buy option in the loan contract of Milan winger Alex Jimenez,..."
    },
    {
      "id": "18032c4eb9a9",
      "title": "Juventus rejected Milan’s last minute offer for Gatti – report",
      "url": "https://football-italia.net/juventus-reject-milan-last-minute-offer-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-07T15:03:30+00:00",
      "summary": "Tuttosport newspaper reports that Milan are already looking for a new centre-back for 2026-27 and..."
    },
    {
      "id": "a4d14bcb7db3",
      "title": "Baresi and Bergomi the ‘secret’ torchbearers at 2026 Winter Olympics opening ceremony",
      "url": "https://football-italia.net/baresi-bergomi-secred-torchbearers-olympics/",
      "source": "football-italia.net",
      "date": "2026-02-07T14:35:47+00:00",
      "summary": "Italian legends Franco Baresi and Beppe Bergomi were two of the torchbearers at the 2026..."
    },
    {
      "id": "17025e679502",
      "title": "Bennacer injured at Zagreb as Milan sweat over potential €10m loss",
      "url": "https://football-italia.net/bennacer-injured-zagreb-milan-sweat/",
      "source": "football-italia.net",
      "date": "2026-02-06T18:11:59+00:00",
      "summary": "Ismael Bennacer’s injury troubles have resurfaced at Dinamo Zagreb, casting fresh doubt over the midfielder’s..."
    }
  ]
}