{
  "lastUpdated": "2026-02-03T11:33:15.651509+00:00",
  "articles": [
    {
      "id": "d340427a31c3",
      "title": "Milan and a positive tradition in the second half: the excellent numbers of the Rossoneri",
      "url": "https://www.milannews.it/news/il-milan-e-una-tradizione-positiva-nei-secondi-tempi-gli-ottimi-numeri-dei-rossoneri-606215",
      "source": "milannews.it",
      "date": "2026-02-03T11:30:00+00:00",
      "summary": "Everything is ready for the match between Bologna and Milan, scheduled for this evening at the Dall'Ara stadium."
    },
    {
      "id": "10e29782a18e",
      "title": "Vitiello explains why Allegri was let down by Milan’s window: “Füllkrug alone isn’t enough”",
      "url": "https://sempremilan.com/vitiello-why-allegri-let-down-window",
      "source": "sempremilan.com",
      "date": "2026-02-03T11:30:00+00:00",
      "summary": "Antonio Vitiello believes that the AC Milan management did not give Massimiliano Allegri the reinforcements that the squad needed. Milan went into the winter window being linked with players in various positions, from striker to centre-back and even wing-back. In the end the only real first-team add"
    },
    {
      "id": "372eed6df1cc",
      "title": "Bologna is looking for redemption tonight: the negative numbers of the rossoblù in the last 10 of Serie A",
      "url": "https://www.milannews.it/l-avversario/il-bologna-stasera-cerca-il-riscatto-i-numeri-negativi-dei-rossoblu-nelle-ultime-10-di-a-606214",
      "source": "milannews.it",
      "date": "2026-02-03T11:20:00+00:00",
      "summary": "With the transfer market having ended in nothing, Milan can concentrate on the championship and think about this evening's away match in Bologna against Vincenzo Italiano's boys."
    },
    {
      "id": "7a24cc1da862",
      "title": "Towards Bologna-Milan, the precedents at Dall'Ara",
      "url": "https://www.milannews.it/news/verso-bologna-milan-i-precedenti-al-dall-ara-606213",
      "source": "milannews.it",
      "date": "2026-02-03T11:10:00+00:00",
      "summary": "Everything is ready for Bologna-Milan, scheduled for this evening at the Dall'Ara."
    },
    {
      "id": "48ea3dae5107",
      "title": "GdS: Ghosts, lack of goals and collapsed deals – Milan’s striker ‘curse’ still lingers",
      "url": "https://sempremilan.com/ghosts-collapsed-deals-milan-striker-curse",
      "source": "sempremilan.com",
      "date": "2026-02-03T11:05:00+00:00",
      "summary": "AC Milan were once again looking for a new starting striker in the winter window, and once again have been left questioning their luck. As La Gazzetta dello Sport (seen below) recall, once upon a time Milan won the Scudetto, thanks in part to their striker’s brace against Sassuolo on the final day. "
    },
    {
      "id": "1d85e2d93c06",
      "title": "MN EXCLUSIVE - Fedele: \"Mateta missed? Better that way. Happy for Maignan. Thiago Silva would have come running\"",
      "url": "https://www.milannews.it/primo-piano/esclusiva-mn-fedele-saltato-mateta-meglio-cosi-felice-per-maignan-thiago-silva-sarebbe-venuto-di-corsa-606135",
      "source": "milannews.it",
      "date": "2026-02-03T11:00:00+00:00",
      "summary": "Furio Fedele, former historic journalist of Corriere dello Sport, was interviewed exclusively by the editorial staff of MilanNews.it."
    },
    {
      "id": "6dbccaa539f2",
      "title": "Impallomeni on Allegri's words: \"He didn't respond to Conte, he said correct things\"",
      "url": "https://www.milannews.it/news/impallomeni-sulle-parole-di-allegri-non-ha-risposto-a-conte-ha-detto-cose-corrette-606205",
      "source": "milannews.it",
      "date": "2026-02-03T10:50:00+00:00",
      "summary": "Stefano Impallomeni, live during Maracanà on TMW Radio, spoke about Antonio Conte's statements and the back-and-forth with Massimiliano Allegri regarding the calendar issue, after the words of the Livorn coach ..."
    },
    {
      "id": "a09ff7204009",
      "title": "Some doubts for Italiano: Bologna's possible choices",
      "url": "https://www.milannews.it/news/qualche-dubbio-per-italiano-le-possibili-scelte-del-bologna-606199",
      "source": "milannews.it",
      "date": "2026-02-03T10:40:00+00:00",
      "summary": "Everything is ready for the match between Bologna and Milan."
    },
    {
      "id": "260494f93312",
      "title": "CorSport: Italiano hatches anti-Modric plan for Bologna ahead of Milan’s visit – the details",
      "url": "https://sempremilan.com/italiano-anti-modric-plan-milan-bologna",
      "source": "sempremilan.com",
      "date": "2026-02-03T10:40:00+00:00",
      "summary": "AC Milan take on Bologna this evening away from home, and it is a contest that could well be decided in the middle of the park. As Corriere dello Sport (via MilanPress) write, it is a match will feature a number of interesting clashes, especially in midfield. Lewis Ferguson and Remo Freuler will fac"
    },
    {
      "id": "f9ab089360bf",
      "title": "Marotta on San Siro: \"In Italy the bureaucracy is obstructionist. Thanks to Ralph and Scaroni we have arrived at the deed\"",
      "url": "https://www.milannews.it/news/marotta-su-san-siro-in-italia-la-burocrazia-e-ostruzionistica-grazie-a-ralph-e-scaroni-siamo-arrivati-al-rogito-606226",
      "source": "milannews.it",
      "date": "2026-02-03T10:30:00+00:00",
      "summary": "Beppe Marotta, president of Inter, spoke thus about San Siro in an interview with DAZN. This is an excerpt of his statements, taken from TMW: \"Yes."
    },
    {
      "id": "11bb1cf6cc67",
      "title": "Milan wants to improve their unbeaten streak: no one in Europe better than the Rossoneri",
      "url": "https://www.milannews.it/news/il-milan-vuole-migliorare-la-striscia-di-imbattibilita-nessuno-in-europa-meglio-dei-rossoneri-606212",
      "source": "milannews.it",
      "date": "2026-02-03T10:20:00+00:00",
      "summary": "The transfer market has just ended and Milan can concentrate on what will be the key period of the championship."
    },
    {
      "id": "58e2a3e16678",
      "title": "Ranking Serie A’s biggest spenders in 2026 winter transfer window",
      "url": "https://football-italia.net/serie-a-biggest-spenders-2026-winter-transfer/",
      "source": "football-italia.net",
      "date": "2026-02-03T10:19:28+00:00",
      "summary": "Lazio were the biggest spenders in Serie A during the winter transfer window, while Juventus..."
    },
    {
      "id": "d82a273d6ea0",
      "title": "CM: Mateta crossed off Milan’s list – the summer No.9 options from Kean to Panichelli",
      "url": "https://sempremilan.com/milan-summer-no9-options-kean-panichelli",
      "source": "sempremilan.com",
      "date": "2026-02-03T10:15:00+00:00",
      "summary": "AC Milan did not end up signing Jean-Philippe Mateta on deadline day, so now they will look to land the right striker in the summer. As Calciomercato.com report, the last 48 hours have seen practically everything happen. Milan agreed a deal worth over €30m with Crystal Palace for Mateta on the penul"
    },
    {
      "id": "e050d16b78d2",
      "title": "Bologna-Milan on Tuesday? The last time in 2018: here's how it went",
      "url": "https://www.milannews.it/news/bologna-milan-di-martedi-l-ultima-volta-nel-2018-ecco-come-ando-606198",
      "source": "milannews.it",
      "date": "2026-02-03T10:10:00+00:00",
      "summary": "The 23rd matchday of Serie A will end this evening with the match between Bologna and Milan. An unusual day for a postponement, considering the day started last Friday."
    },
    {
      "id": "1f59b70c6c26",
      "title": "Mateta-Milan, Romano: \"He missed only for physical reasons\". And he reveals what the footballer risks now",
      "url": "https://www.milannews.it/news/mateta-milan-romano-e-saltato-solo-per-motivi-fisici-e-svela-cosa-rischia-ora-il-calciatore-606225",
      "source": "milannews.it",
      "date": "2026-02-03T10:00:00+00:00",
      "summary": "Fabrizio Romano, on DAZN, revealed the background to Jean-Philippe Mateta's failure to arrive at Milan: \"Only a physical matter."
    },
    {
      "id": "f41d044bdb84",
      "title": "At the Dall'Ara Nkunku will lead the attack: Allegri's possible choices",
      "url": "https://www.milannews.it/news/al-dall-ara-sara-nkunku-a-guidare-l-attacco-le-possibili-scelte-di-allegri-606203",
      "source": "milannews.it",
      "date": "2026-02-03T09:50:00+00:00",
      "summary": "Everything is ready for tonight's match between Bologna and Milan. Tuttosport focuses on what Massimiliano Allegri's choices will have to be."
    },
    {
      "id": "00ab10528a92",
      "title": "GdS: Predicted XIs for Bologna vs. AC Milan – Allegri forced to use unprecedented attack",
      "url": "https://sempremilan.com/predicted-xis-bologna-milan-unprecedented-attack",
      "source": "sempremilan.com",
      "date": "2026-02-03T09:50:00+00:00",
      "summary": "After the drama of deadline day, AC Milan will return to action on the field tonight, taking on Bologna away from home. Milan come into the game at the Stadio Renato dall’Ara under pressure to win after Inter, Napoli and Juventus all did over the weekend. Massimiliano Allegri’s side are battling ano"
    },
    {
      "id": "223206d5142b",
      "title": "Milan, Cissé taken: the Rossoneri's plan is very clear",
      "url": "https://www.milannews.it/news/milan-preso-cisse-il-piano-dei-rossoneri-e-chiarissimo-606197",
      "source": "milannews.it",
      "date": "2026-02-03T09:40:00+00:00",
      "summary": "Jean-Philippe Mateta didn't arrive, but Milan still made one last signing: Alphadjo Cissè, a midfielder born in 2006 who arrived for 8 million plus 2 million in bonuses plus a percentage on the resale ..."
    },
    {
      "id": "aaffc8d2e4a8",
      "title": "The shirt that weighs: Milan and the curse of the number 9",
      "url": "https://www.milannews.it/news/la-maglia-che-pesa-il-milan-e-la-maledizione-della-numero-9-606208",
      "source": "milannews.it",
      "date": "2026-02-03T09:30:00+00:00",
      "summary": "Olivier Giroud was the exception who confirmed the rule in recent years."
    },
    {
      "id": "f386bd8349a5",
      "title": "Opinion of several doctors and an issue since 2019: Why Milan walked away from Mateta",
      "url": "https://sempremilan.com/why-milan-walked-away-palace-mateta",
      "source": "sempremilan.com",
      "date": "2026-02-03T09:25:00+00:00",
      "summary": "Jean-Philippe Mateta was meant to be AC Milan’s statement winter signing, but everything unravelled over a few hours on deadline day. Going into the final day of the window, several sources reported that a deal had been agreed between Milan and Crystal Palace for Mateta. It was expected that the str"
    },
    {
      "id": "6d8279b47336",
      "title": "Milan visits Bologna: Allegri's frightening performance against the Bologna team",
      "url": "https://www.milannews.it/news/il-milan-fa-visita-al-bologna-lo-spaventoso-dato-di-allegri-contro-i-felsinei-606202",
      "source": "milannews.it",
      "date": "2026-02-03T09:20:00+00:00",
      "summary": "Everything is ready for this evening's postponement between Bologna and Milan. As today's edition of Tuttosport reminds us, there are two opposing aspects to consider."
    },
    {
      "id": "aedb27ebb728",
      "title": "Rating every Serie A club’s winter transfer window",
      "url": "https://football-italia.net/rating-every-serie-a-club-winter-transfer/",
      "source": "football-italia.net",
      "date": "2026-02-03T09:15:35+00:00",
      "summary": "Every winter, Italian clubs scramble to try to find the players who can make a..."
    },
    {
      "id": "a93a51a7b4d0",
      "title": "Trouble for Saelemaekers, that's how long he could be out. Pulisic is also out: the plan for the American",
      "url": "https://www.milannews.it/news/guai-per-saelemaekers-ecco-quanto-potrebbe-stare-fuori-out-anche-pulisic-il-piano-per-l-americano-606223",
      "source": "milannews.it",
      "date": "2026-02-03T09:10:00+00:00",
      "summary": "Heavy absences for Massimiliano Allegri in Bologna: Alexis Saelemaekers and Christian Pulisic will not be present in Emilia. As reported by Gazzetta dello Sport, the Belgian could stop for around two weeks due to the adductor problem."
    },
    {
      "id": "63be3e7d65b0",
      "title": "Mateta-Milan, sensational: three different doctors voted \"no\". This is the attacker's serious problem",
      "url": "https://www.milannews.it/news/mateta-milan-clamoroso-tre-medici-diversi-hanno-votato-no-ecco-qual-e-il-problema-serio-dell-attaccante-606224",
      "source": "milannews.it",
      "date": "2026-02-03T09:07:53+00:00",
      "summary": "Important rumors arrive about Jean-Philippe Mateta: according to what was gathered by gazzetta.it, 3 different doctors voted \"no\"."
    },
    {
      "id": "25562fa50c71",
      "title": "Serie A: Bologna vs. Milan – probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/bologna-v-milan-probable-line-ups-watch-on-tv/",
      "source": "football-italia.net",
      "date": "2026-02-03T09:01:32+00:00",
      "summary": "Christian Pulisic is not available for Milan, while Rafael Leao is expected to start on..."
    },
    {
      "id": "b3ab3f36006d",
      "title": "Thoughts only on the pitch: Milan and the highlight of the season, Allegri knows how to manage it",
      "url": "https://www.milannews.it/primo-piano/i-pensieri-solo-al-campo-il-milan-e-la-fase-clou-della-stagione-allegri-sa-come-gestirla-606218",
      "source": "milannews.it",
      "date": "2026-02-03T09:00:00+00:00",
      "summary": "The transfer market has come to an end and Milan were unable to bring the much-desired center forward to Milanello, with Jean-Philippe Mateta failing additional medical tests on his knee."
    },
    {
      "id": "8d1d36d41212",
      "title": "Gallery: ‘Mateta doesn’t arrive’, ‘The ball passes to Allegri’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/front-pages-3-february-bologna-milan-mateta",
      "source": "sempremilan.com",
      "date": "2026-02-03T09:00:00+00:00",
      "summary": "AC Milan return to Serie A action tonight against Bologna, but plenty of the headlines are about a dramatic deadline day. Milan must return to winning ways at the Stadio Renato dall’Ara this evening to keep pace with the likes of Inter, Napoli and Juventus. However, a lot of the attention remains on"
    },
    {
      "id": "57b11579c970",
      "title": "To add insult to injury: between Crystal Palace and France, Mateta risks big",
      "url": "https://www.milannews.it/news/oltre-al-danno-la-beffa-tra-il-crystal-palace-e-la-francia-mateta-rischia-grosso-606219",
      "source": "milannews.it",
      "date": "2026-02-03T08:50:00+00:00",
      "summary": "Adding insult to injury to Jean-Philippe Mateta. L'Equipe provides an in-depth look at what will be the next few months for the French center forward, who was one step away from Milan but then faded due to knee problems."
    },
    {
      "id": "7fb7b91c09ff",
      "title": "Milan on stage in Bologna. Tuttosport: \"Rossoneri in emergency to keep their hopes up\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-milan-di-scena-a-bologna-tuttosport-rossoneri-in-emergenza-per-tenere-le-speranze-606201",
      "source": "milannews.it",
      "date": "2026-02-03T08:40:00+00:00",
      "summary": "From tonight we'll go back to thinking exclusively about the pitch. Milan will visit Bologna but Massimiliano Allegri will have to manage several absences."
    },
    {
      "id": "0174db14561e",
      "title": "Today’s Papers – Milan’s Mateta blow, new Rabiot for Inter, Spalletti wins again",
      "url": "https://football-italia.net/todays-papers-mateta-blow-inter-rabiot/",
      "source": "football-italia.net",
      "date": "2026-02-03T08:31:23+00:00",
      "summary": "La Gazzetta dello Sport Audero recounts: ‘My big scare’ The Cremonese keeper, after being hit..."
    },
    {
      "id": "008be23f19b4",
      "title": "CorSport takes up Allegri's words towards Bologna: \"Milan serious\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-corsport-riprende-le-parole-di-allegri-verso-bologna-milan-serio-606195",
      "source": "milannews.it",
      "date": "2026-02-03T08:30:00+00:00",
      "summary": "Once the transfer window is over, with Jean-Philippe Mateta not arriving, Milan can concentrate fully on this evening's trip to Bologna."
    },
    {
      "id": "4ceda0f43450",
      "title": "Serie A: Every deal completed in 2026 winter transfer window",
      "url": "https://football-italia.net/serie-a-every-transfer-2026-winter-window/",
      "source": "football-italia.net",
      "date": "2026-02-02T19:50:00+00:00",
      "summary": "The winter transfer window in Serie A is over, and Football Italia takes a look..."
    },
    {
      "id": "eaa57b6c795c",
      "title": "Serie A done deals: Every completed transfer on January deadline day",
      "url": "https://football-italia.net/serie-a-done-deals-completed-transfer-deadline/",
      "source": "football-italia.net",
      "date": "2026-02-02T19:21:10+00:00",
      "summary": "The January transfer window in Serie A is closed, and Football Italia lists all the..."
    },
    {
      "id": "631ed95e69c9",
      "title": "Tavolieri: Mateta requires knee surgery after Milan medical failure – the situation",
      "url": "https://sempremilan.com/mateta-requires-surgery-milan-medical-failure",
      "source": "sempremilan.com",
      "date": "2026-02-02T19:00:00+00:00",
      "summary": "This afternoon, AC Milan pulled out of a deal to sign Jean-Philippe Mateta, due to a few reasons. However, the Frenchman will now head to surgery.  It has certainly been an interesting saga with Mateta, and the striker seemed almost guaranteed to be heading to San Siro at one point. Once again, the "
    },
    {
      "id": "4c25aa69b7b3",
      "title": "Conte aims jab at Allegri after response to fixture list complaints: “He is not playing that much”",
      "url": "https://sempremilan.com/conte-jab-allegri-fixture-list-complaints",
      "source": "sempremilan.com",
      "date": "2026-02-02T18:40:00+00:00",
      "summary": "Massimiliano Allegri and Antonio Conte had a bit of a jab at each other in the media during their press conferences on Monday. Allegri spoke in his pre-Bologna presser at Milanello today, and he seemed to address Conte’s complaints about how packed Napoli’s fixture list is, with Serie A, the Champio"
    },
    {
      "id": "380289857726",
      "title": "Sky: Predicted Milan XI vs. Bologna – what Allegri should do with absences to contend with",
      "url": "https://sempremilan.com/predicted-milan-xi-bologna-what-allegri-do",
      "source": "sempremilan.com",
      "date": "2026-02-02T18:20:00+00:00",
      "summary": "AC Milan have a pretty difficult game on Tuesday night, facing a tough side in Bologna. Even if they are not in form, the Rossoblu pose a threat.  It would be easy to suggest that Milan should win at the Dall’Ara tomorrow night due to Bologna’s recent struggles, but doing so will not be easy. […]\nTh"
    },
    {
      "id": "3e92c9cf6b6c",
      "title": "January transfer liveblog: Every news on deadline day",
      "url": "https://football-italia.net/january-transfer-liveblog-rumours-done-deals-2/",
      "source": "football-italia.net",
      "date": "2026-02-02T18:00:00+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "1007c1c94cf8",
      "title": "Official: AC Milan announce signing of Magnus Dalpiaz for Futuro squad – photo",
      "url": "https://sempremilan.com/official-ac-milan-sign-magnus-dalpiaz-bayern",
      "source": "sempremilan.com",
      "date": "2026-02-02T17:59:02+00:00",
      "summary": "AC Milan have announced a third deadline day arrival, with Magnus Dalpiaz joining from Bayern Munich. Dalpiaz arrived in Italy last night ahead of his medical, which took place throughout the course of deadline day. After completing the formalities, he went to Casa Milan to sign his contract, and no"
    },
    {
      "id": "24548ac59058",
      "title": "Official: Sia departs to join Segunda Division side CD Mirantes on loan",
      "url": "https://sempremilan.com/sia-departs-milan-join-cd-mirantes-loan",
      "source": "sempremilan.com",
      "date": "2026-02-02T17:45:00+00:00",
      "summary": "This evening, AC Milan have confirmed that Diego Sia has left the club on loan, joining CD Mirandes, who are bottom of the Spanish second division. With the Futuro project, Milan need to ensure that players are developing at the right rate. However, there will always be limitations to playing in Ser"
    },
    {
      "id": "fff7dd1bd2f0",
      "title": "Romano lifts lid on fall-out after Mateta deal collapse: “Unrest among all parties”",
      "url": "https://sempremilan.com/romano-fall-out-mateta-unrest-milan",
      "source": "sempremilan.com",
      "date": "2026-02-02T17:32:11+00:00",
      "summary": "Fabrizio Romano has shed a bit more light on the fall-out after Jean-Philippe Mateta’s move to AC Milan collapsed on deadline day. It has been nothing short of a chaotic last 24 hours for Mateta, Milan and Crystal Palace. On Sunday evening, it emerged that the Rossoneri had agreed a deal worth ‘in e"
    },
    {
      "id": "9fd0696e2c14",
      "title": "Serie A preview: Bologna vs. AC Milan – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-bologna-ac-milan-team-news-stats",
      "source": "sempremilan.com",
      "date": "2026-02-02T17:20:00+00:00",
      "summary": "If AC Milan are to continue fighting in the Scudetto, then Tuesday’s game against Bologna is must-win, especially considering their recent form.  As the last game of the weekend, Milan come into this needing a result. Failing to do so could write them off for the title. Nevertheless, just getting th"
    },
    {
      "id": "f2f623636667",
      "title": "Tonali agent: ‘No Arsenal talks, we’ll evaluate if Newcastle open to Juventus’",
      "url": "https://football-italia.net/tonali-agent-arsenal-talks-newcastle-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-02T17:00:10+00:00",
      "summary": "Sandro Tonali’s agent Beppe Riso denies reports he offered the Newcastle United player to Arsenal,..."
    },
    {
      "id": "b590d6f3b657",
      "title": "Sky: Pulisic ruled out of Milan’s trip to Bologna due to battle with bursitis",
      "url": "https://sempremilan.com/pulisic-out-bologna-milan-bursitis",
      "source": "sempremilan.com",
      "date": "2026-02-02T16:51:04+00:00",
      "summary": "Massimiliano Allegri will once again have a depleted attack at his disposal for tomorrow night’s game against Bologna. According to Sky, Milan will depart for the game on Tuesday night at the Stadio Renato dall’Ara without Christian Pulisic. Allegri said that Pulisic was dealing with bursitis in his"
    },
    {
      "id": "8a88acc59cb3",
      "title": "Serious Mateta injury behind failed Milan transfer – report",
      "url": "https://football-italia.net/serious-mateta-injury-failed-milan-transfer/",
      "source": "football-italia.net",
      "date": "2026-02-02T16:48:36+00:00",
      "summary": "Jean-Philippe Mateta has failed his medical tests with Milan, and according to Sacha Tavolieri, his..."
    },
    {
      "id": "be07e8bd7e6e",
      "title": "Milan star Pulisic ruled out of Bologna clash",
      "url": "https://football-italia.net/milan-star-pulisic-ruled-out-of-bologna-clash/",
      "source": "football-italia.net",
      "date": "2026-02-02T16:27:40+00:00",
      "summary": "Milan are travelling to Bologna for an away Serie A match without their star Christian..."
    },
    {
      "id": "4251fb33d8a0",
      "title": "Sky: How Milan’s points percentage against different parts of Serie A table compares to rivals",
      "url": "https://sempremilan.com/how-milan-points-percentage-compares-rivals",
      "source": "sempremilan.com",
      "date": "2026-02-02T16:25:58+00:00",
      "summary": "Sky have once again published the numbers regarding how the top four contenders do in games against different parts of the table. The Calcio Club took a look at the data when it comes to how Inter, Milan, Napoli, Juventus and Roma do against the different quadrants of the table: 1st to 5th, 6th to ["
    },
    {
      "id": "4c440ff4bd3a",
      "title": "Opposition insight ahead of Bologna-Milan: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-bologna-milan-february-2026",
      "source": "sempremilan.com",
      "date": "2026-02-02T16:00:00+00:00",
      "summary": "AC Milan will travel to the Stadio Renato Dall’Ara on Tuesday night to face a Bologna side who have been a bit hit and miss in recent Serie A fixtures. Taking the final spot on Matchday 23, Milan will hope to continue their unbeaten record in Serie A with a strong result against another European […]"
    },
    {
      "id": "c837b8bdd013",
      "title": "Official: AC Milan sign Alphadjo Cissè from Hellas Verona on permanent deal",
      "url": "https://sempremilan.com/official-ac-milan-sign-alphadjo-cisse",
      "source": "sempremilan.com",
      "date": "2026-02-02T15:33:29+00:00",
      "summary": "AC Milan have officially confirmed the signing of Alphadjo Cissè on a permanent deal from Hellas Verona. A statement on the club’s official website reads: “AC Milan is delighted to announce the permanent signing of Alphadjo Cissè from Hellas Verona. The midfielder, born in 2006, with continue his lo"
    },
    {
      "id": "b03c95b1a495",
      "title": "‘I was confident’ – Allegri addresses Maignan’s renewal and Modric’s future",
      "url": "https://sempremilan.com/allegri-addresses-maignan-renewal-modric-future",
      "source": "sempremilan.com",
      "date": "2026-02-02T15:16:35+00:00",
      "summary": "Massimiliano Allegri has expressed his delight regarding Mike Maignan’s renewal, and he confirmed Luka Modric will decide his future. It looked for a while like things would be very different, but the arrival of Allegri and Igli Tare – as well as the new coaching staff – has managed to mend the situ"
    },
    {
      "id": "c3ae3dbb4bc8",
      "title": "Reports: Milan decide not to sign Mateta after medical in Paris – the details",
      "url": "https://sempremilan.com/milan-decide-not-to-sign-mateta",
      "source": "sempremilan.com",
      "date": "2026-02-02T14:31:04+00:00",
      "summary": "AC Milan will not proceed with the signing of Jean-Philippe Mateta after undertaking further medical tests on his knees. Heading into deadline day, we knew that a deal had been agreed between Milan and Crystal Palace after negotiations over the weekend. It was expected that the striker would pass a "
    },
    {
      "id": "29d2a2266654",
      "title": "Milan deal for Crystal Palace striker Mateta has fallen through",
      "url": "https://football-italia.net/milan-deal-for-mateta-has-fallen-through/",
      "source": "football-italia.net",
      "date": "2026-02-02T14:28:35+00:00",
      "summary": "The latest updates in Italy claim that Milan’s deal for Crystal Palace striker Jean-Philippe Mateta..."
    },
    {
      "id": "3963a11dd2ce",
      "title": "Conte aims dig at Allegri and Milan: ‘Not playing that much’",
      "url": "https://football-italia.net/conte-aims-dig-allegri-milan-not-playing-much/",
      "source": "football-italia.net",
      "date": "2026-02-02T14:17:00+00:00",
      "summary": "Antonio Conte insists no action is being taken to ease the fixture congestion and taunts..."
    },
    {
      "id": "9cd905da4573",
      "title": "Sky: Juventus resume Mateta talks, propose different terms than Milan",
      "url": "https://football-italia.net/juventus-mateta-talks-different-terms-milan/",
      "source": "football-italia.net",
      "date": "2026-02-02T12:26:48+00:00",
      "summary": "Sky Sport Italia reports that Juventus have resumed talks for Jean-Philippe Mateta, but the Bianconeri..."
    },
    {
      "id": "56f47fdb0852",
      "title": "Nkunku set to stay with Milan beyond January deadline: ‘We’re happy with him’",
      "url": "https://football-italia.net/nkunku-set-to-stay-with-milan-beyond-january/",
      "source": "football-italia.net",
      "date": "2026-02-02T12:20:28+00:00",
      "summary": "According to the latest updates, Christopher Nkunku is set to stay on with Milan on..."
    },
    {
      "id": "30aa78cb6e24",
      "title": "Where Milan stand with Mateta heading into final hours of January transfer window",
      "url": "https://football-italia.net/where-milan-stand-with-mateta-on-deadline-day/",
      "source": "football-italia.net",
      "date": "2026-02-02T11:59:57+00:00",
      "summary": "Milan are still yet to make a final decision on Crystal Palace striker Jean-Philippe Mateta..."
    },
    {
      "id": "0be3dfa99cd6",
      "title": "Allegri: ‘Not right’ to talk about Mateta, ‘I’m happy with the guys I have at my disposal’",
      "url": "https://football-italia.net/allegri-not-right-to-talk-about-mateta/",
      "source": "football-italia.net",
      "date": "2026-02-02T11:39:31+00:00",
      "summary": "Massimiliano Allegri insists that it is ‘not right’ for him to comment on developments regarding..."
    },
    {
      "id": "0d9605bcd666",
      "title": "When is the 2026 January transfer deadline in Serie A?",
      "url": "https://football-italia.net/when-is-the-2026-january-transfer-deadline/",
      "source": "football-italia.net",
      "date": "2026-02-02T08:44:50+00:00",
      "summary": "January has brought plenty of transfer action in Serie A, but teams now have less..."
    },
    {
      "id": "95dc6085a265",
      "title": "Today’s Papers: Mateta tests, Audero shock, Inter flying, Juventus run continues",
      "url": "https://football-italia.net/todays-papers-mateta-tests-audero-shock/",
      "source": "football-italia.net",
      "date": "2026-02-02T08:34:03+00:00",
      "summary": "La Gazzetta dello Sport Inter run away (and thank Audero) Hit by a firework, the..."
    },
    {
      "id": "1ed7b9c5253e",
      "title": "Milan to send club doctor to London before making final Mateta decision",
      "url": "https://football-italia.net/milan-send-doctor-before-mateta-decision/",
      "source": "football-italia.net",
      "date": "2026-02-01T20:25:40+00:00",
      "summary": "Reports from various outlets in Italy claim that Milan will send a club doctor to..."
    },
    {
      "id": "12ed7bd1d2f4",
      "title": "Report Mateta transfer to Milan on standby despite agreement",
      "url": "https://football-italia.net/report-mateta-transfer-to-milan-on-standby/",
      "source": "football-italia.net",
      "date": "2026-02-01T18:20:29+00:00",
      "summary": "The latest updates in Italy claim that Milan’s deal for Crystal Palace striker Jean-Philippe Mateta..."
    }
  ]
}