{
  "lastUpdated": "2026-02-02T10:42:54.688452+00:00",
  "articles": [
    {
      "id": "90d33b5e2b29",
      "title": "The Boniface and Pubill precedents: Milan exercise caution again with Mateta",
      "url": "https://sempremilan.com/milan-caution-mateta-boniface-pubill-precedents",
      "source": "sempremilan.com",
      "date": "2026-02-02T10:37:15+00:00",
      "summary": "AC Milan head into deadline day still unsure if they are going to sign Jean-Philippe Mateta, despite a deal being agreed with Crystal Palace. On Sunday, The Athletic among other sources confirmed that Milan have agreed a deal worth ‘in excess of €30m’ to sign Mateta from Crystal Palace, with his med"
    },
    {
      "id": "d9596a0ad5b8",
      "title": "Milan and the ailments in attack: Allegri has never had his entire department (except in rare cases)",
      "url": "https://www.milannews.it/news/il-milan-e-gli-acciacchi-in-attacco-allegri-non-ha-mai-avuto-il-reparto-al-completo-salvo-rari-casi-606074",
      "source": "milannews.it",
      "date": "2026-02-02T10:30:00+00:00",
      "summary": "Milan are in emergency with attackers. In the last few hours, the Rossoneri club has been pushing for Crystal Palace's Jean-Philippe Mateta, with Max Allegri hoping to have a new player available to make up for the current medical emergency."
    },
    {
      "id": "63527c928054",
      "title": "De Paola rejects Nkunku: \"He was a bargain, but he didn't manage to do much\"",
      "url": "https://www.milannews.it/news/de-paola-boccia-nkunku-era-un-affare-ma-non-e-riuscito-a-fare-molto-606084",
      "source": "milannews.it",
      "date": "2026-02-02T10:20:00+00:00",
      "summary": "Paolo De Paola, connected on TMW Radio during Maracanà, analyzed Christopher Nkunku's performance at Milan in this way: \"Nkunku was a bargain, Tare took him to the half, he had a good pedigree but he couldn't ..."
    },
    {
      "id": "a02f80ad4d3f",
      "title": "GdS: Leao, Pulisic and Saelemaekers at risk – Allegri facing headaches ahead of Bologna trip",
      "url": "https://sempremilan.com/allegri-facing-headaches-ahead-of-bologna",
      "source": "sempremilan.com",
      "date": "2026-02-02T10:15:06+00:00",
      "summary": "AC Milan will be back in Serie A action on Tuesday night in Bologna, and Massimiliano Allegri will have a depleted attack. As La Gazzetta dello Sport (seen below) write this morning, Jean-Philippe Mateta’s arrival is hinging on an extra medical regarding his knee condition, while Allegri is preparin"
    },
    {
      "id": "6c7c7e66f2da",
      "title": "Bucchioni on Mateta: \"The surprise is there, because he doesn't seem to have any problems\"",
      "url": "https://www.milannews.it/news/bucchioni-su-mateta-la-sorpresa-c-e-perche-non-sembra-avere-problemi-di-nessun-tipo-606081",
      "source": "milannews.it",
      "date": "2026-02-02T10:10:00+00:00",
      "summary": "Enzo Bucchioni, in his usual editorial on TMW, spoke thus of Jean-Philippe Mateta: \"The surprise is because the Frenchman is playing consistently, he doesn't seem to have any problems of any kind, but in this ..."
    },
    {
      "id": "a0756a76afb5",
      "title": "LIVE MN - Milan transfer market: last day. Waiting for Mateta: what's happening in Paris. Visits for a former Bayern player",
      "url": "https://www.milannews.it/calciomercato-milan/live-mn-calciomercato-milan-ultimo-giorno-attesa-mateta-cosa-succede-a-parigi-visite-per-un-ex-bayern-606104",
      "source": "milannews.it",
      "date": "2026-02-02T10:00:43+00:00",
      "summary": "Friends of MilanNews.it, today is the last day of the transfer market! \nOur editorial staff will accompany you throughout the day with all the news on the Milan transfer market minute by minute."
    },
    {
      "id": "ef54c99e5724",
      "title": "Milan, change of plans? Odogu can stay with the Rossoneri",
      "url": "https://www.milannews.it/news/milan-cambio-di-programma-odogu-puo-rimanere-in-rossonero-606070",
      "source": "milannews.it",
      "date": "2026-02-02T10:00:00+00:00",
      "summary": "In these last hours of the transfer window, Milan are working on the path that should bring Jean-Philippe Mateta to Italy, with the Crystal Palace striker who will have to undergo an additional medical check-up."
    },
    {
      "id": "7078a4131265",
      "title": "Allegri and the choices towards Bologna: Saele out, Loftus-Cheek wildcard",
      "url": "https://www.milannews.it/news/allegri-e-le-scelte-verso-bologna-saele-out-loftus-cheek-jolly-606080",
      "source": "milannews.it",
      "date": "2026-02-02T09:50:00+00:00",
      "summary": "Milan is preparing for tomorrow night's away match against Bologna. As today's edition of the Gazzetta dello Sport explains, Massimiliano Allegri must design the Rossoneri board by adapting it to the numerous absences of the last few hours."
    },
    {
      "id": "3e92c9cf6b6c",
      "title": "January transfer liveblog: Juventus striker hunt, Mateta’s Milan medical",
      "url": "https://football-italia.net/january-transfer-liveblog-rumours-done-deals-2/",
      "source": "football-italia.net",
      "date": "2026-02-02T09:45:00+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "122ad448ffe5",
      "title": "In the end Disasi will remain in England: a loan to West Ham is one step away",
      "url": "https://www.milannews.it/news/alla-fine-disasi-restera-in-inghilterra-a-un-passo-il-prestito-al-west-ham-606103",
      "source": "milannews.it",
      "date": "2026-02-02T09:44:00+00:00",
      "summary": "He was a target for Milan, then discarded, but in the end he will remain in London and continue to play in the Premier League. As reported by Sky, Axel Disasi is ready to move to West Ham."
    },
    {
      "id": "27511a998839",
      "title": "Towards Bologna-Milan, Allegri has the short deck: Max's solutions",
      "url": "https://www.milannews.it/news/verso-bologna-milan-allegri-ha-la-coperta-corta-le-soluzioni-di-max-606075",
      "source": "milannews.it",
      "date": "2026-02-02T09:40:00+00:00",
      "summary": "Market and pitch, the combination on which Milan is focusing. If the management is understanding the situation regarding Jean-Philippe Mateta, Massimiliano Allegri is preparing for tomorrow night's away match against Bologna."
    },
    {
      "id": "9ff33510a069",
      "title": "Official: AC Milan announce signing of Yahya Idrissi Regragui for Futuro squad – photo",
      "url": "https://sempremilan.com/official-ac-milan-yahya-idrissi-chelsea",
      "source": "sempremilan.com",
      "date": "2026-02-02T09:37:08+00:00",
      "summary": "AC Milan have got their first deal officially across the line, as Yahya Idrissi Regragui has arrived from Chelsea. A statement on the official website reads as follows: “AC Milan is pleased to announce the signing of Yahya Idrissi, who will be part of the Milan Futuro Project, dedicated to the growt"
    },
    {
      "id": "66f42d70ba77",
      "title": "Between Disasi and Gimenez there is De Winter: he is the solution already at home",
      "url": "https://www.milannews.it/news/tra-disasi-e-gimenez-c-e-de-winter-e-la-soluzione-gia-in-casa-606069",
      "source": "milannews.it",
      "date": "2026-02-02T09:30:00+00:00",
      "summary": "These are hectic hours for Milan, who in the final hours of this winter transfer window still have to clear up their reserves."
    },
    {
      "id": "83a0a101a0a2",
      "title": "Tuttosport: Mateta now, Vlahovic in June – Milan plotting ‘revolution’ in attack",
      "url": "https://sempremilan.com/milan-plot-attacking-revolution-mateta-vlahovic",
      "source": "sempremilan.com",
      "date": "2026-02-02T09:26:55+00:00",
      "summary": "AC Milan’s plan for the attacking department involves a potential signing in January and one in June, a report has claimed. The final hours of the winter window could well be hectic for Milan, as Jean-Philippe Mateta has dominated the scene over the past 24 hours. There is a deal agreed with Crystal"
    },
    {
      "id": "377a1c2187e8",
      "title": "OFFICIAL: The young Idrissi-Regragui is a new Rossoneri player",
      "url": "https://www.milannews.it/milan-futuro/ufficiale-il-giovane-idrissi-regragui-e-un-nuovo-calciatore-rossonero-606102",
      "source": "milannews.it",
      "date": "2026-02-02T09:20:00+00:00",
      "summary": "New reinforcement for Milan Futuro: the arrival of the young Yahya Idrissi-Regragui has been announced."
    },
    {
      "id": "a8b0616454de",
      "title": "Idrissi, Cissé and Dalpiaz: Milan and the new trio of young players",
      "url": "https://www.milannews.it/news/idrissi-cisse-e-dalpiaz-il-milan-e-il-nuovo-tris-di-giovani-606068",
      "source": "milannews.it",
      "date": "2026-02-02T09:10:00+00:00",
      "summary": "Not only the intrigue for Jean-Philippe Mateta: Milan, in fact, in the last few hours has closed three operations to strengthen their green line. Today's edition of Corriere dello Sport talks about it."
    },
    {
      "id": "1e60abad6348",
      "title": "Watch: Bayern Munich talent arrives ahead of Milan medical – the terms of the deal",
      "url": "https://sempremilan.com/bayern-dalpiaz-milan-medical-terms-deal",
      "source": "sempremilan.com",
      "date": "2026-02-02T09:01:04+00:00",
      "summary": "Magnus Dalpiaz arrived in Italy last night ahead of his medical before joining AC Milan from Bayern Munich. A lot of the late movement for Milan in this winter window has been regarding young talents set to bolster the youth system. For example, Verona’s Alphadjo Cisse and Chelsea’s Yahya Idrissi Re"
    },
    {
      "id": "e94b9a6d61bb",
      "title": "Milan and the offensive revolution in the summer: waiting for Mateta, Vlahovic remains in the sights for June",
      "url": "https://www.milannews.it/primo-piano/il-milan-e-la-rivoluzione-offensiva-in-estate-in-attesa-per-mateta-per-giugno-vlahovic-resta-nel-mirino-606099",
      "source": "milannews.it",
      "date": "2026-02-02T09:00:00+00:00",
      "summary": "Very frenetic last few hours of the transfer window at Milan. In the last 24 hours, Jean-Philippe Mateta has taken over the scene entirely."
    },
    {
      "id": "c8f24a8f0fa9",
      "title": "Reports: Further tests in London or Paris – why the Mateta to Milan deal is in doubt",
      "url": "https://sempremilan.com/why-mateta-milan-deal-in-doubt",
      "source": "sempremilan.com",
      "date": "2026-02-02T08:51:31+00:00",
      "summary": "It seems that the Jean-Philippe Mateta deal will go right down to the wire, with AC Milan looking to do some extra medical checks. The big news of the past 24 hours is that Milan have agreed a deal worth ‘in excess of €30m’ to sign Mateta from Crystal Palace, as per The Athletic among other […]\nThe "
    },
    {
      "id": "cc9a81ea1fda",
      "title": "The Athletic: \"AC Milan are carrying out further medical checks on Mateta\"",
      "url": "https://www.milannews.it/calciomercato-milan/the-athletic-il-milan-sta-effettuando-ulteriori-controlli-medici-su-mateta-606101",
      "source": "milannews.it",
      "date": "2026-02-02T08:51:00+00:00",
      "summary": "Decisive hours for Jean-Philippe Mateta: as reported by colleague David Ornstein of The Athletic, Milan are carrying out further medical checks on the French footballer in London."
    },
    {
      "id": "2467bd3afb32",
      "title": "Towards Bologna-Milan, the Gazzetta: \"Leao will have to grit his teeth. Pulisic hopes for the bench\"",
      "url": "https://www.milannews.it/rassegna-stampa/verso-bologna-milan-la-gazzetta-leao-dovra-stringere-i-denti-pulisic-spera-per-la-panchina-606079",
      "source": "milannews.it",
      "date": "2026-02-02T08:50:00+00:00",
      "summary": "Market and pitch: if the Milan management is working assiduously for Jean-Philippe Mateta, Massimiliano Allegri is instead preparing for tomorrow evening's away match against Bologna."
    },
    {
      "id": "0d9605bcd666",
      "title": "When is the 2026 January transfer deadline in Serie A?",
      "url": "https://football-italia.net/when-is-the-2026-january-transfer-deadline/",
      "source": "football-italia.net",
      "date": "2026-02-02T08:44:50+00:00",
      "summary": "January has brought plenty of transfer action in Serie A, but teams now have less..."
    },
    {
      "id": "38ac76aed333",
      "title": "Tuttosport on the Mateta mystery: \"Alarming visits, new tests today\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-sul-giallo-mateta-visite-allarmanti-oggi-nuovi-esami-606072",
      "source": "milannews.it",
      "date": "2026-02-02T08:40:00+00:00",
      "summary": "At Milan it will be necessary to understand the evolution of the intricate affair concerning Jean-Philippe Mateta. Today's edition of Tuttosport talks about it: \"Alarming visits, today new tests will be decisive\"."
    },
    {
      "id": "c9869243652e",
      "title": "AC Milan Deadline Day LIVE: Mateta deal in doubt but several talents set to join",
      "url": "https://sempremilan.com/ac-milan-deadline-day-live-winter-2026",
      "source": "sempremilan.com",
      "date": "2026-02-02T08:36:59+00:00",
      "summary": "{rsn-live-v2}\nThe post AC Milan Deadline Day LIVE: Mateta deal in doubt but several talents set to join appeared first on SempreMilan."
    },
    {
      "id": "95dc6085a265",
      "title": "Today’s Papers: Mateta tests, Audero shock, Inter flying, Juventus run continues",
      "url": "https://football-italia.net/todays-papers-mateta-tests-audero-shock/",
      "source": "football-italia.net",
      "date": "2026-02-02T08:34:03+00:00",
      "summary": "La Gazzetta dello Sport Inter run away (and thank Audero) Hit by a firework, the..."
    },
    {
      "id": "e2f3b2a8a808",
      "title": "Allegri's choices towards Bologna, CorSport: \"Loftus-Cheek with Nkunku, an unprecedented pair\"",
      "url": "https://www.milannews.it/rassegna-stampa/le-scelte-di-allegri-verso-bologna-il-corsport-loftus-cheek-con-nkunku-coppia-inedita-606067",
      "source": "milannews.it",
      "date": "2026-02-02T08:30:00+00:00",
      "summary": "Between the market and the field. These are hectic hours at Milan due to the Jean-Philippe Mateta operation, but they are also the hours leading up to tomorrow evening's away match against Bologna."
    },
    {
      "id": "894f5f1ba3d3",
      "title": "La Gazzetta on Milan's attack: \"Gimenez will leave in the summer, Fullkrug pending\"",
      "url": "https://www.milannews.it/rassegna-stampa/la-gazzetta-sull-attacco-del-milan-gimenez-partira-in-estate-fullkrug-in-sospeso-606078",
      "source": "milannews.it",
      "date": "2026-02-02T08:20:00+00:00",
      "summary": "Attack of the present and attack of the future. At Milan we are thinking on several fronts."
    },
    {
      "id": "2fffa1302456",
      "title": "Tuttosport on Milan's offensive department: \"It will be a revolution going forward in June. And DV9 doesn't fade\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-sul-reparto-offensivo-del-milan-a-giugno-in-avanti-sara-rivoluzione-e-dv9-non-sfuma-606071",
      "source": "milannews.it",
      "date": "2026-02-02T08:10:00+00:00",
      "summary": "Frantic final hours of the transfer market for Milan, who on this last day are trying to close for Crystal Palace's Jean-Philippe Mateta."
    },
    {
      "id": "32f1525724e3",
      "title": "Milan's dilemma, CorSport: \"Mateta on stand-by\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-dilemma-del-milan-il-corsport-mateta-in-stand-by-606066",
      "source": "milannews.it",
      "date": "2026-02-02T08:00:00+00:00",
      "summary": "A complicated intrigue, a knot to unravel in these final hours of the market."
    },
    {
      "id": "b0db99a6d12d",
      "title": "La Gazzetta on the Milan market: \"Mateta Intrigue\"",
      "url": "https://www.milannews.it/rassegna-stampa/la-gazzetta-sul-mercato-del-milan-intrigo-mateta-606077",
      "source": "milannews.it",
      "date": "2026-02-02T07:50:00+00:00",
      "summary": "Decisive hours at Milan for the operation that should bring Jean-Philippe Mateta to the Rossoneri. Today's edition of the Gazzetta dello Sport talks about it extensively, with the headline: \"Intrigo Mateta\"."
    },
    {
      "id": "1ed7b9c5253e",
      "title": "Milan to send club doctor to London before making final Mateta decision",
      "url": "https://football-italia.net/milan-send-doctor-before-mateta-decision/",
      "source": "football-italia.net",
      "date": "2026-02-01T20:25:40+00:00",
      "summary": "Reports from various outlets in Italy claim that Milan will send a club doctor to..."
    },
    {
      "id": "7260407d812b",
      "title": "All’s well that ends well: The chronology of Maignan’s renewal and how Milan thawed the frost",
      "url": "https://sempremilan.com/chronology-maignan-renewal-milan-thawed-frost",
      "source": "sempremilan.com",
      "date": "2026-02-01T19:43:07+00:00",
      "summary": "There was a wave of joy in the AC Milan world on Saturday evening, as Mike Maignan’s contract extension was made official. Suggestions had emerged during the week that Maignan would put pen to paper on a new multi-year deal, and the announcement of his new deal until 2031 did indeed come. It has bee"
    },
    {
      "id": "8fd35966eb36",
      "title": "MN: The three ideas Allegri has in mind amid Saelemaekers’ Bologna absence",
      "url": "https://sempremilan.com/three-ideas-allegri-saelemaekers-bologna-absence",
      "source": "sempremilan.com",
      "date": "2026-02-01T18:37:20+00:00",
      "summary": "Alexis Saelemaekers will be missing Tuesday night’s trip to face Bologna because he has not fully recovered from an adductor problem. As MilanNews recall, Saelemaekers seemed to be fully fit again last week, so much so that Max Allegri named him as a starter in last Sunday’s trip to Rome. The Belgia"
    },
    {
      "id": "12ed7bd1d2f4",
      "title": "Report Mateta transfer to Milan on standby despite agreement",
      "url": "https://football-italia.net/report-mateta-transfer-to-milan-on-standby/",
      "source": "football-italia.net",
      "date": "2026-02-01T18:20:29+00:00",
      "summary": "The latest updates in Italy claim that Milan’s deal for Crystal Palace striker Jean-Philippe Mateta..."
    },
    {
      "id": "58927d46d95f",
      "title": "Reports: Mateta to Milan deal ‘put on hold for several reasons’ – the situation",
      "url": "https://sempremilan.com/mateta-milan-on-hold-several-reasons",
      "source": "sempremilan.com",
      "date": "2026-02-01T18:19:51+00:00",
      "summary": "There has been another twist in the Jean-Philippe Mateta saga, as AC Milan are now evaluating whether to sign him before the deadline. It seemed as though everything was done and that Mateta would sign before the window closes. The Athletic even stated that the Frenchman is undergoing a medical toda"
    },
    {
      "id": "1ccf848f19f6",
      "title": "Reports: Sergio Ramos suggestion resurfaces for Milan – the rival bid",
      "url": "https://sempremilan.com/sergio-ramos-suggestion-resurfaces-milan",
      "source": "sempremilan.com",
      "date": "2026-02-01T17:11:21+00:00",
      "summary": "AC Milan are still looking for the right centre-back at the end of the winter window, and Sergio Ramos’ name has once again been put forward. Calciomercato.com confirm that Milan are in search of a versatile, experienced and strong central defender to reinforce the department for Massimiliano Allegr"
    },
    {
      "id": "5eddc01747e4",
      "title": "AC Milan Women 2-1 Genoa: Van Dooren the star again with another match-winning brace",
      "url": "https://sempremilan.com/ac-milan-women-2-1-genoa-match-report",
      "source": "sempremilan.com",
      "date": "2026-02-01T16:35:12+00:00",
      "summary": "AC Milan Women had another positive result on Sunday afternoon as they beat Genoa thanks to a late goal. The Milan Women clinched a convincing win, their first of the year, as they beat Ternana 3-0 at home last Sunday. Kayleigh van Dooren scored twice, one of which was assisted by Thea Kyvåg who the"
    },
    {
      "id": "5890087ed87f",
      "title": "Why Milan decided against signing Chelsea defender Disasi",
      "url": "https://football-italia.net/why-milan-not-signing-chelsea-disasi/",
      "source": "football-italia.net",
      "date": "2026-02-01T15:52:34+00:00",
      "summary": "Milan have reportedly decided against signing Chelsea defender Axel Disasi following ‘technical assessments’ made with..."
    },
    {
      "id": "c981385501d4",
      "title": "Sky: Allegri tries out Nkunku and Loftus-Cheek front two with attack depleted – the latest",
      "url": "https://sempremilan.com/allegri-tries-nkunku-loftus-cheek-front-two",
      "source": "sempremilan.com",
      "date": "2026-02-01T15:48:36+00:00",
      "summary": "AC Milan will return to Serie A action in two days when they face Bologna away from home, but Massimiliano Allegri has some selection headaches. Milan will take to the field at the Stadio Renato dall’Ara on Tuesday at 20:45 CET to conclude the 23rd round of Serie A Enilive, hoping to keep the pressu"
    },
    {
      "id": "7ced8c889f25",
      "title": "Mateta medical given green light ahead of Milan transfer",
      "url": "https://football-italia.net/mateta-medical-given-greenlight/",
      "source": "football-italia.net",
      "date": "2026-02-01T15:34:33+00:00",
      "summary": "Jean-Philippe Mateta is set to have a medical on Sunday ahead of a permanent transfer..."
    },
    {
      "id": "13fbdb95a42b",
      "title": "Athletic: Mateta undergoing medical with AC Milan – deal ‘in excess of €30m’ agreed",
      "url": "https://sempremilan.com/mateta-undergoing-medical-milan-30m-deal",
      "source": "sempremilan.com",
      "date": "2026-02-01T15:28:09+00:00",
      "summary": "Crystal Palace striker Jean-Phillipe Mateta is currently undergoing a medical ahead of a move to AC Milan, reports claim. The links with Mateta have intensified in the past few days, but the deal was dependant on Crystal Palace finding a replacement. They have now got a deal done for Jorgen Strand L"
    },
    {
      "id": "9cd25ffe2048",
      "title": "Romano: Bayern Munich obtain buy-back clause as part of Dalpiaz deal with Milan",
      "url": "https://sempremilan.com/bayern-munich-buy-back-milan-dalpiaz",
      "source": "sempremilan.com",
      "date": "2026-02-01T15:00:48+00:00",
      "summary": "AC Milan will sign a talented young defender from Bayern Munich, but there will be a buy-back clause as part of the deal. A lot of the movement Milan are doing late in the window seems to be geared around signing young players for the future with high potential, and it seems that several deals […]\nT"
    },
    {
      "id": "e1d0a9aa5edc",
      "title": "Milan handed Mateta boost as Strand Larsen set for Palace medical",
      "url": "https://football-italia.net/milan-mateta-boost-strand-larsen-palace-deal/",
      "source": "football-italia.net",
      "date": "2026-02-01T14:40:02+00:00",
      "summary": "Multiple sources claim that Wolverhampton Wanderers have accepted an offer from Crystal Palace for Jorgen..."
    },
    {
      "id": "0d892182c082",
      "title": "Athletic: Crystal Palace have €55m bid for Wolves star accepted – Mateta situation could unlock",
      "url": "https://sempremilan.com/crystal-palace-larsen-accepted-mateta-unlock",
      "source": "sempremilan.com",
      "date": "2026-02-01T14:18:51+00:00",
      "summary": "The pieces may be falling into place for AC Milan to get Jean-Philippe Mateta, was Crystal Palace seem to have found his replacement. La Gazzetta dello Sport spoke this morning about the time pressures when it comes to getting the Mateta deal done. He will either arrive before the 20:00 CET deadline"
    },
    {
      "id": "9da2f83e0848",
      "title": "Hellas Verona 4-1 Milan Primavera: Vermesan’s 11-minute hat-trick puts Milan to the sword",
      "url": "https://sempremilan.com/hellas-verona-4-1-milan-primavera-match-report",
      "source": "sempremilan.com",
      "date": "2026-02-01T13:44:07+00:00",
      "summary": "Milan Primavera had yet another disappointing result on Sunday afternoon as they were well beaten by high-flying Verona away from home. The Primavera were held to a draw in the derby against Inter in their last fixture, squandering a two-goal lead and experiencing late heartbreak once again to draw "
    },
    {
      "id": "cadac86ea26f",
      "title": "Gabbia discusses Maignan’s renewal, Allegri’s impact and Scudetto belief: “We’re a good team”",
      "url": "https://sempremilan.com/gabbia-maignan-allegri-scudetto-belief",
      "source": "sempremilan.com",
      "date": "2026-02-01T13:10:00+00:00",
      "summary": "Matteo Gabbia has insisted that AC Milan believe in winning the Scudetto this season, also shedding light on Massimiliano Allegri’s impact. From the very early days of Allegri’s second spell in charge of Milan it was apparent that Gabbia is one of the players that he wants to build around. The Itali"
    },
    {
      "id": "96a7cf8f33af",
      "title": "Watch: Why Cisse and Regragui could be exciting signings for Milan’s future",
      "url": "https://sempremilan.com/why-cisse-regragui-exciting-signings-milan",
      "source": "sempremilan.com",
      "date": "2026-02-01T12:45:00+00:00",
      "summary": "AC Milan are set to complete two very exciting signings in terms of players with future potential: Alphadjo Cisse and Yahya Idrissi Regragui. Both Cisse and Regragui actually arrived at La Madonnina clinic this morning to undergo their medical tests ahead of signing for Milan. Both will join on perm"
    },
    {
      "id": "a386fd078986",
      "title": "GdS: Saelemaekers and Pulisic could both miss Bologna game – Allegri’s solutions",
      "url": "https://sempremilan.com/saelemaekers-pulisic-could-miss-bologna-solutions",
      "source": "sempremilan.com",
      "date": "2026-02-01T12:20:00+00:00",
      "summary": "A couple of bits of bad news have arrived regarding two important players in view of the trip to face Bologna. Tuesday night’s match at the Stadio Renato Dall’Ara against Vincenzo Italiano’s Bologna is approaching, with the Rossoblu coming off a resounding 3-0 Europa League victory over Maccabi Tel "
    },
    {
      "id": "1b9cb60a6c31",
      "title": "Milan move for unhappy Mateta under threat as Crystal Palace struggle to find replacement",
      "url": "https://football-italia.net/milan-move-for-mateta-under-threat-palace/",
      "source": "football-italia.net",
      "date": "2026-01-31T18:40:04+00:00",
      "summary": "Milan’s pursuit of Jean-Philippe Mateta has hit a fresh obstacle as Crystal Palace struggle to..."
    },
    {
      "id": "e04ac95912a5",
      "title": "Official: Maignan signs new deal with Milan until 2031",
      "url": "https://football-italia.net/official-maignan-signs-new-deal-milan-2031/",
      "source": "football-italia.net",
      "date": "2026-01-31T18:20:12+00:00",
      "summary": "AC Milan have secured the long-term future of captain Mike Maignan, with the goalkeeper putting..."
    },
    {
      "id": "132dcdaa7db5",
      "title": "Maignan has signed new Milan contract to June 2030 plus option",
      "url": "https://football-italia.net/maignan-has-signed-new-milan-contract-to-2030/",
      "source": "football-italia.net",
      "date": "2026-01-31T16:14:20+00:00",
      "summary": "Milan are not expected to announce it until Sunday, but today Mike Maignan signed the..."
    },
    {
      "id": "1e742de01acd",
      "title": "Report Disasi only wants Milan, tells Chelsea to stall West Ham",
      "url": "https://football-italia.net/report-disasi-milan-chelsea-to-stall-west-ham/",
      "source": "football-italia.net",
      "date": "2026-01-31T15:38:14+00:00",
      "summary": "Reports continue to swirl that Chelsea defender Axel Disasi has chosen Milan as his priority..."
    },
    {
      "id": "2600a842ee0b",
      "title": "Official: Date and location of Milan vs. Como match confirmed after Australia debacle",
      "url": "https://football-italia.net/date-location-of-milan-vs-como-match-confirmed/",
      "source": "football-italia.net",
      "date": "2026-01-31T13:38:18+00:00",
      "summary": "The Serie A match between Milan and Como, which the league had sought to play..."
    },
    {
      "id": "9346aac61f82",
      "title": "Two hurdles for Milan to overcome before landing Mateta deal with Crystal Palace",
      "url": "https://football-italia.net/two-hurdles-for-milan-to-overcome-for-mateta/",
      "source": "football-italia.net",
      "date": "2026-01-31T09:22:04+00:00",
      "summary": "Reports in Italy claim that Milan are closing in on a full agreement with Crystal..."
    },
    {
      "id": "fa3dcf4ac29b",
      "title": "Today’s Papers: Milan all in for Mateta, Until the end for Juventus and Kolo Muani",
      "url": "https://football-italia.net/todays-papers-milan-all-in-for-mateta/",
      "source": "football-italia.net",
      "date": "2026-01-31T08:34:07+00:00",
      "summary": "La Gazzetta dello Sport Mateta: It’s a yes  The Frenchman wants Milan immediately Negotiations for..."
    },
    {
      "id": "0e648c8d7668",
      "title": "Glasner confirms Crystal Palace drop Mateta for Forest clash, fuelling Milan speculation",
      "url": "https://football-italia.net/mateta-dropped-not-forest-milan-speculation/",
      "source": "football-italia.net",
      "date": "2026-01-30T16:21:23+00:00",
      "summary": "Crystal Palace coach Oliver Glasner confirms Milan target Jean-Philippe Mateta won’t be part of the..."
    },
    {
      "id": "210e88203f90",
      "title": "Maignan set to sign new Milan contract, Roma ask for Nkunku",
      "url": "https://football-italia.net/maignan-signs-new-milan-contract-roma-nkunku/",
      "source": "football-italia.net",
      "date": "2026-01-30T14:03:32+00:00",
      "summary": "Sky Sport Italia reports that Mike Maignan will put pen to paper on a new..."
    },
    {
      "id": "5d048c937f37",
      "title": "Milan agreement for Mateta who prefers Rossoneri over Nottingham Forest – report",
      "url": "https://football-italia.net/milan-agreement-mateta-nottingham-forest/",
      "source": "football-italia.net",
      "date": "2026-01-30T09:47:40+00:00",
      "summary": "La Gazzetta dello Sport claims Milan have agreed a deal to bring in Jean-Philippe Mateta..."
    },
    {
      "id": "b9cb4f9e51f5",
      "title": "Report Milan fight for Mateta with Nottingham Forest and Juventus",
      "url": "https://football-italia.net/report-milan-mateta-nottingham-forest-juventus/",
      "source": "football-italia.net",
      "date": "2026-01-29T17:31:42+00:00",
      "summary": "Milan are reportedly trying to hijack Nottingham Forest’s bid for Crystal Palace striker Jean-Philippe Mateta,..."
    },
    {
      "id": "69318b559f5a",
      "title": "Milan look to Tottenham, Man City and Lazio for defensive reinforcement",
      "url": "https://football-italia.net/milan-tottenham-man-city-defence-reinforcement/",
      "source": "football-italia.net",
      "date": "2026-01-29T14:07:00+00:00",
      "summary": "According to reports in Italy, Milan are interested in Manchester City defender Nathan Aké, Tottenham’s..."
    }
  ]
}