{
  "lastUpdated": "2026-02-15T21:23:19.678540+00:00",
  "articles": [
    {
      "id": "9e82f24d2936",
      "title": "Pedullà: “Modric, at 40, has more desire and humility than someone who is 20”",
      "url": "https://www.milannews.it/news/pedulla-modric-a-40-anni-ha-piu-voglia-e-umilta-di-chi-ne-ha-20-607455",
      "source": "milannews.it",
      "date": "2026-02-15T21:12:36+00:00",
      "summary": "On his YouTube channel, Alfredo Pedullà commented on last night's match between Pisa and Milan, decided by Luka Modric, on which he then expressed himself as follows:\n\n“You saw the match but since the result counts, and there ..."
    },
    {
      "id": "a021e8254d10",
      "title": "Season over for Alphadjo Cissè: the class of 2006 will have to operate",
      "url": "https://www.milannews.it/news/stagione-finita-per-alphadjo-cisse-il-classe-2006-si-dovra-operare-607549",
      "source": "milannews.it",
      "date": "2026-02-15T21:00:57+00:00",
      "summary": "The adductor problem suffered during the last weekend of Serie B ended up being more serious than expected for AC Milan's new signing, Alphadjo Cissè, on loan at Catanzaro."
    },
    {
      "id": "533942012bd2",
      "title": "Calamai: \"Many at his age and with his history would have gone to winter among the sheikhs. Great lesson from Modric\"",
      "url": "https://www.milannews.it/news/calamai-molti-alla-sua-eta-e-con-la-sua-storia-sarebbero-andati-a-svernare-tra-gli-sceicchi-grande-lezione-di-modric-607507",
      "source": "milannews.it",
      "date": "2026-02-15T20:49:26+00:00",
      "summary": "Luca Calamai, journalist, expressed himself as follows on TMW on Luka Modric: \"Let's go back to Milan's success in Pisa. To the magic of Modric."
    },
    {
      "id": "7d56be62ef3d",
      "title": "Tonali show! First English double for the former Rossoneri player",
      "url": "https://www.milannews.it/dall-estero/tonali-show-prima-doppietta-inglese-per-l-ex-rossonero-607524",
      "source": "milannews.it",
      "date": "2026-02-15T20:37:34+00:00",
      "summary": "Yesterday the fourth round of the FA Cup was played, the most romantic cup in English football and perhaps in the entire football universe."
    },
    {
      "id": "a4beb2f75746",
      "title": "Borghi points out: \"On Pisa's goal you can see the individual limitations of Milan's defenders\"",
      "url": "https://www.milannews.it/news/borghi-fa-notare-sul-gol-del-pisa-si-vedono-i-limiti-individuali-dei-difensori-del-milan-607457",
      "source": "milannews.it",
      "date": "2026-02-15T20:25:26+00:00",
      "summary": "On his YouTube channel, Borghi spoke about the Pisa match on Friday evening, analyzing the general and individual performances."
    },
    {
      "id": "e1024fc36243",
      "title": "Passerini: \"Be careful, though: the small taboo still seems far from being broken. Too much effort in Pisa too\"",
      "url": "https://www.milannews.it/news/passerini-attenzione-pero-il-tabu-piccole-sembra-ancora-lontano-dall-essere-spezzato-anche-a-pisa-troppa-fatica-607405",
      "source": "milannews.it",
      "date": "2026-02-15T20:13:09+00:00",
      "summary": "Carlos Passerini, journalist, expressed himself in the Corriere della Sera on Milan in Pisa: \"Modric is the dream catcher."
    },
    {
      "id": "126f2e52718e",
      "title": "What if the victory against Juventus virtually gives Inter the Scudetto? Amoruso does not close the game for Milan",
      "url": "https://www.milannews.it/news/se-la-vittoria-contro-la-juve-consegna-virtualmente-lo-scudetto-all-inter-amoruso-non-chiude-i-giochi-per-il-milan-607515",
      "source": "milannews.it",
      "date": "2026-02-15T20:00:47+00:00",
      "summary": "Nicola Amoruso, former striker, interviewed by TuttoMercatoWeb."
    },
    {
      "id": "8ea619ac5907",
      "title": "Pellegatti: “Tiring match, qualitatively a step back compared to Bologna”",
      "url": "https://www.milannews.it/news/pellegatti-partita-faticosa-qualitativamente-passo-indietro-rispetto-a-bologna-607452",
      "source": "milannews.it",
      "date": "2026-02-15T19:48:24+00:00",
      "summary": "In his YouTube channel, Carlo Pellegatti spoke again about the match in Pisa."
    },
    {
      "id": "7a811f853096",
      "title": "Como, Fabregas: \"I showed the team some emotional videos, maybe it was too much. I didn't find the way to give the right energy\"",
      "url": "https://www.milannews.it/news/como-fabregas-ho-fatto-vedere-dei-video-emozionali-alla-squadra-forse-e-stato-troppo-non-ho-trovato-il-modo-di-dare-l-energia-giusta-607510",
      "source": "milannews.it",
      "date": "2026-02-15T19:36:03+00:00",
      "summary": "Cesc Fabregas, coach of Como, expressed himself as follows to Sky Sport, speaking like this after the 2-1 defeat against Fiorentina: \"It didn't happen that there is a poor coach who hasn't found a way to make r ..."
    },
    {
      "id": "f4aa85284ebf",
      "title": "Tuttosport: Milan courting ‘a new Jimenez’ – how a deal could aid multiple areas",
      "url": "https://sempremilan.com/milan-courting-new-jimenez",
      "source": "sempremilan.com",
      "date": "2026-02-15T19:30:00+00:00",
      "summary": "AC Milan are looking to Real Madrid once again, and there is hope that there is another project player for them to discover. After the success of Alex Jimenez, where Milan made a nice profit, Milan are once again looking to Madrid for another gem to develop. In fact, it seems that one has already […"
    },
    {
      "id": "39d6d71391e9",
      "title": "The updated Serie A standings after Bologna's victory in Turin",
      "url": "https://www.milannews.it/news/la-classifica-aggiornata-di-serie-a-dopo-la-vittoria-del-bologna-a-torino-607548",
      "source": "milannews.it",
      "date": "2026-02-15T19:24:56+00:00",
      "summary": "Bologna returns to winning the championship exactly one month after the last time. Torino were beaten 2-1 thanks to Vlasic's own goal (who then equalized the score) and a great goal from Santiago Castro."
    },
    {
      "id": "04ba0d537451",
      "title": "Moretto: \"We'll see what Gerard Martin's future will be: AC Milan are certainly looking at it\"",
      "url": "https://www.milannews.it/calciomercato-milan/moretto-vedremo-quale-sara-il-futuro-di-gerard-martin-di-sicuro-il-milan-lo-sta-visionando-607547",
      "source": "milannews.it",
      "date": "2026-02-15T19:17:50+00:00",
      "summary": "Matteo Moretto, in a video published on Fabrizio Romano's YouTube channel, talks about a Barcelona player followed by Milan."
    },
    {
      "id": "8e4445de14af",
      "title": "MN EXCLUSIVE - Gavillucci: \"Not being able to use technology to restore the truth in the field represents a clear limit of the system\"",
      "url": "https://www.milannews.it/esclusive-mn/esclusiva-mn-gavillucci-non-poter-utilizzare-la-tecnologia-per-ripristinare-la-verita-in-campo-rappresenta-un-limite-evidente-del-sistema-607545",
      "source": "milannews.it",
      "date": "2026-02-15T19:00:00+00:00",
      "summary": "The Kalulu-Bastoni episode was the classic straw that broke the camel's back, definitively uncovering Pandora's box on an Italian refereeing class in confusion and which in recent years has not proven itself at all ..."
    },
    {
      "id": "c9748545a032",
      "title": "GdS: Milan Futuro’s forced reset has been strengthened by recent graduates",
      "url": "https://sempremilan.com/milan-futuro-forced-reset-strengthened",
      "source": "sempremilan.com",
      "date": "2026-02-15T19:00:00+00:00",
      "summary": "AC Milan had big expectations for the Futuro project, and it certainly did not start well with relegation. However, it is still proving to be a success. The relegation to Serie D could have closed the door on the Milan Futuro project. Instead, though, it has been strengthened, and there is a case to"
    },
    {
      "id": "f121b741acc0",
      "title": "Collovati: \"Rocchi resign! Every Sunday we talk about sensational refereeing errors. It's no longer possible\"",
      "url": "https://www.milannews.it/news/collovati-rocchi-dia-le-dimissioni-tutte-le-domeniche-siamo-a-parlare-di-errori-arbitrali-clamorosi-non-e-piu-possibile-607506",
      "source": "milannews.it",
      "date": "2026-02-15T18:49:21+00:00",
      "summary": "Fulvio Collovati, former player of Inter, Milan and world champion with the Italian national team in 1982, expressed himself on Rai2 on the chaos that broke out after the serious mistake made by referee La Penna during the match between ..."
    },
    {
      "id": "001f91dc9628",
      "title": "Against Pisa, Tomori crossed the finish line of 150 appearances in Serie A. All with Milan",
      "url": "https://www.milannews.it/news/contro-il-pisa-tomori-ha-tagliato-il-traguardo-delle-150-presenze-in-serie-a-tutte-con-il-milan-607397",
      "source": "milannews.it",
      "date": "2026-02-15T18:35:29+00:00",
      "summary": "Fikayo Tomori's 150th match yesterday in Serie A, all played with Milan. Opta reports it."
    },
    {
      "id": "88c334b39a62",
      "title": "MN: Loftus-Cheek’s priority is and always has been Milan renewal after January rumours",
      "url": "https://sempremilan.com/loftus-cheek-priority-milan-renewal-january-rumours",
      "source": "sempremilan.com",
      "date": "2026-02-15T18:30:00+00:00",
      "summary": "It seemed Ruben Loftus-Cheek was heading to the door in January. However, the Englishman instead preferred to stay at AC Milan.  Throughout January, there was enough to suggest that Loftus-Cheek was going to leave Milan. He reportedly wanted more playing time, which the Rossoneri could not give him,"
    },
    {
      "id": "a2c6de73586f",
      "title": "Inter, La Russa without brakes: \"Bastoni didn't simulate, he behaved better than those who get hit in the stomach and put their hands in their faces\"",
      "url": "https://www.milannews.it/l-avversario/inter-la-russa-senza-freni-bastoni-non-ha-simulato-si-e-comportato-meglio-di-quelli-che-colpiti-nella-pancia-si-mettono-mani-in-faccia-607543",
      "source": "milannews.it",
      "date": "2026-02-15T18:24:00+00:00",
      "summary": "After all the chaos and media outcry that happened over Inter-Juventus, Ignazio La Russa, president of the Senate, commented on the controversies of the Italian derby to Telelombardia as follows:\n\n“After 1-1 we took 2 posts and also in 11 c..."
    },
    {
      "id": "979cabd15c02",
      "title": "Borghi: \"I had the impression that without Saelemaekers Milan lacked a degree of intensity\"",
      "url": "https://www.milannews.it/news/borghi-ho-avuto-l-impressione-che-senza-saelemaekers-al-milan-manchi-un-grado-di-intensita-607460",
      "source": "milannews.it",
      "date": "2026-02-15T18:12:12+00:00",
      "summary": "On his YouTube channel, Borghi spoke about the Pisa match on Friday evening, analyzing the general and individual performances."
    },
    {
      "id": "1d5461dd9218",
      "title": "Milan and Inter have made it clear in recent weeks at Palazzo Marino that they would like to start work on the stadium in three, four months at most",
      "url": "https://www.milannews.it/news/milan-e-inter-nelle-scorse-settimane-hanno-chiarito-a-palazzo-marino-che-vorrebbero-iniziare-i-lavori-per-lo-stadio-fra-tre-quattro-mesi-al-massimo-607503",
      "source": "milannews.it",
      "date": "2026-02-15T18:00:05+00:00",
      "summary": "Marco Pasotto, journalist, expressed himself as follows on gazzetta.it on the new Milan and Inter stadium: \"The calm after the storm."
    },
    {
      "id": "9ff006448cca",
      "title": "Midfield freedom to combat central block: Tactical analysis of Pisa 1-2 AC Milan",
      "url": "https://sempremilan.com/tactical-analysis-of-pisa-1-2-ac-milan",
      "source": "sempremilan.com",
      "date": "2026-02-15T18:00:00+00:00",
      "summary": "AC Milan travelled to Pisa on Friday night in the first game of the latest Serie A round, and they were given a scare by relegation battlers Pisa. Ruben Loftus-Cheek’s header in the first half was a welcome opening of the scoring after a dull spectacle to that point. Then, the turning point seemed t"
    },
    {
      "id": "ba0a8b21cf7c",
      "title": "Cuomo: \"If La Penna gets a 3-match stoppage, Bastoni deserves a 6-match disqualification\"",
      "url": "https://www.milannews.it/news/cuomo-se-la-penna-prende-3-turni-di-stop-bastoni-ne-merita-6-di-squalifica-607546",
      "source": "milannews.it",
      "date": "2026-02-15T17:47:53+00:00",
      "summary": "To talk about the ugly episode between Bastoni and Kalulu that occurred in Inter-Juve last night, TeleLombardia journalist Michael Cuomo was a guest on Radio Radio."
    },
    {
      "id": "858037dcc6ef",
      "title": "23 games without losing in a championship. Milan have only done better twice (once more than 70 years ago)",
      "url": "https://www.milannews.it/news/23-partite-senza-perdere-in-un-campionato-il-milan-ha-fatto-meglio-solo-due-volte-una-piu-di-70-anni-fa-607385",
      "source": "milannews.it",
      "date": "2026-02-15T17:36:24+00:00",
      "summary": "Milan (W15, D8 in the current tournament) equaled its third longest unbeaten run in a Serie A season (23 matches in a row, as between September 1992 and March 1993), behind only a run of 24 matches between December 1..."
    },
    {
      "id": "b5957e5d1aa0",
      "title": "GdS: Allegri, Maignan and more – Milan seeking revenge in many ways",
      "url": "https://sempremilan.com/allegri-maignan-more-milan-seek-revenge",
      "source": "sempremilan.com",
      "date": "2026-02-15T17:30:00+00:00",
      "summary": "After last season, there are several players seeking revenge at AC Milan. However, there are also some who don’t have the burden of last year weighing on them. Before the Pisa game, Massimiliano Allegri stated that Milan was a team seeking revenge when he was asked about the qualities of his squad. "
    },
    {
      "id": "c3d63dfff544",
      "title": "Pellegatti on the formation: \"Milan is more fluid with the 4-3-3 but there is one thing that's holding Allegri back\"",
      "url": "https://www.milannews.it/news/pellegatti-sul-modulo-milan-piu-fluido-col-4-3-3-ma-c-e-una-cosa-che-frena-allegri-607458",
      "source": "milannews.it",
      "date": "2026-02-15T17:24:06+00:00",
      "summary": "In his YouTube channel, Carlo Pellegatti spoke again about the match in Pisa."
    },
    {
      "id": "9808500ab77b",
      "title": "MN: Saelemaekers trains alone again as Como game draws nearer – the situation",
      "url": "https://sempremilan.com/saelemaekers-trains-alone-again-como-nearer",
      "source": "sempremilan.com",
      "date": "2026-02-15T17:00:00+00:00",
      "summary": "Alexis Saelemaekers was hoped to be back in training by now. However, the AC Milan wingback is still not back with the group. It has been a tricky season with injuries for Milan, and recent weeks have shown this further with many key players struggling to some degree. Unfortunately, Saelemaekers has"
    },
    {
      "id": "5e963fbd9a4e",
      "title": "GdS: Allegri message to the group after Pisa – Loftus-Cheek’s issue and first half problems",
      "url": "https://sempremilan.com/allegri-message-group-after-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-15T16:30:00+00:00",
      "summary": "AC Milan got three points against Pisa on Friday night, but it certainly wasn’t easy and Massimiliano Allegri had a few things to say to his squad after.  Above all, it is a win for Milan against a newly promoted side. It feels strange to be celebrating that in February. However, it has troubled the"
    },
    {
      "id": "892902d04a00",
      "title": "Chivu references Milan’s advantage in Scudetto race after Juventus win: “We were naive”",
      "url": "https://sempremilan.com/chivu-references-milan-advantage-scudetto-race",
      "source": "sempremilan.com",
      "date": "2026-02-15T16:00:00+00:00",
      "summary": "It is no secret that Inter are leading the Scudetto race by an almost uncatchable margin currently, but AC Milan are not out of it.  There has been a lot said about the Scudetto this season, but in Milan’s context, it has normally been a case of hoping, rather than expecting. After all, Massimiliano"
    },
    {
      "id": "a8d56d7aa1a2",
      "title": "Leao offers support to Füllkrug off the pitch after Pisa act – his new role for Milan",
      "url": "https://sempremilan.com/leao-offers-support-fullkrug-off-pitch",
      "source": "sempremilan.com",
      "date": "2026-02-15T15:30:00+00:00",
      "summary": "Rafael Leao’s maturity and personality are shining currently for AC Milan, and after the Pisa game, the Portuguese can only be applauded. Niclas Fullkrug certainly had a game to forget, given he came on as a substitute and was also subbed off in the same game. Then, there is the elephant in the room"
    },
    {
      "id": "501beb9341ef",
      "title": "Schira: Galliani has dinner with Allegri and watches Inter-Juventus amid return rumours",
      "url": "https://sempremilan.com/galliani-dinner-allegri-watches-inter-juventus",
      "source": "sempremilan.com",
      "date": "2026-02-15T15:00:00+00:00",
      "summary": "Adriano Galliani has been linked with a return to AC Milan for a while now, and he met with Massimiliano Allegri to have dinner last night. Over the past year, a lot has been said about Galliani and whether he could reprise his role at Milan after leaving Monza earlier this season. The Italian even "
    },
    {
      "id": "5b18e1b056aa",
      "title": "Como fans aim jab at Allegri while Fabregas slams ‘boring’ Serie A: “One day with Fabregas”",
      "url": "https://sempremilan.com/como-fans-aim-jab-allegri-fabregas-slam-serie-a",
      "source": "sempremilan.com",
      "date": "2026-02-15T14:30:00+00:00",
      "summary": "Massimiliano Allegri was on the minds of Como fans during their game against Fiorentina, with them facing AC Milan next, whilst Cesc Fabregas was also critical of Serie A.  In recent weeks, it has become clear that Allegri is not the most liked figure in the Como scene. Fabregas has had a lot to say"
    },
    {
      "id": "7d99a620c45e",
      "title": "GdS: The importance of Cardinale’s latest Milanello visit with ‘centrality’ sought",
      "url": "https://sempremilan.com/importance-of-cardinale-latest-milanello-visit",
      "source": "sempremilan.com",
      "date": "2026-02-15T14:00:00+00:00",
      "summary": "Today, Gerry Cardinale visited Milanello for the second time in less than a month, and it is important for several reasons. The American was present at the training ground with the same group as last time, meaning Zlatan Ibrahimovic, Igli Tare and Giorgio Furlani were all present for this visit. Lar"
    },
    {
      "id": "4479bb92c40e",
      "title": "Vojvoda discusses Como’s chances against Milan after Fiorentina defeat: “Isn’t easy”",
      "url": "https://sempremilan.com/vojvoda-discusses-como-chances-milan",
      "source": "sempremilan.com",
      "date": "2026-02-15T13:35:00+00:00",
      "summary": "AC Milan have a huge game in midweek as they face Como to potentially further solidify their Champions League credentials. The next few weeks have the potential to throw a curveball if Milan are not careful, and the fixtures are indeed coming thick and fast. Starting in midweek, the Rossoneri will p"
    },
    {
      "id": "e2cab47e6c57",
      "title": "GdS: 19 attempts, 8 missed – Milan grow increasingly ineffective from 12 yards",
      "url": "https://sempremilan.com/milan-grow-increasingly-ineffective-12-yards",
      "source": "sempremilan.com",
      "date": "2026-02-15T13:10:00+00:00",
      "summary": "AC Milan missed their latest penalty on Friday night, and there could be an argument made that it is becoming a hindrance more than a positive. Penalties are certainly not a guaranteed goal; there is still a lot to do from the spot. Yet, Milan are undoubtedly struggling when given these golden chanc"
    },
    {
      "id": "17509c10bf8c",
      "title": "‘Like Tonali’s goal in Rome’ – Longoni compares Modric’s winner to Scudetto year",
      "url": "https://sempremilan.com/longoni-compares-modric-winner-tonali-goal",
      "source": "sempremilan.com",
      "date": "2026-02-15T12:45:00+00:00",
      "summary": "Scoring late goals is something which AC Milan have done regularly this year, and the latest came thanks to Luka Modric.  There have been several instances this year where Milan have left it late. In fact, they are among the top teams when it comes to rescuing points past the 90th minute. Whilst it "
    },
    {
      "id": "9e04f5aef0a0",
      "title": "MN: Cardinale present at Milanello for the second time in 25 days – the latest",
      "url": "https://sempremilan.com/cardinale-present-milanello-second-time-25-days",
      "source": "sempremilan.com",
      "date": "2026-02-15T12:14:21+00:00",
      "summary": "Today, AC Milan owner Gerry Cardinale was back at Milanello and he was joined by the management of the club. Given his residence in America, it is unlikely that we see Cardinale in Milano too often, and this is something for which the founder of RedBird has been criticised in recent years. However, "
    },
    {
      "id": "973332ec7089",
      "title": "MN: Milan 15 points better than last season as Allegri’s changes show",
      "url": "https://sempremilan.com/milan-15-points-better-last-season",
      "source": "sempremilan.com",
      "date": "2026-02-15T11:55:00+00:00",
      "summary": "AC Milan have been drastically different since Massimiliano Allegri’s arrival in the summer, and the changes show. When Allegri was hired, there were certainly questions about how much Milan could improve. After all, the squad was a bit messy, whilst the budget and points total required a lot of wor"
    },
    {
      "id": "8ae0bef57697",
      "title": "TMW: Milan considering moves for Lewandowski and Arsenal star in the summer",
      "url": "https://sempremilan.com/milan-considering-moves-lewandowski-arsenal-star",
      "source": "sempremilan.com",
      "date": "2026-02-15T11:30:00+00:00",
      "summary": "It is no surprise that AC Milan will try to sign a striker in the summer, and a few names have been put forward.  With Jean-Philippe Mateta not arriving at Milan in the January mercato, the management will go back to the drawing board, seeking a way to improve the Rossoneri’s front line and there […"
    },
    {
      "id": "e74fd2314d11",
      "title": "GdS: Milan ‘perplexed’ over ‘harsh’ decision to disallow Rabiot’s goal vs. Pisa",
      "url": "https://sempremilan.com/milan-perplexed-harsh-decision-disallow-rabiot-goal",
      "source": "sempremilan.com",
      "date": "2026-02-15T11:05:00+00:00",
      "summary": "It seemed Adrien Rabiot had given AC Milan a two-goal lead against Pisa on Friday night, but it was not to be, confusingly.  Shortly after the half-time interval, Milan had the ball in the back of the net, and it seemed that they had put the game to bed. However, as has been the case […]\nThe post Gd"
    },
    {
      "id": "24d118188a1e",
      "title": "MN: Ricci given perfect conditions to blossom from the bench – his season so far",
      "url": "https://sempremilan.com/ricci-perfect-conditions-blossom-from-bench",
      "source": "sempremilan.com",
      "date": "2026-02-15T10:40:00+00:00",
      "summary": "When Samuele Ricci was linked, picking a place for him felt easy. However, AC Milan added quality, and a starting role became unlikely. Ricci has been one of the longest projects for Milan in recent years. Across several mercatos, there were talks of him being a target, yet the Rossoneri never made "
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    },
    {
      "id": "9c729c8148a4",
      "title": "Pisa forced to field third-choice goalkeeper in Serie A match against Milan",
      "url": "https://football-italia.net/pisa-forced-3rd-choice-goalkeeper-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T13:04:11+00:00",
      "summary": "Second-choice Pisa goalkeeper Simone Scuffet has been ruled out of tonight’s Serie A match against..."
    },
    {
      "id": "e6e4778300f1",
      "title": "Report Milan call McKennie for possible USMNT reunion with Pulisic",
      "url": "https://football-italia.net/milan-call-mckennie-usmnt-reunion-pulisic/",
      "source": "football-italia.net",
      "date": "2026-02-13T12:43:07+00:00",
      "summary": "Milan have reportedly begun preliminary talks with Weston McKennie’s entourage as the Juventus midfielder is..."
    },
    {
      "id": "bb92885e8dfd",
      "title": "Milan make Modric decision, prepare for new contract extensions after Maignan",
      "url": "https://football-italia.net/milan-modric-decision-more-contracts-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-13T11:04:46+00:00",
      "summary": "According to La Gazzetta dello Sport, Fikayo Tomori is expected to be the next Milan..."
    },
    {
      "id": "c682014167e5",
      "title": "Serie A: Pisa vs. Milan – probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/pisa-vs-milan-probable-line-ups-watch-on-tv/",
      "source": "football-italia.net",
      "date": "2026-02-13T08:53:01+00:00",
      "summary": "Ruben Loftus-Cheek and Christopher Nknuku are expected to lead the Milan attack in an away..."
    },
    {
      "id": "d50cee56a1a2",
      "title": "Capello claims Serie A title race wide open: ‘Inter & Juventus, watch out for Milan & Roma’",
      "url": "https://football-italia.net/capello-claims-serie-a-title-race-wide-open/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:30:19+00:00",
      "summary": "Fabio Capello insists the Serie A title race is far from over, warning that Inter..."
    },
    {
      "id": "ef679b7e17ab",
      "title": "Only one Serie A player included in Europe’s best paid footballers in 2026",
      "url": "https://football-italia.net/one-juventus-player-europe-top-20-best-paid/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:01:54+00:00",
      "summary": "Juventus’s Dusan Vlahovic is currently the only Serie A player to feature in the list..."
    },
    {
      "id": "00edaaaae844",
      "title": "Juventus set price tag for Gatti as Milan, Napoli and Premier League clubs queue up",
      "url": "https://football-italia.net/juventus-set-price-tag-for-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-12T14:21:33+00:00",
      "summary": "Juventus reportedly have a price tag in mind when it comes to a potential sale..."
    },
    {
      "id": "8c7c1ace3789",
      "title": "Allegri previews Pisa vs. Milan and gives injury update: ‘Pulisic only has 15-20 minutes’",
      "url": "https://football-italia.net/allegri-previews-pisa-vs-milan-injury-update/",
      "source": "football-italia.net",
      "date": "2026-02-12T12:49:06+00:00",
      "summary": "Massimiliano Allegri has shared his thoughts ahead of Milan’s upcoming Serie A clash against Pisa..."
    }
  ]
}