{
  "lastUpdated": "2026-02-16T07:53:07.435524+00:00",
  "articles": [
    {
      "id": "13d7b0e6505e",
      "title": "Tuttosport headline: \"Allegri and Galliani at dinner between past and... future\"",
      "url": "https://www.milannews.it/rassegna-stampa/tuttosport-titola-allegri-e-galliani-a-cena-tra-passato-e-futuro-607578",
      "source": "milannews.it",
      "date": "2026-02-16T07:40:21+00:00",
      "summary": "\"Allegri and Galliani at dinner between past and."
    },
    {
      "id": "4f36831b439b",
      "title": "Milan, today Saelemaekers should return to group training",
      "url": "https://www.milannews.it/rassegna-stampa/milan-oggi-saelemaekers-dovrebbe-tornare-ad-allenarsi-in-gruppo-607577",
      "source": "milannews.it",
      "date": "2026-02-16T07:30:57+00:00",
      "summary": "After Friday's success at Pisa, Milan are currently preparing for their next match in the championship, namely Wednesday evening's recovery against Como at San Siro."
    },
    {
      "id": "3b52dfca1ab6",
      "title": "CorSera on Milan: \"Patron Cardinale back at Milanello: conversation with Allegri. Como on Wednesday\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-corsera-sul-milan-il-patron-cardinale-di-nuovo-a-milanello-colloquio-con-allegri-mercoledi-il-como-607576",
      "source": "milannews.it",
      "date": "2026-02-16T07:20:38+00:00",
      "summary": "The Corriere della Sera headline this morning on Milan: \"Patron Cardinale back at Milanello: conversation with Allegri. Como on Wednesday\"."
    },
    {
      "id": "68915397a6c7",
      "title": "Cardinale's visit to Milanello. Gazzetta: \"He applauds Milan, thanks Maignan and gives energy\"",
      "url": "https://www.milannews.it/rassegna-stampa/la-visita-di-cardinale-a-milanello-gazzetta-applaude-il-milan-ringrazia-maignan-e-da-la-carica-607575",
      "source": "milannews.it",
      "date": "2026-02-16T07:10:39+00:00",
      "summary": "Today's edition of the Gazzetta dello Sport headlines this morning regarding Gerry Cardinale's visit to Milanello yesterday: \"He applauds Milan, thanks Maignan and gives energy\"."
    },
    {
      "id": "e810e1350b6c",
      "title": "Cardinale back at Milanello: the push from the RedBird number one for the season finale",
      "url": "https://www.milannews.it/primo-piano/cardinale-di-nuovo-a-milanello-la-spinta-del-numero-uno-di-redbird-per-il-finale-di-stagione-607573",
      "source": "milannews.it",
      "date": "2026-02-16T07:00:20+00:00",
      "summary": "Less than a month after his last visit, yesterday Gerry Cardinale met again at Milanello where he had been last January 21st."
    },
    {
      "id": "f63461488734",
      "title": "The updated ranking of the Primavera 1 championship: Milan eleventh",
      "url": "https://www.milannews.it/la-primavera/la-classifica-aggiornata-del-campionato-di-primavera-1-milan-undicesimo-607561",
      "source": "milannews.it",
      "date": "2026-02-16T06:50:27+00:00",
      "summary": "The Primavera 1 championship standings updated after the results of the weekend, which saw Giovanni Renna's Milan return to victory against Genoa: \n\nRome 44 points\nParma 43\nFiorentina 43\nCesena 41\nJuventus 38\nInter 38\n ..."
    },
    {
      "id": "f58da62cdb9a",
      "title": "The updated standings of Serie D, Group B: Milan Futuro fourth in the playoff zone",
      "url": "https://www.milannews.it/news/la-classifica-aggiornata-di-serie-d-girone-b-milan-futuro-quarto-in-piena-zona-playoff-607556",
      "source": "milannews.it",
      "date": "2026-02-16T06:40:40+00:00",
      "summary": "Below is the Serie D Group B ranking after the results of the weekend, which also saw Milan Futuro win narrowly against Breno."
    },
    {
      "id": "2a47a0079d79",
      "title": "Fabregas' Como loses a man to suspension ahead of Milan",
      "url": "https://www.milannews.it/news/il-como-di-fabregas-perde-un-uomo-per-squalifica-in-vista-del-milan-607555",
      "source": "milannews.it",
      "date": "2026-02-16T06:30:00+00:00",
      "summary": "The Como falls four days before the match against Milan, the recovery of the twenty-fourth matchday of the Serie A Enilive championship which will be played on Wednesday at 8.45 pm at San Siro."
    },
    {
      "id": "24bf76ed1c8c",
      "title": "Saelemaekers remains to be evaluated in view of the match against Como",
      "url": "https://www.milannews.it/news/saelemaekers-resta-da-valutare-in-vista-della-sfida-contro-il-como-607554",
      "source": "milannews.it",
      "date": "2026-02-16T06:20:00+00:00",
      "summary": "According to what the MilanNews.it editorial team learned, Alexis Saelemaekers carried out differentiated work today too."
    },
    {
      "id": "7964f75e6b29",
      "title": "Serie A: today ends the 25th day with Cagliari-Lecce",
      "url": "https://www.milannews.it/news/serie-a-oggi-si-chiude-la-25esima-giornata-con-cagliari-lecce-607553",
      "source": "milannews.it",
      "date": "2026-02-16T06:10:37+00:00",
      "summary": "Below is the schedule and results of the 25th matchday of Serie A:\n\n13/02/2026 Friday 8.45pm Pisa 1-2 Milan DAZN\n02/14/2026 Saturday 15th."
    },
    {
      "id": "c678bb574f20",
      "title": "The Serie A standings updated after the weekend's results",
      "url": "https://www.milannews.it/news/la-classifica-di-serie-a-aggiornata-dopo-i-risultati-del-weekend-607552",
      "source": "milannews.it",
      "date": "2026-02-16T06:00:00+00:00",
      "summary": "Below is the Serie A ranking updated after the results of the championship weekend: \n\nInter 61\nMilan 53*\nNaples 50\nRome 47\nJuventus 46\nAtalanta 42\nComo 41*\nLazio 33\nBologna 33\nSassuolo 32\nUdinese 32\nParma 29\nCagliari 28*\nTo..."
    },
    {
      "id": "00ec1807e9ce",
      "title": "Ambrosini: \"After Napoli-Roma there is no doubt that the Scudetto race is in Milan\"",
      "url": "https://www.milannews.it/news/ambrosini-dopo-napoli-roma-non-ci-sono-dubbi-che-la-corsa-scudetto-sia-a-milano-607557",
      "source": "milannews.it",
      "date": "2026-02-16T00:00:45+00:00",
      "summary": "During the post-match of Napoli-Roma (2-2), during the DAZN broadcast \"Fuoriclasse\", the former AC Milan and Fiorentina midfielder, among others, Massimo Ambrosini spoke about the championship race, which after the Maradona challenge will ..."
    },
    {
      "id": "9cfc98167763",
      "title": "Pasotto: \"As in Como, it was always Allegri who indicated Fullkrug as a penalty taker in Pisa. Authoritativeness remains the most important quality of the coach\"",
      "url": "https://www.milannews.it/news/pasotto-come-a-como-e-sempre-stato-allegri-a-indicare-fullkrug-come-rigorista-a-pisa-l-autorevolezza-resta-la-qualita-piu-importante-dell-allenatore-607505",
      "source": "milannews.it",
      "date": "2026-02-15T23:48:58+00:00",
      "summary": "Marco Pasotto, a journalist, expressed himself as follows in La Gazzetta dello Sport on the penalties missed by Milan: \"Sadly those from Florence stand out above all (October 2024)."
    },
    {
      "id": "e3afe362e448",
      "title": "Borghi: \"When Milan doesn't perform at 100%, they concede something, then they're good as always at striking at the first opportunity\"",
      "url": "https://www.milannews.it/news/borghi-quando-non-va-al-100-il-milan-concede-qualcosa-poi-bravo-come-sempre-a-colpire-alla-prima-occasione-607454",
      "source": "milannews.it",
      "date": "2026-02-15T23:36:33+00:00",
      "summary": "On his YouTube channel, Borghi spoke about the Pisa match on Friday evening, analyzing the general and individual performances."
    },
    {
      "id": "ac895ca83879",
      "title": "Sabatini asks himself: “10 days of inactivity for Milan: are we sure it was positive?”",
      "url": "https://www.milannews.it/news/sabatini-si-domanda-10-giorni-di-inattivita-per-il-milan-siamo-sicuri-sia-stato-positivo-607462",
      "source": "milannews.it",
      "date": "2026-02-15T23:24:23+00:00",
      "summary": "In his YouTube channel, Sandro Sabatini spoke like this about Friday night's match between Pisa and Milan."
    },
    {
      "id": "1aed79776ea6",
      "title": "Guidi: \"Modric has signed for one year with the option for a second. The hope of the entire Rossoneri environment is to see him again at Milanello\"",
      "url": "https://www.milannews.it/calciomercato-milan/guidi-modric-ha-firmato-per-un-anno-piu-opzione-per-il-secondo-la-speranza-di-tutto-l-ambiente-rossonero-e-di-rivederlo-ancora-a-milanello-607502",
      "source": "milannews.it",
      "date": "2026-02-15T23:12:28+00:00",
      "summary": "Marco Guidi, journalist, expressed himself in La Gazzetta dello Sport about Luka Modric: \"In the summer, Luka signed an annual contract with Milan, but with the option for a further season together."
    },
    {
      "id": "4e89b59911ce",
      "title": "The shame of Inter-Juve and they also talk. Serie A must support Milan to stay alive. Max, the 4-3-3 \"opens up\" your team",
      "url": "https://www.milannews.it/editoriale/la-vergogna-di-inter-juve-e-parlano-pure-la-serie-a-deve-tifare-milan-per-rimanere-viva-max-il-4-3-3-apre-la-tua-squadra-607521",
      "source": "milannews.it",
      "date": "2026-02-15T23:00:01+00:00",
      "summary": "For years, because months is too short, the Inter fanfare has always shown us the way of what could and could not be said, of what is right and what is wrong."
    },
    {
      "id": "d95636c16cc4",
      "title": "Inter-Juve chaos, Ravezzani: \"I've always thought that Marotta is an honest person\"",
      "url": "https://www.milannews.it/news/caos-inter-juve-ravezzani-sempre-pensato-che-marotta-sia-una-persona-onesta-607540",
      "source": "milannews.it",
      "date": "2026-02-15T22:48:00+00:00",
      "summary": "Following the great chaos and media outcry over what unfortunately happened in Inter-Juventus, the director of QSVS Fabio Ravezzani also spoke up and wrote on his X account about Giuseppe Marotta, president of Inter:\n ..."
    },
    {
      "id": "638224031226",
      "title": "Longhi very harsh: \"The Kalulu-Bastoni case will be talked about forever, the Inter player has forgotten fair play and respect for his opponent\"",
      "url": "https://www.milannews.it/news/longhi-durissimo-del-caso-kalulu-bastoni-si-parlera-in-eterno-l-interista-ha-dimenticato-fair-play-e-il-rispetto-dell-avversario-607541",
      "source": "milannews.it",
      "date": "2026-02-15T22:36:00+00:00",
      "summary": "Bruno Longhi, historic journalist and sports commentator, spoke like this after the very serious refereeing error that occurred in Inter-Juventus when Kalulu su Bastoni was sent off."
    },
    {
      "id": "39fb34a38b69",
      "title": "Ramazzotti reveals: \"Allegri didn't fully enjoy the three points in the locker room on Friday\"",
      "url": "https://www.milannews.it/news/ramazzotti-rivela-allegri-venerdi-nello-spogliatoio-non-si-e-gustato-fino-in-fondo-i-tre-punti-607498",
      "source": "milannews.it",
      "date": "2026-02-15T22:24:14+00:00",
      "summary": "Andrea Ramazzotti, journalist, expressed himself as follows in La Gazzetta dello Sport, telling a background story from Milanello: \"Satisfied with the victory, less so with the performance."
    },
    {
      "id": "f4aa85284ebf",
      "title": "Tuttosport: Milan courting ‘a new Jimenez’ – how a deal could aid multiple areas",
      "url": "https://sempremilan.com/milan-courting-new-jimenez",
      "source": "sempremilan.com",
      "date": "2026-02-15T19:30:00+00:00",
      "summary": "AC Milan are looking to Real Madrid once again, and there is hope that there is another project player for them to discover. After the success of Alex Jimenez, where Milan made a nice profit, Milan are once again looking to Madrid for another gem to develop. In fact, it seems that one has already […"
    },
    {
      "id": "c9748545a032",
      "title": "GdS: Milan Futuro’s forced reset has been strengthened by recent graduates",
      "url": "https://sempremilan.com/milan-futuro-forced-reset-strengthened",
      "source": "sempremilan.com",
      "date": "2026-02-15T19:00:00+00:00",
      "summary": "AC Milan had big expectations for the Futuro project, and it certainly did not start well with relegation. However, it is still proving to be a success. The relegation to Serie D could have closed the door on the Milan Futuro project. Instead, though, it has been strengthened, and there is a case to"
    },
    {
      "id": "88c334b39a62",
      "title": "MN: Loftus-Cheek’s priority is and always has been Milan renewal after January rumours",
      "url": "https://sempremilan.com/loftus-cheek-priority-milan-renewal-january-rumours",
      "source": "sempremilan.com",
      "date": "2026-02-15T18:30:00+00:00",
      "summary": "It seemed Ruben Loftus-Cheek was heading to the door in January. However, the Englishman instead preferred to stay at AC Milan.  Throughout January, there was enough to suggest that Loftus-Cheek was going to leave Milan. He reportedly wanted more playing time, which the Rossoneri could not give him,"
    },
    {
      "id": "9ff006448cca",
      "title": "Midfield freedom to combat central block: Tactical analysis of Pisa 1-2 AC Milan",
      "url": "https://sempremilan.com/tactical-analysis-of-pisa-1-2-ac-milan",
      "source": "sempremilan.com",
      "date": "2026-02-15T18:00:00+00:00",
      "summary": "AC Milan travelled to Pisa on Friday night in the first game of the latest Serie A round, and they were given a scare by relegation battlers Pisa. Ruben Loftus-Cheek’s header in the first half was a welcome opening of the scoring after a dull spectacle to that point. Then, the turning point seemed t"
    },
    {
      "id": "b5957e5d1aa0",
      "title": "GdS: Allegri, Maignan and more – Milan seeking revenge in many ways",
      "url": "https://sempremilan.com/allegri-maignan-more-milan-seek-revenge",
      "source": "sempremilan.com",
      "date": "2026-02-15T17:30:00+00:00",
      "summary": "After last season, there are several players seeking revenge at AC Milan. However, there are also some who don’t have the burden of last year weighing on them. Before the Pisa game, Massimiliano Allegri stated that Milan was a team seeking revenge when he was asked about the qualities of his squad. "
    },
    {
      "id": "9808500ab77b",
      "title": "MN: Saelemaekers trains alone again as Como game draws nearer – the situation",
      "url": "https://sempremilan.com/saelemaekers-trains-alone-again-como-nearer",
      "source": "sempremilan.com",
      "date": "2026-02-15T17:00:00+00:00",
      "summary": "Alexis Saelemaekers was hoped to be back in training by now. However, the AC Milan wingback is still not back with the group. It has been a tricky season with injuries for Milan, and recent weeks have shown this further with many key players struggling to some degree. Unfortunately, Saelemaekers has"
    },
    {
      "id": "5e963fbd9a4e",
      "title": "GdS: Allegri message to the group after Pisa – Loftus-Cheek’s issue and first half problems",
      "url": "https://sempremilan.com/allegri-message-group-after-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-15T16:30:00+00:00",
      "summary": "AC Milan got three points against Pisa on Friday night, but it certainly wasn’t easy and Massimiliano Allegri had a few things to say to his squad after.  Above all, it is a win for Milan against a newly promoted side. It feels strange to be celebrating that in February. However, it has troubled the"
    },
    {
      "id": "892902d04a00",
      "title": "Chivu references Milan’s advantage in Scudetto race after Juventus win: “We were naive”",
      "url": "https://sempremilan.com/chivu-references-milan-advantage-scudetto-race",
      "source": "sempremilan.com",
      "date": "2026-02-15T16:00:00+00:00",
      "summary": "It is no secret that Inter are leading the Scudetto race by an almost uncatchable margin currently, but AC Milan are not out of it.  There has been a lot said about the Scudetto this season, but in Milan’s context, it has normally been a case of hoping, rather than expecting. After all, Massimiliano"
    },
    {
      "id": "a8d56d7aa1a2",
      "title": "Leao offers support to Füllkrug off the pitch after Pisa act – his new role for Milan",
      "url": "https://sempremilan.com/leao-offers-support-fullkrug-off-pitch",
      "source": "sempremilan.com",
      "date": "2026-02-15T15:30:00+00:00",
      "summary": "Rafael Leao’s maturity and personality are shining currently for AC Milan, and after the Pisa game, the Portuguese can only be applauded. Niclas Fullkrug certainly had a game to forget, given he came on as a substitute and was also subbed off in the same game. Then, there is the elephant in the room"
    },
    {
      "id": "501beb9341ef",
      "title": "Schira: Galliani has dinner with Allegri and watches Inter-Juventus amid return rumours",
      "url": "https://sempremilan.com/galliani-dinner-allegri-watches-inter-juventus",
      "source": "sempremilan.com",
      "date": "2026-02-15T15:00:00+00:00",
      "summary": "Adriano Galliani has been linked with a return to AC Milan for a while now, and he met with Massimiliano Allegri to have dinner last night. Over the past year, a lot has been said about Galliani and whether he could reprise his role at Milan after leaving Monza earlier this season. The Italian even "
    },
    {
      "id": "5b18e1b056aa",
      "title": "Como fans aim jab at Allegri while Fabregas slams ‘boring’ Serie A: “One day with Fabregas”",
      "url": "https://sempremilan.com/como-fans-aim-jab-allegri-fabregas-slam-serie-a",
      "source": "sempremilan.com",
      "date": "2026-02-15T14:30:00+00:00",
      "summary": "Massimiliano Allegri was on the minds of Como fans during their game against Fiorentina, with them facing AC Milan next, whilst Cesc Fabregas was also critical of Serie A.  In recent weeks, it has become clear that Allegri is not the most liked figure in the Como scene. Fabregas has had a lot to say"
    },
    {
      "id": "7d99a620c45e",
      "title": "GdS: The importance of Cardinale’s latest Milanello visit with ‘centrality’ sought",
      "url": "https://sempremilan.com/importance-of-cardinale-latest-milanello-visit",
      "source": "sempremilan.com",
      "date": "2026-02-15T14:00:00+00:00",
      "summary": "Today, Gerry Cardinale visited Milanello for the second time in less than a month, and it is important for several reasons. The American was present at the training ground with the same group as last time, meaning Zlatan Ibrahimovic, Igli Tare and Giorgio Furlani were all present for this visit. Lar"
    },
    {
      "id": "4479bb92c40e",
      "title": "Vojvoda discusses Como’s chances against Milan after Fiorentina defeat: “Isn’t easy”",
      "url": "https://sempremilan.com/vojvoda-discusses-como-chances-milan",
      "source": "sempremilan.com",
      "date": "2026-02-15T13:35:00+00:00",
      "summary": "AC Milan have a huge game in midweek as they face Como to potentially further solidify their Champions League credentials. The next few weeks have the potential to throw a curveball if Milan are not careful, and the fixtures are indeed coming thick and fast. Starting in midweek, the Rossoneri will p"
    },
    {
      "id": "e2cab47e6c57",
      "title": "GdS: 19 attempts, 8 missed – Milan grow increasingly ineffective from 12 yards",
      "url": "https://sempremilan.com/milan-grow-increasingly-ineffective-12-yards",
      "source": "sempremilan.com",
      "date": "2026-02-15T13:10:00+00:00",
      "summary": "AC Milan missed their latest penalty on Friday night, and there could be an argument made that it is becoming a hindrance more than a positive. Penalties are certainly not a guaranteed goal; there is still a lot to do from the spot. Yet, Milan are undoubtedly struggling when given these golden chanc"
    },
    {
      "id": "17509c10bf8c",
      "title": "‘Like Tonali’s goal in Rome’ – Longoni compares Modric’s winner to Scudetto year",
      "url": "https://sempremilan.com/longoni-compares-modric-winner-tonali-goal",
      "source": "sempremilan.com",
      "date": "2026-02-15T12:45:00+00:00",
      "summary": "Scoring late goals is something which AC Milan have done regularly this year, and the latest came thanks to Luka Modric.  There have been several instances this year where Milan have left it late. In fact, they are among the top teams when it comes to rescuing points past the 90th minute. Whilst it "
    },
    {
      "id": "9e04f5aef0a0",
      "title": "MN: Cardinale present at Milanello for the second time in 25 days – the latest",
      "url": "https://sempremilan.com/cardinale-present-milanello-second-time-25-days",
      "source": "sempremilan.com",
      "date": "2026-02-15T12:14:21+00:00",
      "summary": "Today, AC Milan owner Gerry Cardinale was back at Milanello and he was joined by the management of the club. Given his residence in America, it is unlikely that we see Cardinale in Milano too often, and this is something for which the founder of RedBird has been criticised in recent years. However, "
    },
    {
      "id": "973332ec7089",
      "title": "MN: Milan 15 points better than last season as Allegri’s changes show",
      "url": "https://sempremilan.com/milan-15-points-better-last-season",
      "source": "sempremilan.com",
      "date": "2026-02-15T11:55:00+00:00",
      "summary": "AC Milan have been drastically different since Massimiliano Allegri’s arrival in the summer, and the changes show. When Allegri was hired, there were certainly questions about how much Milan could improve. After all, the squad was a bit messy, whilst the budget and points total required a lot of wor"
    },
    {
      "id": "8ae0bef57697",
      "title": "TMW: Milan considering moves for Lewandowski and Arsenal star in the summer",
      "url": "https://sempremilan.com/milan-considering-moves-lewandowski-arsenal-star",
      "source": "sempremilan.com",
      "date": "2026-02-15T11:30:00+00:00",
      "summary": "It is no surprise that AC Milan will try to sign a striker in the summer, and a few names have been put forward.  With Jean-Philippe Mateta not arriving at Milan in the January mercato, the management will go back to the drawing board, seeking a way to improve the Rossoneri’s front line and there […"
    },
    {
      "id": "e74fd2314d11",
      "title": "GdS: Milan ‘perplexed’ over ‘harsh’ decision to disallow Rabiot’s goal vs. Pisa",
      "url": "https://sempremilan.com/milan-perplexed-harsh-decision-disallow-rabiot-goal",
      "source": "sempremilan.com",
      "date": "2026-02-15T11:05:00+00:00",
      "summary": "It seemed Adrien Rabiot had given AC Milan a two-goal lead against Pisa on Friday night, but it was not to be, confusingly.  Shortly after the half-time interval, Milan had the ball in the back of the net, and it seemed that they had put the game to bed. However, as has been the case […]\nThe post Gd"
    },
    {
      "id": "24d118188a1e",
      "title": "MN: Ricci given perfect conditions to blossom from the bench – his season so far",
      "url": "https://sempremilan.com/ricci-perfect-conditions-blossom-from-bench",
      "source": "sempremilan.com",
      "date": "2026-02-15T10:40:00+00:00",
      "summary": "When Samuele Ricci was linked, picking a place for him felt easy. However, AC Milan added quality, and a starting role became unlikely. Ricci has been one of the longest projects for Milan in recent years. Across several mercatos, there were talks of him being a target, yet the Rossoneri never made "
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    },
    {
      "id": "9c729c8148a4",
      "title": "Pisa forced to field third-choice goalkeeper in Serie A match against Milan",
      "url": "https://football-italia.net/pisa-forced-3rd-choice-goalkeeper-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T13:04:11+00:00",
      "summary": "Second-choice Pisa goalkeeper Simone Scuffet has been ruled out of tonight’s Serie A match against..."
    },
    {
      "id": "e6e4778300f1",
      "title": "Report Milan call McKennie for possible USMNT reunion with Pulisic",
      "url": "https://football-italia.net/milan-call-mckennie-usmnt-reunion-pulisic/",
      "source": "football-italia.net",
      "date": "2026-02-13T12:43:07+00:00",
      "summary": "Milan have reportedly begun preliminary talks with Weston McKennie’s entourage as the Juventus midfielder is..."
    },
    {
      "id": "bb92885e8dfd",
      "title": "Milan make Modric decision, prepare for new contract extensions after Maignan",
      "url": "https://football-italia.net/milan-modric-decision-more-contracts-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-13T11:04:46+00:00",
      "summary": "According to La Gazzetta dello Sport, Fikayo Tomori is expected to be the next Milan..."
    },
    {
      "id": "c682014167e5",
      "title": "Serie A: Pisa vs. Milan – probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/pisa-vs-milan-probable-line-ups-watch-on-tv/",
      "source": "football-italia.net",
      "date": "2026-02-13T08:53:01+00:00",
      "summary": "Ruben Loftus-Cheek and Christopher Nknuku are expected to lead the Milan attack in an away..."
    },
    {
      "id": "d50cee56a1a2",
      "title": "Capello claims Serie A title race wide open: ‘Inter & Juventus, watch out for Milan & Roma’",
      "url": "https://football-italia.net/capello-claims-serie-a-title-race-wide-open/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:30:19+00:00",
      "summary": "Fabio Capello insists the Serie A title race is far from over, warning that Inter..."
    },
    {
      "id": "ef679b7e17ab",
      "title": "Only one Serie A player included in Europe’s best paid footballers in 2026",
      "url": "https://football-italia.net/one-juventus-player-europe-top-20-best-paid/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:01:54+00:00",
      "summary": "Juventus’s Dusan Vlahovic is currently the only Serie A player to feature in the list..."
    },
    {
      "id": "00edaaaae844",
      "title": "Juventus set price tag for Gatti as Milan, Napoli and Premier League clubs queue up",
      "url": "https://football-italia.net/juventus-set-price-tag-for-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-12T14:21:33+00:00",
      "summary": "Juventus reportedly have a price tag in mind when it comes to a potential sale..."
    },
    {
      "id": "8c7c1ace3789",
      "title": "Allegri previews Pisa vs. Milan and gives injury update: ‘Pulisic only has 15-20 minutes’",
      "url": "https://football-italia.net/allegri-previews-pisa-vs-milan-injury-update/",
      "source": "football-italia.net",
      "date": "2026-02-12T12:49:06+00:00",
      "summary": "Massimiliano Allegri has shared his thoughts ahead of Milan’s upcoming Serie A clash against Pisa..."
    }
  ]
}