{
  "lastUpdated": "2026-02-16T14:09:00.833253+00:00",
  "articles": [
    {
      "id": "9db70521f0c4",
      "title": "The Figurine Museum celebrates twenty years with a tribute to Giuseppe Panini",
      "url": "https://www.milannews.it/news/il-museo-della-figurina-celebra-vent-anni-con-un-omaggio-a-giuseppe-panini-607589",
      "source": "milannews.it",
      "date": "2026-02-16T14:00:05+00:00",
      "summary": "(ANSA) - MODENA, FEBRUARY 16 - Twenty years of exhibitions, educational activities and projects have transformed the collection donated by Giuseppe Panini to the Municipality of Modena into a space for discussion, memory and shared imagination: for the occasion, from ..."
    },
    {
      "id": "b1e9821c9c56",
      "title": "Milan failure to Lyon favourite: Emotional Fonseca celebrates 13 straight wins",
      "url": "https://sempremilan.com/milan-failure-lyon-favourite-fonseca-13-wins",
      "source": "sempremilan.com",
      "date": "2026-02-16T14:00:00+00:00",
      "summary": "Things may not have gone well for Paulo Fonseca at AC Milan, but now he is very much a fan favourite at his current club Lyon. Fonseca was hired by Milan to replace Stefano Pioli before the start of the 2024-25 season, but he didn’t even make it into 2025. The Portuguese was sacked after […]\nThe pos"
    },
    {
      "id": "0f09f3547f07",
      "title": "Longhi: \"I believe the VAR protocol is to be condemned above all and not just La Penna\"",
      "url": "https://www.milannews.it/news/longhi-credo-sia-da-condannare-soprattutto-il-protocollo-var-e-non-solo-la-penna-607542",
      "source": "milannews.it",
      "date": "2026-02-16T13:50:00+00:00",
      "summary": "Bruno Longhi, historic journalist and sports commentator, spoke like this after the very serious refereeing error that occurred in Inter-Juventus when Kalulu su Bastoni was sent off."
    },
    {
      "id": "a7c399766f44",
      "title": "The moment in which Cardinale shook hands and hugged Captain Maignan at Milanello was particularly significant",
      "url": "https://www.milannews.it/news/particolarmente-significativo-il-momento-in-cui-cardinale-a-milanello-ha-stretto-la-mano-e-abbracciato-capitan-maignan-607566",
      "source": "milannews.it",
      "date": "2026-02-16T13:40:38+00:00",
      "summary": "Andrea Ramazzotti, journalist, expressed himself as follows in La Gazzetta dello Sport when describing Cardinale's visit to Milanello: \"Cardinale spent time talking with the managers (who were present in full), the technical staff and ..."
    },
    {
      "id": "19f4d6b324cb",
      "title": "MN: Key Saelemaekers update arrives ahead of Milan’s home game vs. Como",
      "url": "https://sempremilan.com/key-saelemaekers-update-arrives-milan-como",
      "source": "sempremilan.com",
      "date": "2026-02-16T13:35:00+00:00",
      "summary": "Some good news has come from Milanello a couple of days before AC Milan welcome Como to San Siro. The Milan squad were in training today continuing to prepare for the rescheduled game against Cesc Fabregas’ side, which will take place on Wednesday night. There are some doubts about the team Massimil"
    },
    {
      "id": "4c9a41e669b3",
      "title": "Rome, Gasperini: \"We emerge from the matches with Milan and Naples with some regrets\"",
      "url": "https://www.milannews.it/news/roma-gasperini-usciamo-dalle-sfide-con-milan-e-napoli-con-qualche-rammarico-607563",
      "source": "milannews.it",
      "date": "2026-02-16T13:30:56+00:00",
      "summary": "(ANSA) - NAPLES, FEBRUARY 15 - \"We always play to impose ourselves, since the beginning of the season. Since then we have grown, in the first round we won many matches but lost the direct clashes, coming close with performances but then falling."
    },
    {
      "id": "2c2480fb00e1",
      "title": "According to Marchegiani, television evidence against simulations should be reintroduced",
      "url": "https://www.milannews.it/news/secondo-marchegiani-andrebbe-reintrodotta-la-prova-televisiva-contro-le-simulazioni-607559",
      "source": "milannews.it",
      "date": "2026-02-16T13:20:33+00:00",
      "summary": "During the usual appointment with Sky Calcio Club, former goalkeeper Luca Marchegiani had his say on the many problems that referees are having to face this season, focusing in particular on a topic that is so ..."
    },
    {
      "id": "802e72832e9b",
      "title": "Borghi: \"Bad evening for Fullkrug, but it doesn't change his opinion. In these matches, however, he must be perfect\"",
      "url": "https://www.milannews.it/news/borghi-serataccia-per-fullkrug-ma-non-cambia-il-giudizio-in-queste-partite-pero-deve-essere-perfetto-607459",
      "source": "milannews.it",
      "date": "2026-02-16T13:10:24+00:00",
      "summary": "On his YouTube channel, Borghi spoke about the Pisa match on Friday evening, analyzing the general and individual performances."
    },
    {
      "id": "4ad81ad1d371",
      "title": "GdS: Division ‘not important’ – why the Milan Futuro project has barely changed since relegation",
      "url": "https://sempremilan.com/why-milan-futuro-project-barely-changed",
      "source": "sempremilan.com",
      "date": "2026-02-16T13:10:00+00:00",
      "summary": "Davide Bartesaghi is a shining example of a Milan Futuro graduate, but now the club want to see more players make the jump. La Gazzetta dello Sport recall how ‘strange’ the two games against Chievo Verona were. On one side were the Futuro, who dropped into Serie D after a failure on the field in […]"
    },
    {
      "id": "852ac6cc9db4",
      "title": "Inter, Marotta: \"Did I greet Chiellini? The greeting is the minimum. He is a young and inexperienced manager\"",
      "url": "https://www.milannews.it/news/inter-marotta-se-ho-salutato-chiellini-il-saluto-e-il-minimo-e-un-dirigente-giovane-e-inesperto-607604",
      "source": "milannews.it",
      "date": "2026-02-16T13:00:29+00:00",
      "summary": "(ANSA) - MILAN, FEBRUARY 16 - \"Did I say hello to Chiellini? The greeting is the minimum, of course, he was one of my players. He is a young and inexperienced manager, I don't even allow myself to give him advice but we discussed it."
    },
    {
      "id": "82d344d02133",
      "title": "Pasotto: \"The latest adventure left a bitter aftertaste for Allegri. From this perspective, the revenge with Milan can make sense\"",
      "url": "https://www.milannews.it/news/pasotto-l-ultima-avventura-ha-lasciato-un-retrogusto-amaro-ad-allegri-in-quest-ottica-la-rivalsa-col-milan-puo-avere-un-senso-607567",
      "source": "milannews.it",
      "date": "2026-02-16T12:50:52+00:00",
      "summary": "Marco Pasotto, journalist, expressed himself as follows in La Gazzetta dello Sport on Massimiliano Allegri: \"When describing Allegri, talking about revenge in the strict sense obviously makes little sense considering everything he has won in ..."
    },
    {
      "id": "4112f5bad99c",
      "title": "Mazzara claims 4-3-3 is ‘the key’ to Milan ‘making the most of their technical potential’",
      "url": "https://sempremilan.com/mazzara-4-3-3-key-milan-most-potential",
      "source": "sempremilan.com",
      "date": "2026-02-16T12:45:00+00:00",
      "summary": "Pietro Mazzara has suggested that Massimiliano Allegri could and should turn to the 4-3-3 more in order to unlock difficult games. Milan made things more difficult than they perhaps should have been on Friday night in Pisa, especially after taking a first-half lead through Ruben Loftus-Cheek. Niclas"
    },
    {
      "id": "ed2ffd34dff6",
      "title": "Verona chooses press silence to protest against Pairetto's refereeing decisions",
      "url": "https://www.milannews.it/news/il-verona-sceglie-il-silenzio-stampa-per-protestare-contro-le-scelte-arbitrali-di-pairetto-607565",
      "source": "milannews.it",
      "date": "2026-02-16T12:40:19+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 15 - In the two Serie A matches at 3pm Cremonese and Genoa did not get hurt, drawing 0-0 at the Zini, while at the Tardini Parma won at the last gasp against a Verona with 10 men for almost the entire match."
    },
    {
      "id": "04c70e63c9be",
      "title": "Tottenham (surprisingly) makes Igor Tudor official on the bench",
      "url": "https://www.milannews.it/news/il-tottenham-a-sorpresa-ufficializza-igor-tudor-in-panchina-607481",
      "source": "milannews.it",
      "date": "2026-02-16T12:30:43+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 14 - Tottenham has formalized the hiring of Igor Tudor until the end of the season, with the task of reviving the fortunes of the current sixteenth team in the Premier League."
    },
    {
      "id": "9d9d3cc23893",
      "title": "MN - Towards Milan-Como: Saelemaekers in the group, he is recovered for Wednesday",
      "url": "https://www.milannews.it/primo-piano/mn-verso-milan-como-saelemaekers-in-gruppo-e-recuperato-per-mercoledi-607603",
      "source": "milannews.it",
      "date": "2026-02-16T12:20:00+00:00",
      "summary": "As the editorial staff of MilanNews.it learns, Alexis Saelemaekers returned to group training this morning."
    },
    {
      "id": "959905e70d11",
      "title": "QS: A ‘strong message’ to Milan – stability and centrality behind Cardinale’s visit",
      "url": "https://sempremilan.com/strong-message-cardinale-visit-stability-centrality",
      "source": "sempremilan.com",
      "date": "2026-02-16T12:20:00+00:00",
      "summary": "Gerry Cardinale was once again present at AC Milan’s training ground on Sunday, his second visit in less than one month. As Quotidiano Sportivo recall, Cardinale’s past agenda includes a visit to Milanello in the summer of 2024, an appearance at San Siro in September of that year (his most recent fo"
    },
    {
      "id": "c29934b3c72f",
      "title": "MN - A. Panenka puffs out his chest: \"Even if Brahim Diaz had scored the spoon, I will always remain the first. All the champions want to copy me, I am the greatest\"",
      "url": "https://www.milannews.it/news/mn-a-panenka-gonfia-il-petto-anche-se-brahim-diaz-avesse-segnato-il-cucchiaio-io-rimango-sempre-il-primo-tutti-i-campioni-mi-vogliono-copiare-sono-il-607599",
      "source": "milannews.it",
      "date": "2026-02-16T12:10:13+00:00",
      "summary": "Antonin Panenka is back in the news."
    },
    {
      "id": "06ae95454d48",
      "title": "With the draw between Naples and Rome and the defeat of Juve, Milan keeps its rivals for the Champions League at a safe distance",
      "url": "https://www.milannews.it/news/con-il-pari-tra-napoli-e-roma-e-il-ko-della-juve-il-milan-tiene-a-debita-distanza-le-rivali-per-la-champions-607564",
      "source": "milannews.it",
      "date": "2026-02-16T12:00:39+00:00",
      "summary": "(ANSA) - NAPLES, FEBRUARY 15 - Naples and Roma ended the match for a Champions League place at 2-2, with the hosts still chasing. In fact, Roma took the lead first twice."
    },
    {
      "id": "47a89354b790",
      "title": "CaughtOffside: Milan star ‘open’ to Premier League return – Arsenal, Spurs and Man Utd keen",
      "url": "https://sempremilan.com/pulisic-open-manchester-united-arsenal-spurs",
      "source": "sempremilan.com",
      "date": "2026-02-16T11:55:00+00:00",
      "summary": "Speculation about Christian Pulisic’s future at AC Milan continues, with some Premier League clubs keen on landing him. Pulisic is currently under contract until June 2027 at present, but Milan have a one-year option that they can trigger, and they are expected to. However, to resolve his long-term "
    },
    {
      "id": "dc024d6afc56",
      "title": "Vaciago: \"What do we have left from the crazy night at San Siro? Not the apologies of Alessandro Bastoni who didn't feel the need to justify his gesture\"",
      "url": "https://www.milannews.it/news/vaciago-cosa-ci-rimane-dalla-folle-notte-di-san-siro-non-le-scuse-di-alessandro-bastoni-che-non-ha-sentito-il-bisogno-di-giustificare-il-suo-gesto-607594",
      "source": "milannews.it",
      "date": "2026-02-16T11:49:11+00:00",
      "summary": "Guido Vaciago, in his editorial today on Tuttosport, commented on the well-known events of Inter-Juventus as follows: \"What do we have left from the crazy night at San Siro? Not the apologies of Alessandro Bastoni, who twenty-four hours after his performance, has not ..."
    },
    {
      "id": "f1d386917db6",
      "title": "Moratti: \"Bastoni's simulation was enthusiastic\"",
      "url": "https://www.milannews.it/news/moratti-quella-di-bastoni-una-simulazione-entusiasta-607588",
      "source": "milannews.it",
      "date": "2026-02-16T11:37:52+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 16 - \"The simulations annoy me, they made me bored."
    },
    {
      "id": "92ab2443e132",
      "title": "GdS: Leao, Saelemaekers, De Winter and more – Allegri’s doubts ahead of Como game",
      "url": "https://sempremilan.com/leao-saelemaekers-allegri-doubts-como",
      "source": "sempremilan.com",
      "date": "2026-02-16T11:30:00+00:00",
      "summary": "AC Milan are back in action on Wednesday night against Como, and Massimiliano Allegri has some decisions to make. As La Gazzetta dello Sport report, Alexis Saelemaekers also trained separately on Sunday, but will most likely return to full training today. If his left adductor doesn’t cause discomfor"
    },
    {
      "id": "4e89b59911ce",
      "title": "The shame of Inter-Juve and they also talk. Serie A must support Milan to stay alive. Max, the 4-3-3 \"opens up\" your team",
      "url": "https://www.milannews.it/editoriale/la-vergogna-di-inter-juve-e-parlano-pure-la-serie-a-deve-tifare-milan-per-rimanere-viva-max-il-4-3-3-apre-la-tua-squadra-607521",
      "source": "milannews.it",
      "date": "2026-02-16T11:28:01+00:00",
      "summary": "For years, because months is too short, the Inter fanfare has always shown us the way of what could and could not be said, of what is right and what is wrong."
    },
    {
      "id": "f760b0291a0f",
      "title": "Lyon, 13th victory in a row. Fonseca's emotion after the 2-0 against Nice",
      "url": "https://www.milannews.it/gli-ex/lione-13-vittoria-di-fila-la-commozione-di-fonseca-dopo-il-2-0-al-nizza-607590",
      "source": "milannews.it",
      "date": "2026-02-16T11:25:30+00:00",
      "summary": "Paulo Fonseca's Lyon continues to fly in Ligue 1 and yesterday, beating Nice 2-0, achieved its 13th consecutive victory between the championship, the French Cup and the Europa League."
    },
    {
      "id": "b2f8ea846675",
      "title": "Milan-Como: Mariani referee, Gariglio and Maresca will be at VAR",
      "url": "https://www.milannews.it/l-arbitro/milan-como-arbitra-mariani-al-var-ci-saranno-gariglio-e-maresca-607596",
      "source": "milannews.it",
      "date": "2026-02-16T11:13:37+00:00",
      "summary": "The referee for Milan-Como has been appointed, the second half of the 24th matchday of Serie A which will be played on Wednesday at 8.45pm at San Siro: Maurizio Mariani will referee the match, while Gariglio and Maresca will be in charge of VAR."
    },
    {
      "id": "f8fac00794ad",
      "title": "CorSport: Milan aiming to tie English duo down to new deals – the strategy",
      "url": "https://sempremilan.com/milan-tomori-loftus-cheek-new-deals",
      "source": "sempremilan.com",
      "date": "2026-02-16T11:05:00+00:00",
      "summary": "Even though the winter transfer window is now behind us, the AC Milan management are still in negotiations over some deals. It was a rather quiet January for Milan in the end as they signed Niclas Füllkrug from West Ham on loan with option to buy and that was it, with a late deal for […]\nThe post Co"
    },
    {
      "id": "79f82d262dd9",
      "title": "Today Saelemaekers expected in the group. Who will replace Rabiot? Allegri's possible choices for Como",
      "url": "https://www.milannews.it/primo-piano/oggi-saelemaekers-atteso-in-gruppo-chi-sostituira-rabiot-le-possibili-scelte-di-allegri-per-il-como-607595",
      "source": "milannews.it",
      "date": "2026-02-16T11:00:57+00:00",
      "summary": "On Wednesday evening, Milan will recover the home match against Como, valid for the 24th matchday, which could not be played about ten days ago because San Siro was busy for the opening ceremony of the Olympics ..."
    },
    {
      "id": "94341ec42a0f",
      "title": "With the renewal, rather than the expiration date, Bartesaghi's salary will be adjusted to other standards",
      "url": "https://www.milannews.it/calciomercato-milan/con-il-rinnovo-piu-che-la-data-di-scadenza-sara-lo-stipendio-di-bartesaghi-a-essere-adeguato-ad-altri-standard-607571",
      "source": "milannews.it",
      "date": "2026-02-16T10:50:26+00:00",
      "summary": "Alessandra Gozzini, journalist, expressed herself as follows in La Gazzetta dello Sport on Bartesaghi's renewal: \"Bartesaghi had already passed through the office last May to extend the Rossoneri contract until 2030."
    },
    {
      "id": "8bf3833fe4c7",
      "title": "Reports: Season over for new Milan signing Alphadjo Cissè with surgery chosen",
      "url": "https://sempremilan.com/season-over-alphadjo-cisse-surgery-chosen",
      "source": "sempremilan.com",
      "date": "2026-02-16T10:40:00+00:00",
      "summary": "There was a lot of excitement about the signing of Alphadjo Cissè, but he is now expected to spend the rest of the season out of action. While the Jean-Philippe Mateta saga dominated the headlines on deadline day a couple of weeks ago, Milan completed the signing of Cissè, the young talent who was d"
    },
    {
      "id": "6d3b9f6092c0",
      "title": "GdS: Ricci the ‘extra man’ for Milan – how he earned Allegri’s full trust",
      "url": "https://sempremilan.com/ricci-extra-man-milan-allegri-trust",
      "source": "sempremilan.com",
      "date": "2026-02-16T10:15:00+00:00",
      "summary": "Samuele Ricci had a big hand in AC Milan’s winning goal against Pisa on Friday, and he has become the ‘extra man’ for Massimiliano Allegri. As La Gazzetta dello Sport write, it was Luka Modric who stole the show after the victory over Pisa. The 40-year-old popped up in the right place at the right ["
    },
    {
      "id": "77cbd929efe4",
      "title": "CorSport: Why Milan have been left angered after Inter-Juventus refereeing debacle",
      "url": "https://sempremilan.com/why-milan-angered-inter-juventus-refereeing",
      "source": "sempremilan.com",
      "date": "2026-02-16T09:50:00+00:00",
      "summary": "AC Milan are internally very discontent with the officiating during Saturday night’s game between Inter and Juventus, a report claims. After beating Pisa on Friday night, Milan were hoping for a favour from Juventus on Saturday, and they were very close to getting one but for Piotr Zielinski’s last-"
    },
    {
      "id": "4e4727f426b3",
      "title": "Moretto: Milan interested in Barcelona centre-back – ‘evaluation’ phase underway",
      "url": "https://sempremilan.com/milan-interested-gerard-martin-barcelona-evaluation",
      "source": "sempremilan.com",
      "date": "2026-02-16T09:25:00+00:00",
      "summary": "AC Milan’s interest in signing FC Barcelona defender Gerard Martin in the summer window has been confirmed by Matteo Moretto. Late last week, it emerged that Milan have a new name on their radar as they explore various options to reinforce the defence. Reports in Spain suggested that Martin is a con"
    },
    {
      "id": "2bd61fa7e59a",
      "title": "GdS: ‘Cardinale’s speech’ – why Milan’s owner was at Milanello again and what he said",
      "url": "https://sempremilan.com/why-cardinale-present-milanello-what-said",
      "source": "sempremilan.com",
      "date": "2026-02-16T09:00:00+00:00",
      "summary": "Gerry Cardinale as at Milanello on Sunday, marking the second time in less than one month that he has been present. As La Gazzetta dello Sport (seen below) write this morning, yesterday morning the founder of RedBird Capital – the fund that controls Milan – showed up at Milanello to meet the team. T"
    },
    {
      "id": "f4aa85284ebf",
      "title": "Tuttosport: Milan courting ‘a new Jimenez’ – how a deal could aid multiple areas",
      "url": "https://sempremilan.com/milan-courting-new-jimenez",
      "source": "sempremilan.com",
      "date": "2026-02-15T19:30:00+00:00",
      "summary": "AC Milan are looking to Real Madrid once again, and there is hope that there is another project player for them to discover. After the success of Alex Jimenez, where Milan made a nice profit, Milan are once again looking to Madrid for another gem to develop. In fact, it seems that one has already […"
    },
    {
      "id": "c9748545a032",
      "title": "GdS: Milan Futuro’s forced reset has been strengthened by recent graduates",
      "url": "https://sempremilan.com/milan-futuro-forced-reset-strengthened",
      "source": "sempremilan.com",
      "date": "2026-02-15T19:00:00+00:00",
      "summary": "AC Milan had big expectations for the Futuro project, and it certainly did not start well with relegation. However, it is still proving to be a success. The relegation to Serie D could have closed the door on the Milan Futuro project. Instead, though, it has been strengthened, and there is a case to"
    },
    {
      "id": "88c334b39a62",
      "title": "MN: Loftus-Cheek’s priority is and always has been Milan renewal after January rumours",
      "url": "https://sempremilan.com/loftus-cheek-priority-milan-renewal-january-rumours",
      "source": "sempremilan.com",
      "date": "2026-02-15T18:30:00+00:00",
      "summary": "It seemed Ruben Loftus-Cheek was heading to the door in January. However, the Englishman instead preferred to stay at AC Milan.  Throughout January, there was enough to suggest that Loftus-Cheek was going to leave Milan. He reportedly wanted more playing time, which the Rossoneri could not give him,"
    },
    {
      "id": "9ff006448cca",
      "title": "Midfield freedom to combat central block: Tactical analysis of Pisa 1-2 AC Milan",
      "url": "https://sempremilan.com/tactical-analysis-of-pisa-1-2-ac-milan",
      "source": "sempremilan.com",
      "date": "2026-02-15T18:00:00+00:00",
      "summary": "AC Milan travelled to Pisa on Friday night in the first game of the latest Serie A round, and they were given a scare by relegation battlers Pisa. Ruben Loftus-Cheek’s header in the first half was a welcome opening of the scoring after a dull spectacle to that point. Then, the turning point seemed t"
    },
    {
      "id": "b5957e5d1aa0",
      "title": "GdS: Allegri, Maignan and more – Milan seeking revenge in many ways",
      "url": "https://sempremilan.com/allegri-maignan-more-milan-seek-revenge",
      "source": "sempremilan.com",
      "date": "2026-02-15T17:30:00+00:00",
      "summary": "After last season, there are several players seeking revenge at AC Milan. However, there are also some who don’t have the burden of last year weighing on them. Before the Pisa game, Massimiliano Allegri stated that Milan was a team seeking revenge when he was asked about the qualities of his squad. "
    },
    {
      "id": "9808500ab77b",
      "title": "MN: Saelemaekers trains alone again as Como game draws nearer – the situation",
      "url": "https://sempremilan.com/saelemaekers-trains-alone-again-como-nearer",
      "source": "sempremilan.com",
      "date": "2026-02-15T17:00:00+00:00",
      "summary": "Alexis Saelemaekers was hoped to be back in training by now. However, the AC Milan wingback is still not back with the group. It has been a tricky season with injuries for Milan, and recent weeks have shown this further with many key players struggling to some degree. Unfortunately, Saelemaekers has"
    },
    {
      "id": "5e963fbd9a4e",
      "title": "GdS: Allegri message to the group after Pisa – Loftus-Cheek’s issue and first half problems",
      "url": "https://sempremilan.com/allegri-message-group-after-pisa",
      "source": "sempremilan.com",
      "date": "2026-02-15T16:30:00+00:00",
      "summary": "AC Milan got three points against Pisa on Friday night, but it certainly wasn’t easy and Massimiliano Allegri had a few things to say to his squad after.  Above all, it is a win for Milan against a newly promoted side. It feels strange to be celebrating that in February. However, it has troubled the"
    },
    {
      "id": "6aaeb7445ff7",
      "title": "Milan visit and study Everton as new San Siro stadium project develops",
      "url": "https://football-italia.net/milan-visit-and-study-everton-stadium/",
      "source": "football-italia.net",
      "date": "2026-02-14T16:08:21+00:00",
      "summary": "Delegates from Milan have been in Liverpool to visit and study Everton’s new Hill Dickinson..."
    },
    {
      "id": "6faea99830c6",
      "title": "Which 50 players has Gattuso spoken to about an Italy national team call-up?",
      "url": "https://football-italia.net/which-50-italy-players-has-gattuso-spoken-to/",
      "source": "football-italia.net",
      "date": "2026-02-14T11:54:22+00:00",
      "summary": "Gennaro Gattuso and his coaching staff have been busy speaking and meeting with a long..."
    },
    {
      "id": "e3b7843a3f70",
      "title": "Modric and Loftus-Cheek see Milan ‘still in battle for the league’",
      "url": "https://football-italia.net/modric-loftus-cheek-see-milan-still-in-battle/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:39:35+00:00",
      "summary": "Luka Modric believes his late Milan winner against Pisa was ‘crucial to stay in the..."
    },
    {
      "id": "c3754348608d",
      "title": "Hiljemark: ‘Pisa fell asleep and you pay for that against Milan’",
      "url": "https://football-italia.net/hiljemark-pisa-fell-asleep-and-you-pay-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:32:04+00:00",
      "summary": "Oscar Hiljemark admits Pisa ‘fell asleep in two situations, and you will pay for that’..."
    },
    {
      "id": "e9dedaa4dce5",
      "title": "Allegri: ‘Milan should all learn from incredible Modric’",
      "url": "https://football-italia.net/allegri-milan-should-learn-incredible-modric/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:08:34+00:00",
      "summary": "Max Allegri hails Luka Modric for his ‘character and humility’ after giving Milan the 2-1..."
    },
    {
      "id": "3dca59a4590b",
      "title": "Serie A | Pisa 1-2 Milan – Player Ratings as Modric spares Fullkrug blushes",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-player-ratings-as-modric-spares-fullkrug-blushes/",
      "source": "football-italia.net",
      "date": "2026-02-13T22:01:27+00:00",
      "summary": "Pisa were unlucky to fall to a 2-1 defeat to Milan this evening, with Massimiliano..."
    },
    {
      "id": "e059fbae20f9",
      "title": "Serie A | Pisa 1-2 Milan: Modric to the rescue after Fullkrug and Rabiot errors",
      "url": "https://football-italia.net/serie-a-pisa-1-2-milan-modric-to-the-rescue/",
      "source": "football-italia.net",
      "date": "2026-02-13T21:41:49+00:00",
      "summary": "Milan scraped a 2-1 victory away to Pisa, despite Niclas Fullkrug missing a penalty and..."
    },
    {
      "id": "53c2c7349836",
      "title": "Pisa-Milan – Loftus-Cheek defies Allegri criticism to open scoring: ‘His first run all game’",
      "url": "https://football-italia.net/pisa-milan-loftus-cheek-defies-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:46:00+00:00",
      "summary": "Ruben Loftus-Cheek scored to give Milan the lead in Pisa this evening, as the Englishman..."
    },
    {
      "id": "f9a1aa784026",
      "title": "Serie A Week 25 Liveblog: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-week-25-liveblog-pisa-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T20:45:03+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "c40a350b4b6d",
      "title": "Hiljemark has happy memories of facing Milan, wants ‘aggressive’ Pisa",
      "url": "https://football-italia.net/hiljemark-happy-memories-of-facing-milan-pisa/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:34:27+00:00",
      "summary": "New Pisa coach Oscar Hiljemark has fond memories of facing Milan in his playing career..."
    },
    {
      "id": "b6c54f5f7af7",
      "title": "Allegri respect for Pisa, but warning for Milan ahead of Inter battle",
      "url": "https://football-italia.net/allegri-respect-for-pisa-warning-milan-inter/",
      "source": "football-italia.net",
      "date": "2026-02-13T19:26:54+00:00",
      "summary": "Max Allegri explains his Milan choices for the trip to Pisa this evening and won’t..."
    },
    {
      "id": "9e45a624a78d",
      "title": "Serie A official Week 25 line-ups: Pisa vs. Milan",
      "url": "https://football-italia.net/serie-a-official-week-25-line-ups-pisa-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T18:37:05+00:00",
      "summary": "Milan look to Christopher Nkunku, Ruben Loftus-Cheek, Luka Modric and Adrien Rabiot for their trip..."
    },
    {
      "id": "9c729c8148a4",
      "title": "Pisa forced to field third-choice goalkeeper in Serie A match against Milan",
      "url": "https://football-italia.net/pisa-forced-3rd-choice-goalkeeper-vs-milan/",
      "source": "football-italia.net",
      "date": "2026-02-13T13:04:11+00:00",
      "summary": "Second-choice Pisa goalkeeper Simone Scuffet has been ruled out of tonight’s Serie A match against..."
    },
    {
      "id": "e6e4778300f1",
      "title": "Report Milan call McKennie for possible USMNT reunion with Pulisic",
      "url": "https://football-italia.net/milan-call-mckennie-usmnt-reunion-pulisic/",
      "source": "football-italia.net",
      "date": "2026-02-13T12:43:07+00:00",
      "summary": "Milan have reportedly begun preliminary talks with Weston McKennie’s entourage as the Juventus midfielder is..."
    },
    {
      "id": "bb92885e8dfd",
      "title": "Milan make Modric decision, prepare for new contract extensions after Maignan",
      "url": "https://football-italia.net/milan-modric-decision-more-contracts-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-13T11:04:46+00:00",
      "summary": "According to La Gazzetta dello Sport, Fikayo Tomori is expected to be the next Milan..."
    },
    {
      "id": "c682014167e5",
      "title": "Serie A: Pisa vs. Milan – probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/pisa-vs-milan-probable-line-ups-watch-on-tv/",
      "source": "football-italia.net",
      "date": "2026-02-13T08:53:01+00:00",
      "summary": "Ruben Loftus-Cheek and Christopher Nknuku are expected to lead the Milan attack in an away..."
    },
    {
      "id": "d50cee56a1a2",
      "title": "Capello claims Serie A title race wide open: ‘Inter & Juventus, watch out for Milan & Roma’",
      "url": "https://football-italia.net/capello-claims-serie-a-title-race-wide-open/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:30:19+00:00",
      "summary": "Fabio Capello insists the Serie A title race is far from over, warning that Inter..."
    },
    {
      "id": "ef679b7e17ab",
      "title": "Only one Serie A player included in Europe’s best paid footballers in 2026",
      "url": "https://football-italia.net/one-juventus-player-europe-top-20-best-paid/",
      "source": "football-italia.net",
      "date": "2026-02-12T16:01:54+00:00",
      "summary": "Juventus’s Dusan Vlahovic is currently the only Serie A player to feature in the list..."
    },
    {
      "id": "00edaaaae844",
      "title": "Juventus set price tag for Gatti as Milan, Napoli and Premier League clubs queue up",
      "url": "https://football-italia.net/juventus-set-price-tag-for-gatti/",
      "source": "football-italia.net",
      "date": "2026-02-12T14:21:33+00:00",
      "summary": "Juventus reportedly have a price tag in mind when it comes to a potential sale..."
    },
    {
      "id": "8c7c1ace3789",
      "title": "Allegri previews Pisa vs. Milan and gives injury update: ‘Pulisic only has 15-20 minutes’",
      "url": "https://football-italia.net/allegri-previews-pisa-vs-milan-injury-update/",
      "source": "football-italia.net",
      "date": "2026-02-12T12:49:06+00:00",
      "summary": "Massimiliano Allegri has shared his thoughts ahead of Milan’s upcoming Serie A clash against Pisa..."
    }
  ]
}