{
  "lastUpdated": "2026-03-01T10:24:05.256293+00:00",
  "articles": [
    {
      "id": "21cddf27160e",
      "title": "Cremonese, a look at Milan's opponents: at home Nicola's team holds a particular record",
      "url": "https://www.milannews.it/l-avversario/cremonese-uno-sguardo-agli-avversari-del-milan-in-casa-la-squadra-di-nicola-detiene-un-particolare-record-609028",
      "source": "milannews.it",
      "date": "2026-03-01T10:13:00+00:00",
      "summary": "It's matchday! After the defeat at home against Parma, Allegri's Milan will return to the field shortly, away against Cremonese at 12.30."
    },
    {
      "id": "5299ef220c3d",
      "title": "Multiple goal droughts to break: All the key stats ahead of Cremonese vs. AC Milan",
      "url": "https://sempremilan.com/all-key-stats-cremonese-milan-2025-26",
      "source": "sempremilan.com",
      "date": "2026-03-01T10:11:22+00:00",
      "summary": "AC Milan and Cremonese will battle it out at Stadio Giovanni Zini today, where the Rossoneri have struggled to find the back of the net.  There have been just 30 encounters between Milan and Cremonese throughout the years, with the Rossoneri prevailing in 17 of these. The Cremona-based side have col"
    },
    {
      "id": "e7a5b1f7405f",
      "title": "Milan on Andrè from Corinthias: numbers and characteristics of the young Brazilian talent",
      "url": "https://www.milannews.it/news/milan-su-andre-del-corinthias-numeri-e-caratteristiche-del-giovane-talento-brasiliano-609026",
      "source": "milannews.it",
      "date": "2026-03-01T10:00:00+00:00",
      "summary": "Milan is looking for reinforcements for next season."
    },
    {
      "id": "fb86c77c14f5",
      "title": "The five key battles that could win or lose the game for Milan against Cremonese",
      "url": "https://sempremilan.com/five-key-battles-cremonese-ac-milan-2025-26",
      "source": "sempremilan.com",
      "date": "2026-03-01T09:53:14+00:00",
      "summary": "AC Milan will be up against Cremonese in the early kick-off slot today, and as always, there are a few key battles that could decide the outcome of the game.  Massimiliano Allegri is reportedly set to make two changes to the starting XI, fielding a strong one despite suspension risks ahead of the de"
    },
    {
      "id": "d71f6774e541",
      "title": "Milan transfer market: Tare follows Barça's Gerard Martin, costs 15 million",
      "url": "https://www.milannews.it/calciomercato-milan/mercato-milan-tare-segue-gerard-martin-del-barca-costa-15-milioni-609046",
      "source": "milannews.it",
      "date": "2026-03-01T09:46:56+00:00",
      "summary": "According to what Corriere dello Sport reported this morning, Igli Tare, the Rossoneri's sporting director, has been eyeing Gerard Martin for several weeks, the Barcelona defender born in 2002 who can be used both as a left-back and as a centre-back."
    },
    {
      "id": "ef0e79110a3f",
      "title": "Discovering André, a transfer idea born from Moncada and the AC Milan scouting group",
      "url": "https://www.milannews.it/calciomercato-milan/alla-scoperta-di-andre-un-idea-di-mercato-nata-da-moncada-e-dal-gruppo-scouting-del-milan-609041",
      "source": "milannews.it",
      "date": "2026-03-01T09:34:11+00:00",
      "summary": "The definitive white smoke has not yet arrived, but Milan is close to closing the arrival of André, a Corinthians midfielder born in 2006 who will join the Rossoneri in the summer."
    },
    {
      "id": "965be4b745e5",
      "title": "GdS: Predicted XIs for Cremonese vs. AC Milan – Allegri eyes two changes",
      "url": "https://sempremilan.com/gds-xis-cremonese-milan-allegri-changes",
      "source": "sempremilan.com",
      "date": "2026-03-01T09:33:32+00:00",
      "summary": "Massimiliano Allegri is expected to make two changes to the starting XI for today’s game between AC Milan and Cremonese.  Milan need to bounce back with a win today after a draw and a defeat, currently sitting 13 points behind their city rivals Inter in the standings. Allegri has a few absences to d"
    },
    {
      "id": "1a2f1ac55d94",
      "title": "Spring, the official lineups of Roma-Milan",
      "url": "https://www.milannews.it/news/primavera-le-formazioni-ufficiali-di-roma-milan-609044",
      "source": "milannews.it",
      "date": "2026-03-01T09:22:51+00:00",
      "summary": "These are the official lineups for Roma-Milan, the match valid for the 8th return day of the Primavera 1 championship:\n\nROME: Kilvinger, Mirra, Seck, Terlizzi, Litti, Panico, Bah, Carlaccini, Maccaroni, Almaviva; Arena."
    },
    {
      "id": "0acdb3edea39",
      "title": "Corinthians director confirms details of Milan’s offer for André as ‘sales are necessary’",
      "url": "https://sempremilan.com/corinthians-director-confirms-milans-offer-andre",
      "source": "sempremilan.com",
      "date": "2026-03-01T09:18:24+00:00",
      "summary": "The sporting director of Corinthians, Marcelo Paz, has confirmed the details of AC Milan’s offer for the young midfielder André as ‘sales are necessary’.  It was late last night that Matteo Moretto and Fabrizio Romano broke the news about the 19-year-old midfielder, stating that Milan were closing i"
    },
    {
      "id": "df9444c06331",
      "title": "The Corinthians coach against André's departure: \"He must stay to mature. The president knows what I think...\"",
      "url": "https://www.milannews.it/news/l-allenatore-del-corinthians-contro-la-partenza-di-andre-deve-rimanere-per-maturare-il-presidente-sa-come-la-penso-609042",
      "source": "milannews.it",
      "date": "2026-03-01T09:10:37+00:00",
      "summary": "Speaking at the press conference after the defeat against Novorizontino, the Corinthians coach Dorival Junior commented on André's possible departure to Milan as follows: \"We must define ourselves as a team ..."
    },
    {
      "id": "ac2c20a88bc8",
      "title": "LIVE MN - Towards Cremonese-Milan: Fofana is in the middle of the pitch, Pulisic-Leao in front",
      "url": "https://www.milannews.it/primo-piano/live-mn-verso-cremonese-milan-c-e-fofana-in-mezzo-al-campo-pulisic-leao-davanti-609040",
      "source": "milannews.it",
      "date": "2026-03-01T09:00:17+00:00",
      "summary": "This is Milan's probable lineup: (3-5-2) Maignan; Tomori, De Winter, Pavlovic; Saelemaekers, Fofana, Modric, Rabiot, Bartesaghi; Leao, Pulisic.\n\n10."
    },
    {
      "id": "67956f47c6f7",
      "title": "Serie A: Cremonese vs. Milan – Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-cremonese-vs-milan-probable-line-ups/",
      "source": "football-italia.net",
      "date": "2026-03-01T08:55:45+00:00",
      "summary": "Massimiliano Allegri is expected to stick with an attacking line-up of Rafael Leao and Christian..."
    },
    {
      "id": "9881d341b27e",
      "title": "GdS: Contract lies spreading as Pulisic eyes first goal of 2026 in Cremonese-Milan",
      "url": "https://sempremilan.com/gds-contract-lies-pulisic-goal-cremonese-milan",
      "source": "sempremilan.com",
      "date": "2026-03-01T08:55:36+00:00",
      "summary": "Christian Pulisic is eyeing his first goal of 2026 as AC Milan are up against Cremonese away from home today, in need of Captain America’s heroics.  Pulisic is now desperate to end his goal drought, as pointed out by Gazzetta dello Sport (see image below), as he’s been without a goal since December "
    },
    {
      "id": "b341afcadaa9",
      "title": "Romano on Allegri's future: \"It's important that a coach of his caliber has trust and interest in the Milan project\"",
      "url": "https://www.milannews.it/news/romano-sul-futuro-di-allegri-importante-che-un-tecnico-del-suo-calibro-abbia-fiducia-e-interesse-nel-progetto-milan-609018",
      "source": "milannews.it",
      "date": "2026-03-01T08:47:00+00:00",
      "summary": "Fabrizio Romano, a well-known journalist and negotiation expert, expressed himself thus on his YouTube channel, talking about Massimiliano Allegri and what his future could be for next season."
    },
    {
      "id": "dde49022884a",
      "title": "The Corinthians sporting director confirms Milan's offer for André: \"15 million plus two bonuses for 70% of the price\"",
      "url": "https://www.milannews.it/calciomercato-milan/il-ds-del-corinthians-conferma-l-offerta-del-milan-per-andre-15-milioni-piu-due-di-bonus-per-il-70-del-cartellino-609036",
      "source": "milannews.it",
      "date": "2026-03-01T08:35:37+00:00",
      "summary": "During the interview after the match lost against Novorizontino, Marcelo Paz, sporting director of Corinthians, confirmed that Milan has presented an offer for the midfielder born in 2006 André: 15 million ..."
    },
    {
      "id": "f0f2cc990a6e",
      "title": "Today’s Papers: Super Dimarco, Inter +13, Roma-Juve, Cremonese-Milan",
      "url": "https://football-italia.net/todays-papers-super-dimarco-inter-plus-13/",
      "source": "football-italia.net",
      "date": "2026-03-01T08:34:56+00:00",
      "summary": "La Gazzetta dello Sport Dimarco’s golden foot Genoa beaten, Inter reinforce their lead  +13  Eighth..."
    },
    {
      "id": "a766b7c13665",
      "title": "Gallery: ‘Milan 13 points behind’, ‘Get closer again’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/gallery-milan-13-points-papers-italy",
      "source": "sempremilan.com",
      "date": "2026-03-01T08:30:07+00:00",
      "summary": "Inter’s win last night has put the pressure on AC Milan to clinch all three points against Cremonese today, as highlighted by the newspapers this morning.  While many have stopped believing in the Scudetto, the Rossoneri are still in the race mathematically speaking and thus need to secure as many p"
    },
    {
      "id": "ab54714e15d9",
      "title": "Towards Cremonese-Milan: the probable lineups of the two teams",
      "url": "https://www.milannews.it/rassegna-stampa/verso-cremonese-milan-le-probabili-formazioni-delle-due-squadre-609039",
      "source": "milannews.it",
      "date": "2026-03-01T08:23:33+00:00",
      "summary": "These, according to La Gazzetta dello Sport, are the probable line-ups for Cremonese-Milan, a match valid for the 27th matchday of Serie A scheduled for today at 12pm."
    },
    {
      "id": "a95ce720757b",
      "title": "Milan transfer market, Tuttosport: \"It's a derby for Goretzka, but Inter have put the arrow on it\"",
      "url": "https://www.milannews.it/rassegna-stampa/mercato-milan-tuttosport-e-derby-per-goretzka-ma-l-inter-ha-messo-la-freccia-609037",
      "source": "milannews.it",
      "date": "2026-03-01T08:11:09+00:00",
      "summary": "\"It's a derby for Goretzka, but Inter have put the arrow on\": this is the headline from Tuttosport this morning, explaining that Milan have had their eyes on Leon Goretzka for some time, a midfielder whose contract with Bayern Mo ..."
    },
    {
      "id": "0744cd9cd71e",
      "title": "CorSera headlines on Max's future: \"Allegri is holding on to Milan\"",
      "url": "https://www.milannews.it/rassegna-stampa/il-corsera-titola-sul-futuro-di-max-allegri-si-tiene-stretto-il-milan-609038",
      "source": "milannews.it",
      "date": "2026-03-01T07:59:50+00:00",
      "summary": "The Corriere della Sera on newsstands today has the headline on the future of Massimiliano Allegri given that in recent days there have also been rumors about his possible farewell: \"Allegri is holding on to Milan\"."
    },
    {
      "id": "385ccea70b87",
      "title": "André close to Milan: the details of the Rossoneri offer. There is also 20% on future resale",
      "url": "https://www.milannews.it/calciomercato-milan/andre-vicino-al-milan-i-dettagli-dell-offerta-rossonera-c-e-anche-il-20-sulla-futura-rivendita-609033",
      "source": "milannews.it",
      "date": "2026-03-01T07:48:23+00:00",
      "summary": "In the last few hours several pieces of news have arrived from Brazil regarding the negotiations between Milan and Corinthians for André, a midfielder born in 2006 who is one step away from transferring to the Rossoneri."
    },
    {
      "id": "752297199c25",
      "title": "Today Cremonese-Milan, Gazzetta: \"Rabiot, Fofana Saelemaekers starters at risk. With a yellow card they miss the derby\"",
      "url": "https://www.milannews.it/rassegna-stampa/oggi-cremonese-milan-gazzetta-rabiot-fofana-saelemaekers-titolari-a-rischio-con-un-giallo-saltano-il-derby-609035",
      "source": "milannews.it",
      "date": "2026-03-01T07:36:35+00:00",
      "summary": "La Gazzetta dello Sport headlines like this this morning in view of Cremonese-Milan, a match valid for the 27th matchday of Serie A scheduled today at 12.30: \"Rabiot, Fofana  Saelemaekers starters at risk."
    },
    {
      "id": "3565052d4b8d",
      "title": "DS Corinthians: \"There is an offer from Milan for André, but the negotiation is not yet closed. Everyone knows that we need to sell players\"",
      "url": "https://www.milannews.it/news/ds-corinthians-c-e-un-offerta-del-milan-per-andre-ma-la-trattativa-non-e-ancora-chiusa-tutti-sanno-che-abbiamo-bisogno-di-vendere-giocatori-609034",
      "source": "milannews.it",
      "date": "2026-03-01T07:24:23+00:00",
      "summary": "Marcelo Paz, sporting director of Corinthians, after the match lost against Novorizontino, confirmed that there is an ongoing negotiation with Milan for the midfielder born in 2006 André: \"Is there a transfer? No! ..."
    },
    {
      "id": "9f4599bd1545",
      "title": "La Gazzetta opening: \"Milan by assault while waiting for the derby\"",
      "url": "https://www.milannews.it/rassegna-stampa/la-gazzetta-in-apertura-milan-d-assalto-in-attesa-del-derby-609032",
      "source": "milannews.it",
      "date": "2026-03-01T07:12:48+00:00",
      "summary": "Today's edition of the Gazzetta dello Sport headlines this morning on the front page: \"Milan by assault while waiting for the derby\". Today at 12."
    },
    {
      "id": "1b6e1393583a",
      "title": "André-Milan: offer, contract, medical visits and what's missing. The latest from Brazil",
      "url": "https://www.milannews.it/primo-piano/andre-milan-offerta-contratto-visite-mediche-e-cosa-manca-le-ultime-dal-brasile-609031",
      "source": "milannews.it",
      "date": "2026-03-01T07:00:30+00:00",
      "summary": "Milan is close to making its first signing for next season: André, a midfielder born in 2005 from Corinthians."
    },
    {
      "id": "2bbd14dc4017",
      "title": "Primavera back on the pitch: time for the challenge and updated rankings",
      "url": "https://www.milannews.it/la-primavera/primavera-di-nuovo-in-campo-ora-della-sfida-e-classifica-aggiornata-609000",
      "source": "milannews.it",
      "date": "2026-03-01T06:48:41+00:00",
      "summary": "On Sunday 1 March, at 11am, Milan Primavera faces Roma at the Tre Fontane stadium in a match valid for the 27th matchday of the Primavera 1 championship. Renna's Rossoneri come off a good 2-1 victory against Napoli."
    },
    {
      "id": "cd20d399550c",
      "title": "Milan Futuro is back: date and time of the match against Folgore Caratese",
      "url": "https://www.milannews.it/milan-futuro/torna-il-milan-futuro-data-e-ora-della-sfida-con-la-folgore-caratese-608998",
      "source": "milannews.it",
      "date": "2026-03-01T06:36:44+00:00",
      "summary": "After the excellent away win against Caldiero Terme, a clear and convincing 3-0, Mr. Oddo's Milan Futuro will face Folgore Caratese first in the standings. The appointment is for today, Sunday 1 March 2026 at 2pm."
    },
    {
      "id": "69bf1d436cae",
      "title": "Serie A, the updated standings: Inter leads on Milan",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-l-inter-allunga-sul-milan-609022",
      "source": "milannews.it",
      "date": "2026-03-01T06:24:00+00:00",
      "summary": "Below is the updated ranking after Saturday's results:\n\nInter 67\n\nMilan 54*\n\nNaples 53\n\nRome 50*\n\nComo 48\n\nJuventus 46*\n\nAtalanta 45*\n\nBologna 36*\n\nSassuolo 35*\n\nLazio 34*\n\nParma 33\n\nUdinese 32*\n\nCagliari 30\n\nTor ..."
    },
    {
      "id": "b765457087fc",
      "title": "Report Corinthians talent Andre is ready for Milan at age 19",
      "url": "https://football-italia.net/report-corinthians-talent-andre-ready-ac-milan/",
      "source": "football-italia.net",
      "date": "2026-02-28T20:50:57+00:00",
      "summary": "Multiple sources are now reporting that Milan have agreed a deal worth at least €12m..."
    },
    {
      "id": "b7ee8c1506ff",
      "title": "Romano: Milan in ‘advanced talks’ to sign ‘top talent’ from Corinthians for €12-13m",
      "url": "https://sempremilan.com/milan-advanced-talks-andre-corinthians-12-13m",
      "source": "sempremilan.com",
      "date": "2026-02-28T20:42:48+00:00",
      "summary": "Out of nowhere, AC Milan are close to agreeing a deal to sign André from Corinthians, according to reports. Milan’s management always keeps an eye on the emerging talent market, as seen with the signing of David Odogu from VfL Wolfsburg during the summer window, as well as various additions for Mila"
    },
    {
      "id": "4ac4365d9a77",
      "title": "Sky: Milan’s predicted XI to face Cremonese – Jashari on the bench",
      "url": "https://sempremilan.com/sky-milan-xi-cremonese-jashari-bench",
      "source": "sempremilan.com",
      "date": "2026-02-28T19:30:00+00:00",
      "summary": "AC Milan will be up against Cremonese in the early kick-off slot tomorrow and despite doing well lately, Ardon Jashari will start the game on the bench.  After two games without a win, drawing one and losing one, Milan need to pick themselves up with a good performance tomorrow. However, while Cremo"
    },
    {
      "id": "05c78c612ef0",
      "title": "Serie A preview: Cremonese vs. AC Milan – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-cremonese-vs-ac-milan-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-28T19:00:29+00:00",
      "summary": "AC Milan are looking to clinch their first win against Cremonese in the 21st century tomorrow, having dropped points on all three occasions so far.  Just a few weeks ago, Milan were not too far behind Inter and there was a buzz around city, knowing that the derby could bring them even closer. Howeve"
    },
    {
      "id": "9b8fbb017f2a",
      "title": "Cremonese manager says they must play with ‘humour and joy’ against Milan",
      "url": "https://sempremilan.com/cremonese-manager-humour-joy-milan",
      "source": "sempremilan.com",
      "date": "2026-02-28T18:16:35+00:00",
      "summary": "Ahead of the important game against AC Milan tomorrow, Cremonese’s manager Davide Nicola shared his thoughts on what will be needed from his side to get a good result.  After a very positive start to the season, which included the win against Milan in the opening round, Cremonese have taken a turn f"
    },
    {
      "id": "3e5258c58cc0",
      "title": "Milan loanee Colombo looking forward to ‘special’ game against Inter tonight",
      "url": "https://sempremilan.com/milan-loanee-colombo-special-inter",
      "source": "sempremilan.com",
      "date": "2026-02-28T17:30:00+00:00",
      "summary": "The AC Milan loanee Lorenzo Colombo is gearing up for a special game against Inter tonight, returning to the stadium that he used to call home.  Colombo left Milan in the summer on loan with an option to buy, which can turn into an obligation if certain conditions are met. In fact, the only conditio"
    },
    {
      "id": "c51847275484",
      "title": "Allegri provides positive update as Gimenez could join team training ‘next week’",
      "url": "https://sempremilan.com/allegri-positive-update-gimenez-training",
      "source": "sempremilan.com",
      "date": "2026-02-28T17:00:00+00:00",
      "summary": "Santiago Gimenez will soon be back in training with the rest of the squad following a long absence, as confirmed by Massimiliano Allegri today.  Gimenez has been on the sidelines since October, when his ankle problem became too much for him to handle on the pitch. In December, he underwent surgery a"
    },
    {
      "id": "2d7564708457",
      "title": "Opposition insight for Cremonese-Milan: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-cremonese-milan-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-28T16:30:00+00:00",
      "summary": "Cremonese are the next opponents for AC Milan and having failed to win since the start of December, Davide Nicola’s side will be looking to replicate the reverse fixture.  Although the unbeaten run came to an end against Parma last weekend, the opening round of the season still stings for Milan. Des"
    },
    {
      "id": "c84de787b058",
      "title": "Allegri confirms Rabiot will play vs. Cremonese despite suspension risk for derby",
      "url": "https://sempremilan.com/allegri-rabiot-play-cremonese-risk-derby",
      "source": "sempremilan.com",
      "date": "2026-02-28T16:00:00+00:00",
      "summary": "Massimiliano Allegri has effectively confirmed that Adrien Rabiot will play for AC Milan against Cremonese tomorrow, despite him being just one yellow card away from being suspended in the derby.  The yellow card accumulation has certainly ended up in the spotlight in recent weeks, as is sometimes t"
    },
    {
      "id": "81a58cc61758",
      "title": "Allegri plays down Milan exit rumours, makes Pulisic prediction",
      "url": "https://football-italia.net/allegri-milan-exit-rumours-pulisic-prediction/",
      "source": "football-italia.net",
      "date": "2026-02-28T15:47:16+00:00",
      "summary": "Massimiliano Allegri plays down Milan exit rumours, saying that there’s ‘total harmony’ with club directors..."
    },
    {
      "id": "8b164e4cc2a1",
      "title": "Longo: Three youngsters that will be promoted from the Primavera to Milan Futuro",
      "url": "https://sempremilan.com/longo-three-youngsters-promoted-primavera-futuro",
      "source": "sempremilan.com",
      "date": "2026-02-28T15:30:00+00:00",
      "summary": "The current season is far from over, but AC Milan have already begun planning for the next season. That includes the Milan Futuro team, with some notable promotions expected from the Primavera.  For those of you who aren’t familiar with the specifics, the Primavera is Milan’s U19 side, while the Fut"
    },
    {
      "id": "5ad9064c5f6a",
      "title": "Allegri previews Cremonese-Milan and addresses exit rumours: “Complete agreement”",
      "url": "https://sempremilan.com/allegri-previews-cremonese-milan-exit-rumours",
      "source": "sempremilan.com",
      "date": "2026-02-28T15:01:05+00:00",
      "summary": "On the eve of the game between AC Milan and Cremonese, Massimiliano Allegri spoke to the media and shared his thoughts on what he expects to be a tricky task. Milan aren’t exactly in the best of form, first drawing against Como and then dropping all points against Parma to fall behind in the Scudett"
    },
    {
      "id": "d97354f6dc9e",
      "title": "Picture: Italy legend Maldini sends his Milan shirt to Barcelona talent",
      "url": "https://football-italia.net/maldini-milan-shirt-barcelona-gerard-martin/",
      "source": "football-italia.net",
      "date": "2026-02-28T14:54:14+00:00",
      "summary": "Italy and Milan legend Paolo Maldini surprisingly sent one of his signed match-worn shirts to..."
    },
    {
      "id": "90bc86937bb2",
      "title": "Revenge in sight after 25 games: Milan must avoid another Cremonese upset",
      "url": "https://sempremilan.com/revenge-after-25-games-milan-cremonese",
      "source": "sempremilan.com",
      "date": "2026-02-28T14:15:00+00:00",
      "summary": "25 games since Cremonese’s upset in the opening round, winning 1-2 at San Siro, AC Milan will finally be able to get their revenge.  Prior to the defeat against Parma last weekend, Milan had only lost one game: the opening round against Cremonese at San Siro. Davide Nicola’s men made the most of two"
    },
    {
      "id": "e7091d89a4a9",
      "title": "CM: Milan loanee attracting interest from abroad with summer exit possible",
      "url": "https://sempremilan.com/cm-milan-loanee-bondo-summer-exit",
      "source": "sempremilan.com",
      "date": "2026-02-28T13:45:00+00:00",
      "summary": "Warren Bondo’s future will be decided upon his return to AC Milan in the summer, according to a report, with a lot riding on the pre-season contributions.  Bondo joined Cremonese on a season-long loan in the summer, right around the same time that Filippo Terracciano also left Milan for the Cremona-"
    },
    {
      "id": "024548e62e55",
      "title": "Experienced referees assigned to Cremonese-Milan after recent controversy",
      "url": "https://sempremilan.com/experienced-referees-cremonese-milan-controversy",
      "source": "sempremilan.com",
      "date": "2026-02-28T13:15:00+00:00",
      "summary": "Davide Massa has been appointed as the referee for AC Milan’s game against Cremonese tomorrow, with AIA opting for experience.  As we highlighted in our latest newsletter, the debates about the officiating in Serie A have been never-ending this season. In Milan’s case, sadly, errors have been at the"
    },
    {
      "id": "1fe0427d3790",
      "title": "Longo: Tare’s Milan future to be ‘assessed at the end of the season’ – the reasons",
      "url": "https://sempremilan.com/tare-milan-future-assessed-end-season",
      "source": "sempremilan.com",
      "date": "2026-02-28T12:45:00+00:00",
      "summary": "Igli Tare has not even done a year as AC Milan’s sporting director, but his work will be evaluated at the end of the season. As Calciomercato.com recall, last summer Milan decided that they needed a sporting director to come in and plug a gap that was there previously, ever since the departures of P"
    },
    {
      "id": "110b7961e975",
      "title": "Milan chase Guirassy and Chelsea-owned striker for next summer – report",
      "url": "https://football-italia.net/milan-guirassy-chelsea-striker-2026-summer/",
      "source": "football-italia.net",
      "date": "2026-02-28T10:00:29+00:00",
      "summary": "According to La Gazzetta dello Sport, Borussia Dortmund’s Serhou Guirassy is one of Milan’s main..."
    },
    {
      "id": "950e3dbe4545",
      "title": "Two Serie A sides interested in free transfer for Manchester United’s Casemiro",
      "url": "https://football-italia.net/two-serie-a-sides-interested-in-casemiro-free/",
      "source": "football-italia.net",
      "date": "2026-02-27T17:47:18+00:00",
      "summary": "Reports in Italy claim that two sides in Serie A are interested in a potential..."
    },
    {
      "id": "7490edb48798",
      "title": "Report: Milan want to cash in on Estupiñán, price tag set",
      "url": "https://football-italia.net/report-milan-want-estupinan-sold/",
      "source": "football-italia.net",
      "date": "2026-02-26T17:52:28+00:00",
      "summary": "Pervis Estupiñán’s time at Milan appears to be drawing to a close after just one..."
    },
    {
      "id": "4607c4ec9334",
      "title": "Report Allegri considering his future at Milan",
      "url": "https://football-italia.net/allegri-consider-future-milan-report/",
      "source": "football-italia.net",
      "date": "2026-02-25T10:56:20+00:00",
      "summary": "According to Sportitalia, Milan coach Massimiliano Allegri is considering his future at the club beyond..."
    },
    {
      "id": "7367715a2cf2",
      "title": "Former Serie A referee plays down controversial decisions in Milan defeat to Parma",
      "url": "https://football-italia.net/tommasi-milan-parma-open-var/",
      "source": "football-italia.net",
      "date": "2026-02-24T16:51:37+00:00",
      "summary": "Parma’s late 1-0 victory against Milan at San Siro has continued to generate significant debate..."
    },
    {
      "id": "af0191216a1b",
      "title": "Today’s Papers: Champions League, Inter-Bodo/Glimt, McKennie renewal",
      "url": "https://football-italia.net/todays-papers-champions-league-inter-bodo/",
      "source": "football-italia.net",
      "date": "2026-02-24T08:41:35+00:00",
      "summary": "La Gazzetta dello Sport  In with the goals  Champions League: Inter looking for the comeback..."
    },
    {
      "id": "788c5d351c80",
      "title": "Milan angered by four refereeing decisions in last two Serie A matches",
      "url": "https://football-italia.net/milan-angered-by-four-refereeing-decisions/",
      "source": "football-italia.net",
      "date": "2026-02-23T20:54:18+00:00",
      "summary": "Milan have recently expressed their frustrations to the Italian refereeing association (AIA), but this has..."
    },
    {
      "id": "10685676747e",
      "title": "Pictures: Loftus-Cheek shows off missing teeth after nasty Corvi clash",
      "url": "https://football-italia.net/pictures-loftus-cheek-shows-off-missing-teeth/",
      "source": "football-italia.net",
      "date": "2026-02-23T17:32:53+00:00",
      "summary": "Ruben Loftus-Cheek has shared pictures of the aftermath of his horror clash with Edorardo Corvi..."
    },
    {
      "id": "fa7d8029c675",
      "title": "Official: Milan confirm Loftus-Cheek recovery time after horror facial injury",
      "url": "https://football-italia.net/milan-confirm-loftus-cheek-recovery-time/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:41:25+00:00",
      "summary": "Milan have confirmed that midfielder Ruben Loftus-Cheek has undergone surgery, that he has been discharged..."
    },
    {
      "id": "ec7ee8180188",
      "title": "Maignan snubbed Juventus despite higher offer than Milan’s",
      "url": "https://football-italia.net/maignan-snubbed-juventus-higher-offer-milan/",
      "source": "football-italia.net",
      "date": "2026-02-23T16:04:27+00:00",
      "summary": "Milan goalkeeper Mike Maignan reportedly turned down an offer from Juventus, despite the Bianconeri proposing..."
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    }
  ]
}