{
  "lastUpdated": "2026-01-31T15:21:56.280052+00:00",
  "articles": [
    {
      "id": "eb525da50bfb",
      "title": "Watch: Maignan arrives at Casa Milan to sign contract renewal with the Rossoneri",
      "url": "https://sempremilan.com/watch-maignan-arrives-casa-milan-renewal",
      "source": "sempremilan.com",
      "date": "2026-01-31T15:20:00+00:00",
      "summary": "Mike Maignan has arrived at Casa Milan to sign his contract renewal with AC Milan, extending the deadline to 2030 with an option for an additional year.  Maignan’s contract situation has been the talk of the town for quite some time. Understandably so, as the Frenchman has been absolutely brilliant "
    },
    {
      "id": "6cf439d1ff22",
      "title": "Bianchin on Mateta: \"Crystal Palace is still blocking today, Milan won't stop believing in it\"",
      "url": "https://www.milannews.it/calciomercato-milan/bianchin-su-mateta-crystal-palace-fa-muro-anche-oggi-il-milan-non-smette-di-crederci-605903",
      "source": "milannews.it",
      "date": "2026-01-31T15:11:11+00:00",
      "summary": "On his profile \n\n\n."
    },
    {
      "id": "6a69ba15ec23",
      "title": "VIDEO MN - Maignan arrived at the headquarters to sign the renewal",
      "url": "https://www.milannews.it/news/video-mn-maignan-arrivato-in-sede-per-la-firma-del-rinnovo-605902",
      "source": "milannews.it",
      "date": "2026-01-31T15:03:11+00:00",
      "summary": "Mike Maignan has finally arrived at the venue, as demonstrated by the video from our correspondents at Casa Milan."
    },
    {
      "id": "4efdd2d03672",
      "title": "LIVE MN - Milan Market: Maignan arrived at the venue for the signing. Made for Cissè, decisive day for Mateta",
      "url": "https://www.milannews.it/primo-piano/live-mn-mercato-milan-maignan-arrivato-in-sede-per-la-firma-fatta-per-cisse-giornata-decisiva-per-mateta-605873",
      "source": "milannews.it",
      "date": "2026-01-31T15:01:00+00:00",
      "summary": "4pm | MAIGNAN ARRIVED AT THE HEADQUARTERS \nMike Maignan has arrived at the office at this moment to sign the contract renewal with Milan\n\n3.39pm | TARE AND FURLANI ARRIVED AT THE OFFICE\nEverything is ready for the renewal of Maignan."
    },
    {
      "id": "f22b28cc8e5f",
      "title": "Raised in the suburbs, inspired by Ibrahimovic: Mateta's story and all its characteristics",
      "url": "https://www.milannews.it/primo-piano/cresciuto-nelle-banlieue-ispirato-da-ibrahimovic-la-storia-di-mateta-e-tutte-le-sue-caratteristiche-605834",
      "source": "milannews.it",
      "date": "2026-01-31T15:00:00+00:00",
      "summary": "Jean-Philippe Mateta is preparing to become a new AC Milan player. A lightning negotiation, strongly desired by Milan on Thursday night and during the day on Friday."
    },
    {
      "id": "0acc002ea460",
      "title": "GdS: Milan reach agreement with Bayern Munich over young full-back Dalpiaz",
      "url": "https://sempremilan.com/gds-milan-agreement-bayern-munich-youngster",
      "source": "sempremilan.com",
      "date": "2026-01-31T14:50:00+00:00",
      "summary": "AC Milan and Bayern Munich have reached an agreement for the transfer of Magnus Dalpiaz, who will be part of the Primavera side.  Earlier this morning, we reported Sky Germany’s story which said that Milan were in talks with Bayern Munich regarding the 18-year-old. Evidently, talks progressed quickl"
    },
    {
      "id": "756584a26efc",
      "title": "Pirritano: \"Cissè is not a meteor: leaving him in B before the jump makes sense for everyone\"",
      "url": "https://www.milannews.it/news/pirritano-cisse-non-e-una-meteora-lasciarlo-in-b-prima-del-salto-ha-senso-per-tutti-605824",
      "source": "milannews.it",
      "date": "2026-01-31T14:48:30+00:00",
      "summary": "Among the many names that have come out in the last few hours with a view to Milan, there is also that of the young Italian talent born in 2006 Alphadjo Cissè, who is playing a great Serie B championship with the Cata shirt..."
    },
    {
      "id": "b33397f426e2",
      "title": "Former Milan, Paquetà returns home: the move to Flamengo is official",
      "url": "https://www.milannews.it/gli-ex/ex-milan-paqueta-torna-a-casa-ufficiale-il-passaggio-al-flamengo-605876",
      "source": "milannews.it",
      "date": "2026-01-31T14:36:41+00:00",
      "summary": "Lucas Paquetà, former player of Milan, has left West Ham to return to Brazil, to Flamengo."
    },
    {
      "id": "d1d08a60e71f",
      "title": "Ravezzani: \"I like Mateta. The question remains as to how he will settle into Italian football\"",
      "url": "https://www.milannews.it/news/ravezzani-a-me-mateta-piace-resta-l-interrogativo-su-come-si-ambientera-nel-calcio-italiano-605810",
      "source": "milannews.it",
      "date": "2026-01-31T14:24:01+00:00",
      "summary": "Fabio Ravezzani, director of TeleLombardia, expressed himself on X on Jean-Philippe Mateta, Milan's transfer target: \"Mateta seems like a very interesting operation to me. I said it for Juve, I confirm it for Milan."
    },
    {
      "id": "9293293ce626",
      "title": "Watch: RedBird taking flight with NBA Europe, refinancing and stadium plans",
      "url": "https://sempremilan.com/watch-redbird-nba-refinancing-stadium-plans",
      "source": "sempremilan.com",
      "date": "2026-01-31T14:20:00+00:00",
      "summary": "After securing financing to repay the vendor loan, RedBird and Gerry Cardinale have some big plans for AC Milan, which is something that Oliver and Isak discussed in the latest bonus podcast.  Yesterday afternoon, it was announced that RedBird had repaid the vendor loan to Elliott, with the American"
    },
    {
      "id": "d1d6fe994f48",
      "title": "From England, Joshua Zirkzee will remain at United until the end of the season",
      "url": "https://www.milannews.it/dall-estero/dall-inghilterra-joshua-zirkzee-rimarra-allo-united-fino-al-termine-della-stagione-605880",
      "source": "milannews.it",
      "date": "2026-01-31T14:12:45+00:00",
      "summary": "One of the most talked about names this month of January, but in general of the latest transfer market sessions, is that of Joshua Zirkzee."
    },
    {
      "id": "5bbf6f8e7f02",
      "title": "Freund on Goretzka: \"His time at Bayern Munich will end in the summer\"",
      "url": "https://www.milannews.it/news/freund-su-goretzka-il-suo-periodo-al-bayern-monaco-finira-in-estate-605758",
      "source": "milannews.it",
      "date": "2026-01-31T14:00:00+00:00",
      "summary": "Christoph Freund, sporting director of Bayern Munich, spoke at a press conference on the future of Leon Goretzka, also linked to AC Milan: “We have had several discussions with him, with all the parties involved."
    },
    {
      "id": "ee31d98d7a0a",
      "title": "Romano: Chelsea outcast leaves West Ham hanging after giving priority to Milan",
      "url": "https://sempremilan.com/romanbo-chelsea-outcast-west-ham-priority-milan",
      "source": "sempremilan.com",
      "date": "2026-01-31T13:50:00+00:00",
      "summary": "Axel Disasi has given full priority to joining AC Milan, who now must decide whether to sign the Chelsea outcast or not.  In addition to a striker, which ended up being Niclas Füllkrug (and possibly Jean-Philippe Mateta), a centre-back was a priority for Milan as they headed into the month. However,"
    },
    {
      "id": "ffdd950ca3d1",
      "title": "Happy birthday to Lorenzo Torriani who turns 21 today!",
      "url": "https://www.milannews.it/news/tanti-auguri-a-lorenzo-torriani-che-oggi-compie-21-anni-605890",
      "source": "milannews.it",
      "date": "2026-01-31T13:48:43+00:00",
      "summary": "Day of celebration at Milan, today on the day of the resumption of training in view of the next away match against Bologna which is scheduled for Tuesday 3 February at 8pm."
    },
    {
      "id": "2600a842ee0b",
      "title": "Official: Date and location of Milan vs. Como match confirmed after Australia debacle",
      "url": "https://football-italia.net/date-location-of-milan-vs-como-match-confirmed/",
      "source": "football-italia.net",
      "date": "2026-01-31T13:38:18+00:00",
      "summary": "The Serie A match between Milan and Como, which the league had sought to play..."
    },
    {
      "id": "6974645bbc4b",
      "title": "Lazio, Sarri: \"Romagnoli? It's a situation that the club manages\"",
      "url": "https://www.milannews.it/news/lazio-sarri-romagnoli-e-una-situazione-che-gestisce-la-societa-605875",
      "source": "milannews.it",
      "date": "2026-01-31T13:36:08+00:00",
      "summary": "(ANSA) - ROME, JAN 30 - \"I don't care about the market, the company does. Romagnoli is a situation whose management is in the hands of the company."
    },
    {
      "id": "fcef8290dba0",
      "title": "Bologna, training resumed today: Italiano recovers a player in the group",
      "url": "https://www.milannews.it/l-avversario/bologna-ripresi-oggi-gli-allenamenti-italiano-recupera-un-giocatore-in-gruppo-605889",
      "source": "milannews.it",
      "date": "2026-01-31T13:24:50+00:00",
      "summary": "After the European away match on the neutral pitch of Maccabi Tel Aviv, which resulted in a final tenth place in the Europa League League Phase standings, Bologna was able to enjoy a day of rest yesterday and ..."
    },
    {
      "id": "ec27fee6b6b2",
      "title": "Gordon Singer reflects on Elliott’s ownership of AC Milan: “We are proud”",
      "url": "https://sempremilan.com/singer-reflects-elliotts-ownership-milan-proud",
      "source": "sempremilan.com",
      "date": "2026-01-31T13:20:00+00:00",
      "summary": "Gordon Singer commented on Elliott Management’s official exit from AC Milan yesterday, stating that they are ‘proud’ of what they have achieved.  It was back in the summer of 2018 that Elliott took control of the club, as the Chinese owner Yongong Li defaulted on his loan. Immediately, the American "
    },
    {
      "id": "8be3baef08ac",
      "title": "Serie D, Scanzorosciate-Milan Futuro: the official lineups",
      "url": "https://www.milannews.it/milan-futuro/serie-d-scanzorosciate-milan-futuro-le-formazioni-ufficiali-605894",
      "source": "milannews.it",
      "date": "2026-01-31T13:12:02+00:00",
      "summary": "There is just over a quarter of an hour left until the start of the match between Scanzorosciate and Milan Futuro."
    },
    {
      "id": "ffbb8e709068",
      "title": "Last call for the defense: Allegri waits for the central defender",
      "url": "https://www.milannews.it/primo-piano/ultima-chiamata-per-la-difesa-allegri-aspetta-il-centrale-605698",
      "source": "milannews.it",
      "date": "2026-01-31T13:00:00+00:00",
      "summary": "The last few days of the transfer market for Milan revolve around a clear priority, almost no longer negotiable: a central defender."
    },
    {
      "id": "5477c3fb3f13",
      "title": "Galliani says Milan would have had ‘fewer’ points and ‘not more’ without Allegri",
      "url": "https://sempremilan.com/galliani-milan-fewer-points-without-allegri",
      "source": "sempremilan.com",
      "date": "2026-01-31T12:50:00+00:00",
      "summary": "AC Milan and Massimiliano Allegri have been praised for their results this season, and as argued by Adriano Galliani, the manager is a huge part of that.  There was some scepticism when Milan decided to replace Sergio Conceicao with Allegri in the summer. The Portuguese manager was always going to l"
    },
    {
      "id": "04198316a2bf",
      "title": "Rowe charges Bologna: \"EL's victory will give us enthusiasm in the championship too\"",
      "url": "https://www.milannews.it/l-avversario/rowe-carica-il-bologna-la-vittoria-di-el-ci-dara-entusiasmo-anche-in-campionato-605733",
      "source": "milannews.it",
      "date": "2026-01-31T12:48:00+00:00",
      "summary": "Jonathan Rowe, Bologna footballer, spoke to the club's official channels after EL's match against Maccabi Tel Aviv, also pointing to the next championship matches: \"This victory is important for us, I'm sure it will ..."
    },
    {
      "id": "5f28eb85690b",
      "title": "Bianchin hypothesizes the path for Alphadjo Cissè next year",
      "url": "https://www.milannews.it/news/bianchin-ipotizza-il-percorso-per-alphadjo-cisse-il-prossimo-anno-605879",
      "source": "milannews.it",
      "date": "2026-01-31T12:36:32+00:00",
      "summary": "It is now done for the purchase of Alphadjo Cissè by Milan: the footballer born in 2006, born in Treviso, owned by Hellas Verona and who this season plays on loan at Catanzaro in Ser ..."
    },
    {
      "id": "546955d493fb",
      "title": "De Zerbi doesn't back down: \"I'll stay in Marseille for another five or six years\"",
      "url": "https://www.milannews.it/dall-estero/de-zerbi-non-arretra-resto-a-marsiglia-altri-cinque-o-sei-anni-605833",
      "source": "milannews.it",
      "date": "2026-01-31T12:24:00+00:00",
      "summary": "(ANSA) - MARSEILLE, JAN 30 - Marseille coach Roberto De Zerbi, whose future at OM seemed uncertain after their elimination from the Champions League, confirmed that he will be on the bench on Saturday against Paris FC, where he intends ..."
    },
    {
      "id": "0b0671ae0cfb",
      "title": "Watch: Mateta to AC Milan? Lorenzo and Stefano react to the latest news",
      "url": "https://sempremilan.com/mateta-ac-milan-lorenzo-stefano-react",
      "source": "sempremilan.com",
      "date": "2026-01-31T12:20:00+00:00",
      "summary": "Jean-Philippe Mateta appears to be Milan’s priority on the transfer market at the moment, which is something that Lorenzo and Stefano have reacted to.  In the last few days, Milan have accelerated their pursuit of Crystal Palace’s Mateta, keen on beating the competition rather than waiting until the"
    },
    {
      "id": "15ef18572079",
      "title": "AC Milan-Mateta agreement: salary figures revealed",
      "url": "https://www.milannews.it/calciomercato-milan/accordo-milan-mateta-svelate-le-cifre-dell-ingaggio-605872",
      "source": "milannews.it",
      "date": "2026-01-31T12:12:00+00:00",
      "summary": "During the usual appointment with the video update on his YouTube channel, Fabrizio Romano took stock of Milan's incoming transfer market, talking about both the Mateta issue and the central defender."
    },
    {
      "id": "da381766a41f",
      "title": "Elliot bids farewell to Milan. The QS: \"RedBird completes refinancing. Comvest enters and Maignan signs\"",
      "url": "https://www.milannews.it/rassegna-stampa/elliot-saluta-il-milan-il-qs-redbird-completa-il-rifinanziamento-entra-comvest-e-maignan-firma-605857",
      "source": "milannews.it",
      "date": "2026-01-31T12:00:24+00:00",
      "summary": "Yesterday an important page in Milan's corporate history was written."
    },
    {
      "id": "560608b23b35",
      "title": "Official: Dates and times confirmed for Pisa, Parma and Como clashes for Milan",
      "url": "https://sempremilan.com/official-dates-times-pisa-parma-como",
      "source": "sempremilan.com",
      "date": "2026-01-31T11:55:00+00:00",
      "summary": "Lega Serie A have officially confirmed the dates and times for matchdays 25 and 26, as well as the rescheduled game between AC Milan and Como (matchday 24).  The scheduling of games has come under scrutiny in recent weeks, with Milan playing two games in just 66 hours. Furthermore, the Rossoneri’s h"
    },
    {
      "id": "a64dab4587e3",
      "title": "Moretto: \"Mateta is not in Milan but waiting to understand whether to fly or not\"",
      "url": "https://www.milannews.it/news/moretto-mateta-non-e-a-milano-ma-in-attesa-di-capire-se-volare-o-meno-605887",
      "source": "milannews.it",
      "date": "2026-01-31T11:48:59+00:00",
      "summary": "AC Milan is pushing, and pushing a lot, on Jean-Philippe Mateta: the Rossoneri club is working to bring the French striker to Max Allegri's court already in this winter transfer market session, anticipating the agreement that ..."
    },
    {
      "id": "c3d5dbbd0987",
      "title": "Moretto: Price tag confirmed as Milan secure Verona youngster for the summer",
      "url": "https://sempremilan.com/moretto-price-tag-milan-verona-youngster",
      "source": "sempremilan.com",
      "date": "2026-01-31T11:30:00+00:00",
      "summary": "AC Milan have secured the services of Alphadjo Cissè, who will join the club in the summer, and the price tag of the operation has now been revealed. This morning, Gianluca Di Marzio stated that Milan had overtaken PSV Eindhoven in the race for the midfielder, reaching an agreement with Hellas Veron"
    },
    {
      "id": "a2efaa0729f1",
      "title": "Romano: Milan could sign centre-back as Allegri ‘made his voice heard’",
      "url": "https://sempremilan.com/romano-milan-centre-back-allegri-voice",
      "source": "sempremilan.com",
      "date": "2026-01-31T11:05:00+00:00",
      "summary": "Massimiliano Allegri has asked the AC Milan management to sign a centre-back and according to Fabrizio Romano, they could fulfil his wish.  It’s certainly heating up for Milan on the transfer market, in advanced negotiations with Crystal Palace over Jean-Philippe Mateta. However, the attack isn’t th"
    },
    {
      "id": "8c9bcfcbda69",
      "title": "Di Marzio: Furlani behind Milan’s accelerated pursuit of Mateta – the situation",
      "url": "https://sempremilan.com/di-marzio-furlani-milans-pursuit-mateta",
      "source": "sempremilan.com",
      "date": "2026-01-31T10:40:00+00:00",
      "summary": "Giorgio Furlani’s green light has been a key part of AC Milan’s accelerated pursuit of Jean-Philippe Mateta, who appears to be just one step away from leaving Crystal Palace.  Milan have been evaluating solutions for the No.9 role for quite some time now, above all as Santiago Gimenez and Christophe"
    },
    {
      "id": "c7c41919f97b",
      "title": "Sky Germany: Milan ‘pushing’ to sign Bayern Munich right-back for the Futuro",
      "url": "https://sempremilan.com/sky-milan-pushing-bayern-munich-futuro",
      "source": "sempremilan.com",
      "date": "2026-01-31T10:15:00+00:00",
      "summary": "AC Milan are reportedly ‘pushing’ to sign the Bayern Munich right-back Magnus Dalpiaz, who would become a part of the Futuro team.  In the last year or so, we have seen quite a few reinforcements for the Futuro side, with the Rossoneri looking to make the team even more competitive. Cheveyo Balentie"
    },
    {
      "id": "c9f49280eb8f",
      "title": "GdS: Maignan will sign Milan renewal this afternoon – final details sorted",
      "url": "https://sempremilan.com/gds-maignan-milan-renewal-this-afternoon",
      "source": "sempremilan.com",
      "date": "2026-01-31T09:50:00+00:00",
      "summary": "Mike Maignan will sign his new contract with AC Milan today, according to a report, and he will receive a significant pay rise for it.  After a long and tiring saga, with back and forths from both parties, Maignan is finally ready to put pen to paper. An agreement has been reached with Milan for […]"
    },
    {
      "id": "22f41b363db8",
      "title": "GdS: Two conditions must be met for Mateta to join Milan from Crystal Palace",
      "url": "https://sempremilan.com/gds-two-conditions-mateta-milan-crystal-palace",
      "source": "sempremilan.com",
      "date": "2026-01-31T09:25:00+00:00",
      "summary": "Jean-Philippe Mateta could be the big signing for AC Milan in this transfer window, but in order to secure him immediately, two conditions will have to be met.  Milan have been scratching their heads with regard to the No.9 position this season. As both Santiago Gimenez and Christopher Nkunku strugg"
    },
    {
      "id": "9346aac61f82",
      "title": "Two hurdles for Milan to overcome before landing Mateta deal with Crystal Palace",
      "url": "https://football-italia.net/two-hurdles-for-milan-to-overcome-for-mateta/",
      "source": "football-italia.net",
      "date": "2026-01-31T09:22:04+00:00",
      "summary": "Reports in Italy claim that Milan are closing in on a full agreement with Crystal..."
    },
    {
      "id": "01d50fe7a444",
      "title": "Di Marzio: Milan and Verona agree on summer move for youngster – full details",
      "url": "https://sempremilan.com/di-marzio-milan-verona-summer-move-youngster",
      "source": "sempremilan.com",
      "date": "2026-01-31T09:00:00+00:00",
      "summary": "AC Milan have ousted PSV Eindhoven in the race for Alphadjo Cissè, having reached a total agreement with Hellas Verona for a transfer.  Cissè is an attacking midfielder that Milan have been keeping tabs on for a very long time. In fact, the first rumours date back to February 2024, and the managemen"
    },
    {
      "id": "fa3dcf4ac29b",
      "title": "Today’s Papers: Milan all in for Mateta, Until the end for Juventus and Kolo Muani",
      "url": "https://football-italia.net/todays-papers-milan-all-in-for-mateta/",
      "source": "football-italia.net",
      "date": "2026-01-31T08:34:07+00:00",
      "summary": "La Gazzetta dello Sport Mateta: It’s a yes  The Frenchman wants Milan immediately Negotiations for..."
    },
    {
      "id": "5517bbe84b25",
      "title": "Gallery: ‘Milan all in for Mateta’, ‘Furlani attacks’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/gallery-milan-mateta-furlani-papers-italy",
      "source": "sempremilan.com",
      "date": "2026-01-31T08:30:00+00:00",
      "summary": "Jean-Philippe Mateta appears to be getting closer to AC Milan, with negotiations now at an advanced stage, and this was naturally the main focus of the newspapers this morning.  What initially seemed like a certain summer reinforcement has turned into a concrete January pursuit. Indeed, Milan are ho"
    },
    {
      "id": "1e928943ef43",
      "title": "“A long-term commitment to the Club” – Cardinale’s first comments after RedBird refinancing",
      "url": "https://sempremilan.com/cardinale-first-comments-redbird-refinancing",
      "source": "sempremilan.com",
      "date": "2026-01-30T20:30:00+00:00",
      "summary": "This afternoon, it was confirmed that RedBird had refinanced the vendor loan used to initially purchase AC Milan, thus seeing Elliott exit the club.  It has been an interesting few weeks where RedBird have been concerned. In December, it was reported that they would not be supporting any moves made "
    },
    {
      "id": "c54f160468a5",
      "title": "Romano: Mateta informs Crystal Palace of desire to join Milan regardless of timing",
      "url": "https://sempremilan.com/mateta-informs-palace-desire-join-milan",
      "source": "sempremilan.com",
      "date": "2026-01-30T19:45:04+00:00",
      "summary": "This evening, AC Milan have been given a huge boost in their chances of signing Jean-Philippe Mateta, with him requesting the move.  The Mateta saga has evolved quickly. As of this morning, Milan had a chance to sign the Frenchman, with Massimiliano Allegri pushing for the striker. In the hours that"
    },
    {
      "id": "7a0ae3ffde1c",
      "title": "Official: AC Milan announce signing of El Hadj Malick Cissè for Futuro squad – photo",
      "url": "https://sempremilan.com/ac-milan-announce-cisse-signing-futuro",
      "source": "sempremilan.com",
      "date": "2026-01-30T19:27:24+00:00",
      "summary": "This evening, AC Milan have confirmed the signing of El Hadj Malick Cissè, who will join Massimo Oddo’s Futuro side.  Things have moved quickly where Cissè has been involved, with the links first starting to appear at the start of the week. Appreciated by Barcelona and RB Leipzig, Milan may have pul"
    },
    {
      "id": "94d95ed43cb1",
      "title": "MN: Mateta may still arrive as Nkunku says no to exit – the situation",
      "url": "https://sempremilan.com/mateta-may-still-arrive-nkunku-says-no",
      "source": "sempremilan.com",
      "date": "2026-01-30T19:00:00+00:00",
      "summary": "It seemed AC Milan would need a striker to leave this month to allow someone new to arrive. However, this may not be the case.  Throughout the season so far, Milan have been tempted by the idea of signing a new striker. To do so, it seemed they would have had to part with one […]\nThe post MN: Mateta"
    },
    {
      "id": "0e648c8d7668",
      "title": "Glasner confirms Crystal Palace drop Mateta for Forest clash, fuelling Milan speculation",
      "url": "https://football-italia.net/mateta-dropped-not-forest-milan-speculation/",
      "source": "football-italia.net",
      "date": "2026-01-30T16:21:23+00:00",
      "summary": "Crystal Palace coach Oliver Glasner confirms Milan target Jean-Philippe Mateta won’t be part of the..."
    },
    {
      "id": "210e88203f90",
      "title": "Maignan set to sign new Milan contract, Roma ask for Nkunku",
      "url": "https://football-italia.net/maignan-signs-new-milan-contract-roma-nkunku/",
      "source": "football-italia.net",
      "date": "2026-01-30T14:03:32+00:00",
      "summary": "Sky Sport Italia reports that Mike Maignan will put pen to paper on a new..."
    },
    {
      "id": "3e92c9cf6b6c",
      "title": "January transfer liveblog: Milan close to Mateta, Lookman twist",
      "url": "https://football-italia.net/january-transfer-liveblog-rumours-done-deals-2/",
      "source": "football-italia.net",
      "date": "2026-01-30T10:40:41+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "5d048c937f37",
      "title": "Milan agreement for Mateta who prefers Rossoneri over Nottingham Forest – report",
      "url": "https://football-italia.net/milan-agreement-mateta-nottingham-forest/",
      "source": "football-italia.net",
      "date": "2026-01-30T09:47:40+00:00",
      "summary": "La Gazzetta dello Sport claims Milan have agreed a deal to bring in Jean-Philippe Mateta..."
    },
    {
      "id": "b9cb4f9e51f5",
      "title": "Report Milan fight for Mateta with Nottingham Forest and Juventus",
      "url": "https://football-italia.net/report-milan-mateta-nottingham-forest-juventus/",
      "source": "football-italia.net",
      "date": "2026-01-29T17:31:42+00:00",
      "summary": "Milan are reportedly trying to hijack Nottingham Forest’s bid for Crystal Palace striker Jean-Philippe Mateta,..."
    },
    {
      "id": "69318b559f5a",
      "title": "Milan look to Tottenham, Man City and Lazio for defensive reinforcement",
      "url": "https://football-italia.net/milan-tottenham-man-city-defence-reinforcement/",
      "source": "football-italia.net",
      "date": "2026-01-29T14:07:00+00:00",
      "summary": "According to reports in Italy, Milan are interested in Manchester City defender Nathan Aké, Tottenham’s..."
    },
    {
      "id": "059070d81ac0",
      "title": "Free agent Goretzka targeted with determination by Milan",
      "url": "https://football-italia.net/free-agent-goretzka-targeted-by-ac-milan/",
      "source": "football-italia.net",
      "date": "2026-01-27T20:11:15+00:00",
      "summary": "Milan are pushing hard to agree personal terms with Bayern Munich midfielder Leon Goretzka, who..."
    },
    {
      "id": "fa309b31e0a1",
      "title": "Capello identifies Milan’s biggest ‘flaw’ and explains Inter advantage in Serie A race",
      "url": "https://football-italia.net/capello-identifies-milans-biggest-flaw-and-explains-inter-advantage-in-serie-a-race/",
      "source": "football-italia.net",
      "date": "2026-01-27T17:47:32+00:00",
      "summary": "Fabio Capello has given an in-depth review of the two teams currently fighting for the..."
    },
    {
      "id": "325c906634a1",
      "title": "Milan expected to complete €20m deal for Lazio defender Gila in the summer",
      "url": "https://football-italia.net/milan-expected-20m-deal-for-lazio-gila/",
      "source": "football-italia.net",
      "date": "2026-01-27T13:23:36+00:00",
      "summary": "Milan are already laying the groundwork for their summer rebuild, and a new centre-back is..."
    },
    {
      "id": "5b2cb74dfdb9",
      "title": "Today’s papers – Inter push for Perisic; Napoli in crisis",
      "url": "https://football-italia.net/todays-papers-inter-push-for-perisic-napoli-in-crisis/",
      "source": "football-italia.net",
      "date": "2026-01-27T09:45:13+00:00",
      "summary": "La Gazzetta dello Sport “Inter don’t stop” Inter’s momentum continues both in Serie A and..."
    },
    {
      "id": "46dfb510bd30",
      "title": "Today’s Papers – Juve fly, Inter run away, Milan stopped",
      "url": "https://football-italia.net/todays-papers-juve-fly-milan-stop-inter-run/",
      "source": "football-italia.net",
      "date": "2026-01-26T08:51:22+00:00",
      "summary": "La Gazzetta dello Sport Juve fly and Inter run away The Old Lady dominates, Napoli..."
    },
    {
      "id": "da4eee084e3c",
      "title": "Allegri: ‘Positive Milan result, it was going so well against Roma’",
      "url": "https://football-italia.net/allegri-positive-milan-result-going-well-roma/",
      "source": "football-italia.net",
      "date": "2026-01-25T22:30:10+00:00",
      "summary": "Max Allegri insists Milan were on track for victory at the Stadio Olimpico until the..."
    },
    {
      "id": "91bacc5e5156",
      "title": "Gasperini proud of Roma draw: ‘Milan always dangerous, even when seemingly dominated’",
      "url": "https://football-italia.net/gasperini-proud-roma-milan-always-dangerous/",
      "source": "football-italia.net",
      "date": "2026-01-25T22:16:46+00:00",
      "summary": "Gian Piero Gasperini insists Roma ‘deserve credit’ for their 1-1 draw with second-placed Milan. ‘They..."
    },
    {
      "id": "8f2042147188",
      "title": "Milan stars Maignan and Modric frustrated at Roma penalty in 1-1 draw",
      "url": "https://football-italia.net/milan-maignan-modric-frustrated-roma-penalty/",
      "source": "football-italia.net",
      "date": "2026-01-25T22:02:38+00:00",
      "summary": "Milan stars Mike Maignan and Luka Modric were very critical of the Roma penalty in..."
    },
    {
      "id": "60c57a8359c6",
      "title": "Serie A | Roma 1-1 Milan – Player Ratings as Maignan digs deep to deny Giallorossi victory",
      "url": "https://football-italia.net/serie-a-roma-1-1-milan-maignan-draw/",
      "source": "football-italia.net",
      "date": "2026-01-25T21:41:41+00:00",
      "summary": "Milan battled hard against a strong Roma side to Serie A | Roma 1-1 Milan:..."
    },
    {
      "id": "0c7dae17b91b",
      "title": "Serie A | Roma 1-1 Milan: Stoic Pellegrini freezes De Winter celebration",
      "url": "https://football-italia.net/serie-a-roma-1-1-milan-pellegrini-de-winter/",
      "source": "football-italia.net",
      "date": "2026-01-25T21:40:13+00:00",
      "summary": "While Milan had taken the lead against the run of play with Koni De Winter,..."
    },
    {
      "id": "647772f783f3",
      "title": "Watch: De Winter heads Milan in front at Roma",
      "url": "https://football-italia.net/watch-de-winter-heads-milan-in-front-at-roma/",
      "source": "football-italia.net",
      "date": "2026-01-25T21:24:21+00:00",
      "summary": "Koni De Winter scored his first goal for Milan on Sunday evening, to give his..."
    }
  ]
}