{
  "lastUpdated": "2026-02-19T18:48:54.684334+00:00",
  "articles": [
    {
      "id": "1a70dcdda3ee",
      "title": "Lazio's protest continues: no organized support even in the Italian Cup",
      "url": "https://www.milannews.it/news/continua-la-protesta-della-lazio-niente-tifo-organizzato-neanche-in-coppa-italia-607989",
      "source": "milannews.it",
      "date": "2026-02-19T18:40:06+00:00",
      "summary": "The Curva biancoceleste's protest against the management of the Lazio president, Claudio Lotito, will also continue in the first leg of the Coppa Italia semi-final against Atalanta."
    },
    {
      "id": "a2c302f03c7b",
      "title": "TMW: Milan beaten by Dortmund to Brazilian starlet – the latest",
      "url": "https://sempremilan.com/milan-beaten-by-dortmund-brazilian-starlet",
      "source": "sempremilan.com",
      "date": "2026-02-19T18:30:00+00:00",
      "summary": "AC Milan made an approach for young full-back Kaua Prates in the winter mercato, but they have been beaten to his signing by Borussia Dortmund.  In the past month, Milan took a look at a number of impressive young talents, with the intention of strengthening the Futuro set-up. Indeed, it has since b"
    },
    {
      "id": "57af0d98102d",
      "title": "Discontent with the refereeing incidents at Milan-Como is evident from the Rossoneri club",
      "url": "https://www.milannews.it/primo-piano/dal-club-rossonero-trapela-malcontento-per-gli-episodi-arbitrali-di-milan-como-608027",
      "source": "milannews.it",
      "date": "2026-02-19T18:25:46+00:00",
      "summary": "The day after the match against Como, the atmosphere at Milan is anything but relaxed."
    },
    {
      "id": "a8531e76fcc7",
      "title": "Four games against Fabregas, four times behind, but never losing one",
      "url": "https://www.milannews.it/news/quattro-partite-contro-fabregas-quattro-volte-in-svantaggio-ma-senza-mai-perderne-una-607986",
      "source": "milannews.it",
      "date": "2026-02-19T18:22:52+00:00",
      "summary": "Four matches against Como, four times behind, four matches without defeat: Milan's score against Fabregas remains immaculate even after yesterday."
    },
    {
      "id": "cc6f33d2c83a",
      "title": "Should Saelemaekers have been expelled? Marelli: \"From my point of view, it's okay not to issue a second yellow card because we are very much at the limit\"",
      "url": "https://www.milannews.it/news/saelemaekers-andava-espulso-marelli-dal-mio-punto-di-vista-ci-sta-non-comminare-il-secondo-cartellino-giallo-perche-siamo-molto-al-limite-608023",
      "source": "milannews.it",
      "date": "2026-02-19T18:10:35+00:00",
      "summary": "There were huge protests from Como for an alleged yellow card foul by Saelemaekers which was not sanctioned by the referee: it would have been the second yellow card."
    },
    {
      "id": "2e2b8b55e6a6",
      "title": "Why Fabregas cannot be punished with video evidence after Milan 1-1 Como",
      "url": "https://football-italia.net/why-fabregas-cannot-be-punished-video-evidence/",
      "source": "football-italia.net",
      "date": "2026-02-19T18:02:36+00:00",
      "summary": "Many were calling for video evidence to be used in punishing Como coach Cesc Fabregas..."
    },
    {
      "id": "9097371ac995",
      "title": "World Cup at home: the Rossoneri (and US captain) Pulisic can't wait",
      "url": "https://www.milannews.it/news/mondiale-in-casa-il-rossonero-e-capitano-usa-pulisic-non-vede-l-ora-607872",
      "source": "milannews.it",
      "date": "2026-02-19T18:00:00+00:00",
      "summary": "Christian Pulisic, American striker for Milan, is enjoying the Winter Olympic Games firsthand, in the city where he has lived for two and a half years now."
    },
    {
      "id": "67ea6b5c6432",
      "title": "TMW: Tom Brady, Olympic stars and Gattuso – San Siro hosts several famous faces",
      "url": "https://sempremilan.com/tom-brady-olympic-stars-gattuso-san-siro",
      "source": "sempremilan.com",
      "date": "2026-02-19T18:00:00+00:00",
      "summary": "It is nothing new for San Siro to host celebrities, and for the game between AC Milan and Como, there were several notable faces in attendance.  For many, San Siro is a box office stadium to attend once in their life, and with the recent news about its closure, a new stadium is to be […]\nThe post TM"
    },
    {
      "id": "142cd252f594",
      "title": "Order: \"We are far from the Leao that Milan needs\"",
      "url": "https://www.milannews.it/news/ordine-siamo-lontani-dal-leao-di-cui-ha-bisogno-il-milan-607939",
      "source": "milannews.it",
      "date": "2026-02-19T17:50:00+00:00",
      "summary": "Franco Ordine, in his usual editorial in the Corriere dello Sport, spoke thus of Rafael Leao after his goal against Como: \"It's true: that goal from a throw with the compass by Jashari (a surprise, the young man placed by Max alongside ..."
    },
    {
      "id": "3942ca398640",
      "title": "Italy women's squad called up for the matches against Sweden and Denmark: two Rossoneri",
      "url": "https://www.milannews.it/news/italia-femminile-le-convocate-per-le-sfide-con-svezia-e-danimarca-due-rossonere-607877",
      "source": "milannews.it",
      "date": "2026-02-19T17:40:08+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 18 - The women's national team's qualification process for the tenth edition of the World Cup, which will be played in Brazil from 24 June to 25 July 2027, has begun."
    },
    {
      "id": "10eaffa588de",
      "title": "Ravezzani against Allegri's expulsion: \"Killing him out just because he says shut up seems crazy to me. Bad luck to the referees\"",
      "url": "https://www.milannews.it/news/ravezzani-contro-l-espulsione-di-allegri-cacciarlo-solo-perche-dice-stai-zitto-mi-pare-folle-male-gli-arbitri-608024",
      "source": "milannews.it",
      "date": "2026-02-19T17:30:30+00:00",
      "summary": "Speaking on his social channels, the director of TeleLombardia Fabio Ravezzani had his say on the analysis of former referee Luca Marelli regarding the expulsion of Massimiliano Allegri in Milan-Como: “I don't agree."
    },
    {
      "id": "3589546d74c3",
      "title": "CorSport: Milan in the hands of the best – Allegri’s experience crucial to this moment",
      "url": "https://sempremilan.com/milan-in-hands-of-the-best-allegri-experience",
      "source": "sempremilan.com",
      "date": "2026-02-19T17:30:00+00:00",
      "summary": "Whilst it may not feel positive for AC Milan currently, they can have faith that Massimiliano Allegri will guide them through this moment successfully. At this moment, it is difficult to see Milan having an exciting end to the season. They are seven points clear in the Champions League places, but t"
    },
    {
      "id": "6b934019089c",
      "title": "Scaroni: \"New trophies? Of course we want to update the noticeboard. I like the Milan Foundation for intervening in many fields of social life\"",
      "url": "https://www.milannews.it/news/scaroni-nuovi-trofei-certo-che-vogliamo-aggiornare-la-bacheca-mi-piace-fondazione-milan-per-intervenire-su-tanti-campi-della-vita-sociale-608026",
      "source": "milannews.it",
      "date": "2026-02-19T17:29:34+00:00",
      "summary": "On the occasion of the celebration of 23 years of the Milan Foundation (CLICK HERE), AC Milan president Paolo Scaroni spoke to the media present at the event."
    },
    {
      "id": "db1a4a117f07",
      "title": "Fondazione Milan celebrates 23 years of social impact and launches an innovative solution for accessibility",
      "url": "https://www.milannews.it/news/fondazione-milan-celebra-23-anni-di-impatto-sociale-e-lancia-una-soluzione-innovativa-per-l-accessibilita-608025",
      "source": "milannews.it",
      "date": "2026-02-19T17:28:13+00:00",
      "summary": "Fondazione Milan celebrates its 23rd Anniversary in the presence of the Minister for Disabilities Alessandra Locatelli and the President of AC Milan and Fondazione Milan Paolo Scaroni and launches a new accessibility project for people ..."
    },
    {
      "id": "7030393c31a4",
      "title": "8 goals in 18 appearances for Leao. Already equaled the 8, but in 34 games, from last season",
      "url": "https://www.milannews.it/news/8-gol-in-18-presenze-per-leao-gia-eguagliati-gli-8-ma-in-34-partite-della-scorsa-stagione-607985",
      "source": "milannews.it",
      "date": "2026-02-19T17:20:33+00:00",
      "summary": "Rafael Leão (eight goals in 18 appearances in this championship) has equaled the goals scored in the entire last Serie A (eight but in 34 games). Opta reports it."
    },
    {
      "id": "8d5f7d5f8514",
      "title": "Marelli: \"Fabregas-Saelemaekers, no big deal. Allegri expulsion, nothing else could have been done\"",
      "url": "https://www.milannews.it/news/marelli-fabregas-saelemaekers-niente-di-che-espulsione-allegri-non-si-poteva-far-altro-608022",
      "source": "milannews.it",
      "date": "2026-02-19T17:10:09+00:00",
      "summary": "Luca Marelli, referee commentator for DAZN, analyzed the situation in Milan-Como last night which then led to Max Allegri's expulsion:\n\n“Fabregas touched Saelemaekers, gave him a push and then he ..."
    },
    {
      "id": "42d39903da04",
      "title": "Jashari is there and it shows: increasingly growing, Allegri pampers himself with the class of 2002",
      "url": "https://www.milannews.it/primo-piano/jashari-c-e-e-si-vede-sempre-piu-in-crescita-allegri-si-coccola-il-classe-2002-608004",
      "source": "milannews.it",
      "date": "2026-02-19T17:00:00+00:00",
      "summary": "A draw that smacks of partial defeat. Milan did not go beyond the 1-1 draw at home against Como and slowed down in the race for first place."
    },
    {
      "id": "d4a68d83fb78",
      "title": "First meeting to press room row: How Allegri-Fabregas tension arose",
      "url": "https://sempremilan.com/how-allegri-fabregas-tension-arose",
      "source": "sempremilan.com",
      "date": "2026-02-19T17:00:00+00:00",
      "summary": "Seeing a rivalry develop in real time is something strange, and with AC Milan manager Massimiliano Allegri and Como’s coach Cesc Fabregas, it is happening.  After the latest game, it cannot be denied that Fabregas and Allegri are rivals. The dislike is clear, and it has largely been one-sided, if no"
    },
    {
      "id": "42e80233995d",
      "title": "Pellegatti: \"You can say what you want about Allegri's game, but without Rabiot, Pulisic, Saelemaekers and without the best Leao it's hard to beat any opponent\"",
      "url": "https://www.milannews.it/news/pellegatti-si-puo-dire-quello-che-si-vuole-sul-gioco-di-allegri-ma-senza-rabiot-pulisic-saelemaekers-e-senza-il-miglior-leao-e-dura-battere-qualsiasi-607979",
      "source": "milannews.it",
      "date": "2026-02-19T16:50:15+00:00",
      "summary": "Carlo Pellegatti, journalist, expressed himself as follows on his Instagram channel after Milan-Como: \"You can say what you want about Allegri's game, about the difficulties in shooting on goal, about the game which has regressed compared to B..."
    },
    {
      "id": "7df8074db9d7",
      "title": "Does Tresoldi want Milan? The former Bruges player is not convinced: he needs more experience to gain",
      "url": "https://www.milannews.it/calciomercato-milan/tresoldi-vuole-il-milan-l-ex-calciatore-del-bruges-non-convinto-avrebbe-bisogno-di-altra-esperienza-da-fare-607865",
      "source": "milannews.it",
      "date": "2026-02-19T16:40:55+00:00",
      "summary": "Gert Verheyen, former Bruges player, released these words to Milannews."
    },
    {
      "id": "b464001b7503",
      "title": "Post Milan-Como, situations and controversies that are annoying. Do you dream of a championship? Only the concreteness of the three points counts",
      "url": "https://www.milannews.it/podcast-mn/post-milan-como-situazioni-e-polemiche-che-danno-fastidio-sogno-scudetto-conta-solo-la-concretezza-dei-tre-punti-608021",
      "source": "milannews.it",
      "date": "2026-02-19T16:30:06+00:00",
      "summary": "Milan-Como 1-1 leaves several themes: Maignan is human, Leao is decisive even on half serve, the team never gives up and the championship, despite the minus 7 from Inter, is not yet closed."
    },
    {
      "id": "d552387df9a2",
      "title": "GdS: ‘A sigh of relief’ – Pavlovic will not face long absence after avoiding fracture",
      "url": "https://sempremilan.com/pavlovic-not-face-long-absence-avoid-fracture",
      "source": "sempremilan.com",
      "date": "2026-02-19T16:30:00+00:00",
      "summary": "AC Milan sighed last night when Strahinja Pavlovic was forced to be subbed off at half-time, and it seemed serious. However, tests, thankfully, show otherwise.  In recent years, Milan have been seriously unlucky with injuries, and this season has been no different. Perhaps it can be argued that they"
    },
    {
      "id": "7b2c3901ca59",
      "title": "First assist for Jashari with Milan. He hasn't been on the scoresheet since March 2025",
      "url": "https://www.milannews.it/news/primo-assist-per-jashari-con-il-milan-non-andava-a-referto-dal-marzo-2025-607984",
      "source": "milannews.it",
      "date": "2026-02-19T16:22:38+00:00",
      "summary": "Ardon Jashari provided his first assist in Serie A, and overall first in the league since March 2025 for Club Brugge. Opta reports it."
    },
    {
      "id": "301aae732ec3",
      "title": "Rampulla: \"The simulation has always been there, it must be sanctioned with a one-month disqualification\"",
      "url": "https://www.milannews.it/news/rampulla-la-simulazione-c-e-sempre-stata-deve-essere-sanzionata-con-un-mese-di-squalifica-607788",
      "source": "milannews.it",
      "date": "2026-02-19T16:11:00+00:00",
      "summary": "Michelangelo Rampulla, on TMW Radio during Maracanà, spoke thus of the Bastoni-Kalulu chaos: \"The simulation has always been there."
    },
    {
      "id": "93e0156916c4",
      "title": "Juventus, the results of Bremer's tests after the injury suffered against Galatasaray",
      "url": "https://www.milannews.it/news/juventus-l-esito-degli-esami-di-bremer-dopo-l-infortunio-subito-contro-il-galatasaray-607966",
      "source": "milannews.it",
      "date": "2026-02-19T16:00:03+00:00",
      "summary": "(ANSA) - TURIN, FEBRUARY 18 - Juventus and Gleison Bremer can breathe a sigh of relief, the results of the tests he underwent at J Medical came back negative."
    },
    {
      "id": "aa3ccea1bb99",
      "title": "Watch: Leao’s lob sees Milan extend unbeaten run with draw vs. Como – the highlights",
      "url": "https://sempremilan.com/highlights-from-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T16:00:00+00:00",
      "summary": "AC Milan managed to salvage a draw yesterday against Como, after the visitors took the lead in the first half. Offensively speaking, it was one of the worst Milan performances of the season at San Siro, as they managed less than 1 xG. Nevertheless, they still got a result, being effective, even if t"
    },
    {
      "id": "2d9c334cd288",
      "title": "Guidi: \"Leao asked the fans to support Milan unconditionally. As if to say: it's not over here\"",
      "url": "https://www.milannews.it/news/guidi-leao-ha-chiesto-ai-tifosi-di-appoggiare-il-milan-in-modo-incondizionato-come-a-dire-non-e-finita-qui-607976",
      "source": "milannews.it",
      "date": "2026-02-19T15:50:23+00:00",
      "summary": "Marco Guidi, journalist, expressed himself in La Gazzetta dello Sport about Rafa Leao: \"\"It was a match to win\", admits Rafa. He then asks the fans to support Milan unconditionally."
    },
    {
      "id": "88f321aefd9b",
      "title": "Milan team news: Boost as Pavlovic tests reveal no fracture",
      "url": "https://football-italia.net/milan-team-news-boost-as-pavlovic-tests/",
      "source": "football-italia.net",
      "date": "2026-02-19T15:39:58+00:00",
      "summary": "Milan will breathe a sigh of relief this morning, after medical examinations revealed that Strahinja..."
    },
    {
      "id": "27873a4bfc49",
      "title": "‘Its not about sprints, it’s a marathon’ – Milan players react after disappointing Como draw",
      "url": "https://sempremilan.com/players-react-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T15:30:00+00:00",
      "summary": "AC Milan were forced to settle for a draw against Como on Wednesday night, and some of the team have posted messages about the result.  It is a game where Milan can look back with some allowance. After all, they keep their unbeaten run whilst being far from their best, while their Head-To-Head recor"
    },
    {
      "id": "7cb100489dc6",
      "title": "When coaches get involved: Milan rightly furious after Chivu and Fabregas incidents",
      "url": "https://sempremilan.com/milan-rightly-furious-chivu-fabregas",
      "source": "sempremilan.com",
      "date": "2026-02-19T15:00:00+00:00",
      "summary": "This season, AC Milan have been subjected to a few occasions where managers have been wrongly involved in games, yet nothing has ever been done with it.  Last night’s involvement from Cesc Fabregas brings up an uneasy question again, why are Milan the victims of coaches getting involved in games. If"
    },
    {
      "id": "61851f5fc6dd",
      "title": "Hauge refers to Inter clash as ‘the derby’ and admits ‘special meaning’: “Always nice”",
      "url": "https://sempremilan.com/hauge-refers-to-inter-clash-as-the-derby-special-meaning",
      "source": "sempremilan.com",
      "date": "2026-02-19T14:30:00+00:00",
      "summary": "Jens Petter Hauge never really hit the levels that AC Milan hoped for, but the Norwegian winger still keeps the club close to his heart. After leaving Milan, the young winger has gone on to have a pretty decent interesting career. Of course, the initial hopes were that he would be a key figure for ["
    },
    {
      "id": "acb2506abbea",
      "title": "Jashari’s arrival and xG lows: All the key stats from Milan 1-1 Como",
      "url": "https://sempremilan.com/all-the-key-stats-milan-1-1-como",
      "source": "sempremilan.com",
      "date": "2026-02-19T14:00:00+00:00",
      "summary": "AC Milan were held to a 1-1 draw by Como at San Siro on Wednesday night, here are some of the key stats from the game.  It was certainly not a game to shout about from a Milan perspective. In fact, it was a game to forget. From poor officiating to the goal conceded, the […]\nThe post Jashari’s arriva"
    },
    {
      "id": "99590206d996",
      "title": "Longoni: ‘Milan barely manage to win’ – Scudetto dream is over for the Rossoneri this season",
      "url": "https://sempremilan.com/barely-manage-win-scudetto-dream-over-for-milan",
      "source": "sempremilan.com",
      "date": "2026-02-19T13:35:00+00:00",
      "summary": "This season, AC Milan have been in the Scudetto fight, but they have often been their own downfall, rather than anyone else damaging them.  It has been a while since Milan last lost, yet, despite that feeling, they are not sitting at the top of the table, as many would expect. Indeed, despite losing"
    },
    {
      "id": "b328421ec01d",
      "title": "Sporting Judge: Fabregas left unpunished for now as Allegri’s ban is confirmed",
      "url": "https://sempremilan.com/fabregas-unpunished-allegri-ban-confirmed",
      "source": "sempremilan.com",
      "date": "2026-02-19T13:10:00+00:00",
      "summary": "This morning, the Sporting Judge has released its standard statement about the action from the previous day, and AC Milan may be a little shocked. Given it was the only game left of the matchday, the Sporting Judge has released a specific statement for the game between Milan and Como, detailing the "
    },
    {
      "id": "1cd8c2d9d292",
      "title": "‘You never know’ – Allegri references the Scudetto whilst admitting Champions League priority remains",
      "url": "https://sempremilan.com/allegri-references-scudetto-champions-league-focus",
      "source": "sempremilan.com",
      "date": "2026-02-19T12:45:00+00:00",
      "summary": "Massimiliano Allegri has focused on the Champions League all season, but it seems that he is not shutting down the hope of AC Milan winning the title.  Throughout the season so far, Milan have been involved in a title conversation. They have certainly been in better positions, and they have not real"
    },
    {
      "id": "626b83eb2b83",
      "title": "GdS: Milan’s road to the derby and hopes regarding Inter’s fixture congestion",
      "url": "https://sempremilan.com/milan-road-to-derby-inter-fixture-congestion",
      "source": "sempremilan.com",
      "date": "2026-02-19T12:20:00+00:00",
      "summary": "AC Milan, despite dropping points at San Siro, will still have a slight hope of the Scudetto, despite the seven-point gap being solidified.  The draw against Como hurts. Whilst the Scudetto has never been the end goal for this season, it has been there, and Milan have probably allowed themselves to "
    },
    {
      "id": "d1035a3b77cf",
      "title": "Video: Fabregas’ shirt tug and touchline confrontation with Allegri",
      "url": "https://football-italia.net/fabregas-shirt-tug-touchline-clash-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-19T12:02:33+00:00",
      "summary": "Watch how Cesc Fabregas pulled the shirt of Alexis Saelemaekers and how Milan coach Massimiliano..."
    },
    {
      "id": "6652087a182f",
      "title": "MN: Pavlovic lucky to avoid fibula fracture but sustains large hematoma – the details",
      "url": "https://sempremilan.com/pavlovic-undergoing-tests-forced-exit",
      "source": "sempremilan.com",
      "date": "2026-02-19T11:50:00+00:00",
      "summary": "Strahinja Pavlovic has been key for AC Milan this season, and he will now be absent after being forced to leave the pitch after a rough tackle. There have been a number of improved players this season for Milan. Indeed, since Massimiliano Allegri’s arrival, a case can be made for several of the Ross"
    },
    {
      "id": "dd9b7c273588",
      "title": "Jashari feels Milan did better against Como in draw than reverse fixture: “We were dangerous”",
      "url": "https://sempremilan.com/jashari-feels-milan-did-better-como-draw-reverse",
      "source": "sempremilan.com",
      "date": "2026-02-19T11:30:00+00:00",
      "summary": "Ardon Jashari got a chance to play in a more advanced role on Wednesday night, and he was largely impressive for AC Milan. When Jashari signed, it seemed he would fluctuate across the midfield positions. Instead, he has regularly stepped in for Luka Modric, and whilst he has done solidly, he should "
    },
    {
      "id": "8029d346e637",
      "title": "‘Something I’m not proud of’ – Fabregas apologises for ‘unsportsmanlike’ Saelemaekers grab",
      "url": "https://sempremilan.com/im-not-proud-fabregas-apologises-saelemaekers-grab",
      "source": "sempremilan.com",
      "date": "2026-02-19T11:05:00+00:00",
      "summary": "Cesc Fabregas created one of the big talking points for this game, and AC Milan will rightly be annoyed by the decision to send Massimiliano Allegri off. When looking at the game on paper, Allegri being sent off would make most think that the Milan manager had done something, and whilst this would b"
    },
    {
      "id": "5332dfeea45e",
      "title": "Maignan mistake costly as Leao saves the day: Player ratings from Milan-Como from Italian papers",
      "url": "https://sempremilan.com/player-ratings-milan-como-1-1",
      "source": "sempremilan.com",
      "date": "2026-02-19T10:40:00+00:00",
      "summary": "AC Milan were left to deal with another frustrating game when they faced Como on Wednesday night, and they will now face the consequences moving forward. In a game where Milan could’ve really cemented their position as a Scudetto challenger, they were unable to get three points. Both keepers were at"
    },
    {
      "id": "fb0503218fca",
      "title": "Allegri and Fabregas have expletive argument outside conference room – what happened",
      "url": "https://sempremilan.com/allegri-fabregas-expletive-argument-outside-conference-room",
      "source": "sempremilan.com",
      "date": "2026-02-19T10:15:00+00:00",
      "summary": "After the red card incident for Massimiliano Allegri, tensions were high after AC Milan drew against Como and they boiled over behind closed doors. The relationship between Allegri and Cesc Fabregas has not really been there, ever. Despite the pair seemingly sharing niceties before the first game, t"
    },
    {
      "id": "c7bf1ab24225",
      "title": "Watch: Fabregas holds Saelemaekers back to provoke furious reaction and Allegri red card",
      "url": "https://sempremilan.com/fabregas-holds-saelemaekers-back-allegri-red",
      "source": "sempremilan.com",
      "date": "2026-02-19T09:50:00+00:00",
      "summary": "Massimiliano Allegri was given a red card last night, but it should’ve potentially been the other way around and AC Milan can, and will, feel hard done by.  In split seconds, brief moments can change games and Milan may have witnessed that last night, as Allegri was given a red card on the sidelines"
    },
    {
      "id": "8e22ac8839a0",
      "title": "What Allegri told Fabregas in heated post-match clash: ‘You are a kid’",
      "url": "https://football-italia.net/what-allegri-told-fabregas-kid-milan-como/",
      "source": "football-italia.net",
      "date": "2026-02-19T09:09:48+00:00",
      "summary": "More details emerge about the confrontation between Milan coach Massimiliano Allegri and Como’s Cesc Fabregas..."
    },
    {
      "id": "d3f0ece0dd15",
      "title": "Today’s Papers – Bodo shaming, Italy cry, Leao saves Milan",
      "url": "https://football-italia.net/today-papers-bodo-shaming-italy-cry-leao-milan/",
      "source": "football-italia.net",
      "date": "2026-02-19T08:42:54+00:00",
      "summary": "La Gazzetta dello Sport Inter, three slaps But they are still +7 in Serie A...."
    },
    {
      "id": "f24c9ac03bd7",
      "title": "Allegri and Fabregas bad blood after Como coach ‘unsporting behaviour’",
      "url": "https://football-italia.net/allegri-fabregas-bad-blood-como-unsporting/",
      "source": "football-italia.net",
      "date": "2026-02-18T23:07:22+00:00",
      "summary": "There is bad blood between Max Allegri and Cesc Fabregas, as they had another row..."
    },
    {
      "id": "60f4f709567f",
      "title": "Leao and Jashari believe Milan ‘played better’ than in victory over Como",
      "url": "https://football-italia.net/leao-jashari-believe-milan-played-better-como/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:53:55+00:00",
      "summary": "Rafael Leao and Ardon Jashari argue Milan ‘played better’ in their 1-1 draw than they..."
    },
    {
      "id": "0886a97f78fb",
      "title": "Allegri: ‘A valuable Milan point, Fabregas fouled Saelemaekers’",
      "url": "https://football-italia.net/allegri-valuable-milan-point-fabregas-fouled/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:34:39+00:00",
      "summary": "Max Allegri insists Milan must see the 1-1 draw with Como as ‘a valuable point’..."
    },
    {
      "id": "72872cf860f0",
      "title": "Fabregas: ‘Como proud of 1-1 Milan draw, apology for Allegri’ row",
      "url": "https://football-italia.net/fabregas-como-proud-of-1-1-milan-draw-apology/",
      "source": "football-italia.net",
      "date": "2026-02-18T22:19:36+00:00",
      "summary": "Cesc Fabregas apologised for his touchline row with Max Allegri, but was ‘very proud’ of..."
    },
    {
      "id": "d7ed67655616",
      "title": "Serie A | Milan 1-1 Como: Leao magic rescues Maignan howler",
      "url": "https://football-italia.net/serie-a-milan-1-1-como-leao-magic-save-maignan/",
      "source": "football-italia.net",
      "date": "2026-02-18T21:46:39+00:00",
      "summary": "Rafael Leao’s remarkable lob cancelled out a Mike Maignan howler on Nico Paz, as Milan..."
    },
    {
      "id": "f3ddcbad229c",
      "title": "Serie A and UCL Liveblog: Milan vs. Como and Bodo/Glimt vs. Inter",
      "url": "https://football-italia.net/serie-a-ucl-liveblog-milan-como-bodo-inter/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:45:19+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "1c9558aed7a3",
      "title": "Tare shrugs off Milan Scudetto talk, reassuring news on Leao",
      "url": "https://football-italia.net/tare-shrugs-off-milan-scudetto-reassuring-leao/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:33:33+00:00",
      "summary": "Milan director Igli Tare shrugs off Scudetto talk ahead of tonight’s rescheduled clash with Como..."
    },
    {
      "id": "383f8ba5a703",
      "title": "Fabregas hint at Como False 9 experiment ‘to hurt Milan’",
      "url": "https://football-italia.net/fabregas-hint-at-como-false-9-experiment-milan/",
      "source": "football-italia.net",
      "date": "2026-02-18T19:25:43+00:00",
      "summary": "Cesc Fabregas gives hints who is playing False 9 for Como this evening against Milan,..."
    },
    {
      "id": "740924179509",
      "title": "Serie A official Week 24 line-ups: Milan vs. Como",
      "url": "https://football-italia.net/serie-a-official-wk-24-line-ups-milan-vs-como/",
      "source": "football-italia.net",
      "date": "2026-02-18T18:39:09+00:00",
      "summary": "Milan have Rafael Leao and Christopher Nkunku upfront for the rescheduled Serie A clash with..."
    },
    {
      "id": "480f0a07090d",
      "title": "Milan optimistic over one-year Modric extension",
      "url": "https://football-italia.net/milan-optimistic-over-modric-extension/",
      "source": "football-italia.net",
      "date": "2026-02-18T17:17:48+00:00",
      "summary": "Milan are working hard to sign Luka Modric to a new one-year contract extension, after..."
    },
    {
      "id": "6dc5a25930b4",
      "title": "Milan team news: Loftus-Cheek set to miss Como clash; Nkunku to start instead",
      "url": "https://football-italia.net/milan-team-news-loftus-cheek-como-nkunku/",
      "source": "football-italia.net",
      "date": "2026-02-18T15:19:36+00:00",
      "summary": "Milan are preparing to host Como at San Siro this evening, as the Rossoneri look..."
    },
    {
      "id": "3ecccc1bff44",
      "title": "Why is Milan vs. Como the only Serie A match being played on Wednesday?",
      "url": "https://football-italia.net/why-is-milan-como-being-played-on-wednesday/",
      "source": "football-italia.net",
      "date": "2026-02-18T14:08:50+00:00",
      "summary": "Milan are due to take on Como in Serie A on Sunday evening, the only..."
    },
    {
      "id": "eb060911f496",
      "title": "Italy’s extra Champions League spot fades away after Juventus and Atalanta losses",
      "url": "https://football-italia.net/italys-extra-champions-league-spot-fades-away/",
      "source": "football-italia.net",
      "date": "2026-02-18T13:33:42+00:00",
      "summary": "Italy’s chances of receiving an extra spot in next season’s Champions League were dealt another..."
    },
    {
      "id": "6e8ccb197068",
      "title": "Official: Bologna sign Milan midfielder on permanent basis",
      "url": "https://football-italia.net/bologna-sign-milan-midfielder-on-permanent/",
      "source": "football-italia.net",
      "date": "2026-02-18T12:41:09+00:00",
      "summary": "Bologna have officially announced their signing of Tommaso Pobega on a definitive, permanent transfer from..."
    },
    {
      "id": "f5ba944f0536",
      "title": "Serie A: Milan vs. Como – Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-milan-vs-como-probable-line-ups/",
      "source": "football-italia.net",
      "date": "2026-02-18T09:16:33+00:00",
      "summary": "Milan will be without several of their key first team players when they take on..."
    }
  ]
}