{
  "lastUpdated": "2026-02-23T14:43:34.583790+00:00",
  "articles": [
    {
      "id": "b4773eecad4f",
      "title": "Florenzi on Troilo's goal: \"Parma's fencing is something prepared\"",
      "url": "https://www.milannews.it/news/florenzi-sul-gol-di-troilo-lo-scherma-del-parma-e-una-cosa-preparata-608346",
      "source": "milannews.it",
      "date": "2026-02-23T14:30:23+00:00",
      "summary": "Alessandro Florenzi, former player of Milan and now commentator for Sky Sport 24, intervened after the match of Milan-Parma 0-1 and commented on the episode of Troilo's goal, much discussed and conceded after review..."
    },
    {
      "id": "2893b9b07d40",
      "title": "Watch: Wasteful Milan and controversial calls see Parma win at San Siro – the highlights",
      "url": "https://sempremilan.com/watch-milan-0-1-parma-highlights",
      "source": "sempremilan.com",
      "date": "2026-02-23T14:30:00+00:00",
      "summary": "AC Milan’s unbeaten run was ended by Parma at San Siro on Sunday evening, and with it any title hopes have probably alse been destroyed. Milan missed a few chances before the only goal of the game, with Rafael Leao’s volley being symbolic of the night. The Portuguese hammered an effort against the i"
    },
    {
      "id": "227245e798f2",
      "title": "Milan had not been without a goal at the San Siro for 10 months. It happened at Easter against Atalanta",
      "url": "https://www.milannews.it/news/il-milan-non-rimaneva-a-secco-di-gol-a-san-siro-da-10-mesi-era-successo-a-pasqua-contro-l-atalanta-608427",
      "source": "milannews.it",
      "date": "2026-02-23T14:22:51+00:00",
      "summary": "Milan has not scored for the second time in this Serie A (0-0 vs Juventus in October), while they have not been goalless in a home match in the top flight since April 2025 (0-1 vs Atalanta). Opta reports it."
    },
    {
      "id": "f0dba07a3de6",
      "title": "Ravezzani: \"Milan has little to blame other than the obvious offensive sterility\"",
      "url": "https://www.milannews.it/news/ravezzani-il-milan-ha-poco-da-rimproverarsi-se-non-la-conclamata-sterilita-offensiva-608382",
      "source": "milannews.it",
      "date": "2026-02-23T14:11:00+00:00",
      "summary": "The comment by Fabio Ravezzani, director of TeleLombardia, commented on Milan's defeat at the San Siro against Parma with a tweet on his personal X profile: \"Milan have little to blame themselves for, other than the proclaimed sterility..."
    },
    {
      "id": "e9163fb22474",
      "title": "Another hard tile for Lazio: Rovella suffered a broken collarbone",
      "url": "https://www.milannews.it/news/altra-dura-tegola-per-la-lazio-rovella-ha-subito-la-frattura-della-clavicola-608421",
      "source": "milannews.it",
      "date": "2026-02-23T14:00:26+00:00",
      "summary": "(ANSA) - CAGLIARI, FEBRUARY 21 - \"I'm playing different football to what I normally do. I didn't like some of the team's choices, we carried the ball too much."
    },
    {
      "id": "06175247b220",
      "title": "From Gabbia to Troilo: The many decisions Milan feel have gone against them in 2025-26",
      "url": "https://sempremilan.com/many-decisions-milan-against-them-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-23T14:00:00+00:00",
      "summary": "AC Milan are far from happy with the officiating this season, which they believe has cost them several points along the way. The fall-out continues after Milan’s home defeat against Parma, which ended their 24-game unbeaten run in the league and saw Inter move 10 points clear at the top of the table"
    },
    {
      "id": "de49d591d8d0",
      "title": "De Grandis: \"Valenti-Maignan? Mild, but it's obstruction. Foul that must be managed on the pitch\"",
      "url": "https://www.milannews.it/news/de-grandis-valenti-maignan-blanda-ma-e-ostruzione-fallo-che-va-gestito-in-campo-608388",
      "source": "milannews.it",
      "date": "2026-02-23T13:50:01+00:00",
      "summary": "Stefano De Grandis, journalist and commentator for Sky Sport 24, during the episode of Sky Calcio Club spoke about Parma's goal at San Siro, awarded with VAR: \"It's true that to ensure that the player is fouled..."
    },
    {
      "id": "006d194eff87",
      "title": "Terrible debut for Tudor at Tottenham. Spurs lost the derby against Arsenal badly at home",
      "url": "https://www.milannews.it/news/debutto-bruttissimo-per-tudor-al-tottenham-gli-spurs-perdono-male-in-casa-il-derby-con-l-arsenal-608418",
      "source": "milannews.it",
      "date": "2026-02-23T13:40:54+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 22 - Arsenal beat Tottenham 4-1 in the London derby for the 27th matchday of the Premier League and thus move back to +5 on Manchester City, albeit with one more match already played (the Gunners have ..."
    },
    {
      "id": "ffb50b86a96b",
      "title": "Ordine believes Milan must ‘watch out’ for chasing pack: “The magic has been interrupted”",
      "url": "https://sempremilan.com/ordine-milan-watch-out-chasing-pack",
      "source": "sempremilan.com",
      "date": "2026-02-23T13:35:00+00:00",
      "summary": "AC Milan suffered their most damaging result of the season so far at San Siro on Sunday night as they were beaten 1-0 by Parma. Milan missed a number of big chances to take the lead, coming closes with Rafael Leao’s volley that hit the inside of the post. Then, in the closing minutes, Parma […]\nThe "
    },
    {
      "id": "d64e571d3473",
      "title": "Juventus, Spalletti: \"There is too much pressure on results in the players' heads\"",
      "url": "https://www.milannews.it/news/juventus-spalletti-nella-testa-dei-giocatori-ci-sono-troppe-pressioni-sui-risultati-608422",
      "source": "milannews.it",
      "date": "2026-02-23T13:30:24+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 21 - \"When authority and conviction are lacking, there is little that can be done. Even today we missed a myriad of passes in the middle of the pitch that my players don't normally make mistakes."
    },
    {
      "id": "e5d72a890fa9",
      "title": "15 wins and 9 draws after the defeat against Cremonese. Now we start again: first defeat after 24 games",
      "url": "https://www.milannews.it/news/15-vittorie-e-9-pareggi-dopo-il-ko-contro-la-cremonese-ora-si-ricomincia-prima-sconfitta-dopo-24-partite-608426",
      "source": "milannews.it",
      "date": "2026-02-23T13:20:46+00:00",
      "summary": "After 24 consecutive matches without defeat (W15, D9), Milan lost a Serie A match for the second time in this championship (2-1 vs Cremonese on matchday one). Opta reports it."
    },
    {
      "id": "95f76d57cd4c",
      "title": "Cuomo: \"Marotta speaks in the League, Chiellini and Comolli on TV, Manna shouts into the microphones. Milan don't understand what they're doing. Galliani is missing!\"",
      "url": "https://www.milannews.it/news/cuomo-marotta-parla-in-lega-chiellini-e-comolli-in-tv-manna-grida-ai-microfoni-il-milan-non-si-capisce-cosa-fa-manca-galliani-608444",
      "source": "milannews.it",
      "date": "2026-02-23T13:10:09+00:00",
      "summary": "Michael Cuomo, journalist, expressed himself to MilanNews in the aftermath of Milan-Parma: “The refereeing issue and its communication management brought to light all Milan's limitations."
    },
    {
      "id": "0ccc0fa537e9",
      "title": "Moretto: Maignan ‘closed the door’ on approach from Juventus – the background",
      "url": "https://sempremilan.com/maignan-closed-door-approach-juventus",
      "source": "sempremilan.com",
      "date": "2026-02-23T13:10:00+00:00",
      "summary": "AC Milan managed to obtain Mike Maignan’s renewal after months of negotiations, but there was interest from rivals Juventus. During the summer window it looked certain that Maignan’s time at Milan was coming to an end. Chelsea tried to sign him before the Club World Cup, and even though he remained "
    },
    {
      "id": "abe1d2016657",
      "title": "Untouchable goalkeepers, unless your name is Mike Maignan and you play for Milan",
      "url": "https://www.milannews.it/primo-piano/portieri-intoccabili-tranne-se-ti-chiami-mike-maignan-e-giochi-per-il-milan-608447",
      "source": "milannews.it",
      "date": "2026-02-23T13:00:30+00:00",
      "summary": "Milan-Parma leaves a legacy of incandescent controversies, not only for the Troilo-Bartesaghi contact which led to the goal of the ducal defender, but also for the management of the episodes involving the two goalkeepers."
    },
    {
      "id": "484293f63d63",
      "title": "Ramazzotti: \"The polite call made by Milan to The Hague was of no use. In fact, the effect was the opposite. Last night the managers were angry\"",
      "url": "https://www.milannews.it/news/ramazzotti-la-chiamata-garbata-fatta-dal-milan-all-aia-non-e-servita-anzi-l-effetto-e-stato-opposto-ieri-sera-rabbia-dei-dirigenti-608435",
      "source": "milannews.it",
      "date": "2026-02-23T12:50:40+00:00",
      "summary": "Andrea Ramazzotti, journalist, expressed himself in La Gazzetta dello Sport on Milan's discontent with the refereeing after the home defeat against Parma: \"The polite call made by Milan in The Hague did not help."
    },
    {
      "id": "3ee264ad577f",
      "title": "GdS: Milan’s AIA call ‘ineffective’ – why there is further anger about officiating",
      "url": "https://sempremilan.com/why-milan-further-anger-officiating",
      "source": "sempremilan.com",
      "date": "2026-02-23T12:45:00+00:00",
      "summary": "AC Milan have been left angered by officiating for the second time in just a few days, this time following the shock defeat to Parma. As La Gazzetta dello Sport write, Milan’s polite call to the AIA was ‘ineffective’. In fact, the effect was the opposite of what was hoped for. After the Como draw, t"
    },
    {
      "id": "d1dfca20a315",
      "title": "According to Gasperini, the race for Champions League qualification will only be decided at the end of the season",
      "url": "https://www.milannews.it/news/secondo-gasperini-la-corsa-per-la-qualificazione-in-champions-league-si-decidera-solo-a-fine-stagione-608417",
      "source": "milannews.it",
      "date": "2026-02-23T12:40:22+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 22 - \"Champions? Sunday will be a very important match against Juventus, winning it would be a big step forward."
    },
    {
      "id": "f8e3583b489d",
      "title": "The club's comment on Milan-Parma: \"It's a shock when looking at the top, even though the objective that has always been stated is and remains Champions League qualification\"",
      "url": "https://www.milannews.it/news/il-commento-del-club-a-milan-parma-una-mazzata-guardando-la-vetta-seppur-l-obiettivo-da-sempre-dichiarato-sia-e-rimanga-la-qualificazione-in-champions-608415",
      "source": "milannews.it",
      "date": "2026-02-23T12:30:46+00:00",
      "summary": "Below is AC Milan's comment, via the club's official website, on Milan-Parma (0-1):\n\n\"It's a bitter evening for Milan, who unexpectedly went down at San Siro losing 0-1 to ..."
    },
    {
      "id": "f770ca1d3b6f",
      "title": "Yesterday a heavy defeat, but Allegri's Milan still has 13 points more than that of Fonseca and Conceicao",
      "url": "https://www.milannews.it/news/ieri-una-sconfitta-pesante-ma-il-milan-di-allegri-ha-comunque-13-punti-in-piu-di-quello-di-fonseca-e-conceicao-608425",
      "source": "milannews.it",
      "date": "2026-02-23T12:20:01+00:00",
      "summary": "Below is the score of Milan's last seasons after 26 championship days:\n\n2025/26: 54 points — Allegri\n2024/25: 41 points — Fonseca/Conceicao\n2023/24: 53 points — Pioli\n2022/23: 48 points — Pioli\n2 ..."
    },
    {
      "id": "0da24353115d",
      "title": "‘We got 54 points this way’ – Landucci responds strongly to idea of three-man attack",
      "url": "https://sempremilan.com/landucci-responds-idea-three-man-attack",
      "source": "sempremilan.com",
      "date": "2026-02-23T12:20:00+00:00",
      "summary": "AC Milan’s assistant coach Marco Landucci answered some difficult questions after the loss against Parma, including one about the attacking configuration. Landucci stepped into the dugout for the fifth time this season with Massimiliano Allegri suspended again. The previous games saw wins over Bari,"
    },
    {
      "id": "198bdcb5f056",
      "title": "Order: \"A draw (with Como) and a defeat (with Parma) in the space of 4 days are a wake-up call\"",
      "url": "https://www.milannews.it/news/ordine-un-pareggio-col-como-e-una-sconfitta-col-parma-nel-giro-di-4-giorni-sono-un-campanello-d-allarme-608405",
      "source": "milannews.it",
      "date": "2026-02-23T12:10:15+00:00",
      "summary": "During the usual appointment with his commentary for Il Corriere dello Sport, my colleague Franco Ordine spoke about Milan's defeat against Parma yesterday, focusing in particular on \"Pulisic's aim\", which has worsened ..."
    },
    {
      "id": "f2c14380d656",
      "title": "Pulisic still goalless in 2026 as Milan fall 10 points behind Inter",
      "url": "https://football-italia.net/pulisic-goalless-2026-milan-10-points-inter/",
      "source": "football-italia.net",
      "date": "2026-02-23T12:04:03+00:00",
      "summary": "Christian Pulisic has had a tough start to the year as the Milan star hasn’t..."
    },
    {
      "id": "495fa4715071",
      "title": "Manna raises his voice against the referees, describing what happened in Bergamo as disconcerting",
      "url": "https://www.milannews.it/news/manna-alza-la-voce-contro-gli-arbitri-definendo-sconcertante-quanto-accaduto-a-bergamo-608325",
      "source": "milannews.it",
      "date": "2026-02-23T12:00:56+00:00",
      "summary": "In the post-match of Atalanta-Napoli, a match which saw the Bergamo team win 2 to 1 amidst controversy, the sporting director of the Neapolitans Giovanni Manna appeared at the press conference to comment and raise his voice after the errors ..."
    },
    {
      "id": "6d24314da5c6",
      "title": "Parma boss Cuesta sends message to Loftus-Cheek and dodges question about Troilo goal",
      "url": "https://sempremilan.com/parma-cuesta-loftus-cheek-troilo-goal",
      "source": "sempremilan.com",
      "date": "2026-02-23T11:55:00+00:00",
      "summary": "Parma head coach Carlos Cuesta sent his thoughts to Ruben Loftus-Cheek, and dodged a question about the winner against AC Milan. Back in 1993, Milan went into a home game against Parma with a 58-game unbeaten run on the line, and lost 1-0 to an Asprilla free-kick. While last night it was only a 24-g"
    },
    {
      "id": "7a9f0a8b989c",
      "title": "Bucchioni: \"It was right to cancel Troilo's goal. Piccinini had guessed the clever trick and instead of helping him, VAR made him make a mistake\"",
      "url": "https://www.milannews.it/news/bucchioni-giusto-annullare-il-gol-di-troilo-piccinini-aveva-intuito-la-furbata-e-il-var-invece-di-aiutarlo-l-ha-fatto-sbagliare-608411",
      "source": "milannews.it",
      "date": "2026-02-23T11:50:39+00:00",
      "summary": "During the usual appointment with his editorial for TMW, the journalist Enzo Bucchioni could not help but talk about what happened in the last weekend of the championship, yet another tainted by gross refereeing errors: \n ..."
    },
    {
      "id": "9cacd601b32c",
      "title": "The one on Loftus-Cheek is more rigorous than not: slow motion",
      "url": "https://www.milannews.it/news/quello-su-loftus-cheek-e-piu-rigore-che-no-la-moviola-608416",
      "source": "milannews.it",
      "date": "2026-02-23T11:40:19+00:00",
      "summary": "For another championship weekend, the protagonist was not the pitch, but referees and VAR."
    },
    {
      "id": "be7d1c974fac",
      "title": "It was also Parma, in March 1993, who interrupted the 58 consecutive useful results of Capello's Milan. The ducals stop Allegri at 24",
      "url": "https://www.milannews.it/news/fu-sempre-il-parma-nel-marzo-1993-a-interrompere-i-58-risultati-utili-consecutivi-del-milan-di-capello-i-ducali-fermano-allegri-a-24-608434",
      "source": "milannews.it",
      "date": "2026-02-23T11:30:01+00:00",
      "summary": "As reported by Corriere dello Sport, \"it was March 21, 1993 and it was Asprilla who put an end to the record-breaking series of Fabio Capello's Milan of the Invincibles, fresh from 58 consecutive useful results."
    },
    {
      "id": "c00978e91e0f",
      "title": "CM: Pulisic loses aim amid possible distractions – goal drought reaches two months",
      "url": "https://sempremilan.com/pulisic-loses-aim-drought-two-months",
      "source": "sempremilan.com",
      "date": "2026-02-23T11:30:00+00:00",
      "summary": "Christian Pulisic has been decisive for AC Milan since arriving in 2023, but he is not going through the best patch of form at the moment. As Calciomercato.com recall, Milan’s 24-game unbeaten run went up in smoke last night as they not only lost against Parma, but failed to score. Even fielding the"
    },
    {
      "id": "11cb19367d3a",
      "title": "Very heated discussion about Milan at Pressing! Here is the whole debate between Trevisani, Sabatini, Pellegatti, Viviano and Tacchinardi",
      "url": "https://www.milannews.it/news/accesissima-discussione-sul-milan-a-pressing-ecco-tutto-il-dibattito-tra-trevisani-sabatini-pellegatti-viviano-e-tacchinardi-608437",
      "source": "milannews.it",
      "date": "2026-02-23T11:20:23+00:00",
      "summary": "During last night's episode of Pressing, broadcast on Italia1, there was a heated discussion between the commentators in the studio about Milan."
    },
    {
      "id": "51e337fc67bb",
      "title": "‘The On-Field Review is not fair’ – Loftus-Cheek and Troilo incidents divide expert opinion",
      "url": "https://sempremilan.com/loftus-cheek-troilo-divide-expert-opinion",
      "source": "sempremilan.com",
      "date": "2026-02-23T11:05:00+00:00",
      "summary": "AC Milan’s defeat to Parma had a couple of highly controversial decisions, which have been the subject of debate from experts and pundits. The first one came just a few minutes in: a cross from Alexis Saelemaekers on the left side was cleared by a defender a split second before the Parma goalkeeper "
    },
    {
      "id": "db464e29a86d",
      "title": "A swathe of disappointing performances: Player ratings from Milan-Parma from Italian papers",
      "url": "https://sempremilan.com/player-ratings-milan-0-1-parma-italian-papers",
      "source": "sempremilan.com",
      "date": "2026-02-23T10:40:00+00:00",
      "summary": "AC Milan’s 24-game unbeaten run fell at San Siro on Sunday as they lost to Parma 1-0, while the Scudetto hopes probably went with it. The only goal of the game was a controversial one 10 minutes from time, as Troilo rose at the far post to head in a corner. It was initially disallowed […]\nThe post A"
    },
    {
      "id": "4d37804875f9",
      "title": "CorSport: Just like 1993 – Parma end Milan’s unbeaten run again as title dream evaporates",
      "url": "https://sempremilan.com/parma-end-milan-unbeaten-run-again-1993",
      "source": "sempremilan.com",
      "date": "2026-02-23T10:15:00+00:00",
      "summary": "AC Milan needed to win to keep the Scudetto race alive against Parma on Sunday, but instead their unbeaten run was ended. As Corriere dello Sport (via MilanNews) write this morning, the game against Parma should have been a chance for Milan to show that they are fully over their hoodoo against teams"
    },
    {
      "id": "81618ec3638b",
      "title": "Reports: Loftus-Cheek set for surgery with season-ending injury feared – Corvi’s gesture",
      "url": "https://sempremilan.com/loftus-cheek-surgery-season-ending-injury-feared",
      "source": "sempremilan.com",
      "date": "2026-02-23T09:50:00+00:00",
      "summary": "In addition to losing the game late on, there was another negative note for AC Milan on Sunday as Ruben Loftus-Cheek had to be stretchered off. As MilanNews recall, Loftus-Cheek had to leave the San Siro pitch just minutes into the match against Parma, taken to hospital on a stretcher and in a neck "
    },
    {
      "id": "ecf0a15c0181",
      "title": "GdS: Toothless and timid – why Milan showed familiar failings in loss to Parma",
      "url": "https://sempremilan.com/why-milan-showed-familiar-failings-parma",
      "source": "sempremilan.com",
      "date": "2026-02-23T09:25:00+00:00",
      "summary": "AC Milan’s unbeaten streak was ended by Parma at San Siro on Sunday, and now the Scudetto dream has probably vanished for good. As La Gazzetta dello Sport (seen below) report, Massimiliano Allegri’s pre-match calculation was that Milan needed to win 12 of their last 13 games to catch Inter and win t"
    },
    {
      "id": "6a90b72fa08b",
      "title": "Milan star Leao questions referee decisions on Instagram after 1-0 loss vs. Parma",
      "url": "https://football-italia.net/milan-leao-questions-referee-instagram-parma/",
      "source": "football-italia.net",
      "date": "2026-02-23T09:09:55+00:00",
      "summary": "Milan star Rafael Leao didn’t hide his frustration over Parma’s winning goal at San Siro..."
    },
    {
      "id": "5d56ee46e2ed",
      "title": "Gallery: ‘Milan fury’, ‘A gift to Inter’ – Today’s front pages in Italy",
      "url": "https://sempremilan.com/front-pages-23-february-milan-0-1-parma",
      "source": "sempremilan.com",
      "date": "2026-02-23T09:00:00+00:00",
      "summary": "AC Milan’s unbeaten run was halted at 24 games by Parma at San Siro on Sunday evening, and with it the title dreams evaporated too. Milan missed several opportunities to get themselves ahead and probably secure a different outcome. Then, with 10 minutes left, Parma got what would prove to be the win"
    },
    {
      "id": "b1603bcbb6a7",
      "title": "Today’s Papers – Milan rage, referees’ flop, Juventus collapse",
      "url": "https://football-italia.net/todays-papers-milan-rage-referee-flop-juventus/",
      "source": "football-italia.net",
      "date": "2026-02-23T08:30:03+00:00",
      "summary": "La Gazzetta dello Sport The Devil lose against Parma and attack the referee Milan rage,..."
    },
    {
      "id": "915b2c1d765e",
      "title": "Serie A race for Champions League heats up after dramatic weekend for Milan, Napoli & Juventus",
      "url": "https://football-italia.net/serie-a-race-for-champions-league-heats-up/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:57:08+00:00",
      "summary": "The race for Champions League football in Serie A has never looked tighter, and a..."
    },
    {
      "id": "4bee85e8dfba",
      "title": "Parma & Cuesta take leaf out of Arsenal book to conquer Milan at San Siro",
      "url": "https://football-italia.net/parma-cuesta-leaf-out-of-arsenal-book-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:28:52+00:00",
      "summary": "Whatever your view on the legality of Mariano Troilo’s winner as Parma beat Milan 1-0..."
    },
    {
      "id": "70e1d8195528",
      "title": "Former Serie A referee claims Parma winner against Milan ‘not worthy of on-field review’",
      "url": "https://football-italia.net/marelli-claims-parma-winner-against-milan/",
      "source": "football-italia.net",
      "date": "2026-02-22T21:07:00+00:00",
      "summary": "The controversy surrounding Parma’s winning goal against Milan at San Siro shows no sign of..."
    },
    {
      "id": "2af2bd9e49fe",
      "title": "Milan midfielder Loftus-Cheek suffers jaw fracture in defeat to Parma",
      "url": "https://football-italia.net/milan-midfielder-loftus-cheek-jaw-fracture/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:23:08+00:00",
      "summary": "Milan’s miserable afternoon at San Siro was compounded by serious injury news regarding Ruben Loftus-Cheek,..."
    },
    {
      "id": "1e37d9da2c78",
      "title": "Leao fuels officiating controversy of Milan-Parma with Instagram stories",
      "url": "https://sempremilan.com/leao-fuels-controversy-milan-parma-instagram",
      "source": "sempremilan.com",
      "date": "2026-02-22T20:17:53+00:00",
      "summary": "Rafael Leao has fueled the officiating controversy on Instagram with a couple of stories, highlighting a previous incident that went against AC Milan.  Milan’s unbeaten run came to an end this evening as Parma scored the only goal at San Siro. It was a rather controversial goal, however, as Mike Mai"
    },
    {
      "id": "4924a7a3944c",
      "title": "‘The thing that hurts the most’ – Gabbia bitter after unbeaten run ends against Parma",
      "url": "https://sempremilan.com/hurts-most-gabbia-unbeaten-run-parma",
      "source": "sempremilan.com",
      "date": "2026-02-22T20:11:20+00:00",
      "summary": "AC Milan defender Matteo Gabbia has admitted that the unbeaten run ending at the hands of Parma ‘hurts’, also sending his thoughts to Ruben Loftus-Cheek. Gabbia was expected to start the game against Parma this evening, but the defender pulled up during the warm-ups complaining of muscle discomfort."
    },
    {
      "id": "e89f703a6bd8",
      "title": "Milan 0-1 Parma – Cuesta: ‘Our thoughts are with Loftus-Cheek, we try to be ready to score from set-pieces’",
      "url": "https://football-italia.net/milan-0-1-parma-cuesta-set-pieces-loftus-cheek/",
      "source": "football-italia.net",
      "date": "2026-02-22T20:05:00+00:00",
      "summary": "Carlos Cuesta cut a composed and measured figure at San Siro after Parma pulled off..."
    },
    {
      "id": "bf6d32a285f4",
      "title": "Watch: “It was just pathetic” – Lorenzo’s instant reaction to AC Milan 0-1 Parma",
      "url": "https://sempremilan.com/lorenzos-instant-reaction-milan-0-1-parma-2026",
      "source": "sempremilan.com",
      "date": "2026-02-22T19:58:41+00:00",
      "summary": "Lorenzo reacted to AC Milan’s defeat against Parma straight after the full-time whistle, highlighting how the lack of chances created was pathetic from the Rossoneri.  Milan headed into the game knowing they needed to win, especially after the draw against Como, to keep their already slim Scudetto h"
    },
    {
      "id": "2ecda8740370",
      "title": "Landucci praises Milan’s attitude despite Parma defeat: “The ball wouldn’t go in”",
      "url": "https://sempremilan.com/landucci-praises-milan-parma-attitude",
      "source": "sempremilan.com",
      "date": "2026-02-22T19:55:56+00:00",
      "summary": "AC Milan’s assistant coach Marco Landucci believes that there was an element of bad luck about the defeat to Parma, taking a positive view on the performance. Milan had a number of chances to make the night a bit more routine, but they spurned them and they were made to pay with 10 minutes left. […]"
    },
    {
      "id": "cb65629c8589",
      "title": "Landucci: ‘Milan unlucky with Parma, ball didn’t want to go in’",
      "url": "https://football-italia.net/landucci-milan-unlucky-parma-ball-didnt-want/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:53:54+00:00",
      "summary": "Milan assistant manager Marco Landucci insists they were ‘not lucky’ tonight with injuries, the woodwork,..."
    },
    {
      "id": "578227234824",
      "title": "Serie A Liveblog: Atalanta vs. Napoli, Milan vs. Parma, Roma vs. Cremonese",
      "url": "https://football-italia.net/serie-a-live-atalanta-napoli-milan-parma-roma/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:44:12+00:00",
      "summary": "{rsn-live-v2}"
    },
    {
      "id": "83e15480f27e",
      "title": "MN: Muscle strain and broken teeth – the latest on Gabbia and Loftus-Cheek’s injuries",
      "url": "https://sempremilan.com/latest-gabbia-loftus-cheek-injuries",
      "source": "sempremilan.com",
      "date": "2026-02-22T19:43:22+00:00",
      "summary": "In addition to the negative result at San Siro this evening, there was more bad news for AC Milan on the injury front too. There was a late line-up change for Massimiliano Allegri to make just before kick-off against Parma. Matteo Gabbia pulled up during the warm-ups complaining of muscle discomfort"
    },
    {
      "id": "74ec4192014a",
      "title": "Player Ratings: AC Milan 0-1 Parma – Bartesaghi blunder; Pulisic misses",
      "url": "https://sempremilan.com/player-ratings-ac-milan-0-1-parma-bartesaghi",
      "source": "sempremilan.com",
      "date": "2026-02-22T19:31:22+00:00",
      "summary": "AC Milan dropped points once again, this time all three, as Parma prevailed by the odd goal at San Siro. Several players struggled and below are the ratings for the Rossoneri.  If you haven’t already, make sure to check out how we decide the player ratings. From the scale to what affects the rating,"
    },
    {
      "id": "7d1eaf8982a2",
      "title": "Serie A | Milan 0-1 Parma – Player Ratings as Troilo and Corvi batten down the hatches",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-player-ratings/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:09:16+00:00",
      "summary": "Milan fell to a late 1-0 defeat to Parma this evening, after they were unable..."
    },
    {
      "id": "0338d8d0b0d7",
      "title": "Serie A | Milan 0-1 Parma: Rossoneri suffer shocking first defeat in 24 rounds",
      "url": "https://football-italia.net/serie-a-milan-0-1-parma-shocking-defeat-24/",
      "source": "football-italia.net",
      "date": "2026-02-22T19:05:53+00:00",
      "summary": "Milan paid the price for insipid finishing and sluggish defending, as Parma inflicted their first..."
    },
    {
      "id": "ad92e7503a8c",
      "title": "Ex-West Ham & Villa man Reo-Coker: ‘Fabregas pull on Saelemaekers inexcusable’",
      "url": "https://football-italia.net/ex-west-ham-villa-man-reo-coker-fabregas/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:50:32+00:00",
      "summary": "Former West Ham and Aston Villa midfielder turned CBS Sports Golazo pundit Nigel Reo-Coker has..."
    },
    {
      "id": "be4ffa2fa372",
      "title": "Milan double blow as Loftus-Cheek and Gabbia suffer injuries",
      "url": "https://football-italia.net/milan-double-loftus-cheek-gabbia-injuries/",
      "source": "football-italia.net",
      "date": "2026-02-22T17:25:58+00:00",
      "summary": "Milan suffered two major injuries in their match against Parma, as Matteo Gabbia pulled out..."
    },
    {
      "id": "a426ed6a1955",
      "title": "Landucci: ‘Milan focus on our journey, believe in Leao’",
      "url": "https://football-italia.net/landucci-milan-focus-journey-believe-in-leao/",
      "source": "football-italia.net",
      "date": "2026-02-22T16:40:03+00:00",
      "summary": "Milan assistant manager Marco Landucci shrugs off talk of the Scudetto race with rivals Inter..."
    },
    {
      "id": "47258cff203b",
      "title": "Serie A official line-ups: Milan vs. Parma",
      "url": "https://football-italia.net/serie-a-official-line-ups-milan-vs-parma/",
      "source": "football-italia.net",
      "date": "2026-02-22T15:54:34+00:00",
      "summary": "Milan welcome Christian Pulisic and Adrien Rabiot back to the starting XI with Rafael Leao..."
    },
    {
      "id": "cdb760fc8c2d",
      "title": "Serie A: Milan vs. Parma: Probable line-ups and where to watch on TV",
      "url": "https://football-italia.net/serie-a-milan-vs-parma-probable-line-ups-2/",
      "source": "football-italia.net",
      "date": "2026-02-22T09:17:18+00:00",
      "summary": "Christian Pulisic and Rafael Leao look set to partner each other in attack for just..."
    },
    {
      "id": "1ebade3a7510",
      "title": "Today’s Papers: Juventus unrecognisable, Inter flying, Italy golden land",
      "url": "https://football-italia.net/todays-papers-juventus-unrecognisable-inter/",
      "source": "football-italia.net",
      "date": "2026-02-22T08:41:37+00:00",
      "summary": "La Gazzetta dello Sport  The golden land  The bluest Olympics ever come to an end ..."
    },
    {
      "id": "0ce5a9e9364d",
      "title": "Milan, Allegri: Leao and Pulisic ‘improving’, I ‘get emotional’ when I talk to Modric",
      "url": "https://football-italia.net/milan-allegri-leao-pulisic-improve-talk-modric/",
      "source": "football-italia.net",
      "date": "2026-02-21T15:04:00+00:00",
      "summary": "Milan coach Massimiliano Allegri says Rafael Leao and Christian Pulisic are ‘improving’ and admits he..."
    },
    {
      "id": "39bd700d0d30",
      "title": "Fabregas: ‘I made a mistake, but some are seeking excuses’ with Como",
      "url": "https://football-italia.net/fabregas-made-mistake-some-seek-excuses-como/",
      "source": "football-italia.net",
      "date": "2026-02-21T13:59:43+00:00",
      "summary": "Cesc Fabregas again takes responsibility for his mistake against Milan, but also hints they are..."
    }
  ]
}