{
  "lastUpdated": "2026-02-22T05:50:51.359869+00:00",
  "articles": [
    {
      "id": "1d36b8d43e5d",
      "title": "Milan, Allegri: \"Pavlovic recovered, Pulisic and Leao are better\"",
      "url": "https://www.milannews.it/news/milan-allegri-pavlovic-recuperato-pulisic-e-leao-stanno-meglio-608243",
      "source": "milannews.it",
      "date": "2026-02-22T00:00:00+00:00",
      "summary": "(ANSA) - MILAN, FEBRUARY 21 - \"Pavlovic seemed at risk, because we feared after the blow in the match, but fortunately he is also available."
    },
    {
      "id": "3d79d0dc2bad",
      "title": "Colombo: \"If there aren't managers who do it, there are many coaches who never miss an opportunity to point out the wrongs suffered. Allegri doesn't make a mistake\"",
      "url": "https://www.milannews.it/news/colombo-se-non-ci-sono-dei-dirigenti-che-lo-fanno-ci-sono-molti-allenatori-che-non-perdono-occasione-di-rimarcare-i-torti-subiti-allegri-non-sbaglia-u-608190",
      "source": "milannews.it",
      "date": "2026-02-21T23:48:52+00:00",
      "summary": "Monica Colombo, journalist for Corriere della Sera, expressed herself as follows on Radio Rossonera on Milan's political weight: “I believe that it's fine to be gentlemen but sometimes it helps to raise your voice."
    },
    {
      "id": "63d4a922df0b",
      "title": "Attention Milan: it's time for an (almost) record. With Parma, Allegri goes for second place in history",
      "url": "https://www.milannews.it/news/attenzione-milan-e-il-momento-di-un-quasi-record-col-parma-allegri-va-per-il-secondo-posto-nella-storia-608183",
      "source": "milannews.it",
      "date": "2026-02-21T23:36:45+00:00",
      "summary": "Milan are unbeaten in 24 consecutive matches (W15, D9) and could record a streak of at least 25 matches without defeat in a single top league for only the second time in their history, after the streak of 34 that lasted throughout the season ..."
    },
    {
      "id": "f9b3300e461b",
      "title": "Giroud, future in the balance: moment of reflection for the Frenchman",
      "url": "https://www.milannews.it/dall-estero/giroud-futuro-in-bilico-momento-di-riflessione-per-il-francese-608224",
      "source": "milannews.it",
      "date": "2026-02-21T23:24:24+00:00",
      "summary": "According to what was reported by L'Equipe, a French newspaper, Olivier Giroud's future at Lille is more in the balance than ever."
    },
    {
      "id": "ad4cb0b328a9",
      "title": "Mancini (DAZN): “Milan couldn't have done more than that, but no sentences”",
      "url": "https://www.milannews.it/news/mancini-dazn-il-milan-piu-di-cosi-non-poteva-fare-ma-niente-sentenze-608221",
      "source": "milannews.it",
      "date": "2026-02-21T23:12:41+00:00",
      "summary": "Decisive weeks for Milan. After the draw against Como, tomorrow the Rossoneri will challenge Parma to remain in first place in the standings, occupied by Inter."
    },
    {
      "id": "fdec995b5bb3",
      "title": "Milan cuckolded and beaten. Deception wins. Rafa, thank you. While Nkunku...",
      "url": "https://www.milannews.it/editoriale/milan-cornuto-e-mazziato-vince-l-inganno-rafa-grazie-mentre-nkunku-608251",
      "source": "milannews.it",
      "date": "2026-02-21T23:00:00+00:00",
      "summary": "The match against Como on Wednesday was a great opportunity wasted in the championship fight. Alt."
    },
    {
      "id": "a840ef21d488",
      "title": "Pellegatti: “I hope that in future management the political weight will be authoritative”",
      "url": "https://www.milannews.it/news/pellegatti-spero-che-nel-futuro-management-il-peso-politico-sia-autorevole-608220",
      "source": "milannews.it",
      "date": "2026-02-21T22:48:12+00:00",
      "summary": "In his YouTube channel, Carlo Pellegatti spoke about the protests that Milan would have made by calling the AIA leaders for some refereeing decisions."
    },
    {
      "id": "3f85f63f87fd",
      "title": "Romano takes stock of Bartesaghi's future: \"Milan has every intention of rewarding him, which is why renewal is the most certain and safest destination\"",
      "url": "https://www.milannews.it/calciomercato-milan/romano-fa-il-punto-sul-futuro-di-bartesaghi-il-milan-ha-tutta-l-intenzione-di-premiarlo-per-questo-il-rinnovo-e-la-destinazione-piu-certa-e-sicura-608258",
      "source": "milannews.it",
      "date": "2026-02-21T22:36:08+00:00",
      "summary": "During the usual appointment with the video update on his YouTube channel, Fabrizio Romano spoke about the movements at Milan, focusing in particular on the future of Davide Bartesaghi, amidst interest from the P ..."
    },
    {
      "id": "5d7c9a4f90e1",
      "title": "Oddo: \"My idols were Baresi and Maldini, people who didn't make you make mistakes with a look\"",
      "url": "https://www.milannews.it/news/oddo-i-miei-idoli-erano-baresi-e-maldini-gente-che-non-ti-faceva-sbagliare-con-uno-sguardo-608218",
      "source": "milannews.it",
      "date": "2026-02-21T22:24:00+00:00",
      "summary": "Massimo Oddo was interviewed by FanPage, this is an extract of his statements.\n\nOn his idols: \"They were the real ones, not the ones of today, with all due respect."
    },
    {
      "id": "4a48c82efc16",
      "title": "Tresoldi: \"The dream of playing for Milan is here, inside my head. I think about it every morning\"",
      "url": "https://www.milannews.it/news/tresoldi-il-sogno-di-giocare-nel-milan-e-qui-dentro-la-testa-ci-penso-ogni-mattina-608217",
      "source": "milannews.it",
      "date": "2026-02-21T22:12:00+00:00",
      "summary": "Nicolò Tresoldi, Bruges striker, was interviewed by Sportweek and spoke again about the possibility of one day wearing the AC Milan shirt: \"A future of 9 for the Rossoneri? It's the dream that drives me..."
    },
    {
      "id": "7de74ce224b3",
      "title": "Serie A, the updated standings after the Unipol Domus draw between Cagliari and Lazio",
      "url": "https://www.milannews.it/news/serie-a-la-classifica-aggiornata-dopo-il-pari-dell-unipol-domus-tra-cagliari-e-lazio-608253",
      "source": "milannews.it",
      "date": "2026-02-21T22:00:44+00:00",
      "summary": "The Serie A standings updated after the goalless draw at the Unipol Domus Arena between Fabio Pisacane's Cagliari and Maurizio Sarri's Lazio. The challenge was valid for the advance of the 26th day of the championship."
    },
    {
      "id": "9ccdf4aad5d6",
      "title": "Goalless draw at the Unipol Domus, Cagliari and Lazio emerge with a point each",
      "url": "https://www.milannews.it/news/pareggio-senza-reti-all-unipol-domus-cagliari-e-lazio-escono-con-un-punto-a-testa-608252",
      "source": "milannews.it",
      "date": "2026-02-21T21:50:43+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 21 - It ends 0-0 at the Unipol Domus between Cagliari and Lazio in the Saturday evening match of the 26th round of Serie A."
    },
    {
      "id": "963fdb530e77",
      "title": "Attention Milan: in percentage, only Arsenal's Merino scores more headers than Parma's Pellegrino",
      "url": "https://www.milannews.it/news/attenzione-milan-in-percentuale-solo-merino-dell-arsenal-segna-piu-di-testa-di-pellegrino-del-parma-608184",
      "source": "milannews.it",
      "date": "2026-02-21T21:36:08+00:00",
      "summary": "Among players with double figures in goals since the start of last season in the top five European leagues, only Mikel Merino (64%) has scored a higher percentage of headed goals than Mateo Pellegrino (60% - 6/10); the class of 2001, the ..."
    },
    {
      "id": "c5bb9fe27a25",
      "title": "Ancelotti spoilers that he will renew with Brazil for another four years",
      "url": "https://www.milannews.it/news/ancelotti-spoilera-che-rinnovera-con-il-brasile-per-altri-quattro-anni-608123",
      "source": "milannews.it",
      "date": "2026-02-21T21:24:00+00:00",
      "summary": "(ANSA) - RIO DE JANEIRO, FEBRUARY 20 - Carlo Ancelotti has expressed his desire to extend his contract with the Brazilian national football team for another four years, remaining in office until the 2030 World Cup."
    },
    {
      "id": "61b3acdb3299",
      "title": "We always have fun with Milan and Parma: 3.9 goals per game on average in the last 15 matches",
      "url": "https://www.milannews.it/news/con-milan-e-parma-ci-si-diverte-sempre-3-9-gol-di-media-a-partita-nelle-ultime-15-sfide-608186",
      "source": "milannews.it",
      "date": "2026-02-21T21:12:26+00:00",
      "summary": "In 14 of the last 15 matches between these two teams both teams have scored (3.9 goals on average in the period) - the only exception being the 1-0 victory for the Rossoneri on 1 December 2019."
    },
    {
      "id": "b290edcf6c10",
      "title": "Towards Milan-Parma: the latest precedents at San Siro smile on the Devil",
      "url": "https://www.milannews.it/news/verso-milan-parma-gli-ultimi-precedenti-a-san-siro-sorridono-al-diavolo-608124",
      "source": "milannews.it",
      "date": "2026-02-21T21:00:00+00:00",
      "summary": "After the home draw against Como, Massimiliano Allegri's Milan are approaching their next league match against Parma on Sunday at 6pm."
    },
    {
      "id": "ce7892b138c1",
      "title": "Fonseca and the adventure at Milan: \"I deserved more time, changing something in Italy is difficult\"",
      "url": "https://www.milannews.it/gli-ex/fonseca-e-l-avventura-al-milan-meritavo-piu-tempo-cambiare-qualcosa-in-italia-e-difficile-608214",
      "source": "milannews.it",
      "date": "2026-02-21T20:48:00+00:00",
      "summary": "Interviewed by The Athletic, Paulo Fonseca - among the many topics discussed - also remembered his period at Milan: \"I deserved more time. Milan is an extraordinary club and I really enjoyed coaching them."
    },
    {
      "id": "5f0d49fdfde6",
      "title": "Not just Rabiot: Milan have two more bookings against Parma",
      "url": "https://www.milannews.it/news/non-solo-rabiot-il-milan-ha-altri-due-diffidati-contro-il-parma-608211",
      "source": "milannews.it",
      "date": "2026-02-21T20:36:00+00:00",
      "summary": "Tomorrow Milan will challenge Parma at San Siro. As the Gazzetta dello Sport reminds us, it's not just Adrien Rabiot at risk of disqualification."
    },
    {
      "id": "736861a2e150",
      "title": "Rome, Gasperini: \"For the club, it's a transition year, I have the Champions League objective\"",
      "url": "https://www.milannews.it/news/roma-gasperini-per-la-societa-anno-di-transizione-io-ho-l-obiettivo-champions-608238",
      "source": "milannews.it",
      "date": "2026-02-21T20:24:03+00:00",
      "summary": "(ANSA) - ROME, FEBRUARY 21 - \"It was the club and Ranieri who said that this would be a year of transition. I am the one who spoke about the Champions League as an objective."
    },
    {
      "id": "f68cc49fd3ec",
      "title": "Alvino: \"The Champions League fight is very interesting: Napoli and Milan are still favourites\"",
      "url": "https://www.milannews.it/news/alvino-la-lotta-champions-e-molto-interessante-napoli-e-milan-comunque-favorite-608192",
      "source": "milannews.it",
      "date": "2026-02-21T20:13:24+00:00",
      "summary": "Carlo Alvino, a journalist of Neapolitan faith, expressed himself thus during 'Terzo Tempo Calcio Napoli' on Televomero: “After Bergamo, the calendar will be more affordable for Napoli."
    },
    {
      "id": "86ecaff0db99",
      "title": "Sky: Milan’s predicted XI to face Parma – Estupinan, Loftus-Cheek and Pulisic named",
      "url": "https://sempremilan.com/sky-milans-xi-parma-estupinan-rlc-pulisic",
      "source": "sempremilan.com",
      "date": "2026-02-21T19:31:42+00:00",
      "summary": "Massimiliano Allegri has decided to make some big changes to the starting eleven for Milan-Parma tomorrow, according to a report.  The mid-week game against Como didn’t go quite to plan for  Milan as a Mike Maignan howler had them trailing. They did enough to salvage a point but at the end of the da"
    },
    {
      "id": "253991d31736",
      "title": "Serie A preview: AC Milan vs. Parma – Team news, opposition insight, stats and prediction",
      "url": "https://sempremilan.com/serie-a-preview-ac-milan-vs-parma-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-21T19:00:00+00:00",
      "summary": "After the mid-week draw, AC Milan will be looking to get back to winning ways against Parma, a team they also need to get revenge against.  Milan are entering a crucial part of the season, with just 13 games left and Inter pushing on at the top. In short, they need as many points as […]\nThe post Ser"
    },
    {
      "id": "e3fa1fdfa286",
      "title": "Di Stefano explains why Cissè signing is reminiscent of ‘the old Milan’",
      "url": "https://sempremilan.com/di-stefano-cisse-signing-reminiscent-milan",
      "source": "sempremilan.com",
      "date": "2026-02-21T18:30:00+00:00",
      "summary": "In the final days of the January window, AC Milan secured the promising Serie B talent Alphadjo Cissè, a signing that Peppe Di Stefano believes is reminiscent of the old Milan.  The transfer was announced on the final day of the window and in the statement, it was confirmed that the attacking midfie"
    },
    {
      "id": "9c459d1b6691",
      "title": "Mr 100% returns: Landucci ready to take Allegri’s duties for Milan-Parma",
      "url": "https://sempremilan.com/mr-100-returns-landucci-milan-parma",
      "source": "sempremilan.com",
      "date": "2026-02-21T18:00:13+00:00",
      "summary": "Marco Landucci will be the head coach in Milan’s dugout tomorrow as Massimiliano Allegri will be serving a one-game suspension. In short, Mr 100% is back.  When Allegri signed his contract with Milan, thus confirming his return to the club, we all knew that he would wear his heart on his sleeve. In "
    },
    {
      "id": "4937576dcc2d",
      "title": "Allegri admits Scudetto is highly unlikely as things stand: “12 wins and one defeat”",
      "url": "https://sempremilan.com/allegri-admits-scudetto-highly-unlikely-milan",
      "source": "sempremilan.com",
      "date": "2026-02-21T17:30:19+00:00",
      "summary": "Massimiliano Allegri has admitted that it will be very difficult for AC Milan to compete for the Scudetto, with just 13 games remaining of the season.  Due to the 1-1 draw against Como earlier in the week, Milan are now seven points behind their city rivals Inter (before this weekend’s matchday, any"
    },
    {
      "id": "f87a7cdd1651",
      "title": "Opposition insight for Milan-Parma: Form, injuries, predicted XI and more",
      "url": "https://sempremilan.com/opposition-insight-milan-parma-2025-26",
      "source": "sempremilan.com",
      "date": "2026-02-21T17:00:00+00:00",
      "summary": "Parma will be hoping to snatch more points from AC Milan tomorrow evening, having frustrated the Rossoneri in the reverse fixture.  After a rough run of results, the Gialloblu have seemingly found a bit of a stride with two consecutive wins, beating Bologna and Hellas Verona. There is some breathing"
    },
    {
      "id": "dadf35171854",
      "title": "Not only Rabiot as Athekame and Fofana could also miss derby against Inter",
      "url": "https://sempremilan.com/not-only-rabiot-athekame-fofana-derby",
      "source": "sempremilan.com",
      "date": "2026-02-21T16:30:00+00:00",
      "summary": "Adrien Rabiot is one yellow card away from suspension, which inevitably has become a big talking point as the derby is around the corner, but the same goes for two more players.  Rabiot missed Milan-Como due to suspension, having received a double yellow against Pisa in the round before. Had he not "
    },
    {
      "id": "e7a74f8e8af7",
      "title": "Lazio 2-2 AC Milan Women: Comeback win squandered by the Rossonere",
      "url": "https://sempremilan.com/lazio-2-2-ac-milan-women-comeback-squandered",
      "source": "sempremilan.com",
      "date": "2026-02-21T16:07:20+00:00",
      "summary": "Milan Women thought they had completed a crucial comeback in the capital, but then Lazio found a way back to snatch a point.  After the defeats against Roma and Fiorentina, the Rossonere have received a fair amount of criticism as the Champions League places now seem like an impossible task. As such"
    },
    {
      "id": "845ee13a6255",
      "title": "Watch: Scotti scores brace for Milan Primavera including lovely free-kick",
      "url": "https://sempremilan.com/watch-scotti-brace-milan-primavera-lovely",
      "source": "sempremilan.com",
      "date": "2026-02-21T15:30:00+00:00",
      "summary": "Filippo Scotti, the captain of Milan Primavera, got on the scoresheet twice in the game against Napoli earlier today, helping his side secure an important 2-1 win.  After the 2-1 win against Genoa, which got them back to winning ways, the Rossoneri followed that up with the same scoreline today. Whi"
    },
    {
      "id": "795d6817169a",
      "title": "Allegri explains why Pavlovic makes him ‘angry’ despite giving ‘everything’",
      "url": "https://sempremilan.com/allegri-explains-why-pavlovic-angry",
      "source": "sempremilan.com",
      "date": "2026-02-21T15:08:47+00:00",
      "summary": "Strahinja Pavlovic will be at Massimiliano Allegri’s disposal for tomorrow’s clash between Milan and Parma, and there is one thing the Serbian can improve upon.  Pavlovic received a nasty knock against Como and Milan initially feared a broken fibula. Thankfully, it was just a case of heavy bleeding,"
    },
    {
      "id": "0ce5a9e9364d",
      "title": "Milan, Allegri: Leao and Pulisic ‘improving’, I ‘get emotional’ when I talk to Modric",
      "url": "https://football-italia.net/milan-allegri-leao-pulisic-improve-talk-modric/",
      "source": "football-italia.net",
      "date": "2026-02-21T15:04:00+00:00",
      "summary": "Milan coach Massimiliano Allegri says Rafael Leao and Christian Pulisic are ‘improving’ and admits he..."
    },
    {
      "id": "08a62b21fcd3",
      "title": "Longo: Estupinan and Pulisic could start against Parma – latest from Milanello",
      "url": "https://sempremilan.com/longo-estupinan-pulisic-start-parma-latest",
      "source": "sempremilan.com",
      "date": "2026-02-21T14:24:04+00:00",
      "summary": "AC Milan will be up against Parma tomorrow and after an unusually quiet morning, indications have now arrived on the predicted starting eleven, with a duo potentially getting the chance.  After the draw against Como, Milan have a point to prove (pun intended) as they cannot afford to increase the ga"
    },
    {
      "id": "567090fe47bd",
      "title": "Renna and Scotti react to Milan Primavera 2-1 Napoli: “A truly excellent performance”",
      "url": "https://sempremilan.com/renna-scotti-react-milan-primavera-2-0-napoli",
      "source": "sempremilan.com",
      "date": "2026-02-21T14:00:00+00:00",
      "summary": "After Milan Primavera’s 2-1 win against Napoli earlier today, head coach Giovanni Renna and captain Filippo Scotti spoke to the media.  It was the Primavera’s second win in a row, having beaten Genoa last week, and they are thus picking up some form after a tough run of results. Scotti played a huge"
    },
    {
      "id": "39bd700d0d30",
      "title": "Fabregas: ‘I made a mistake, but some are seeking excuses’ with Como",
      "url": "https://football-italia.net/fabregas-made-mistake-some-seek-excuses-como/",
      "source": "football-italia.net",
      "date": "2026-02-21T13:59:43+00:00",
      "summary": "Cesc Fabregas again takes responsibility for his mistake against Milan, but also hints they are..."
    },
    {
      "id": "d76681767343",
      "title": "Allegri previews Milan-Parma, provides injury update and reflects on season finale",
      "url": "https://sempremilan.com/allegri-previews-milan-parma-injury-presser",
      "source": "sempremilan.com",
      "date": "2026-02-21T13:31:03+00:00",
      "summary": "On the eve of the game between AC Milan and Parma, Massimiliano Allegri spoke to the media at his usual pre-game press conference.  Milan only clinched a point in their mid-week clash against Como and as a result, Inter are now seven points ahead. As such, tomorrow’s game against Parma is even more "
    },
    {
      "id": "4eda19192303",
      "title": "Bonus Podcast with Oliver and Anthony: Future of Milan’s midfield",
      "url": "https://sempremilan.com/bonus-podcast-future-of-milans-midfield",
      "source": "sempremilan.com",
      "date": "2026-02-21T12:50:00+00:00",
      "summary": "Join Oli and Anthony as they go through each of Milan’s current midfielders to discuss their future, and address which targets could complete the department. Milan’s midfield has been a hot talking point this season amid the success of Luka Modric and Adrien Rabiot, but also the injury of Ardon Jash"
    },
    {
      "id": "7f9194dab63d",
      "title": "Milan Primavera 2-1 Napoli: Captain Scotti shines with brace and lovely free-kick",
      "url": "https://sempremilan.com/milan-primavera-2-0-napoli-captain-scotti",
      "source": "sempremilan.com",
      "date": "2026-02-21T12:20:03+00:00",
      "summary": "Milan Primavera managed to build on their win last weekend with another one today, beating a struggling Napoli side thanks to Filippo Scotti’s brace.  Last weekend, Giovanni Renna’s men bounced back after a tough run of results. Two goals were enough to beat a ten-man Genoa side, and the Rossoneri w"
    },
    {
      "id": "7aa3ce96e411",
      "title": "Tresoldi thinks about Milan move ‘every morning’, but expected Italy call",
      "url": "https://football-italia.net/tresoldi-thinks-milan-move-morning-italy-call/",
      "source": "football-italia.net",
      "date": "2026-02-21T12:13:57+00:00",
      "summary": "Nicolò Tresoldi admits he thinks about joining Milan ‘every morning when I wake up’, but..."
    },
    {
      "id": "4e17c42c4d47",
      "title": "Tresoldi doubles down on Milan dream: “I think about it every morning”",
      "url": "https://sempremilan.com/tresoldi-doubles-down-milan-dream-every-morning",
      "source": "sempremilan.com",
      "date": "2026-02-21T11:56:09+00:00",
      "summary": "Nicolo Tresoldi has, once again, opened up about his desire to play for AC Milan one day, though admitting that he’s not exactly close at the moment.  Given the history of Milan, it’s not exactly strange that some players – especially Italian ones – would like to wear the red and black shirt. It doe"
    },
    {
      "id": "d9a98da7185e",
      "title": "Fonseca: ‘I deserved more time’ at Milan",
      "url": "https://football-italia.net/fonseca-deserved-more-time-milan/",
      "source": "football-italia.net",
      "date": "2026-02-21T11:31:16+00:00",
      "summary": "Paulo Fonseca says he ‘enjoyed’ his short spell at Milan, but feels he ‘deserved more..."
    },
    {
      "id": "90d6966a1a1d",
      "title": "Fonseca says he ‘deserved more time’ at Milan after ‘amazing games’ and Lyon success",
      "url": "https://sempremilan.com/fonseca-more-time-milan-amazing-games",
      "source": "sempremilan.com",
      "date": "2026-02-21T11:30:00+00:00",
      "summary": "Paulo Fonseca has opened up about his short stint at Milan, saying that he would have liked more time, having now proved what he’s capable of with Lyon.  Milan appointed Fonseca as their new manager in the summer of 2024 after saying goodbye to Stefano Pioli at the end of the season. Before the end "
    },
    {
      "id": "c11e9f08c1d4",
      "title": "Official: Piccinini will officiate Milan vs. Parma – no controversy despite two reds",
      "url": "https://sempremilan.com/piccinini-officiate-milan-parma-two-reds",
      "source": "sempremilan.com",
      "date": "2026-02-21T11:05:00+00:00",
      "summary": "Marco Piccinini has been named the referee for AC Milan’s clash against Parma tomorrow, and after recent controversy, he will surely be under the spotlight.  The refereeing situation in Italy appears to be at a breaking point, with multiple teams getting obvious wrong calls made against them. For Mi"
    },
    {
      "id": "3b07fdff22d5",
      "title": "Di Stefano says Milan ‘must improve’ with signings ‘like Goretzka’ next season",
      "url": "https://sempremilan.com/di-stefano-milan-improve-signings-goretzka",
      "source": "sempremilan.com",
      "date": "2026-02-21T10:40:00+00:00",
      "summary": "Peppe Di Stefano has shared his take on what AC Milan will need to do in the event of Champions League qualification. Spoiler alert: the Rossoneri have a lot of work to do.  With 54 points collected after 25 games, Milan are sitting in second place in the league, seven points behind leaders Inter an"
    },
    {
      "id": "47863fa5f394",
      "title": "GdS: Allegri needs underperforming Milan leaders now more than ever",
      "url": "https://sempremilan.com/gds-allegri-needs-underperforming-milan-leaders",
      "source": "sempremilan.com",
      "date": "2026-02-21T10:16:18+00:00",
      "summary": "As Milan are entering a crucial phase of the season, also known as the season finale, Massimiliano Allegri has called upon the leaders to make a bigger difference.  The 1-1 draw against Como was a blow to Milan’s Scudetto hopes, now seven points behind their city rivals Inter. However, if there’s on"
    },
    {
      "id": "253ce718c287",
      "title": "Bonucci hails Milan coach Allegri: ‘A master, a phenomenon’",
      "url": "https://football-italia.net/italy-gattuso-bonucci-allegri-master-milan/",
      "source": "football-italia.net",
      "date": "2026-02-20T21:08:08+00:00",
      "summary": "Leonardo Bonucci has paid a glowing tribute to AC Milan head coach Massimiliano Allegri, describing..."
    },
    {
      "id": "d57652257213",
      "title": "Former Milan & Juventus defender De Sciglio clarifies collapsed Hradec Kralove move",
      "url": "https://football-italia.net/milan-juventus-defender-de-sciglio-hradec/",
      "source": "football-italia.net",
      "date": "2026-02-20T20:28:03+00:00",
      "summary": "Mattia De Sciglio has broken his silence over his failed transfer to Czech side Hradec..."
    },
    {
      "id": "16dbbff87a34",
      "title": "Milan interested in Club Brugge forward Tresoldi: the situation",
      "url": "https://football-italia.net/milan-interested-club-brugge-forward-tresoldi/",
      "source": "football-italia.net",
      "date": "2026-02-20T18:06:59+00:00",
      "summary": "AC Milan are quietly but decisively building their plans for the summer transfer window, and..."
    },
    {
      "id": "fe2664d29bdc",
      "title": "Extra Champions League spot: Where Italy stands after Inter loss and Bologna win",
      "url": "https://football-italia.net/extra-champions-league-spot-where-italy-stands/",
      "source": "football-italia.net",
      "date": "2026-02-20T16:25:31+00:00",
      "summary": "Italy’s chances of attaining an additional spot in next year’s Champions League remain slim despite..."
    },
    {
      "id": "603a8d098889",
      "title": "Pulisic impresses Milan star: ‘He speaks Italian almost perfectly’",
      "url": "https://football-italia.net/pulisic-impresses-milan-star-italian-perfectly/",
      "source": "football-italia.net",
      "date": "2026-02-20T14:20:48+00:00",
      "summary": "Milan star Rafael Leao is full of praise for USMNT star Christian Pulisic, on and..."
    },
    {
      "id": "14c9f595a9b3",
      "title": "Leao shares Diogo Jota story, promises to ‘make him proud’ at World Cup",
      "url": "https://football-italia.net/leao-diogo-jota-story-make-him-proud-world-cup/",
      "source": "football-italia.net",
      "date": "2026-02-20T14:13:03+00:00",
      "summary": "A ‘devastated’ Rafael Leao reveals Diogo Jota wanted to watch a Milan game at San..."
    },
    {
      "id": "5a8780cd73bf",
      "title": "Rafael Leao: Ibrahimovic ‘too demanding’, I ‘don’t go out’ before Milan derby",
      "url": "https://football-italia.net/leao-don-t-go-out-milan-derby-ibrahimovic/",
      "source": "football-italia.net",
      "date": "2026-02-20T13:47:07+00:00",
      "summary": "Milan star Rafael Leao admits he avoids going out the week before the derby against..."
    },
    {
      "id": "c765c1d746d1",
      "title": "Frustrated Milan call AIA after controversial refereeing decisions in 1-1 Como draw",
      "url": "https://football-italia.net/frustrated-milan-call-aia-after-como-draw/",
      "source": "football-italia.net",
      "date": "2026-02-20T13:18:03+00:00",
      "summary": "Milan have reportedly been in contact with the Italian referees’ association (AIA) after a series..."
    },
    {
      "id": "18a4afe5a487",
      "title": "Roma the have best defensive record in Europe as Milan, Arsenal and Real Madrid follow",
      "url": "https://football-italia.net/roma-best-defensive-record-milan-arsenal-real/",
      "source": "football-italia.net",
      "date": "2026-02-20T12:36:59+00:00",
      "summary": "Roma are the least beaten defence in the top five European leagues, but Milan and..."
    },
    {
      "id": "46350e123f0a",
      "title": "Today’s Papers – Furious Milan, McTominay’s ‘soft football’",
      "url": "https://football-italia.net/todays-papers-furious-milan-mctominay-soft/",
      "source": "football-italia.net",
      "date": "2026-02-20T08:34:08+00:00",
      "summary": "La Gazzetta dello Sport Furious Milan The club is irritated with the referees, call to..."
    },
    {
      "id": "2e2b8b55e6a6",
      "title": "Why Fabregas cannot be punished with video evidence after Milan 1-1 Como",
      "url": "https://football-italia.net/why-fabregas-cannot-be-punished-video-evidence/",
      "source": "football-italia.net",
      "date": "2026-02-19T18:02:36+00:00",
      "summary": "Many were calling for video evidence to be used in punishing Como coach Cesc Fabregas..."
    },
    {
      "id": "88f321aefd9b",
      "title": "Milan team news: Boost as Pavlovic tests reveal no fracture",
      "url": "https://football-italia.net/milan-team-news-boost-as-pavlovic-tests/",
      "source": "football-italia.net",
      "date": "2026-02-19T15:39:58+00:00",
      "summary": "Milan will breathe a sigh of relief this morning, after medical examinations revealed that Strahinja..."
    },
    {
      "id": "d1035a3b77cf",
      "title": "Video: Fabregas’ shirt tug and touchline confrontation with Allegri",
      "url": "https://football-italia.net/fabregas-shirt-tug-touchline-clash-allegri/",
      "source": "football-italia.net",
      "date": "2026-02-19T12:02:33+00:00",
      "summary": "Watch how Cesc Fabregas pulled the shirt of Alexis Saelemaekers and how Milan coach Massimiliano..."
    },
    {
      "id": "8e22ac8839a0",
      "title": "What Allegri told Fabregas in heated post-match clash: ‘You are a kid’",
      "url": "https://football-italia.net/what-allegri-told-fabregas-kid-milan-como/",
      "source": "football-italia.net",
      "date": "2026-02-19T09:09:48+00:00",
      "summary": "More details emerge about the confrontation between Milan coach Massimiliano Allegri and Como’s Cesc Fabregas..."
    },
    {
      "id": "d3f0ece0dd15",
      "title": "Today’s Papers – Bodo shaming, Italy cry, Leao saves Milan",
      "url": "https://football-italia.net/today-papers-bodo-shaming-italy-cry-leao-milan/",
      "source": "football-italia.net",
      "date": "2026-02-19T08:42:54+00:00",
      "summary": "La Gazzetta dello Sport Inter, three slaps But they are still +7 in Serie A...."
    },
    {
      "id": "f24c9ac03bd7",
      "title": "Allegri and Fabregas bad blood after Como coach ‘unsporting behaviour’",
      "url": "https://football-italia.net/allegri-fabregas-bad-blood-como-unsporting/",
      "source": "football-italia.net",
      "date": "2026-02-18T23:07:22+00:00",
      "summary": "There is bad blood between Max Allegri and Cesc Fabregas, as they had another row..."
    }
  ]
}